{
  "title": "Weekly Review: 12/16/2017",
  "link": "https://codesachin.wordpress.com/2017/12/17/weekly-review-12-16-2017/",
  "comments": "https://codesachin.wordpress.com/2017/12/17/weekly-review-12-16-2017/#respond",
  "dc:creator": "srjoglekar246",
  "pubDate": "Sat, 16 Dec 2017 23:08:21 +0000",
  "category": [
    "Machine Learning/AI",
    "neural networks",
    "nvidia",
    "tensorflow"
  ],
  "guid": "http://codesachin.wordpress.com/?p=918",
  "description": "Hebbian Learning in Neural Networks One major difference between human and machine learning is the way we retain important aspects of our knowledge, as we gather more data. All throughout our life, we keep enforcing those concepts/facts which help us most in our day-to-day activities. ML algorithms are much less selective &#8211; if you train &#8230; <a href=\"https://codesachin.wordpress.com/2017/12/17/weekly-review-12-16-2017/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Weekly Review: 12/16/2017</span> <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><strong><a href=\"https://www.technologyreview.com/s/609710/neural-networks-are-learning-what-to-remember-and-what-to-forget/\">Hebbian Learning in Neural Networks</a></strong></p>\n<p>One major difference between human and machine learning is the way we <em>retain</em> important aspects of our knowledge, as we gather more data. All throughout our life, we keep enforcing those concepts/facts which help us most in our day-to-day activities. ML algorithms are much less selective &#8211; if you train a NN to perform task A and then retrain it to perform task B, the parameters for A will be forgotten &#8216;uniformly&#8217;.</p>\n<p><a href=\"https://arxiv.org/abs/1711.09601\">This paper</a> tries to apply the <a href=\"https://en.wikibooks.org/wiki/Artificial_Neural_Networks/Hebbian_Learning\">Hebbian-learning</a> principle of &#8216;Neurons that fire together, wire together&#8217; to NNs. Its done as follows:</p>\n<ol>\n<li>While training for task A, the algorithm measures the &#8216;<em>importance</em>&#8216; of a parameter as the gradient of the L2 norm of the output-error. In essence, this quantifies the <em>absolute change in output for a small change in the param-value</em>.</li>\n<li>Now, while re-training for a different task, the importance values computed in the above step are used as <a href=\"https://en.wikipedia.org/wiki/Regularization_(mathematics)\">regularization parameters</a>. This penalizes changes to the important params for task A, even while training for task B &#8211; as a result, the NN still performs decently at task A even after being re-trained.</li>\n</ol>\n<p><strong><a href=\"http://amid.fish/assets/Distributed%20TensorFlow%20-%20A%20Gentle%20Introduction.html\">Distributed Tensorflow</a></strong></p>\n<p>This article gives a very good overview of distributed-computing mechanisms in TensorFlow. The main problem being tackled is the sharing of parameters/variables across different machines. Some take-aways:</p>\n<ol>\n<li>tf.Session, by itself, is like an isolated execution engine.</li>\n<li>However, multiple sessions can be made to share variables using tf.train.Servers, which are grouped together into &#8216;clusters&#8217;. All servers in the same cluster share variable values (this is done using namespaces).</li>\n<li>With tf.device, if you have multiple devices each with their own process, you can choose which one holds the original copy of a Variable.</li>\n<li>Each server is responsible for building its own Graph though &#8211; the elements of the graph can include process-specific params, as well as global ones shared across servers.</li>\n</ol>\n<p>The post gives multiple small examples, as well as one cumulative piece detailed multiple feature &#8211; do take a look!</p>\n<p><strong><a href=\"https://www.theverge.com/2017/12/5/16737260/ai-image-translation-nvidia-data-self-driving-cars\">UNsupervised Image-to-Image Translation by Nvidia</a></strong></p>\n<p>Another good paper from <a href=\"https://nips.cc/\">NIPS2017</a>. The problem addressed here is that of unsupervised image-to-image translation, also shortened as <em>UNIT</em>. Consider the conversion of a street-photo in sunny weather, to the same street on a rainy day.</p>\n<p>If it was supervised, we would have pairs of photos of the same streets, in sunny & rainy weather. But such data is hard to come by, especially in the quantities needed for deep learning. So what if you just have a bunch of sunny street photos, and a set of rainy ones? (with no &#8216;common&#8217; street). This is basically the problem being solved here.</p>\n<p>Nvidia uses a <a href=\"https://arxiv.org/pdf/1512.09300.pdf\">VAE-GAN</a> for this purpose, with some twists. Consider the sunny/rainy example from above:</p>\n<ol>\n<li>The raw image is first converted to a latent vector by a <em><a href=\"http://kvfrans.com/variational-autoencoders-explained/\">Variational Autoencoder</a>.</em></li>\n<li>This latent vector is then given as input to the Generative part of a GAN.</li>\n</ol>\n<p>The twist is that the last few layers of the VAE, and the first few layers of the GAN are shared by both sunny-to-rainy and rainy-to-sunny networks. Why so?</p>\n<p>You can intuitively see that the VAE is converting the raw pixels into a vector encoding basic attributes of the street &#8211; irrespective of the weather. While the first few layers of the VAE deal with raw pixel data, the higher ones understand abstract street-attributes (which are weather-independent). As a result, the latter layers get shared.</p>\n<p>The same logic is applied (but in reverse), in keeping the first few layers of the Generative network common.</p>\n<p><a href=\"https://youtu.be/e3aXvYIWIq0\">Heres a video</a> of the method to give you a taste of the results obtained. They are surprisingly good!</p>\n<p><strong><a href=\"https://motherboard.vice.com/en_us/article/gydydm/gal-gadot-fake-ai-porn\">Fake AI porn (NSFW)</a></strong></p>\n<p>A Redditor going by the name of &#8216;deepfake&#8217; uses Tensorflow-based deep learning to paste celebrity faces onto pornstar bodies in videos. While the results are not perfect, they are good enough to cause concerns over consent.</p>\n<p>(To give you an example of the progress that has made in video manipulation, take a look at <a href=\"https://www.youtube.com/watch?v=ohmajJTcpNk\">Face2Face</a> &#8211; They use a video of some celebrity, and combine it with actions by a user on their live feed, to generate a video of the celebrity doing the same.).</p>\n",
  "wfw:commentRss": "https://codesachin.wordpress.com/2017/12/17/weekly-review-12-16-2017/feed/",
  "slash:comments": 0,
  "media:content": {
    "media:title": "srjoglekar246"
  }
}