{
  "title": "2022 will be the year of exploration in dating",
  "link": "https://theblog.okcupid.com/2022-will-be-the-year-of-exploration-in-dating-696d6385372a?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/696d6385372a",
  "category": [
    "relationships",
    "data",
    "dating",
    "love"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Wed, 01 Dec 2021 20:08:11 GMT",
  "atom:updated": "2021-12-01T20:08:10.988Z",
  "content:encoded": "<h4>OkCupid data reveals dating trends we can expect in the new year</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*sFmtLU2QsvXBugVe2PJzbg.jpeg\" /></figure><p>2022 will be the year of exploration in dating. After nearly two years of pandemic living, singles are returning to dating with more open-mindedness than ever. Daters around the world are expressing an increased desire to meet a diverse set of people, and explore new things when it comes to love and sex. Trust us, we have the data to back it up: Our OkCupid algorithm is powered by thousands of questions so it can match people on what really matters — and singles’ responses to those questions help us predict the future of dating. Here are the 10 dating trends you can expect to see in 2022: the year of exploration in dating.</p><ol><li><strong>Daters Will Explore Their Sexuality More Than Ever</strong></li></ol><p>The pandemic has led daters to not only be more open about who they are, but also more interested in exploring their sexuality. Since the end of last year, we’ve seen a nearly 10% increase in users identifying as pansexual. There’s also been a 250% increase in users identifying as bisexual compared to last year, and a 29% increase in users identifying as non-binary. We’ll see this continue into 2022 and daters can only benefit; the more open singles are, the more matches for everyone!</p><p><strong>2. Kink Will Be Even More of a Thing</strong></p><p>Each year we see the taboo around kink and BDSM lessening, and the pandemic accelerated that. Daters are not only more open to it, but more vocal in their openness as well. In 2021, there’s been a 55% increase in users saying they’re kinky, and women are leading the charge: “BDSM” mentions in female users’ profiles have increased 17%.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*MlBYKAHPCU5oEUxYkFCWsg.jpeg\" /></figure><p><strong>3. Money Will Matter Less</strong></p><p>The likelihood of a single saying wealth is very important in a match nearly doubled during the pandemic. After all, jobs were lost and many daters’ financial security was at risk. However, if we continue to see employment and vaccination rates increase in 2022 as they are today, we will also see this number decrease and fewer singles will say money is very important when it comes to who they date. We’ve already seen this drop begin to happen, with only 14% of users saying money is very important in a match today compared to around 16% earlier in the year.</p><p><strong>4. There Will Be More Open Relationships</strong></p><p>Monogamy certainly isn’t out, but non-monogamy is definitely in. While the majority of OkCupid daters seek monogamous relationships, in 2021 users seeking non-monogamous relationships increased 7%, and mentions of “non-monogamy” and “throuple” in user profiles have gone up 21%. Next year, more and more daters will be looking for non-monogamous relationships as they become open to multiple relationships at a time.</p><p><strong>5. Politics Will Be the Biggest Dealbreaker</strong></p><p>There’s been a nearly 10% increase in political terms in user profiles in 2021 despite it not even being an election year. With the midterms heating up in 2022, there’s no question that being aligned politically will be the biggest dating dealbreaker this year. In fact, users on OkCupid are 5x less likely to mark a matching question about politics as “irrelevant” on how important it is to them compared to questions not having to do with politics.</p><p><strong>6. Safe Sex Will Be Hotter Than Ever</strong></p><p>If the pandemic taught us anything, it was to be vigilant about our health — and that includes sexual health, too. Since the pandemic, there’s been a 16% decrease in singles who say they never or rarely discuss STD status before fooling around. Daters today are being straightforward not just about their feelings, but also about their sexual health — resulting in healthier, more honest relationships. Over the past five years there’s also been a nearly 10% increase in singles who say they get tested before and after each new partner.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*TEtJcMsNANbjccbTLAR67Q.jpeg\" /></figure><p><strong>7. Divorced Singles Will Be Getting Back Out There</strong></p><p>Since 2017, there’s been a nearly 300% increase in user profiles mentioning being recently divorced and this increase isn’t going anywhere. As with all singles, more divorced singles turned to the apps during the pandemic to find love and in 2022, there will be even more — divorced during the pandemic — returning to the dating scene. “For singles who have to rebuild their social circle after divorce, dating apps provide an excellent way to re-enter the dating scene,” says Damona Hoffman, OkCupid dating expert and host of The Dates & Mates Podcast.</p><p><strong>8. Sober Dating Will Become Increasingly Popular</strong></p><p>Over the past five years, daters have become 2x less likely to say that a date being sober was a dealbreaker, and in just the past month there has been a nearly 10% increase in terms such as “sobriety” and “sober dating” in OkCupid profiles. Therefore, we expect daters looking for sober dates will increase at least 5x in 2022. Even those who aren’t sober are enjoying this trend, going on sober first and second dates to really get to know the other person without any outside influence.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ur5jtcdcXurr143Q0ppGlQ.jpeg\" /></figure><p><strong>9. More Singles Will Be Looking for a Match to Start a Family With</strong></p><p>At the beginning of 2021, we saw an over 125% increase in users saying they wanted children and 2022 should be no different. The pandemic forced people to consider what was really important to them, and family turned out to be one of those things. But this won’t be the nuclear family of the past; many who are looking to have children are not necessarily looking to get married, or even be monogamous in some cases — but rather want to find a committed partner to have children with.</p><p><strong>10. And Finally, 2022 Will Kick Off With a Huge Boost for Dating!</strong></p><p>The first Sunday of the new year is always a great day to meet someone on a dating app. Historically, we’ve seen up to a 70% increase in user activity on this day. But because 2022’s first Sunday lands early on January 2,<strong> </strong>there will be <em>two</em> Dating Sundays for the first time in over a decade.<strong> </strong>January 2, the first Dating Sunday of 2022, will be as busy as usual, but we expect an unprecedented surge of likes, matches, and conversations on the second Sunday as well, as some singles will get a slightly later start on their New Year’s resolutions.</p><p><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>Download OkCupid</em></a><em> to get a kickstart on Dating Sunday today!</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=696d6385372a\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/2022-will-be-the-year-of-exploration-in-dating-696d6385372a\">2022 will be the year of exploration in dating</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}