{
  "title": "Safety Guarantees for Neural Network Dynamic Systems via Stochastic Barrier Functions. (arXiv:2206.07811v3 [eess.SY] UPDATED)",
  "link": "http://arxiv.org/abs/2206.07811",
  "description": "<p>Neural Networks (NNs) have been successfully employed to represent the state\nevolution of complex dynamical systems. Such models, referred to as NN dynamic\nmodels (NNDMs), use iterative noisy predictions of NN to estimate a\ndistribution of system trajectories over time. Despite their accuracy, safety\nanalysis of NNDMs is known to be a challenging problem and remains largely\nunexplored. To address this issue, in this paper, we introduce a method of\nproviding safety guarantees for NNDMs. Our approach is based on stochastic\nbarrier functions, whose relation with safety are analogous to that of Lyapunov\nfunctions with stability. We first show a method of synthesizing stochastic\nbarrier functions for NNDMs via a convex optimization problem, which in turn\nprovides a lower bound on the system's safety probability. A key step in our\nmethod is the employment of the recent convex approximation results for NNs to\nfind piece-wise linear bounds, which allow the formulation of the barrier\nfunction synthesis problem as a sum-of-squares optimization program. If the\nobtained safety probability is above the desired threshold, the system is\ncertified. Otherwise, we introduce a method of generating controls for the\nsystem that robustly maximizes the safety probability in a minimally-invasive\nmanner. We exploit the convexity property of the barrier function to formulate\nthe optimal control synthesis problem as a linear program. Experimental results\nillustrate the efficacy of the method. Namely, they show that the method can\nscale to multi-dimensional NNDMs with multiple layers and hundreds of neurons\nper layer, and that the controller can significantly improve the safety\nprobability.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Mazouz_R/0/1/0/all/0/1\">Rayan Mazouz</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Muvvala_K/0/1/0/all/0/1\">Karan Muvvala</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Ratheesh_A/0/1/0/all/0/1\">Akash Ratheesh</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Laurenti_L/0/1/0/all/0/1\">Luca Laurenti</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Lahijanian_M/0/1/0/all/0/1\">Morteza Lahijanian</a>"
}