{
  "title": "Converting Coal Power Plants to Nuclear Gains Steam",
  "link": "https://spectrum.ieee.org/nuclear-power-plant",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-a-building-concept.jpg?id=31822097&width=1200&height=800&coordinates=0%2C60%2C0%2C60\"/><br/><br/><p>On a planet aspiring to become carbon neutral, the once-stalwart coal power plant is an emerging anachronism. </p><p>It is true that, in much of the developing world, coal-fired capacity <a href=\"https://www.carbonbrief.org/mapped-worlds-coal-power-plants/\" rel=\"noopener noreferrer\" target=\"_blank\">continues to grow</a>. But in every corner of the globe, political and financial pressures <a href=\"https://www.power-technology.com/news/g20-overseas-coal-financing/\" rel=\"noopener noreferrer\" target=\"_blank\">are mounting</a> to bury coal in the past. In the United States, coal’s share of electricity generation <a href=\"https://www.eia.gov/energyexplained/electricity/electricity-in-the-us-generation-capacity-and-sales.php\" rel=\"noopener noreferrer\" target=\"_blank\">has plummeted</a> since its early 2000s peak; 28 percent of U.S. coal plants <a href=\"https://www.power-eng.com/coal/nearly-60-gw-of-coal-fired-capacity-to-retire-by-2035-eia-says/\" rel=\"noopener noreferrer\" target=\"_blank\">are planned</a> to shutter by 2035. </p><p>As coal plants close, they leave behind empty building shells and scores of lost jobs. Some analysts have proposed a solution that, on the surface, seems almost too elegant: turning old coal plants into nuclear power plants. </p><p>On 13 September, the <a href=\"https://www.energy.gov/\" target=\"_blank\">U.S. Department of Energy</a> (DOE) released a report suggesting that, in theory, over 300 former and present coal power plants <a href=\"https://fuelcycleoptions.inl.gov/SiteAssets/SitePages/Home/C2N2022Report.pdf\" target=\"_blank\">could be converted to nuclear</a>. Such a conversion has never been done, but the report is another sign that the idea is gaining momentum—if with the slow steps of a baby needing decades to learn to walk.</p><p>“A lot of communities that may have not traditionally been looking at advanced nuclear, or nuclear energy in general, are now being incentivized to look at it,” says <a href=\"https://www.linkedin.com/in/victoribarrajr\" target=\"_blank\">Victor Ibarra Jr.</a>, an analyst at the <a href=\"https://nuclearinnovationalliance.org/about-us\" target=\"_blank\">Nuclear Innovation Alliance</a> think tank, who wasn’t involved with the DOE study.</p><p>Conversion backers say the process has benefits for everybody involved. Plant operators might save on costs, with transmission lines, cooling towers, office buildings, and roads already in place. Once-coal-dependent communities might gain jobs and far better air quality.</p><p>“I think it’s something that people have been talking about for a while,” says <a href=\"https://www.linkedin.com/in/patrick-white-2a903166?trk=public_profile_browsemap\" target=\"_blank\">Patrick White</a>, project manager at the Nuclear Innovation Alliance.</p><p>DOE analysts screened 349 retired and 273 still-operating coal-plant sites across the United States. They filtered out sites that were retired earlier than 2012, sites that weren’t operated by utilities, and sites deemed unsuitable for nuclear reactors (such as plants in disaster-prone or high-population-density areas). That left 157 recently retired and 237 operating sites that could—in theory—house nuclear reactors.</p><p>Not all of these remaining coal plants are perfect fits, however. Most nuclear plants around the world today are large light-water reactors, with capacities well over a gigawatt—quite a bit more than typical coal plants. Large reactors need consistent and prolific water sources to cool themselves, something not every old coal plant can provide. DOE analysts flagged only 35 recently retired and 96 operating coal sites that could house a large light-water reactor within half a mile. </p><p>But in the future, not all reactors might be so large. Many still-speculative <a href=\"https://www.energy.gov/ne/advanced-small-modular-reactors-smrs\" target=\"_blank\">small modular reactor designs</a> might deliver just a few hundred megawatts. (In Hainan, China, <a href=\"https://www.world-nuclear-news.org/Articles/Linglong-One-reactor-pit-installed-at-Changjiang\" rel=\"noopener noreferrer\" target=\"_blank\">Linglong One</a>—the world’s first small modular reactor plant—is now under construction.) Depending on the design, these could be cooled with less water or even air, making them far more feasible fits for coal sites. DOE analysts found 125 recently retired and 190 operating sites that could house such small reactors.</p><p>Either option will be an uphill battle. In the United States, any new reactor must gain the blessing of the federal <a href=\"https://www.nrc.gov/about-nrc.html\" target=\"_blank\">Nuclear Regulatory Commission</a> (NRC), a process that can take up to five years and drive up costs in a sector <a href=\"https://ourworldindata.org/cheap-renewables-growth\" target=\"_blank\">already facing rising prices</a>. Only <a href=\"https://www.wabe.org/30b-georgia-power-nuclear-plant-delayed-up-to-6-more-months/\" rel=\"noopener noreferrer\" target=\"_blank\">one nuclear power plant</a> is currently under construction in the United States, in eastern Georgia.</p><p>A specific challenge would-be-conversions must face is that the NRC’s standards—both for atmospheric pollution and for the amount of radiological material a reactor can release—are much tighter than federal standards for coal plants.</p><p>On the state level, no fewer than <a href=\"https://www.ncsl.org/research/environment-and-natural-resources/states-restrictions-on-new-nuclear-power-facility.aspx\" target=\"_blank\">12</a>—California, Connecticut, Hawaii, Illinois, Maine, Massachusetts, Minnesota, New Jersey, New York, Oregon, Rhode Island, and Vermont—all have their own conditions restricting new nuclear construction.</p><p>Even if regulations didn’t stand in the way, coal-to-nuclear conversion has never been done. However, there is one project that has made some headway. </p><p>In Kemmerer, Wyo., nestled in the foothills of the Rocky Mountains, the nuclear energy firm <a href=\"https://www.terrapower.com/\" target=\"_blank\">TerraPower</a> plans to <a href=\"https://natriumpower.com/wyoming/\" target=\"_blank\">retrofit an existing coal plant</a> with a <a href=\"https://www.terrapower.com/our-work/natriumpower/\" rel=\"noopener noreferrer\" target=\"_blank\">sodium fast reactor</a>. The firm is planning to start building its reactor around 2026, hoping to deliver power by decade’s end. Even so, it hasn’t attained regulatory approval just yet.</p><p>If Wyoming will be the first, there are signs that it won’t be the last. In neighboring Montana, state legislators <a href=\"https://www.spglobal.com/commodityinsights/en/market-insights/latest-news/electric-power/021221-montana-senate-panel-oks-study-to-convert-colstrip-coal-plant-to-nuclear\" rel=\"noopener noreferrer\" target=\"_blank\">recently approved</a> a study for converting one coal plant to nuclear. That plant, situated in the coal mining town of Colstrip, currently faces its imminent end as nearby Oregon and Washington plan to <a href=\"https://www.tricitiesbusinessnews.com/2021/01/clean-energy-ban-coal/\" target=\"_blank\">ban coal power</a> by 2025.</p><p>In West Virginia, once coal’s citadel, the state government <a href=\"https://www.npr.org/2022/02/08/1079339405/west-virginia-ban-nuclear-power-coal\" rel=\"noopener noreferrer\" target=\"_blank\">eliminated</a> its old ban on nuclear power plants. Nationally, the recently enacted Inflation Reduction Act <a href=\"https://www.ans.org/news/article-4292/the-ira-crediting-nuclear-energy/\" rel=\"noopener noreferrer\" target=\"_blank\">offers</a> tax credits for nuclear projects in communities with retiring coal plants—something that will certainly increase interest in conversions.</p><p>“Are all of these sites going to get nuclear power plants? Probably not,” says White. “But is this a really good way for people to start the conversation on what are potential next steps, and where are potential sites to look at it? I think that’s a really cool opportunity.”</p>",
  "pubDate": "Mon, 26 Sep 2022 17:00:01 +0000",
  "guid": "https://spectrum.ieee.org/nuclear-power-plant",
  "category": [
    "Coal",
    "Nuclear",
    "Climate change",
    "Energy",
    "Nuclear power"
  ],
  "dc:creator": "Rahul Rao",
  "media:content": ""
}