{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-6161454524846955365",
  "published": "2020-07-27T08:09:00.000-07:00",
  "updated": "2020-07-27T08:09:55.405-07:00",
  "title": "The Bank of Canada Dives Into Unconventional Policy",
  "content": "The Bank of Canada has been doing things that, for it, are unprecedented. And, since our new Bank fo Canada Governor, Tiff Macklem, has made his first policy decision on July 15, now would be a good time to figure out what the Bank of Canada is up to. Since late March, the Bank's target for the overnight policy rate has been at 0.25%, which Macklem referred to in his <a href=\"https://www.bankofcanada.ca/multimedia/mpr-press-conference-webcasts-july-2020/\">press conference last week</a> as the \"effective lower bound.\" That's not an effective lower bound in the usual sense, as it's clear that the Bank could go negative if it chose to. By saying \"effective lower bound,\" I think the idea is to impress on you that the Bank won't go lower. The Bank has also engaged in a large balance sheet expansion, again since late March. Recall that this is a first for the Bank of Canada, which went through a short period from Spring 2009 to Spring 2010, where it ran a floor system. But during that floor-system period, the Bank only put enough overnight reserves (about $3 billion) in the system to peg the overnight rate at 0.25%. This time is different, in that the Bank now has assets of about 23.5% of annual GDP, as compared for example to a Fed balance sheet in the US of about 32.5% of GDP. In domestic GDP units, the Bank's balance sheet is growing at about twice the rate of the Fed's.<br /><br />Let's look at some of the details. Here are the main items on the asset side of the Bank's balance sheet that have shown big increases.<div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-Vd8AnWxnS-A/Xxn5y-4aZqI/AAAAAAAAECI/HuM55O5Sh60T24ABpmm3poGasLAUu1oagCNcBGAsYHQ/s1600/assets.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"842\" data-original-width=\"948\" height=\"568\" src=\"https://3.bp.blogspot.com/-Vd8AnWxnS-A/Xxn5y-4aZqI/AAAAAAAAECI/HuM55O5Sh60T24ABpmm3poGasLAUu1oagCNcBGAsYHQ/s640/assets.png\" width=\"640\" /></a></div><div><br /></div>There are some other asset purchases, including provincial bonds, corporate bonds, and commercial paper, but those are small potatoes, I think. The Bank has certainly not entered into the realm of credit allocation in a big way, as the Fed has, for example. The chart shows weekly data from the beginning of the year. A big difference here from typical central bank balance sheet expansions is that a large portion of the expansion consists of lending in the repo market, both term and overnight. Presumably that's intended as a crisis lending program that reaches into all the nooks and crannies of the financial system. The bank also lends at the \"bank rate\" (like discount window loans) only to Payments Canada large-value transfer system participants - there are 17 of those, including the chartered banks. Lending at the bank rate is minimal right now. As well, as Carolyn Wilkins (senior deputy governor) outlined July 15&nbsp; in the press conference, purchases of government of Canada securities, which comprise most of the balance sheet increase, other than repos, have been conducted across the maturity spectrum and are not confined, as would be usual in these policy moves, to long-maturity government securities. Note in particular that the Bank has increased substantially its holdings of t-bills, which the Fed has not bought (on net) since March.<div>&nbsp; <div>Early in the COVID-19 crisis, when Stephen Poloz was Governor, the justification for the balance sheet expansion - the purchases of federal government securities in particular - was to improve market function. As the <a href=\"https://www.bankofcanada.ca/wp-content/uploads/2020/07/mpr-2020-07-15.pdf\">July Monetary Policy Report</a>&nbsp;states, markets in government debt, and financial markets more broadly, seem to be functioning well now, more or less. So, the Report lays out a fairly conventional rationale for unconventional asset purchases, as follows:</div><div><br /></div><div><blockquote>Large-scale secondary market purchases of Government of Canada bonds provide monetary stimulus through several channels and can be described as quantitative easing (QE). When markets are not functioning well, QE improves liquidity in the government bond market (liquidity channel). QE can also lower borrowing costs for businesses and households by putting downward pressure on government yields (interest-rate channel).8 Through the purchase of a large quantity of government bonds held by the private sector, QE reduces the relative supply of bonds and thus lowers their relative yields, leading investors to reallocate their portfolio to riskier assets (portfolio balance channel). In addition, some investors will adjust their portfolios to include more assets priced in other currencies, placing downward pressure on the Canadian dollar (foreign exchange channel). Markets generally interpret QE as a signal that rates will likely be at the lower bound for an extended period (signalling channel).</blockquote></div></div><div><br /></div><div>The \"liquidity channel,\" is no longer an issue, as the Bank sees it, so what we're left with, from their point of view, is the \"interest rate channel,\" the \"exchange rate channel,\" and the \"signalling channel.\" The interest rate channel basically involves a segmented markets or portfolio balance story. This was the main justification given by Ben Bernanke for the several rounds of QE in the US, post-financial crisis. According to this view, we can think of the demand for government debt as being segmented by maturity. So, if you buy that idea, the central bank can purchase long-maturity bonds, sell short maturity bonds, and thus increase the prices of long maturity bonds and lower the prices of short maturity bonds - flatten the yield curve. Or, in a floor system with short rates tied down to zero (or 0.25% in this case), the sale of short maturity assets is irrelevant, long bond yields fall, and the yield curve flattens, according to the story. The exchange rate channel is just part of the same phenomenon. If the central bank thinks it can play with the yield curve, it can also move other asset prices in the process, including the exchange rate. The signalling channel, from the Bank's point of view, seems to depend on inferences people make about future policy based on the current state of the balance sheet. I guess we're supposed to view growth in the balance sheet as a commitment to accommodative policy for the indefinite future.</div><div><br /></div><div>On the balance sheet, the Bank has committed to purchasing government of Canada securities at a rate of $5 billion per week until the recovery is well underway. For context, QE3 in the US, which ran from 2012-2014, involved asset purchases of $85 billion (US) per month. So, adjusting for exchange rates and size of the economy, the current Canadian program is roughly twice the size of QE3, so in principle it's a big deal - though more about this below.<br /></div><div><br /></div><div>So, what questions might we want to ask about this?</div><div><br /></div><div>1) <i>What's the exit strategy?&nbsp; </i>To date, central banks that have dived into quantitative easing (QE) in a big way have never exited. The Fed outlined exit strategies from its large balance sheet state as early as 2011, but never did it, other than to allow a bit of runoff. Basically, the more the Fed lives with its large balance sheet, the more it likes it, for no good reasons as far as I can tell. In the Bank of Canada's case, the structure of the balance sheet increase seems designed for somewhat easy exit. Repos can disappear quickly, and t-bills will also mature quickly or could be sold, presumably without capital losses, if the balance sheet exit occurs before liftoff in the policy interest rate. But, given the <a href=\"https://www.bankofcanada.ca/wp-content/uploads/2010/01/dp07-2-e.pdf\">accounting standards the Bank has adopted</a>, it seems that government bonds are classed as \"held to maturity,\" are carried at book value, and can't be sold. If asset purchases proceed at the current rate, then by the end of 2020 government bonds held by the Bank will be about 12% of GDP. That's compared to Bank of Canada assets which are normally around 5% of GDP. So, if interest rates go up, say 2 years from now, the Bank will have quite low interest earnings on an asset portfolio that is being financed by maybe 50% currency (at 0%), and 50% reserves (at the policy rate). So that would put a dent in the transfer the Bank makes to the federal government. Under some scenarios, that transfer could hit zero, which would be problematic.</div><div><br /></div><div>2)&nbsp;<i>If the \"interest rate channel\" is so important to the Bank, why is it purchasing t-bills?</i> Basically, there's an exchange of reserves for t-bills going on, which doesn't accomplish anything, and could actually be harmful (more below). If the Bank really buys the segmented markets story, it should be purchasing long-maturity government bonds, and lengthening the average maturity of the assets in its portfolio. But maybe it's up to something else. If so, someone should let us know.</div><div><br /></div><div>3)<i>What's going on with the government of Canada's account balance with the Bank? </i>Here's what's happening on the liabilities side of the Bank's balance sheet:</div><div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-XkE29qj4Xjw/XxsWwpfDcTI/AAAAAAAAECY/kinTDbR5FBQB3YjVr1QkmkjJasEauZmDACNcBGAsYHQ/s970/liab.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"798\" data-original-width=\"970\" height=\"514\" src=\"https://1.bp.blogspot.com/-XkE29qj4Xjw/XxsWwpfDcTI/AAAAAAAAECY/kinTDbR5FBQB3YjVr1QkmkjJasEauZmDACNcBGAsYHQ/w625-h514/liab.png\" width=\"625\" /></a></div></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">There's been unusual growth in currency outstanding, but that's not a big deal relative to what you see in the chart, which is growth in reserve balances - overnight balances of LVTS participants with the Bank of Canada earning 0.25%. What's really weird here - and you see this in the US now as well - is that the federal government is holding a very large and growing balance with the Bank. So, in an environment in which it's claimed that the market in government debt isn't working properly (at least through some of the period in the chart), the federal government is issuing so much debt that it's not spending all the proceeds from its issuance, and instead parking the cash at the Bank of Canada. In addition, in the first chart, since April 1, t-bills and bonds held by the Bank have increased by about $216 billion - that's a swap of reserves for $216 billion in government securities - while the federal government has proceeded to swap $154 billion in government securities for reserves. So, this isn't much of a QE program, if that's the intention, as the federal government and the Bank seem to be working at cross purposes. But we know that the Bank and the Department of Finance are on good terms, and there's a regular conversation going on. So what have they agreed to? Inquiring minds want to know.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">4)&nbsp;<i>Who says QE works anyway? </i>QE is essentially debt management - the central bank making choices about how much interest-bearing overnight reserves are in the market, relative to government securities or other assets of various other maturities. A move by the central bank to engage in protracted QE is then a move by the central bank to take on the debt management role normally assigned to the central government. In Canada, the line between the Bank of Canada and the Department of Finance is blurry. Debt management policy seems to be something that is worked out jointly between the Bank and the Department Finance - for example I have talked to economists at the Bank who think about nothing but debt management. Once debt management policy is decided, the Bank implements it. As well, management by the Bank of the government of Canada's cash balances is an integral part of day-to-day monetary policy intervention, at least in normal times. In the past, there has been some worry that QE would be inflationary. You heard that a lot in the US post-financial crisis - from what remains of the monetarist contingent. The alleged inflationary effects of QE have also been put forward as justification for the use of QE, particularly by the Bank of Japan, beginning in 2013. The BOJ tried to use QE as a means for getting inflation up to its 2% target, which was a failure. Typically, low-nominal-interest rate environments just produce low inflation - that's Japanese experience since the mid-90s, and what we've seen in Europe and elsewhere since 2008. So, with the policy rate at zero or below, currency outstanding is driven by the demand for it at a zero nominal interest rate, inflation is low, and QE simply changes the composition of the outstanding consolidated government (central government plus central bank) debt. More overnight reserves, and less of whatever the central bank is buying. So why should we think that having more interest-bearing reserves in the banking system, and less government debt in financial markets should stimulate anything? To help get at that, let's look at money market interest rates in Canada.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-SQqjfZNDBI8/Xxsu_KukzgI/AAAAAAAAECk/sZIkw4Myv48PDvAYF_nz4wBF_O9h06qugCNcBGAsYHQ/s978/rrates.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"842\" data-original-width=\"978\" height=\"539\" src=\"https://1.bp.blogspot.com/-SQqjfZNDBI8/Xxsu_KukzgI/AAAAAAAAECk/sZIkw4Myv48PDvAYF_nz4wBF_O9h06qugCNcBGAsYHQ/w625-h539/rrates.png\" width=\"625\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">Day 60 is late March, when the interest rate on reserves (balances of LVTS participants held with the Bank) went to 0.25%. Early in the year, you can see a normal configuration of interest rates in Canada - typically t-bill rates (1 month and 3 month) are lower than the overnight repo rate. You can see the period of market turmoil after day 60, when t-bill rates are typically at or above the repo rate, and the repo rate is below the interest rate on reserves. Then, things eventually settle down, getting into July. The repo rate is now at the interest rate on reserves, as it should be in a well-operating floor system, and t-bill rates are lower than the overnight rate, though the margin is not as large as pre-COVID-19. The current configuration of interest rates might make you wonder why swapping reserves for t-bills is a good idea. Apparently the Bank has to give the chartered banks a premium to hold reserves rather than t-bills, implying that reserves are inferior to t-bills. Now think about long-maturity government bonds. Essentially, the Bank is swapping reserves for long-maturity government debt, and the chartered banks are taking reserves and turning them into bank deposits. Of course, chartered banks can hold long-maturity government bonds directly and turn them into bank deposits, so why isn't the Bank of Canada just a redundant middleman in this operation? You might argue that the Bank is unloading risk from the chartered banks, but what risk? Given the Bank's forward guidance, we're expecting short rates to stay low for a long period of time, and so we should expect little variability in long bond prices. Further, these are large Canadian banks, and their ability to bear a small amount of risk on government debt is pretty good, I think. Here's what's happening with the chartered banks:</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-GPhDW2csOZ8/Xxs041YDwKI/AAAAAAAAECw/-G5pXu8budopEiey5_DjbRrBz0ULD16GACNcBGAsYHQ/s995/totalbank.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"798\" data-original-width=\"995\" height=\"501\" src=\"https://1.bp.blogspot.com/-GPhDW2csOZ8/Xxs041YDwKI/AAAAAAAAECw/-G5pXu8budopEiey5_DjbRrBz0ULD16GACNcBGAsYHQ/w625-h501/totalbank.png\" width=\"625\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div>In this chart, I've shown only bank deposits, which have increased substantially since March (sorry the hash marks on the horizontal axis divide a year into fifths), and illiquid assets, which have not. As you might imagine, on the asset side, banks are holding much more liquid assets:</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-OCrLRJHuA4Y/Xxs6N2DSBqI/AAAAAAAAEC8/cE45TLkKpj8fkNztDgb1GBiziffwKKotQCNcBGAsYHQ/s1003/liquid.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"798\" data-original-width=\"1003\" height=\"499\" src=\"https://1.bp.blogspot.com/-OCrLRJHuA4Y/Xxs6N2DSBqI/AAAAAAAAEC8/cE45TLkKpj8fkNztDgb1GBiziffwKKotQCNcBGAsYHQ/w625-h499/liquid.png\" width=\"625\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div>Chartered banks are holding much more reserves, but also much more t-bills, and somewhat more government bonds (less than and more than 3 years to maturity). So, the question would be: What difference would it make to these chartered banks if they had less reserves and more government debt on the asset side of the balance sheet? Basically, QE involves stuffing the banking sector with overnight assets, while taking safe assets widely used as collateral out of the market, so it's hard to see why we would think of QE as accommodative.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">5) <i>Aren't bond yields pretty low anyway? </i>With the overnight rate at 0.25%, the current 2-year government bond yield is 0.268%, the 5-year is at 0.342%, the 10-year is 0.50%, and the 30-year is 0.975%. The Bank thinks it can squeeze a few more basis points out of the 10-year bond yield for example? And what would that accomplish?</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">So, you can tell that I'm not too excited about the Bank's QE program. On the positive side, the interest rate policy looks OK. It's hard to see what else the Bank should do other than keep the policy rate at zero, or close to it, for the foreseeable future. Forward guidance is perhaps overemphasized as a policy tool I think - it's best for a central banker to take an action, make it well understood why the action was taken, and then trust people to understand how the state of the world maps into policy actions - but the Bank's interest rate guidance is fairly innocuous, as these things go. The July policy statement says:</div><blockquote><div class=\"separator\" style=\"clear: both; text-align: left;\"><span style=\"background-color: white; color: #676984; font-family: &quot;open sans&quot;, &quot;helvetica neue&quot;, helvetica, arial, sans-serif; font-size: 14px; font-variant-ligatures: none;\">The Governing Council will hold the policy interest rate at the effective lower bound until economic slack is absorbed so that the 2 percent inflation target is sustainably achieved.</span></div></blockquote><div>There are things I don't like about that, but it's a piece of fiction that allows the Bank to justify interest rate hikes when the time comes. The Bank is telling you that there's a Phillips curve (that's the fiction), and that the way to control inflation is to control an output gap, say as measured by the unemployment rate. As I argued <a href=\"https://www.utpjournals.press/doi/full/10.3138/cpp.2019-058\">in this paper</a>, what the Bank has typically done in the past is to raise and lower its interest rate target in response mainly to the unemployment rate. As long as the Bank gets the average level of the policy rate about right, in the process they can successfully hit a 2% inflation target, as they've done since 1991. Best guess is that the right average policy rate is where it was before COVID-19, at 1.75% or thereabouts. To sustain 2% inflation, the Bank has to get back up to that level sometime in the future. But, inflation targeting is off the table right now, for good reasons, though Tiff Macklem wants to reassure us, in line with the Bank's agreement with the federal government, that he has the 2% target on his mind. Problem is, as the Bank recognizes in its report, that the CPI measure used by the Bank as their inflation measure was designed to be useful only if expenditure shares don't vary much. That's not the case now, so standard inflation measures won't have much meaning for a while. In any case, we should expect inflation to be fairly low and stable, though below target for some time. Take my word for it, that's just a feature of low-nominal-interest-rate environments, large central bank balance sheet or small.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 7
}