{
  "title": "577: Back to Hogwarts! We're Teaching Our Own Magical Lessons!",
  "link": "https://audioboom.com/posts/8151845",
  "itunes:episode": 577,
  "itunes:title": "Back to Hogwarts! We're Teaching Our Own Magical Lessons!",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2702,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>To celebrate going Back to Hogwarts, each MuggleCaster brings their own Hogwarts Lesson to the table, and you better pay attention because House Points are up for grabs.  Class is now in session!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome Slug Club member, Robbie! <a href=\"https://www.instagram.com/robtonkswandcollector/\">Check out his wand collection</a> on Instagram!</li>\n<li>Main Discussion: Build Your Own Hogwarts Lesson as a new year at the school kicks off.</li>\n<li>Professor Andrew teaches about the Hogwarts Express in History of Magic.</li>\n<li>Spend Muggle Studies with Professor Eric</li>\n<li>Professor Laura introduces us to Proper Spell Enunciation</li>\n<li>Explore International Wizarding Cultures with Professor Micah</li>\n<li>Professor Robbie drops some serious Wandlore knowledge on us all!</li>\n<li>Beware of pop quizzes, homework and security nightmares!</li>\n<li>Quizzitch:  From what neighborhood does Harry first (accidentally) hail the Knight Bus?</li>\n<li>On next week's episode: Chapter-by-Chapter returns with Chapters 1-3 of Harry Potter and the Sorcerer's Stone!</li>\n<li>This week's episode is brought to you by Upside (download the FREE Upside App and use promo code mugglecast to get $5 or more cash back on your first purchase of $10 or more) and BetterHelp (get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast)</a>\n</li>\n</ul>\n",
  "pubDate": "Tue, 06 Sep 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-05:/posts/8151845",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}