{
  "title": "This VC Is Betting Big on Flying Taxis and Scooters",
  "link": "https://spectrum.ieee.org/adam-grosser-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/man-sitting-in-front-of-a-disassembled-car-in-a-garage-with-tools-behind-him.png?id=29963584&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p><strong>Adam Grosser wants</strong> to improve transportationof people, goods, and energy. That’s why the chairman and managing partner of the early-stage venture capital fund <a href=\"https://up.partners\" rel=\"noopener noreferrer\" target=\"_blank\">UP Partners</a> is investing in several mobility projects. They include <a href=\"https://www.beta.team/\" rel=\"noopener noreferrer\" target=\"_blank\">Beta Technologies</a>’<a href=\"https://spectrum.ieee.org/evtol-air-taxi-industry\" target=\"_self\"> electric vertical-takeoff-and-landing</a> aircraft, <a href=\"https://www.quincus.com\" rel=\"noopener noreferrer\" target=\"_blank\">Quincus</a>’s operating system for supply-chain and logistics providers, and <a href=\"http://www.teleo.ai\" rel=\"noopener noreferrer\" target=\"_blank\">Teleo</a>’s teleoperation platform for mining, construction, and other heavy equipment.</p><p>“Transportation is the underlying fabric of society,” Grosser says. “At UP, we invest in key enabling technologies that help move people and goods faster, safer, more efficiently, and sustainably. This can include anything from new kinds of ground, sea-born, air, or space vehicles to production lines, packages, and units of automation.”<br/></p><hr/><p>The mobility sector is ripe for improvement, he says. “Arguably just about everything on a car, except for a few safety systems, was invented by 1920—although not necessarily put into widespread practice. But mobility hasn’t previously been an investable category.” </p><p>He credits several factors for this. Faster, smaller, and cheaper additive manufacturing is now available. Also, rapid shifts in battery capacity and electric motor torque have dramatically changed how mobility vehicles and methods are built and work. </p><p>The question, he says, is how to pull all these together into something that is safe and more environmentally friendly than what we do today—and which has a viable financial model. </p><p>One company that ticks all these boxes for Grosser is <a href=\"https://kolors.com.mx/\" target=\"_blank\">Kolors</a>, in Acapulco, Mexico, which aims to transform the bus industry across Latin America by offering a website for riders to reserve a seat on an intercity bus. The company does not own the buses. Instead, it partners with small and medium-size bus lines that own their vehicles to provide a consistent customer experience and offer a single ticketing framework. He describes Kolors as an “asset-light bus company” and compares it to <a href=\"https://www.uber.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Uber</a>, the ride-hailing service, which also doesn’t own the vehicles customers use. </p><p class=\"pull-quote\">At UP Partners, we invest in key enabling technologies that help move people and goods faster, safer, more efficiently, and sustainably.</p><p>Grosser decided to get into the investment business after two decades in senior positions at <a href=\"https://www.apple.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Apple</a>, <a href=\"https://www.theguardian.com/technology/gamesblog/2013/apr/04/lucasarts-closed-by-disney\" rel=\"noopener noreferrer\" target=\"_blank\">LucasArts</a>, <a href=\"https://www.sonypictures.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Sony Pictures Entertainment</a>, and <a href=\"https://en.wikipedia.org/wiki/@Home_Network\" rel=\"noopener noreferrer\" target=\"_blank\">@Home Network</a>. He spent more than a decade at <a href=\"https://foundationcapital.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Foundation Capital</a>, primarily in early-stage ventures. He then moved to large-cap private equity firms, including <a href=\"https://www.silverlake.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Silver Lake</a>. He’s been with UP Partners since May 2020. </p><p>“Most people who go into tech investing today do that with a fairly clear intention of being an investor,” Grosser says. “[By contrast], I would consider myself an inadvertent investor. I’ve spent decades working to solve meaningful challenges, first as an engineer, then as an entrepreneur, and for the past 21 years as an investor.” </p><p>What helped him succeed at his investing goals? Mentors. </p><p>“I have been lucky enough to have amazing mentors and partners, from my college days through to the present,\" Grosser says. One was the late <a href=\"https://foundationcapital.com/in-memory-of-kathryn-gould/\" rel=\"noopener noreferrer\" target=\"_blank\">Kathryn Gould</a>, who founded Foundation Capital. In addition to being one of the first female venture capitalists, she was also a physicist and concert violinist. </p><p>“She pulled me in and said, ‘I think you will be a good investor. Let me teach you.’”</p><p>Grosser also credits his diverse engineering experiences with helping him talk knowledgeably about potential new technologies and companies to invest in as well as conduct due diligence. </p><p>Grosser uses some of what he learned through his hands-on experience with a variety of vehicles. He has built airplanes, boats, hydrofoils, and motorcycles. He even <a href=\"https://spectrum.ieee.org/cycle-by-wire-recumbent-trike\" target=\"_self\">built a cycle-by-wire electric trike</a> for a close friend who had been an avid cyclist but was essentially paralyzed by ALS. He also builds and restores classic cars and vintage military aircraft. He recently finished building a 1963 Porsche 356 B for his daughter. He also is converting the drivetrain of a 1974 Jaguar E-Type to an electric one.</p><p>Grosser has been a pilot for more than 40 years and has flown everything from gliders and biplanes to helicopters and seaplanes. He currently holds an Airline Transport Pilot rating certificate, which is the highest achievement of pilot certification.</p><p>His advice for would-be investors is to use the knowledge they already have. </p><p>“Courses like robotics or thermodynamics that may not have been part of your major can be integrated with whatever you’ve learned and done in software, hardware, and product design,” he says. “Any of this knowledge and experience can help you establish rapport and make more-informed selections.”</p><p><em>This article appears in the July 2022 print issue as “Adam Grosser.”</em></p>",
  "pubDate": "Tue, 14 Jun 2022 15:15:38 +0000",
  "guid": "https://spectrum.ieee.org/adam-grosser-profile",
  "category": [
    "Type:departments",
    "Careers",
    "Venture capital",
    "Transportation",
    "Vtol",
    "Evtol",
    "Flying taxi"
  ],
  "dc:creator": "Daniel P. Dern",
  "media:content": ""
}