{
  "title": "Bolivia's Election and What's Next, with Thomas C. Field Jr.",
  "description": "<p><em>Thanks for listening! If you’re interested in more coverage of international affairs and US foreign policy, check out Foreign Exchanges at </em><em>Substack</em><em> and sign up for our free email list today:</em></p><p>Thomas C. Field Jr. of Embry-Riddle Aeronautical University joins me for the <a target=\"_blank\" href=\"https://fx.substack.com/p/bolivia-since-morales-with-thomas\">second time</a> to update us on the situation in Bolivia. Luis Arce, nominee of Evo Morales’ Movement for Socialism (MAS) party, won a decisive victory in last month’s election, potentially capping a year that saw Morales ousted in a right-wing putsch that then made every effort to stop MAS from returning to power. We look back on what happened to Morales and the destructive legacy that the Jeanine Áñez-led junta has left in its wake, and look ahead to the challenges that face Arce, from a revanchist Bolivian far right, to an economy devastated by mismanagement and COVID-19, to a regional political environment (largely overseen by the Organization for American States) that is designed to undermine left-wing governments.</p><p>Thomas is the author of From <em>Development to Dictatorship: Bolivia and the Alliance for Progress in the Kennedy Era</em> and co-editor of the recently published <em>Latin America and the Global Cold War</em>, both of which are available from Powell’s (<a target=\"_blank\" href=\"https://www.powells.com/book/-9780801452604\">here</a> and <a target=\"_blank\" href=\"https://www.powells.com/book/-9781469655697\">here</a>, respectively) and many other booksellers.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/bolivias-election-and-whats-next",
  "guid": "substack:post:17324323",
  "dc:creator": "Derek Davison",
  "pubDate": "Tue, 03 Nov 2020 18:46:08 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4749,
  "itunes:image": ""
}