{
  "title": "How Can We Talk About Autonomous Weapons?",
  "link": "https://spectrum.ieee.org/autonomous-weapons-challenges",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/abstract-illustration-of-overlapping-circles-and-squares.jpg?id=31988673&width=1200&height=800&coordinates=0%2C116%2C0%2C117\"/><br/><br/><p>\n<em>This article is part of our <a href=\"/collections/autonomous-weapons-challenges/\" target=\"_blank\">Autonomous Weapons Challenges</a> series. The IEEE Standards Association is <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" target=\"_blank\">looking for your feedback</a> on this topic, and has invites you to answer <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" target=\"_blank\">these questions</a>.</em></p><p>\n\tLethal autonomous weapons systems can sound terrifying, but autonomy in weapons systems is far more nuanced and complicated than a simple debate between “good or bad” and “ethical or unethical.” In order to address the legal and ethical issues that an autonomous weapons system (AWS) can raise, it’s important to look at the many technical challenges that arise along the full spectrum of autonomy. A group of experts convened by \n\t<a href=\"https://standards.ieee.org/\" target=\"_blank\">the IEEE Standards Association</a> is working on this, but they need your help.\n</p><p>\n\tWeapons systems can be built with a range of autonomous capabilities. They might be self-driving tanks, surveillance drones with AI-enabled image recognition, unmanned underwater vehicles that operate in swarms, loitering munitions with advanced target recognition—the list goes on. Some autonomous capabilities are less controversial, while others trigger intense debate over the legality and ethics of the capability. Some capabilities have existed for decades, while others are still hypothetical and may never be developed.\n</p><p>\n\tAll of this can make autonomous weapons systems difficult to talk about, and doing so has proven to be incredibly challenging over the years. Answering even the most seemingly straightforward questions, such as whether an AWS is lethal or not, can get surprisingly complicated.\n</p><hr/><p>\n\tTo date, international discussions have largely focused on the legal, ethical, and moral issues that arise with the prospect of lethal AWS, with limited consideration of the technical challenges. At the United Nations, these discussions have taken place within the\n\t<a href=\"https://www.un.org/disarmament/the-convention-on-certain-conventional-weapons/background-on-laws-in-the-ccw/\" rel=\"noopener noreferrer\" target=\"_blank\"> Convention on Certain Conventional Weapons</a>. After nearly a decade, though, the U.N. has yet to come up with a new treaty or regulations to cover AWS. In early discussions at the CCW and other international forums, participants often talked past each other: One person might consider a “fully autonomous weapons system” to include capabilities that are only slightly more advanced than today’s drones, while another might use the term as a synonym for the Terminator.\n</p><p>\n\tDiscussions advanced to the point that in 2019, member states at the CCW agreed on a set of \n\t<a href=\"https://documents-dds-ny.un.org/doc/UNDOC/GEN/G19/343/64/PDF/G1934364.pdf?OpenElement\" rel=\"noopener noreferrer\" target=\"_blank\">11 guiding principles regarding lethal AWS</a>. But these principles are nonbinding, and it’s unclear how the technical community can implement them. At the most recent meeting of the CCW in July, delegates repeatedly pushed for more nuanced discussions and understanding of the various technical issues that arise throughout the life cycle of an AWS.\n</p><p>\n\tTo help bring clarity to these and other discussions, the \n\t<a href=\"https://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association</a> convened an expert group in 2020, to consider the ethical and technical challenges of translating AWS principles into practice and what that might mean for future development and governance.\n</p><p>\n\tLast year, the expert group, which I lead, published its findings in a report entitled “<a href=\"https://standards.ieee.org/wp-content/uploads/import/documents/other/ethical-technical-challenges-autonomous-weapons-systems.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Ethical and Technical Challenges in the Development, Use, and Governance of Autonomous Weapons Systems</a>.” In the document, we identified over 60 challenges of autonomous weapons systems, organized into 10 categories:\n</p><ol>\n<li>Establishing common language</li>\n<li>Enabling effective human control</li>\n<li>Determining legal obligations</li>\n<li>Ensuring robustness</li>\n<li>Testing and evaluating</li>\n<li>Assessing risk</li>\n<li>Addressing operational constraints</li>\n<li>Collecting and curating data</li>\n<li>Aligning procurement practices</li>\n<li>Addressing nonmilitary use</li>\n</ol><p>\n\tIt’s not surprising that “establishing common language” is the first category. As mentioned, when the debates around AWS first began, the focus was on \n\t<em>lethal</em> autonomous weapons systems, and that’s often still where people focus. Yet determining whether or not an AWS is lethal turns out to be harder than one might expect.\n</p><p>\n\tConsider a drone that does autonomous surveillance and carries a remote-controlled weapon. It uses artificial intelligence to navigate to and identify targets, while a human makes the final decision about whether or not to launch an attack. Just the fact that the weapon and autonomous capabilities are within the same system suggests this could be considered a lethal AWS.\n</p><p>\n\tAdditionally, a human may not be capable of monitoring all of the data the drone is collecting in real time in order to identify and verify the target, or the human may over-trust the system (a \n\t<a href=\"https://www.bbc.com/future/article/20211019-why-we-place-too-much-trust-in-machines\" rel=\"noopener noreferrer\" target=\"_blank\">common problem</a> when humans work with machines). Even if the human makes the decision to launch an attack against the target that the AWS has identified, it’s not clear how much “meaningful control” the human truly has. (“<a href=\"https://blogs.icrc.org/law-and-policy/2018/08/15/autonomous-weapons-operationalizing-meaningful-human-control/\" rel=\"noopener noreferrer\" target=\"_blank\">Meaningful human control</a>” is another phrase that has been hotly debated.)\n</p><p>\n\tThis problem of definitions isn’t just an issue that comes up when policymakers at the U.N. discuss AWS. AI developers also have different definitions for commonly used concepts, including “bias,” “transparency,” “trust,” “autonomy,” and “artificial intelligence.” In many instances, the ultimate question may not be, Can we establish technical definitions for these terms? but rather, How do we address the fact that there may never be consistent definitions and agreement on these terms? Because, of course, one of the most important questions for all of the AWS challenges is not whether we technically \n\t<em>can</em> address this, but even if there is a technical solution, <em>should</em> we build and deploy the system?\n</p><p>\n\tIdentifying the challenges was just the first stage of the work for the IEEE-SA expert group. We also concluded that there are three critical perspectives from which a new group of experts will be considering these challenges in more depth:\n</p><ul>\n<li><strong><a href=\"https://spectrum.ieee.org/how-can-we-make-sure-that-aws-are-used-responsibly\" target=\"_blank\">Assurance and safety</a></strong>, which looks at the technical challenges of ensuring the system behaves the way it’s expected to.<br/>\n</li>\n<li><strong><a href=\"https://spectrum.ieee.org/the-challenge-of-human-control-over-autonomous-weapons\" target=\"_blank\">Human–machine teaming</a></strong>, which considers how the human and the machine will interact to enable reasonable and realistic human control, responsibility, and accountability.</li>\n<li><strong><a href=\"https://spectrum.ieee.org/autonomous-weapon-systems-and-the-laws-of-war\" target=\"_blank\">Law, policy, and ethics</a></strong>, which considers the legal, political, and ethical implications of the issues raised throughout the Challenges document.</li>\n</ul><div class=\"ieee-sidebar-large\">\n<h3>What Do You Think?</h3>\n<p>\n\tThis is where we want your feedback! Many of the AWS challenges are similar to those arising in other fields that are developing autonomous systems. We expect and hope that IEEE members and readers of \n\t\t<em>IEEE Spectrum</em> will have insights from their own fields that can inform the discussion around AWS technologies.\n\t</p>\n<p>\n\tWe’ve put together a \n\t\t<a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">series of questions</a> in the Challenges document that we hope you’ll answer, to help us better understand how people in other fields are addressing these issues. Autonomous capabilities will increasingly be applied to weapons systems, much as they are being applied in other realms, and we hope that by looking at the challenges in more detail, we can help establish effective technical solutions, while contributing to discussions about what can and should be legally acceptable. Your feedback will help us move toward this ultimate goal. <a href=\"https://saforms.ieee.org/autonomous-weapons-participation/\" rel=\"noopener noreferrer\" target=\"_blank\">Public comments will be open through 7 December 2022</a>.\n\t</p>\n</div><p>\n<em>The independent group of experts who authored the report for the IEEE Standards Associate includes <a href=\"https://www.linkedin.com/in/emmanuelbloch/?locale=en_US\" rel=\"noopener noreferrer\" target=\"_blank\">Emmanuel Bloch</a>, <a href=\"https://www.linkedin.com/in/aconn23/\" rel=\"noopener noreferrer\" target=\"_blank\">Ariel Conn</a>, <a href=\"https://www.linkedin.com/in/denise-garcia-13054016b/\" rel=\"noopener noreferrer\" target=\"_blank\">Denise Garcia</a>, <a href=\"https://www.linkedin.com/in/amandeep-gill-33052416/\" rel=\"noopener noreferrer\" target=\"_blank\">Amandeep Gill</a>, <a href=\"https://www.linkedin.com/in/ashley-soulstice-llorens/\" rel=\"noopener noreferrer\" target=\"_blank\">Ashley Llorens</a>, <a href=\"https://www.linkedin.com/in/martnoorma/\" rel=\"noopener noreferrer\" target=\"_blank\">Mart Noorma</a>, and <a href=\"https://www.linkedin.com/in/heather-m-roff-95466713/\" rel=\"noopener noreferrer\" target=\"_blank\">Heather Roff</a></em><em>.</em>\n</p>",
  "pubDate": "Thu, 03 Nov 2022 13:10:04 +0000",
  "guid": "https://spectrum.ieee.org/autonomous-weapons-challenges",
  "category": [
    "Autonomous weapons",
    "Aws",
    "Robotics"
  ],
  "dc:creator": "Ariel Conn",
  "media:content": ""
}