{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-4888878190066699871",
  "published": "2020-03-16T10:00:00.000-07:00",
  "updated": "2020-03-16T10:00:03.264-07:00",
  "title": "Protecting our extended workforce and the community",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\"><i>Today, as the unprecedented COVID-19 situation continues, Google <a href=\"https://blog.google/inside-google/company-announcements/update-extended-workforce-covid-19\" target=\"_blank\">outlined</a> how it’s reducing the need for people to come into its offices while ensuring that its products continue to operate for everyone.  We are committed to keeping the YouTube community informed about our actions related to COVID-19 in a dedicated location in our <a href=\"https://support.google.com/youtube/answer/9777243?p=covid19_updates&amp;visit_id=637194868739116880-4122912225&amp;rd=1\" target=\"_blank\">help center</a>. Here is our <a href=\"https://youtube-creators.googleblog.com/2020/03/coronavirus-update-on-creator-support.html\" target=\"_blank\">update</a> from last week; below is some more information about the reduction of in-office staffing as it relates to YouTube:<br /></i><br /><br /><br />We have teams at YouTube, as well as partner companies, that help us support and protect the YouTube community—from people who respond to user and creator questions, to reviewers who evaluate videos for possible policy violations. These teams and companies are staffed by thousands of people dedicated to helping users and creators. As the coronavirus response evolves, we are taking the steps needed to prioritize the well-being of our employees, our extended workforce, and the communities where they live, including reducing in-office<span style=\"font-family: Arial; font-size: 11pt; white-space: pre-wrap;\"> </span>staffing in certain sites.<br /><br /><br /><br />Our Community Guidelines enforcement today is based on a combination of people and technology: Machine learning helps detect potentially harmful content and then sends it to human reviewers for assessment. As a result of the new measures we’re taking, we will temporarily start relying more on technology to help with some of the work normally done by reviewers. This means automated systems will start removing some content without human review, so we can continue to act quickly to remove violative content and protect our ecosystem, while we have workplace protections in place. <br /><br /><br /><br />As we do this, users and creators may see increased video removals, including some videos that may not violate policies. We won’t issue strikes on this content except in cases where we have high confidence that it’s violative. If creators think that their content was removed in error, they can <a href=\"https://support.google.com/youtube/answer/185111?hl=en\" target=\"_blank\">appeal the decision</a> and our teams will take a look. However, note that our workforce precautions will also result in delayed appeal reviews. We’ll also be more cautious about what content gets promoted, including livestreams. In some cases, unreviewed content may not be available via search, on the homepage, or in recommendations. <br /><br /><br /><br />All eligible creators will still be able to monetize videos and this does not change the updates on monetization of coronavirus-related videos we <a href=\"https://youtube-creators.googleblog.com/2020/03/coronavirus-update-on-creator-support.html\" target=\"_blank\">shared</a> last week. And we’ll continue to enforce our policies regarding coronavirus content, including removing videos that discourage people from seeking medical treatment or claim harmful substances have health benefits. <br /><br /><br /><br />The situation with coronavirus continues to change day by day, and we’ll continue to take the steps needed to protect our teams and the communities where they live. This may affect additional types of YouTube user and creator support and reviews, such as applications for the YouTube partner program or responses on social media. To stay up-to-date on any changes in our services—and our broader response to the coronavirus—continue to check the <a href=\"https://support.google.com/youtube/answer/9777243?p=covid19_updates&amp;visit_id=637194868739116880-4122912225&amp;rd=1\" target=\"_blank\">help center</a>. <br /><br /><br /><br />We recognize this may be a disruption for users and creators, but know this is the right thing to do for the people who work to keep YouTube safe and for the broader community. We appreciate everyone’s patience as we take these steps during this challenging time.</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}