{
  "title": "S1E64 - “Swimming Chose Me” with 12-Time Olympic Medalist Natalie Coughlin",
  "guid": "https://pinecast.com/guid/1fa00e4c-662e-4757-a395-565829a74fa2",
  "pubDate": "Thu, 26 May 2022 06:30:00 -0000",
  "itunes:duration": "01:03:51",
  "description": "<p>Laura’s guest on today’s episode is record-breaker, trailblazer, and history-maker Natalie Coughlin. Natalie has won twelve Olympic medals and twenty World Championship medals; she was the first US woman to win six medals at a single Olympic Games and the first woman to win back-to-back Olympic gold medals in the same event and consecutive Olympics. And as if that wasn’t enough, Natalie was also the first woman ever to swim the hundred-meter backstroke in less than a minute. Her achievements also include winning eleven out of a possible twelve individual NCAA titles, being NCAA Swimmer of the Year three years in a row, and winning a total of sixteen medals in major international competitions (twenty-five gold, twenty-two silver, and thirteen bronze) spanning the Olympics, the World Championships, the Pan-Pacific Championships, and the Pan-American Games. As impressive as her achievements are, Natalie’s also just a really cool, down-to-earth person who’s so much fun to talk to. During the episode, we jump into how her story began, her fierce competitiveness, and an injury that changed her whole perspective on swimming.</p>\n<p>First up, Natalie shares how she got into swimming at a young age and how her natural competitiveness drove her to break onto the swimming scene at just thirteen. She then relates how she suffered a torn labrum in the run-up to qualifying for the 2000 Olympics team, the effect that had on her mindset and perspective, and her choice to avoid surgery and recover through physical rehab. Next, Natalie discusses how she chose which college to attend (eventually ending up at Cal, Berkeley) and the choices she made in her career post-injury, including ditching the two-hundred-meter backstroke and transitioning to sprint events. She talks about qualifying for the 2004 Olympics and the relief when she did, followed by the experience of winning her first gold medal and the positive impact that had on her confidence and ability to stay calm while competing. She also discusses how becoming a gold medalist led to more media attention and street recognition, how the Michael Phelps phenomenon helped shield her from the worst of that, and how she managed to achieve a happy medium of attention for her record-breaking success. Natalie then shares how it felt when other swimmers started nipping at her heels, firing up her competitiveness, and the mindset she gets into when preparing to compete. She then discusses how she prepared for the 2008 and 2012 Olympics, keeping her cool when the media were pushing retirement, and circling back to that early injury and how it helped her keep swimming in perspective. Laura then asks Natalie to share her most memorable and toughest moments in her career, including winning the hundred-back in Beijing and feeling isolated during the 2012 Games. And finally, Natalie shares what she’s been up to since retiring from competition, including writing her cookbook Cook to Thrive and starting the women-owned winery Gaderian Wines in Napa Valley.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>How Natalie got started in swimming</li>\n<li>Natalie’s competitive spirit</li>\n<li>Breaking onto the swimming scene at age thirteen</li>\n<li>Dealing with injury while trying to make the 2000 Olympic team</li>\n<li>Choosing between colleges</li>\n<li>Ditching the 200 backstroke</li>\n<li>Qualifying for the 2004 Olympic team</li>\n<li>The impact of winning gold at the Olympics</li>\n<li>Dealing with media attention</li>\n<li>Winning medals and breaking records</li>\n<li>The mentality of competition</li>\n<li>The road to Beijing 2008 and London 2012</li>\n<li>The most memorable vs. the toughest moment of Natalie’s swimming career</li>\n<li>What Natalie’s up to now</li>\n<li>Natalie’s cookbook, Cook to Thrive</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“Like the Water Babies type thing, you know, that every parent really needs to do for the safety of their children. It’s very, very important, whether you want them to be a swimmer or not, you have to get your kids in the water early.”</li>\n<li>“When we did soccer at school, like during PE or during recess and lunch, all the kids in my class, they were in soccer, and they were just, they were so much better than me. So I remember going home and practicing with a soccer ball against the wall in the backyard, just so I could get better. And no one was coaching me, I was doing this by myself.”</li>\n<li>“I will never forget, like, walking out onto the pool deck in Fort Lauderdale, Florida, and they’re like, ‘And in lane one, Natalie Coughlin. Thirteen-year-old Natalie Coughlin.’ And then I choked because it was the first time I was on, like, the major stage.”</li>\n<li>“A doctor, you know, finally told me, ‘Hey, you tore your labrum.’ So I had to deal with that, you know, most of ’99 and the lead up until 2000. And so my training really suffered. Emotionally, I really suffered. It was a really, really tough thing. And so I got to the 2000 Olympic trials, and by that time, I was just a shell of like, what I was before.”</li>\n<li>“Honestly, the 200 back is one of the most painful events. And by that stage in my career, I was transitioning much more into sprint. And so that was just kind of the proof that I needed of like, ‘Hey, see? I don’t need to do this dumb event.’”</li>\n<li>“Olympic gold, kind of, you just enter this other stratosphere of athletics where you will forever be an Olympic gold medalist - no one could ever take that away.”</li>\n<li>“Because I had the confidence to do so, I would go pretty easy that first hundred, I would build the fifth twenty-five, and then that last seventy-five meters, I would just hammer it home and just mow people down. It was so fun to swim that way.”</li>\n<li>“I remember being in the middle of Manhattan and people stopping me on the streets and, like, being on a train in the middle of nowhere, and people stopping me and being recognized. And, you know, part of that was really cool. But also, you know, I turned twenty-two at that Olympic Games. So it was, it was a lot, you know, like, it was great, but it also was super-overwhelming at the same time.”</li>\n<li>“I didn’t want all that pressure on me. It’s that catch-22. You know, if you want all that attention, you have to take all that pressure, and I felt like I had kind of the happy medium of it.”</li>\n<li>“And then, all of a sudden, I started crying. And then I started crying because I was crying. I was just like this sobbing, like, snotty mess.”</li>\n<li>“2012, I failed to make the Olympic team in the 100 back. And people were like, ‘Oh my God,’ you know, waiting for me to freak out or something. And like, 'It’s just swimming, guys. I already have two gold medals. Like it’s, I’m fine.'”</li>\n<li>“One, it’s so misogynistic, and two, none of their business. Like, it is so inappropriate for people to tell women that they need to retire and have babies. Some women don’t want it. Some people have a hard time getting pregnant. There’s like, so many reasons to not.”</li>\n<li>“What I’m most proud of is just, kind of, my consistency throughout the years. The ability to, you know, be in medal contention for twelve different events over three Olympic Games. Like that’s something that no one’s done. You know, even you know, Dara and Jenny. They didn’t do it in three Olympics. I’m really proud of that.”</li>\n<li>“I knew definitively after the ’16 trials that I was done. Like, I love swimming, and I love training so much, but honestly, I don’t feel the need to compete ever again. Like, that was kind of my mentality. And so, you know, I ended on my own terms, and I was really, really happy about it.”</li>\n<li>“I’ve always made sure when my teammates have had disappointing races or whatever, to not hide from them, and not hide from the conversation, just to be there for them. Like, it was a learning experience for me too.”</li>\n<li>“I think it’s really telling of us as maybe a culture sometimes. Like, we expect people to have a hissy fit or just have this giant pity party.”</li>\n<li>“I eat very healthy, but I don’t deprive myself. So like, I allow myself to have butter, and I eat chicken with the skin on it. And like, I believe in Whole Foods, and I believe in balance.”</li>\n<li>“People really wanted to peg me into, like, just clean, just healthy. This, like, boring Spartan, like, oh, this is what athletes eat. And that’s not how I’ve ever eaten. And if I ate that way, I would go crazy. I need to have a glass of wine, I need to have my chocolate and butter and like all those things.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Natalie’s Links:\n<a href=\"https://www.instagram.com/nataliecoughlin/\" rel=\"nofollow\">Natalie’s Instagram</a>\n<a href=\"https://www.instagram.com/gaderianwines/\" rel=\"nofollow\">Gaderian Wines Instagram</a>\n<a href=\"https://www.gaderianwines.com/\" rel=\"nofollow\">Gaderian Wines Homepage</a>\n<a href=\"https://www.amazon.com/Cook-Thrive-Recipes-Fuel-Body/dp/1524762172\" rel=\"nofollow\">Cook to Thrive</a></p>",
  "itunes:title": "“Swimming Chose Me” with 12-Time Olympic Medalist Natalie Coughlin",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 64
}