{
  "title": "177: The Life and Crimes of Doris Payne",
  "link": "https://audioboom.com/posts/7847971",
  "itunes:episode": 177,
  "itunes:title": "The Life and Crimes of Doris Payne",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3676,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>DORIS PAYINE IS THE WORLD'S MOST NOTORIOUS JEWEL THIEF...AND SHE REALLY LOVES HER JOB, YOU GUYS!<br>\n<br>\nThis is one of the wildest rides we've gone on in a while! This documentary tells the tale of how a poor, single, black mother from segregated West Virginia became the world's most notorious jewel thief. She's complicated and fabulous and we have a lot of feelings. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://lnk.to/ptzIRNzD\"><strong>CHECK OUT OUR NEW PODCAST: \"Strange And Unexplained With Daisy Eagan\"</strong></a><strong><br>\n</strong>Do you believe in ghosts? How about bigfoot? Do you think it’s strange and fascinating that a 4 year old in Oklahoma could look at a black and white picture of a man from the 1930s and say ‘that was me. Before.” And then provide actual, verifiable details of the man’s life? If so, “Strange and Unexplained With Daisy Eagan” is about to be your new Favorite podcast. Each week, Daisy looks at real stories of hauntings, disappearances, UFO encounters, the Bermuda Triangle, near death experiences, and anything else that feels just beyond what we can easily make sense of. She is your guide into the inexplicable details of these stories. But she’s also like, “show me the receipts.” <a href=\"https://lnk.to/ptzIRNzD\"><strong>Check out Episodes 1 - 5 RIGHT NOW!</strong></a>\n</div>\n",
  "pubDate": "Tue, 20 Apr 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-04-19:/posts/7847971",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}