{
  "itunes:episode": 38,
  "title": "Yes, We Can! With Marisa McClellan",
  "pubDate": "Thu, 29 Aug 2013 14:23:15 +0000",
  "link": "http://newdisrupt.org/blog/2013/8/29/episode-38-yes-we-can-with-marisa-mcclellan",
  "description": "<p>Marisa McClellan puts stuff in jars and it's delicious. Her <a href=\"http://foodinjars.com/\">Food in Jars blog</a> on canning and preserving went from a side venture alongside a full-time job to her main hub as a food writer. She writes for <em><a href=\"http://blog.foodnetwork.com/fn-dish/author/mmcclellan/\">Food Network</a></em> and <a href=\"http://tablematters.com/author/marisa-mcclellan/\">Table Matters</a> (part of Saveur). She conducts dozens of workshops and demonstrations every year. Her first book is <em><a href=\"http://www.amazon.com/Food-Jars-Preserving-Batches-Year-Round/dp/0762441437%3FSubscriptionId%3D1K6YWVXGBKSQA9ABHHG2%26tag%3Dsearchbyisbn%26linkCode%3Dxm2%26camp%3D2025%26creative%3D165953%26creativeASIN%3D0762441437\">Food in Jars: Preserving in Small Batches Year-Round</a></em>, and she is in the middle of writing her second book, <em>Preserving by the Pint</em>. You want to pickle something? She's your woman. She talks about how she built a career one jar of jam at a time.</p>",
  "guid": "tag:soundcloud,2010:tracks/107838463",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:50:06",
  "itunes:subtitle": "Marisa McClellan (\"Food in Jars\" blog) puts stuff in jars and it's delicious.",
  "itunes:summary": "Marisa McClellan puts stuff in jars and it's delicious. Her Food in Jars blog on canning and preserving went from a side venture alongside a full-time job to her main hub as a food writer. She writes for Food Network and Table Matters (part of Saveur). She conducts dozens of workshops and demonstrations every year. Her first book is Food in Jars: Preserving in Small Batches Year-Round, and she is in the middle of writing her second book, Preserving by the Pint. You want to pickle something? She's your woman."
}