{
  "title": "Biden lashes out at Twitter and Musk",
  "link": "https://www.rt.com/news/565985-biden-musk-twitter-lies/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565985-biden-musk-twitter-lies/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366156d20302760d9218b6e.jpg\" /> Twitter, which was recently acquired by Elon Musk, “spews lies all across the world,” US President Joe Biden has said <br/><a href=\"https://www.rt.com/news/565985-biden-musk-twitter-lies/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>“There’s no editors anymore in America,” the US president complained</strong></p>\n            \n                        \n            <p>By acquiring Twitter last month, Elon Musk took charge of a social media platform that<em> &ldquo;spews lies all across the world,&rdquo;</em> US President Joe Biden said on Friday.</p>\n<p>The comment came shortly after reports emerged that Musk had fired thousands of Twitter employees&nbsp;globally as part of a cost-cutting strategy. Sources told Politico that those laid off included members of teams working on the upcoming midterm elections in the US, content moderation, and verification of politicians&rsquo; accounts.</p>\n<p><em>&ldquo;Elon Musk goes out and buys an outfit that spews lies all across the world,&rdquo;</em> Biden said during a Democratic fundraiser in Rosemont, Illinois, referring to the purchase of Twitter by the world&rsquo;s richest man.</p>\n<p><em>&ldquo;There&rsquo;s no editors anymore in America,&rdquo;</em> he said, as quoted by CNN.</p>\n<p>Earlier, White House Press Secretary Karine Jean-Pierre claimed that Biden had been <em>&ldquo;outspoken about the importance of social media platforms continuing to take steps to reduce hate speech and misinformation.&rdquo; That included Twitter, Facebook and any other other platform &ldquo;where users can spread misinformation,&rdquo;</em> she added.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636567042030271f55419679.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565971-elon-musk-activists-advertiser-boycott/\">‘Activist groups’ tanking Twitter profits – Musk</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Musk&rsquo;s $44 billion deal to acquire Twitter was followed by claims from left-wing politicians and activists that there had been a spike in hate speech and racism on the platform.</p>\n<p>The owner of Tesla and SpaceX rebuffed those accusations, saying that <em>&ldquo;nothing has changed with content moderation&rdquo;</em> since he took charge just over a week ago.</p>\n<p>On Friday, Musk revealed that Twitter was losing $4 million per day because <em>&ldquo;activist groups&rdquo;</em> had been <em>&ldquo;trying to destroy free speech in America&rdquo;</em> by pressuring advertisers to boycott his platform.</p>\n<p>The tech entrepreneur said earlier that his goal was to turn Twitter into <em>&ldquo;a common digital town square, where a wide range of beliefs can be debated in a healthy manner, without resorting to violence.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 07:52:12 +0000",
  "dc:creator": "RT"
}