{
  "id": "yt:video:mFKYnbzLCh4",
  "yt:videoId": "mFKYnbzLCh4",
  "yt:channelId": "UCwRXb5dUK4cvsHbx-rGzSgw",
  "title": "xTool D1",
  "link": "",
  "author": {
    "name": "Derek Banas",
    "uri": "https://www.youtube.com/channel/UCwRXb5dUK4cvsHbx-rGzSgw"
  },
  "published": "2022-04-28T13:49:17+00:00",
  "updated": "2022-04-29T12:42:20+00:00",
  "media:group": {
    "media:title": "xTool D1",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I had no experience working with laser cutters / etchers until I got the Makeblock xTool D1, but it is so easy to use I feel like I can make anything! It can cut through basically anything. Because it is a laser though it can't cut through clear materials. It can etch everything including metal and glass. \n\nI'm going to show a bunch of projects I made using the xTool D1 and some of its accessories. I use the new Rotary Tool, Honeycomb Working Panel and some of Makeblock's engraving accessories. I can't believe I was able to make all of these cool things with zero experience.\n\nThe Makeblock xTool D1 Cutting and Engraving Machine is an industrial machine downsized for designers and hobbyists. All of the internal moving components are industrialized steel, but it is light enough to easy carry. The laser is accurate to .08 mm and moves with a precision of .01 mm. It has height adjustment, engraves and cuts numerous materials and is easy to adjust.\n\nThe xTool D1 is on Sale Here : https://bit.ly/MBxTool\n\nFULL DISCLOSURE \n\nI was given this kit for free for review. I was however not paid money for this review. You can sign up down below if you want the chance to test products like me.\n\nTEST  PRODUCTS  LIKE  ME\nIf  you’d  like  to  apply  to  be  a  product  tester  like  me,  check  out：  https://www.xtool.com/pages/influencer  \nOr join their Facebook group:\n https://www.facebook.com/groups/xtoold1  \nFIND  OUT  MORE  ABOUT  xTool\nFacebook:    https://www.facebook.com/xToolOfficial    \nInstagram:  https://www.instagram.com/makeblock.xtool/  \n\n#LaserEngraver #LaserCutter #xToolD1",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}