{
  "title": "Ethiopia: Truce Needs Robust Rights Monitoring",
  "link": "https://www.hrw.org/news/2022/11/04/ethiopia-truce-needs-robust-rights-monitoring",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Redwan Hussein (2nd L), Representative of the Ethiopian government, and Getachew Reda (2nd R), Representative of the Tigray People's Liberation Front (TPLF), sign a “cessation of hostilities” agreement between the two parties after African Union-led negotiations, Pretoria, South Africa, November 2, 2022.\n                    © 2022 PHILL MAGAKOE/AFP via Getty Images \n          \n\n  \n<p>(Nairobi) – The “cessation of hostilities” agreement between Ethiopia’s federal government and Tigrayan authorities announced on November 2, 2022 provides a crucial opportunity for immediate and rigorous international monitoring to avert further atrocities and a humanitarian catastrophe, Human Rights Watch said today. Intensified fighting in the Tigray region during the past two months has heightened fears of further rights abuses and caused large-scale displacement of civilians.<br /><br />\nThe two main warring parties reached an agreement following 10 days of African Union-led negotiations in South Africa, nearly two years after the war began on November 4, 2020. The devastating conflict has affected Tigray and the neighboring Afar and Amhara regions. Much of the Tigrayan population remains without access to desperately needed humanitarian assistance, which the Ethiopian government has largely blocked from the region.<br /><br />\n“The cessation of hostilities in northern Ethiopia after nearly two years of bloodshed is a critical moment to end atrocities and the immense suffering of millions of civilians,” said Carine Kaneza Nantulya, deputy Africa director at Human Rights Watch. “International scrutiny will be key to ensuring that the warring parties, which committed widespread abuses, don’t prolong the harm to the civilian population.”<br /><br />\nKey backers of the agreement should prioritize protecting civilians, press for robust monitoring, and ensure that the Ethiopian government and Tigrayan authorities fully carry out their rights commitments, Human Rights Watch said.<br /><br />\nHuman Rights Watch has documented serious violations of the laws of war and human rights abuses by all parties to the conflict. Ethiopian and Eritrean government forces, at times with allied militias, have committed extrajudicial killings, rape and sexual violence, unlawful shelling and airstrikes, and pillage. Tigrayan forces have also killed civilians and been responsible for sexual violence, and looting and destruction of property.<br /><br />\nIn Western Tigray Zone, Human Rights Watch jointly with Amnesty International, documented an ethnic cleansing campaign against the Tigrayan population by Amhara regional forces and militias, at times with the participation of Ethiopian federal forces.<br /><br />\nThe conflict has led to one of the world’s worst humanitarian crises. In June 2022, the United Nations estimated that 13 million people required humanitarian assistance in Afar, Amhara, and Tigray regions. Since June 2021, Ethiopian authorities have effectively besieged the Tigray region, preventing humanitarian aid from reaching hundreds of thousands of people and blocking basic services, including banking, electricity, and telecommunications. In September, the International Commission of Human Rights Experts, mandated by the UN Human Rights Council, found that Ethiopian forces were “intentionally using starvation of civilians as a method of warfare.”<br /><br />\nThe UN reported that 27 aid workers have been killed since November 2020. In the most recent incidents, separate attacks in the Tigray region killed an Ethiopian Red Cross ambulance driver and an International Rescue Committee worker.<br /><br />\nIn a joint statement released by the warring parties on November 2, 2022, the Ethiopian government agreed to “enhance its cooperation with humanitarian agencies to expedite aid to all those in need of assistance,” and “continue efforts to restore public services…of all communities affected by the conflict.” Given the Ethiopian authorities’ denials since the war began that they were obstructing humanitarian assistance in the Tigray region, it will be critical for the African Union and others monitoring the agreement to ensure that the obstructions end, Human Rights Watch said. This should include ensuring that basic services to the Tigray region are immediately restored and that independent humanitarian assistance reaches all affected communities.<br /><br />\nEthiopia’s partners should ensure that any mechanism established to oversee compliance with the cessation of hostilities includes a human rights monitoring component and gender rights experts to release timely public reports on the situation. They should be prepared to take concrete measures in the event of future rights abuses.<br /><br />\nThe agreement seen by Human Rights Watch does not explicitly mention the situation for civilians in Western Tigray zone, the site of the ethnic cleansing campaign. The warring parties should facilitate immediate and safe access for international humanitarian agencies – including to formal and informal detention sites without prior notification.<br /><br />\nFederal and regional authorities should also grant the International Commission of Human Rights Experts on Ethiopia and other independent rights monitors full and safe access to conflict-affected areas to press for full implementation of the rights commitments in the agreement.<br /><br />\nThe agreement lacks details on formal accountability, with the joint statement only mentioning a “transitional justice policy framework to ensure accountability, truth, reconciliation, and healing.”<br /><br />\nThe Ethiopian government and its partners should support investigations into violations of international law by all parties to the conflict in addition to transitional justice measures such as a forum for people to recount their experiences.<br /><br />\n“Over the past two years, impunity for serious crimes has taken root and driven further abuses,” Kaneza Nantulya said. “Ethiopia’s partners and the agreement’s backers need to make clear that accountability for the gravest crimes will remain on the agenda so the countless victims of this heinous war can obtain a measure of justice.”<br /><br /></p>",
  "pubDate": "Fri, 04 Nov 2022 00:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/04/ethiopia-truce-needs-robust-rights-monitoring"
}