{
  "author": {
    "name": "Hunter Clark and Jeff Dawson"
  },
  "title": "Is China Running Out of Policy Space to Navigate Future Economic Challenges?",
  "link": "",
  "id": "https://libertystreeteconomics.newyorkfed.org/?p=18174",
  "updated": "2022-09-21T21:02:49Z",
  "published": "2022-09-26T11:00:00Z",
  "category": [
    "",
    ""
  ],
  "summary": "After making progress slowing the pace of debt accumulation prior to the pandemic, China saw its debt levels surge in 2020 as the government responded to the severe economic slowdown with credit-led stimulus. With China currently in the midst of another sharp decline in economic activity due to its property slump and <a href=\"https://libertystreeteconomics.newyorkfed.org/2022/06/does-chinas-zero-covid-strategy-mean-zero-economic-growth/\">zero-COVID strategy</a>, Chinese authorities have responded again by pushing out credit to soften the downturn despite already high levels of debt on corporate, household, and  government balance sheets. In this post, we revisit China’s debt buildup and consider the growing constraints on Chinese policymakers’ tools to navigate future economic challenges.",
  "content": "<p class=\"ts-blog-article-author\">Hunter Clark and Jeff Dawson</p>\n\n\n\n<figure class=\"lse-featured-image\">\n\t<img width=\"460\" height=\"288\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_460.jpg?w=460\" class=\"cover-image asset-image img-responsive wp-post-image\" alt=\"Photo: Chinese shoppers lining up to buy shopping carts full of items within a store\" loading=\"lazy\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_460.jpg 920w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_460.jpg?resize=460,288 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_460.jpg?resize=768,481 768w\" sizes=\"(max-width: 460px) 100vw, 460px\" /></figure>\n\n\n\n<p>After making progress slowing the pace of debt accumulation prior to the pandemic, China saw its debt levels surge in 2020 as the government responded to the severe economic slowdown with credit-led stimulus. With China currently in the midst of another sharp decline in economic activity due to its property slump and <a href=\"https://libertystreeteconomics.newyorkfed.org/2022/06/does-chinas-zero-covid-strategy-mean-zero-economic-growth/\">zero-COVID strategy</a>, Chinese authorities have responded again by pushing out credit to soften the downturn despite already high levels of debt on corporate, household, and  government balance sheets. In this post, we revisit China’s debt buildup and consider the growing constraints on Chinese policymakers’ tools to navigate future economic challenges.</p>\n\n\n\n<h4><strong>China’s Waves of Debt</strong></h4>\n\n\n\n<p>Previous posts have explored China’s <a href=\"https://libertystreeteconomics.newyorkfed.org/2017/02/chinas-continuing-credit-boom/\">credit boom</a> and rise of <a href=\"https://libertystreeteconomics.newyorkfed.org/2019/02/could-rising-household-debt-undercut-chinas-economy/\">household debt</a>. China’s policy response to the global financial crisis in 2009 unleashed nearly ten years of uninterrupted growth in debt, with credit to the nonfinancial sector exploding by almost 150 percent of GDP, according to data from the Bank for International Settlements—one of the largest increases in modern history. It was not until 2018 that Chinese authorities were able to briefly stabilize these debt ratios through a hard-fought “deleveraging campaign.”</p>\n\n\n\n<p>China’s debt ratio resumed its upward trend in 2019, but then exploded again in 2020 as China was the first country in the world to respond to the pandemic. China’s run-up in credit in 2020 totaled nearly 29 percentage points of GDP but was short-lived, as the credit ratio contracted modestly in 2021. As COVID-19 spread globally, other countries’ policy responses were also associated with rising debt ratios, with China’s increase comparable to that of other countries, as illustrated in the chart below. However, while other major economies in the world are now tightening their monetary policies, expectations are for overall debt in China to rise again in 2022 to stabilize growth. China’s repeated reliance on credit-driven stimulus raises questions about the buildup of risks in the financial system and the extent to which rising debt levels in all three sectors—discussed below—are sustainable and could ultimately hamstring Chinese authorities’ policy options.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">China Has Seen a Sharp Run-Up in Debt Levels</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg?w=411\" alt=\"Bar chart showing the percentage point change in the credit-to-GDP ratios of China, Japan, the euro area, the U.S., and other emerging markets between 2007 and 2021, in particular highlighting the change from the end of 2019 through the end of 2021. \" class=\"wp-image-18186\" width=\"458\" height=\"321\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg?resize=460,323 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg?resize=768,538 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg?resize=411,288 411w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch1.jpg?resize=1536,1077 1536w\" sizes=\"(max-width: 458px) 100vw, 458px\" /><figcaption>Source: Bank for International Settlements via CEIC.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<h4><strong>One Step Forward, Two Steps Back</strong></h4>\n\n\n\n<p>As illustrated in the chart below, China’s total nonfinancial sector credit was almost 290 percent of GDP at the end of 2021. Borrowing by the corporate sector—the largest part of China’s total debt—is equivalent to approximately 153 percent of GDP, a figure that is among the highest in the world. China’s deleveraging campaign was effective in curbing runaway growth in shadow credit, but growth in corporate leverage resumed with pandemic-related stimulus. While estimates vary, state-owned enterprises (SOEs) account for around 50 to 60 percent of total corporate debt, with the remainder held on Chinese privately owned corporate balance sheets. Entities known as local government financing vehicles are also classified as corporate debt in China, although a large portion of these debts are assumed to be implicit government debt, as discussed in the next section. Repayment concerns involving corporate debt in China primarily relate to lending to inefficient SOEs and distressed real estate developers, with the latter the focus of authorities’ efforts over the past two years to reduce leverage in the property sector.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Corporate, Household, and Government Debt Have All Increased Notably</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg?w=432\" alt=\"Area chart showing increases in China’s government debt and corporate and household credit as a percent of GDP since 2006. Increases in debt have occurred across all three components.\" class=\"wp-image-18202\" width=\"459\" height=\"306\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg?resize=460,307 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg?resize=768,513 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg?resize=432,288 432w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch2-1.jpg?resize=1536,1025 1536w\" sizes=\"(max-width: 459px) 100vw, 459px\" /><figcaption>Source: Bank for International Settlements via CEIC.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Household debt accounts for 62 percent of GDP in China and has grown rapidly in recent years, raising concerns around increasingly stretched household balance sheets. China’s household debt has risen to levels that are quite high by developing country standards but remain broadly comparable to those of developed economies. As illustrated in the two charts below, the ratio of household debt to income in China is currently estimated to be in a range above the median for the economies in the OECD, while household debt service ratios have increased steadily and now exceed those in the United States, approaching even Korea.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-title\">Household Debt, in Particular, Has Surged</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg?w=434\" alt=\"Two-panel chart with a bar chart on left showing the ratio of household debt to disposable income in China, the U.S., the OECD, and Korea, in percent, and a line chart on the right showing the household debt service to income ratios of Australia, Korea, the U.S., and China. As illustrated in the two charts, the ratio of China’s household debt to income is currently estimated to be in a range above the median for the economies in the OECD, while China’s household debt service ratios have increased steadily and now exceed those in the U.S., and possibly even Korea.\" class=\"wp-image-18189\" width=\"459\" height=\"304\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg?resize=460,305 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg?resize=768,509 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg?resize=434,288 434w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch3.jpg?resize=1536,1018 1536w\" sizes=\"(max-width: 459px) 100vw, 459px\" /><figcaption>Source: Authors&#8217; calculations, based on data from the Organisation for Economic Co-operation and Development and the Bank for International Settlements (BIS) via CEIC.<br>Notes: The estimation range shown in the left panel uses household debt as reported by the BIS in the numerator and disposable income as reported by the sum of compensation of labor and property income in the flow of funds (lower range) and the household survey (upper range). The lower and upper ranges shown in the right panel use disposable income reported in the flow of funds (labor compensation and property income) and the household survey, respectively.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Mortgage loans make up roughly 63 percent of China’s total household debt (39 percent of GDP). Chinese authorities’ recent focus on curbing excesses in the property sector—and intermittent COVID-related lockdowns—have slowed mortgage growth notably, to under 10 percent year over year as of July after averaging more than twice that pace over the past six years. Property developers’ struggles to complete construction of pre-sold properties have likely added to the debt burdens of Chinese households, who are waiting to move into new properties yet still making rental or mortgage payments on current residences. In response, an increasing number of home buyers in China have threatened to suspend mortgage payments on undelivered homes, increasing financial risks to banks and developers.</p>\n\n\n\n<p>Officially recognized central and local government debt in China is moderate by international standards, at about 50 percent of GDP. However, estimates of “augmented” fiscal debt are much higher, at up to 100 percent of GDP for year-end 2021, according to IMF estimates. The sizable gap between these numbers represents debt that has been issued for fiscal purposes—typically categorized as corporate loans—and likely requires implicit fiscal assistance to be serviced or repaid, or that could be recognized as official debt under some circumstances. This “hidden” government debt is almost entirely borne by local governments, which are highly reliant on the property sector for financing and have much less fiscal flexibility than the central government.</p>\n\n\n\n<h4><strong>Is China Heading for a Financial Crisis?</strong></h4>\n\n\n\n<p>International experience suggests that rapid buildup of debt is often followed by financial crises or at least extended periods of much slower economic growth. Thus far, China has managed to avoid a severe day of reckoning, and Chinese authorities are still viewed as having considerable policy tools to manage the nation’s economy and associated financial risks</p>\n\n\n\n<p>These tools stem from unique features of the Chinese political and financial system. For example, China’s government maintains direct and indirect control of the country’s financial and nonfinancial sectors at the central and local level, including through ownership of most of the banks in the financial system and a significant portion of nonfinancial corporate firms. In addition, China’s domestic economy is shielded from external shocks by its current account surplus, large stock of foreign exchange reserves, and capital controls. Finally, China possesses ample scope to use monetary, credit, and central government fiscal policies to dampen economic fluctuations, as reflected in the response to the pandemic.</p>\n\n\n\n<p>Despite this unique array of policy tools, China has not been immune to financial turbulence over the past decade. China experienced an interbank market crisis in 2013, equity market busts in 2007 and 2015, massive capital outflows in 2015-16, a spate of bank failures in 2019, and most recently a crisis in its property sector accompanied by additional pressures on parts of its banking sector.</p>\n\n\n\n<p>Against such a backdrop, there are strong reasons to be watchful for signs of a sustained downshift in China’s historical pattern of economic performance. First, there is evidence that China’s credit-driven growth model is facing serious diminishing returns, as shown, for example, in the high and steadily increasing incremental capital to output ratio (shown in the chart on left below) and rising credit intensity (shown in chart on right). The decline in the “GDP bang for the credit buck” suggests that the old playbook of turning on the credit spigots will be less effective than in the past, while leading to the potential for increases in bad debt. Our colleague, Matthew Higgins, has <a href=\"https://www.newyorkfed.org/research/epr/2020/epr_2020_china-growth-outlook_higgins.html\">written </a>more extensively on the self-limiting nature of capital accumulation as a growth driver in China.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Is China&#8217;s Credit-Driven Growth Model Now Pushing on a String?</p>\n\n\n\n<figure class=\"wp-block-image size-large is-resized\"><img loading=\"lazy\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch4.jpg?w=460\" alt=\"The left panel of this two-panel chart is a trend chart showing a high increase in China’s incremental capital to output ratio since 2001, indicating that China’s credit-driven growth model is facing serious diminishing returns. The right-panel is a bar chart showing China’s lower credit intensity from 2004 through 2022:Q2 in trillions of renminbi. \" class=\"wp-image-18190\" width=\"459\" height=\"277\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch4.jpg 1840w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch4.jpg?resize=460,279 460w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch4.jpg?resize=768,465 768w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/09/LSE_2022_revisiting-china_dawson_ch4.jpg?resize=1536,931 1536w\" sizes=\"(max-width: 459px) 100vw, 459px\" /><figcaption>Source: Authors&#8217; calculations, based on data from the National Bureau of Statistics of China and the People&#8217;s Bank of China, via CEIC.<br>Notes: Left panel shows five-year moving average. Incremental capital to output ratio (ICOR) is calculated as the ratio of gross fixed capital formation to GDP divided by real GDP growth. In right panel, data shown for 2022 are through June. Credit intensity of GDP is the ratio of the incremental increase in credit over the incremental increase in GDP on a three-year moving average.</figcaption></figure>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p>Second, fiscal and monetary policies appear to face political and institutional constraints that may not be readily apparent from the data. On the fiscal side, even though official debt levels appear quite manageable, local governments are experiencing rapidly increasing debt burdens that remain hidden in local government affiliated enterprises and financial institutions. Based on China’s historical precedent, addressing these issues will likely take years of reform and fiscal tightening, which will create an additional drag on growth. On the monetary side, the authorities likely face constraints on cutting interest rates and reserve requirements for fear of sparking capital outflows or weakening banks’ profitability and encouraging additional buildups of risky borrowing.</p>\n\n\n\n<p>Finally, China faces other important challenges that will represent a sharp departure from the conditions it has experienced since Deng Xiaoping launched the country on its path of economic reform roughly four decades ago. Most profoundly, China’s demographic profile is <a href=\"https://libertystreeteconomics.newyorkfed.org/2018/08/will-demographic-headwinds-hobble-chinas-economy/\">aging</a> quickly, which will greatly increase old-age dependency and lead to a reduction in the working population. Moreover, as its share of global trade stops rising, China’s export engine eventually will downshift to a growth rate similar to that of world trade, or perhaps even lower. Against this backdrop, the medium- to long-term outlook for China’s economy will likely hinge more than ever on the quality of its economic and institutional policies.</p>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg?w=90\" alt=\"Photo: portrait of Hunter Clark\" class=\"wp-image-16357 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/05/clark_hunter.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/clark\" target=\"_blank\">Hunter L. Clark</a> is an international policy advisor in International Studies in the Federal Reserve Bank of New York’s Research and Statistics Group. </p>\n</div></div>\n\n\n\n<div style=\"height:12px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<div class=\"wp-block-media-text alignwide\" style=\"grid-template-columns:15% auto\"><figure class=\"wp-block-media-text__media\"><img loading=\"lazy\" width=\"90\" height=\"90\" src=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/dawson_jeff.jpg?w=90\" alt=\"Photo: portrait of Jeff Dawson\" class=\"wp-image-16688 size-full\" srcset=\"https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/dawson_jeff.jpg 90w, https://libertystreeteconomics.newyorkfed.org/wp-content/uploads/sites/2/2022/06/dawson_jeff.jpg?resize=45,45 45w\" sizes=\"(max-width: 90px) 100vw, 90px\" /></figure><div class=\"wp-block-media-text__content\">\n<p class=\"is-style-bio-contact has-large-font-size\"><a rel=\"noreferrer noopener\" href=\"https://www.newyorkfed.org/research/economists/dawson\" target=\"_blank\">Jeffrey B. Dawson</a> is an international policy advisor in International Studies in the Federal Reserve Bank of New York’s Research and Statistics Group.</p>\n</div></div>\n\n\n\n<div style=\"height:23px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<p class=\"is-style-disclaimer\">\n    <strong>How to cite this post:</strong><br/>\n    Hunter Clark and Jeff Dawson, &#8220;Is China Running Out of Policy Space to Navigate Future Economic Challenges?,&#8221; Federal Reserve Bank of New York <em>Liberty Street Economics</em>, September 26, 2022, https://libertystreeteconomics.newyorkfed.org/2022/09/is-china-running-out-of-policy-space-to-navigate-future-economic-challenges/.</p>\n</p>\n\n\n\n<p class=\"is-style-related-reading\"><strong>Related reading:</strong><br><a href=\"https://libertystreeteconomics.newyorkfed.org/2022/06/does-chinas-zero-covid-strategy-mean-zero-economic-growth/\">Does China’s Zero Covid Strategy Mean Zero Economic Growth?</a> (June 2022)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2017/02/chinas-continuing-credit-boom/\">China’s Continuing Credit Boom</a> (February 2017)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2019/02/could-rising-household-debt-undercut-chinas-economy/\">Could Rising Household Debt Undercut China’s Economy?</a> (February 2019)<br><a href=\"https://libertystreeteconomics.newyorkfed.org/2018/08/will-demographic-headwinds-hobble-chinas-economy/\">Will Demographic Headwinds Hobble China’s Economy?</a> (August 2018)<br><a href=\"https://www.newyorkfed.org/research/epr/2020/epr_2020_china-growth-outlook_higgins.html\">China&#8217;s Growth Outlook: Is High-Income Status in Reach?</a> (<em>Economic Policy Review</em>, October 2020)</p>\n\n\n\n<div>\n<div style=\"height:24px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div>\n\n\n\n<hr class=\"wp-block-separator has-alpha-channel-opacity\"/>\n\n\n\n<p class=\"is-style-disclaimer\"><strong>Disclaimer</strong><br>The views expressed in this post are those of the author(s) and do not necessarily reflect the position of the Federal Reserve Bank of New York or the Federal Reserve System. Any errors or omissions are the responsibility of the author(s).</p>\n</div>\n"
}