{
  "title": "Episode 127: &#8220;Ticket to Ride&#8221; by the Beatles",
  "link": "https://500songs.com/podcast/episode-127-ticket-to-ride-by-the-beatles/",
  "pubDate": "Tue, 13 Jul 2021 17:31:32 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=832",
  "description": "<p>This week’s episode looks at \"Ticket to Ride\", the making of the Beatles' second film, and the influence of Bob Dylan on the Beatles' work and lives. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, o<a href=\"https://www.patreon.com/posts/53645310\">n \"The Game of Love\" by Wayne Fontana and the Mindbenders</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week, as there are too many songs by the Beatles.</p>\n<p>I have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>, <a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>, <a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles </em>by Steve Lambley</a>, <a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>, <a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and <a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a></p>\n<p>For material on the making of the film, I referred to <em><a href=\"https://amzn.to/3tXKWpv\">Getting Away With It</a></em><a href=\"https://amzn.to/3tXKWpv\"> by Steven Soderbergh</a>, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.</p>\n<p>Sadly the only way to legally get the original mix of \"Ticket to Ride\" is <a href=\"https://amzn.to/2U0tGmS\">this ludicrously-expensive out-of-print box set,</a> but the 1987 remix is widely available on <a href=\"https://amzn.to/3AUrEoZ\">the CD issue of the <em>Help! </em>soundtrack</a>. The film is <a href=\"https://amzn.to/2TY92np\">available on DVD</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>When we last looked at the Beatles, they had just achieved their American success, and had appeared in their first film, A Hard Day's Night. Today, we're going to look at the massive artistic growth that happened to them between late 1964 and mid 1965, the making of their second film, Help!, the influence, both artistic and personal, of Bob Dylan on the group, and their introduction both to studio experimentation and to cannabis. We're going to look at \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>1964 was a tremendously busy year for the Beatles. After they'd finished making A Hard Day's Night, but even before it was released, they had gone on yet another tour, playing Denmark, the Netherlands, Hong Kong, Australia, and New Zealand, though without Ringo for much of the tour -- Ringo had to have his tonsils removed, and so for the first eight shows of the tour he was replaced by session drummer Jimmy Nicol, the former drummer with Colin Hicks and his Cabin Boys, who had played on several cheap soundalike records of Beatles songs. Nicol was a competent drummer, though very different in style from Ringo, and he found his temporary moment of celebrity hugely upsetting -- he later described it as the worst thing to ever happen to him, and ended up declaring bankruptcy only nine months after touring with the group. Nicol is now a recluse, and hasn't spoken to anyone about his time with the Beatles in more than thirty years.</p>\n<p>After Ringo returned to the group and the film came out they went back into the studio, only two months after the release of their third album, to start work on their fourth. They recorded four songs in two sessions before departing on their first full US tour. Those songs included two cover versions -- a version of \"Mr. Moonlight\" by Doctor Feelgood and the Interns that appeared on the album, and a version of Little Willie John's \"Leave My Kitten Alone\" that didn't see release until 1995 -- and two originals written mostly or entirely by John Lennon, \"Baby's In Black\", and \"I'm a Loser\":</p>\n<p>[Excerpt: The Beatles, \"I'm a Loser\"]</p>\n<p>\"I'm a Loser\" was an early sign of an influence that had particularly changed Lennon's attitude to songwriting -- that of Bob Dylan. Dylan had been on the group's radar for some time -- Paul McCartney in the Anthology book seems to have a confused memory of seeing Madhouse on Castle Street, the TV play Dylan had appeared in in January 1963 -- but early 1964 had seen him rise in prominence to the point that he was a major star, not just an obscure folk singer. And Lennon had paid particular attention to what he was doing with his lyrics.</p>\n<p>We've already seen that Lennon had been writing surreal poetry for years, but at this point in his life he still thought of his songwriting and his poetry as separate. As he would later put it \"I had a sort of professional songwriter's attitude to writing pop songs; we would turn out a certain style of song for a single, and we would do a certain style of thing for this and the other thing. I'd have a separate songwriting John Lennon who wrote songs for the meat market, and I didn't consider them (the lyrics or anything) to have any depth at all.\"</p>\n<p>This shouldn't be taken as Lennon saying that the early Beatles songs were lacking in quality, or that he didn't take the work seriously, but that it wasn't about self-expression. He was trying to do the best work he could as a craftsman. Listening to Dylan had showed him that it was possible instead to treat pop songwriting as art, in the sense Lennon understood the term -- as a means of personal expression that could also allow for experimentation and playing games.</p>\n<p>\"I'm a Loser\" is a first tentative step towards that, with Lennon for one of the first times consciously writing about his own emotions -- though careful to wrap those feelings both in a conventional love song structure and in a thick layer of distancing irony, to avoid making himself vulnerable -- and the stylistic influence of Dylan is very noticeable, as much in the instrumentation as in the lyrics. While several early Beatles singles had featured Lennon playing harmonica, he had been playing a chromatic harmonica, a type of harmonica that's mostly used for playing single-note melodies, because it allows the player to access every single note, but which is not very good for bending notes or playing chords. If you've heard someone playing the harmonica as a single-note melody instrument with few or no chords, whether Stevie Wonder, Larry Adler, or Max Geldray, the chances are they were playing a chromatic harmonica.</p>\n<p>On \"I'm a Loser\", though, Lennon plays a diatonic harmonica -- an instrument that he would refer to as a \"harp\" rather than a harmonica, because he associated it with the blues, where it's often referred to as a harp. Diatonic harmonicas are the instrument of choice for blues players because they allow more note-bending, and it's easier to play a full chord on them -- the downside, that you have a smaller selection of notes available, is less important in the blues, which tends towards harmonic minimalism. Diatonic harmonicas are the ones you're likely to hear on country, blues, and folk recordings -- they're the instrument played by people like Little Walter, Sonny Boy Williamson, Charlie McCoy, and Bob Dylan.</p>\n<p>Lennon had played a diatonic before, on \"I Should Have Known Better\", another song which shows Dylan's influence in the performance, though not in the lyrics. In both cases he is imitating Dylan's style, which tends to be full of chordal phrases rather than single-note melody.</p>\n<p>What's interesting about “I'm a Loser” though is contrasting John's harmonica solo with George's guitar solo which follows immediately after:</p>\n<p>[Excerpt: The Beatles, \"I'm a Loser\"]</p>\n<p>That's a pure Carl Perkins solo, and the group would, in their choices of cover versions for the next few months, move away somewhat from the soul and girl-group influences that dominated the covers on their first two albums, and towards country and rockabilly -- they would still cover Larry Williams, Little Richard, and Chuck Berry, but there were no more covers of contemporary Black artists, and instead there were cover versions of Buddy Holly, Carl Perkins, and Buck Owens, and Harrison switched from the Rickenbacker that had been his main instrument on A Hard Day's Night to playing a Gretsch -- the brand of guitar that Chet Atkins and Eddie Cochrane played. </p>\n<p>The consensus among commentators -- with which, for once, I agree -- seems to be that this was also because of the influence of Dylan. The argument is that the Beatles heard Dylan's music as a form of country music, and it inspired them to go back to their other country-oriented influences. And this makes a lot of sense -- it was only fifteen years earlier, at the same time as they replaced \"race\" with \"rhythm and blues\", that Billboard magazine chose to rename their folk chart to the country and western chart -- as Tyler Mahan Coe puts it, \"after years of trying to figure out what to call their “poor Black people music” and “poor white people music” charts\". And Dylan had been as influenced by Hank Williams as by Woody Guthrie.</p>\n<p>In short what the Beatles, especially Lennon, heard in Dylan seems to have been three things -- a reminder of the rockabilly and skiffle influences that had been their first love before they'd discovered R&B and soul, permission to write honestly about one's own experiences, and an acknowledgement that such writing could include surrealistic wordplay. Fundamentally, Dylan, as much as being a direct influence, seems to have given the group a kind of permission -- to have shown them that there was room in the commercial sphere in which they were now operating for them to venture into musical and lyrical areas that had always appealed to them.</p>\n<p>But of course, that was not the only influence that Dylan had on the group, as anyone who has ever read anything at all about their first full US tour knows. That tour saw them playing huge venues like the Hollywood Bowl -- a show which later made up a big part of their only official live album, which was finally released in 1977:</p>\n<p>[Excerpt: The Beatles, \"Things We Said Today (live at the Hollywood Bowl 1964)\"]</p>\n<p>It was nine days into the tour, on the twenty-eighth of August 1964, that they met Bob Dylan for the first time.</p>\n<p>The meeting with Dylan is usually called the first time the Beatles ever smoked cannabis -- and that's true, at least if you're talking about them as a group. Lennon had tried it around 1960, and both Lennon and Harrison had tried it at a show at the Southport Floral Hall in early 1962, but neither had properly understood what they were smoking, and had both already been drunk before smoking it. According to a later interview with Harrison, that had led to the two of them madly dancing the Twist in their dressing room, shouting \"This stuff isn't doing anything!\"</p>\n<p>But it was at this meeting that Paul and Ringo first smoked it, and it also seems to have been taken by Lennon and Harrison as their \"real\" first time, possibly partly because being introduced to cannabis by Bob Dylan in a New York hotel sounds a lot cooler than being introduced to it by your support band's drummer in Southport, possibly because it was the first time that they had all smoked it together as a group, but mostly because this was the time when it became a regular part of the group's life.</p>\n<p>Oddly, it happened because of a misheard lyric. Dylan had loved \"I Want to Hold Your Hand\", and had misheard \"I can't hide\" as \"I get high\", and thus just assumed that the British band were already familiar with cannabis.</p>\n<p>The drug had a profound effect on them -- McCartney later recalled being convinced he had discovered the meaning of life, writing it down on a bit of paper, and getting their roadie Mal Evans to hold the paper for safekeeping. The next morning, when he looked at the paper, he found it merely said \"there are seven levels\". Lennon, on the other hand, mostly remembered Dylan playing them his latest demos and telling them to listen to the words, but Lennon characteristically being unable to concentrate on the lyrics because in his stoned state he was overwhelmed by the rhythm and general sound of the music.</p>\n<p>From this point on, the use of cannabis became a major part of the group's life, and it would soon have a profound effect on their lifestyles, their songwriting, the production on their records, and every other aspect of their career.</p>\n<p>The Beatle on whom it seems to have had the strongest and most immediate effect was Lennon, possibly because he was the one who was coping least well with success and most needed something to take his mind off things. Lennon had always been susceptible to extremes of mood -- it's likely that he would these days be diagnosed as bipolar, and we've already seen how as soon as he'd started writing personally, he'd written \"I'm a Loser\". He was feeling trapped in suburbia, unsuited for his role as a husband and father, unhappy about his weight, and just generally miserable. Cannabis seemed, at least at first, to offer a temporary escape from that. All the group spent much of the next couple of years stoned, but Lennon probably more than any of them, and he was the one whose writing it seemed to affect most profoundly.</p>\n<p>On the group's return from the US, they carried on working on the next album, and on a non-album single designed to be released simultaneously with it.</p>\n<p>\"I Feel Fine\" is a major milestone in the group's career in a number of ways. The most obvious is the opening -- a brief bit of feedback which Lennon would always later claim to be the first deliberate use of the technique on a record:</p>\n<p>[Excerpt: The Beatles, \"I Feel Fine\"]</p>\n<p>Feedback had, up until this point, been something that musicians generally tried to avoid -- an unwanted sound that could wreck a performance. But among guitarists in London, especially, it was becoming the fashionable sound to incorporate, in a carefully controlled manner, in order to make sounds that nobody had heard before. Jeff Beck, Dave Davies, and Pete Townshend would all argue about which of them was the first to use the technique, but all were using it on stage by the time the Beatles recorded \"I Feel Fine\".</p>\n<p>But the Beatles were, if not the first to deliberately use feedback on a record (as I've said in the past, there is no such thing as a first anything, and there are debatable examples where feedback may be deliberate going back to the 1930s and some records by Bob Wills), certainly the most prominent artists to do so up to that point, and also the first to make it a major, prominent feature of a hit record in this manner. If they hadn't done it, someone else undoubtedly would, but they were the first to capture the sound that was becoming so popular in the London clubs, and as so often in their career they were able to capture something that was at the cutting edge of the underground culture and turn it into something that would be accepted by millions.</p>\n<p>\"I Feel Fine\" was important to the Beatles in another way, though, in that it was the first Beatles original to be based entirely around a guitar riff, and this was if anything a more important departure from their earlier records than the feedback was. Up to this point, while the Beatles had used riffs in covers like \"Twist and Shout\", their originals had avoided them -- the rhythm guitar had tended to go for strummed chords, while the lead guitar was usually reserved for solos and interjections. Rather than sustaining a riff through the whole record, George Harrison would tend to play answer phrases to the vocal melody, somewhat in the same manner as a backing vocalist.</p>\n<p>This time, though, Lennon wrote an entire song around a riff -- one he had based on an R&B record from a few years earlier that he particularly loved, \"Watch Your Step\" by Bobby Parker:</p>\n<p>[Excerpt: Bobby Parker, \"Watch Your Step\"]</p>\n<p>Parker's record had, in turn, been inspired by two others -- the influence of Ray Charles' \"What'd I Say\" is very obvious, but Parker had based the riff on one that Dizzy Gillespie had used in \"Manteca\", a classic early Afro-Cuban jazz record from 1947:</p>\n<p>[Excerpt: Dizzy Gillespie, \"Manteca\"]</p>\n<p>Parker had played that riff on his guitar, varied it, and come up with what may be the most influential guitar riff of all time, one lifted not only by the Beatles (on both \"I Feel Fine\" and, in a modified form, \"Day Tripper\") but Led Zeppelin, Deep Purple, the Allman Brothers Band, and many, many others:</p>\n<p>[Excerpt: Bobby Parker, \"Watch Your Step\"]</p>\n<p>Lennon took that riff and based a new song around it -- and it's important to note here that \"I Feel Fine\" *is* a new song. Both songs share the same riff and twelve-bar blues structure, but Lennon's lyric and melody are totally different, and the record has a different feel. There's a blurry line between plagiarism and homage, and to my mind \"I Feel Fine\" stays on the right side of that line, although it's a difficult issue because the Beatles were so much more successful than the unknown Parker.</p>\n<p>Part of the reason \"I Feel Fine\" could be the Beatles' first single based around a riff was it was recorded on a four-track machine, EMI having finally upgraded their equipment, which meant that the Beatles could record the instrumental and vocal tracks separately. This allowed Lennon and Harrison to hold down the tricky riff in unison, something Lennon couldn't do while also singing the melody -- it's noticeable that when they performed this song live, Lennon usually strummed the chords on a semi-acoustic guitar rather than doubling the riff as he does on the record.</p>\n<p>It's also worth listening to what Ringo's doing on the drums on the track. One of the more annoying myths about the Beatles is the claim made by a lot of people that Starr was in some way not a good drummer. While there has been some pushback on this, even to the extent that there is now a contrarian counterconsensus that says he was the best drummer in the world at the time, the general public still thinks of him as having been not particularly good. One listen to the part Starr played on \"I Feel Fine\" -- or indeed a close listen to any of his drum parts -- should get rid of that idea. While George and John are basically duplicating Parker's riff, Ringo picks up on the Parker record's similarity to \"What'd I Say\" and plays essentially the same part that Ray Charles' drummer had:</p>\n<p>[Excerpt: The Beatles, \"I Feel Fine (isolated drum part)\"]</p>\n<p>There are copies of that posted on YouTube, and almost all of them have comments from people claiming that the drumming in question must be a session drummer, because Starr couldn't play that well. </p>\n<p>Several of the Beatles' singles for the next two years would feature a heavy guitar riff as their main instrumental hook. Indeed, it seems like late 1964 is a point where things start to change a little for the Beatles in how they conceptualise singles and albums. Up to this point, they seem to have just written every song as a potential single, then chosen the ones they thought of as the most commercial as singles and stuck the rest out as album tracks.</p>\n<p>But from autumn 1964 through early 1966 there seems, at least on Lennon's part, to be a divide in how he looked at songs. The songs he brought in that became singles were almost uniformly guitar-driven heavy rockers with a strong riff. Meanwhile, the songs recorded for albums were almost all based on strummed acoustic guitars, usually ballads or at most mid-tempo, and often with meditative lyrics. He clearly seems to have been thinking in terms of commercial singles and less commercial album tracks, even if he didn't quite articulate it that way. </p>\n<p>I specify Lennon here, because there doesn't seem to be a comparable split in McCartney's writing -- partly because McCartney didn't really start writing riff-based songs until Lennon dropped the idea in late 1966. McCartney instead seems to start expanding his palette of genres -- while Lennon seems to be in two modes for about an eighteen-month period, and not really to venture out of either the bluesy riff-rocker or the country-flavoured folk rock mode, McCartney starts becoming the stylistic magpie he would become in the later period of the group's career.</p>\n<p>The B-side to the single, \"She's a Woman\" is, like the A-side, blues-based, but here it's McCartney in Little Richard mode. The most interesting aspect to it, though, is the rhythm guitar part -- off-beat stabs which sound very much like the group continuing to try to incorporate ska into their work:</p>\n<p>[Excerpt: The Beatles, \"She's a Woman\"]</p>\n<p>The single went to number one, of course, as all the group's singles in this period did.</p>\n<p>Beatles For Sale, the album that came out of these sessions, is generally regarded as one of the group's weaker efforts, possibly because of the relatively large number of cover versions, but also because of its air of bleakness. From the autumnal cover photo to the laid-back acoustic feel of much of the album, to the depressing nature of Lennon's contributions to the songwriting -- \"No Reply\", \"I'm a Loser\", \"Baby's in Black\", and \"I Don't Want to Spoil the Party\" all being a far cry from \"I Feel Fine\" – it's not a fun album by any means. I've always had a soft spot for the album myself, but it's clearly the work of people who were very tired, depressed, and overworked.</p>\n<p>And they were working hard -- in the four months after the end of their American tour on the twentieth of September, they recorded most of Beatles For Sale and the accompanying single, played forty-eight gigs, made TV appearances on Shindig, Scene at 6:30, Thank Your Lucky Stars, Ready Steady Go, and Top of the Pops, radio appearances on Top Gear and Saturday Club, and sundry interviews. On top of that John also made an appearance on Peter Cook and Dudley Moore's show \"Not Only... But Also\", performing versions of some of his poetry with Moore and Norman Rossington, who had co-starred in A Hard Day's Night:</p>\n<p>[Excerpt: John Lennon, Dudley Moore and Norman Rossington, \"All Abord Speeching\"]</p>\n<p>They did get a month off from mid-January 1965 through mid-February, but then it was back to work on a new film and accompanying soundtrack album.</p>\n<p>The group's second film, Help!, is generally regarded with rather less fondness than A Hard Day's Night, and it's certainly the case that some aspects of the film have not dated at all well -- in particular the way that several characters are played by white actors in brownface doing very unconvincing Indian accents, and the less than respectful attitude to Hindu religious beliefs, are things which will make any modern viewer with the slightest sensitivity to such issues cringe terribly. </p>\n<p>But those aren't the aspects of the film which most of its critics pick up on -- rather they tend to focus only on the things that the Beatles themselves criticise about the film, mostly that the group spent most of the filming stoned out of their minds, and the performances are thus a lot less focused than those in A Hard Day's Night, and also that the script -- written this time by Richard Lester's regular collaborator Charles Wood, from a story by Marc Behm, rather than by Alun Owen -- is also a little unfocused.</p>\n<p>All these are fair criticisms as far as they go, but it's also the case that Help! is not a film that is best done justice by being viewed on a small screen on one's own, as most of its critics have viewed it most of the time. Help! is part of a whole subgenre of films which were popular in the 1960s but largely aren't made today -- the loose, chaotic, adventure comedy in which a nominal plot is just an excuse for a series of comedy sketches strung together with spectacular visuals. The genre encompasses everything from It's a Mad Mad Mad Mad World to Casino Royale to The Pink Panther, and all of these films are meant to be seen on a big screen which allows the audience to appreciate their visual inventiveness, and in a communal audience which is laughing along with them.</p>\n<p>And when seen in that light, Help! is actually a remarkably entertaining example of the type. Yes, it doesn't hold together as well as A Hard Day's Night, and it doesn't resolve so much as just stop, but structurally it's remarkably close to the films of the Marx Brothers, especially their Paramount films, and it's odd that the Marx comparisons get made about A Hard Day's Night, a slice-of-life film inspired by the French New Wave, and not about the screwball comedy that ends in a confused chase sequence.</p>\n<p>There is one thing that is worth noting about Help! that is often obscured -- part of the reason for its globetrotting nature was because of the levels of taxation in Britain at the time. For top earners, like the Beatles were, the marginal rate of income tax was as high as ninety-five percent in the mid-sixties. Many of us would think this was a reasonable rate for people who were earning many, many times in a year what most people would earn in a lifetime, but it's also worth noting that the Beatles'  success had so far lasted only two years, and that a pop act who was successful for five years was remarkably long-lived -- in the British pop industry only Cliff Richard and the Shadows had had a successful career as chart artists for longer than that, and even they were doing much less well in 1965 than they had been in 1963. In retrospect, of course, we know that the Beatles would continue to sell millions of records a year for more than sixty years, but that was not something any of them could possibly have imagined at the time, and we're still in a period where Paul McCartney could talk about going into writing musicals once the Beatles fad passed, and Ringo could still imagine himself as the owner of a hairdresser's.</p>\n<p>So it's not completely unreasonable of them to want to keep as much of their money as they could, while they could, and so while McCartney will always talk in interviews about how many of the scenes in the film were inspired by a wishlist from the group -- \"We've never been skiing\", \"We've never been to the Bahamas\" -- and there might even be some truth to that, it's also the case that the Bahamas were as known for their lax tax regime as for their undoubted charm as a tourist destination, and these journeys were not solely about giving the group a chance to have fun.</p>\n<p>But of course, before making the film itself, the group had to record songs for its soundtrack, and so on February the sixteenth they went into the studio to record four songs, including the next single, \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>While \"Ticket to Ride\" is mostly -- or possibly solely -- John's song, the record is very much Paul's record. For most of 1964, McCartney hadn't really been pulling his weight in the songwriting department when compared to John -- the handful of songs he had written had included some exceptional ones, but for the most part he hadn't written much, and John had been the more productive member of their partnership, writing almost all of the A Hard Day's Night album, most of the better tracks on Beatles For Sale, and the non-album single \"I Feel Fine\". </p>\n<p>But now, John was sinking into one of his periodic bouts of depression -- he was still writing strong material, and would produce some of the best songs of his career in 1965, but he was unfocused and unhappy, and it was showing in his slowed productivity -- while McCartney was energised by living in London, the cultural capital of the world at that point in time, and having a famous girlfriend who was exposing him to vast areas of culture he had never been aware of before. </p>\n<p>I say that \"Ticket to Ride\" is written by John, but there is some slight dispute about who contributed what to the writing. John's statement was that the song was all him, and that Paul's main contribution was the drum pattern that Ringo plays. Paul, on the other hand, claims that the song is about a sixty-forty split, with John being the sixty. McCartney's evidence for that is the strong vocal harmony he sings -- usually, if there's a two-part harmony like that on a Beatles song, it came about because Lennon and McCartney were in the same room together while writing it, and singing the part together as they were writing. He also talks about how when writing it they were discussing Ryde in the Isle of Wight, where McCartney's cousin ran a pub.</p>\n<p>I can certainly see it being the case that McCartney co-wrote the song, but I can also easily see the musicianly McCartney feeling the need to harmonise what would otherwise have been a monotonous melody, and adding the harmonies during the recording stage. </p>\n<p>Either way, though, the song is primarily John's in the writing, but the arrangement is primarily McCartney's work -- and while Lennon would later claim that McCartney would always pay less attention to Lennon's songs than to McCartney's own, in this middle period of the group's career most of their truly astounding work comes when  Lennon brings in the song but McCartney experiments with the arrangement and production. Over and over again we see McCartney taking control of a Lennon song in the studio and bringing out aspects of it that its composer either had not considered or had not had the musical vocabulary or patience to realise on his own.</p>\n<p>Indeed one can see this as part of the dynamic that eventually led to the group breaking up. Lennon would bring in a half-formed idea and have the whole group work on it, especially McCartney, and turn it into the best version of itself it could be, but this would then seem like McCartney trying to take over. McCartney, meanwhile, with his greater musical facility, would increasingly not bother asking for the input of the group's other members, even when that input would have turned a mediocre song into a good one or a good one into a great one. </p>\n<p>But at this point in their careers, at least, the collaboration brought out the best in both Lennon and McCartney -- though one must wonder what Harrison and Starr felt about having their parts dictated to them or simply replaced. In the case of \"Ticket to Ride\", one can trace the evolution of McCartney's drum pattern idea over a period of a few months. He was clearly fascinated by Hal Blaine's drum intro to \"Be My Baby\":</p>\n<p>[Excerpt: The Ronettes, \"Be My Baby\"]</p>\n<p>and came up with a variation of it for his own song \"What You're Doing\", possibly the most interesting song on Beatles For Sale on a pure production level, the guitar part for which, owing a lot to the Searchers, is also clearly a pointer to the sound on “Ticket to Ride”:</p>\n<p>[Excerpt: The Beatles, \"What You're Doing\"]</p>\n<p>\"Ticket to Ride\"s drum part is a more complex variation on that slightly broken pattern, as you can hear if you listen to the isolated drum part:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride (isolated drums)\"]</p>\n<p>Interestingly, Ringo doesn't keep that precise pattern up all the way through in the studio recording of the song, though he does in subsequent live versions. Instead, from the third verse onwards he shifts to a more straightforward backbeat of the kind he would more normally play:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride (isolated drums)\"]</p>\n<p>The mono mix of \"Ticket to Ride\", which is how most listeners of the time encountered it, shows much more than the stereo mix just what the group, and particularly Paul, were trying to do.  It's a bass-heavy track, sluggish and thundering. It's also a song that sounds *obsessed*. For the first six bars of the verse, and the whole intro, the song stays on a single chord, A, only changing on the word \"away\", right before the chorus:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>This obsession with one chord was possibly inspired by soul music, and in particular by \"Dancing in the Street\", which similarly stays on one chord for a long time:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Dancing in the Street\"]</p>\n<p>We'll be looking more at how soul music was increasingly doing away with chord progressions in favour of keeping to an extended groove on a single chord when we next look at James Brown in a few weeks' time. But in its single-chord focus and its broken drum beat, \"Ticket to Ride\" is very much a precursor of what the group would do a little over a year later, when they recorded \"Tomorrow Never Knows\".</p>\n<p>Of course, it was also around this time that the group discovered Indian music for the first time. There are scenes in the film Help! which feature musicians playing Indian instruments, and George Harrison became fascinated by the sound of the sitar and bought one, and we'll be seeing the repercussions of that for much of the next year. But it's interesting to note that a lot of the elements that make Indian classical music so distinctive to ears used to Western popular music -- the lack of harmonic movement, the modal melodies, the use of percussion not to keep a steady beat but in melodic interplay with the string instruments -- were all already present in songs like \"Ticket to Ride\", albeit far less obviously and in a way that still fit very much into pop song conventions. The Beatles grew immensely as musicians from their exposure to Indian music, but it's also the case that Indian music appealed to them precisely because it was an extension of the tastes they already had.</p>\n<p>Unlike when recording Beatles For Sale, the group clearly had enough original material to fill out an album, even if they ended up not doing so and including two mediocre cover versions on the album -- the last time that would happen during the group's time together. The B-sides of the two singles, John's \"Yes It Is\" and Paul's \"I'm Down\", both remained only available on the singles, even though the previous film soundtrack had included the B-sides of both its singles. Not only that, but they recorded two Lennon/McCartney songs that would remain unreleased until more than thirty years later. \"If You've Got Troubles\" was left unreleased for good reason -- a song written for Ringo to sing, it's probably the single worst Lennon/McCartney song ever attempted by the group, with little or nothing to redeem it.</p>\n<p>McCartney's \"That Means a Lot\" is more interesting. It's clearly an attempt by McCartney to write a \"Ticket to Ride\" part two, with a similar riff and feel:</p>\n<p>[Excerpt: The Beatles, \"That Means a Lot\"]</p>\n<p>It even has a sped-up repurposing of the hook line at the end, just as \"Ticket to Ride\" does, with \"Can't you see?\" taking the place of \"My baby don't care\":</p>\n<p>[Excerpt: The Beatles, \"That Means a Lot\"]</p>\n<p>The group spent a couple of sessions on that track, but seem to have given up on it. While it's far from the best thing they did, it's not worthless or unreleasable, and one suspects that they ended up thinking that the track couldn't go on the same album as \"Ticket to Ride\" because the two songs were just too close. Instead, they ended up giving the song to P.J. Proby, the American singer who had been brought over by Jack Good for the About The Beatles show, and who had built something of a career for himself in the UK with a string of minor hits. Lennon said \"we found we just couldn't sing it. In fact, we made a hash of it, so we thought we'd better give it to someone who could do it well\". And Proby *could* have done it well -- but whether he did or not is something you can judge for yourself:</p>\n<p>[Excerpt: P.J. Proby, \"That Means a Lot\"]</p>\n<p>Somehow, Proby's version of the song made the top thirty.</p>\n<p>When the group started filming \"Help!\", the film was still going under the working title \"Eight Arms to Hold You\", which absolutely nobody involved liked -- the title was even included on the label of some copies of \"Ticket to Ride\", but Lennon and McCartney particularly disliked the idea of writing a song to that title. Some have suggested that the plan was to use McCartney's \"Eight Days a Week\", an album track from Beatles For Sale that had been released as an American single, as a title track, but it seems unlikely that anyone would have considered that -- United Artists wanted something they could put out on a soundtrack album, and the song had already been out for many months.</p>\n<p>Instead, at almost the last minute, it was decided to name the film \"Help!\". This was actually close to the very first working title for the film, which had been \"Help, Help\". According to Lester, \"the lawyer said it had already been registered and you mustn’t use it so we had Beatles Two and then Eight Arms to Hold You\". The only film I've been able to discover with the title \"Help, Help\", though, is a silent film from 1912, which I don't imagine would have caused much problem in this case. </p>\n<p>However, after the group insisted that they couldn't possibly write a song called \"Eight Arms to Hold You\", Lester realised that if he put an exclamation mark after the word \"help\", that turned it into a different title. After getting legal approval he announced that the title of the new film was going to be \"Help!\", and that same day John came up with a song to that title:</p>\n<p>[Excerpt: The Beatles, \"Help!\"]</p>\n<p>Lennon later said that the song had started out as a slow, intense, ballad, and he had been persuaded to speed it up in the studio somewhat against his will. The song being performed as an upbeat pop song possibly made it harder for the public to see what was obvious to Lennon himself, that the song itself was a cry for help from someone going through a mental health crisis. Despite the title not being his, the sentiments certainly were, and for the first time there was barely even the fig-leaf of romantic love to disguise this. The song's lyrics certainly could be interpreted as being the singer wanting help from a romantic partner, but they don't actually specify this, which is not something that could be said about any of the group's other originals up to this point.</p>\n<p>The soundtrack album for Help! is also notable in other ways. George Harrison writes two songs on the album, when he'd only written one in total for the first four albums. From this point on he would be a major songwriting presence in the group. It also contains the most obvious Dylan homage yet, with Lennon impersonating Dylan's vocal style on \"You've Got to Hide Your Love Away\", recorded three days after \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"You've Got to Hide Your Love Away\"] </p>\n<p>\"You've Got to Hide Your Love Away\" was notable in another way as well -- it was the first time that a musician other than the Beatles or George Martin was called in to work on a Beatles record (other than Andy White on the \"Love Me Do\" session, which was not something the Beatles chose or approved of). The flute player Johnny Scott overdubbed two tracks of flute at the end of the recording:</p>\n<p>[Excerpt: The Beatles, \"You've Got to Hide Your Love Away\"]</p>\n<p>That was a sign of things to come, because in June, once filming had completed, the group went into the studio to continue recording for the non-soundtrack side of the soundtrack album. This was the height of the group's success and embrace by the establishment -- two days earlier it had been announced that they were all to be awarded MBEs -- and it's also the point at which McCartney's new creative growth as a songwriter really became apparent. They recorded three songs on the same day -- his Little Richard soundalike \"I'm Down\", which ended up being used as the B-side for \"Help!\", an acoustic country song called \"I've Just Seen a Face\", and finally a song whose melody had come to him in a dream many months earlier.</p>\n<p>McCartney had been so impressed by the melody he'd dreamed that he'd been unable to believe it was original to him, and had spent a long time playing it to other people to see if they recognised it. When they didn't, he eventually changed the lyrics from his original jokey \"Scrambled eggs/Oh my baby how I love your legs\" to something more appropriate, and titled it \"Yesterday\":</p>\n<p>[Excerpt: The Beatles, \"Yesterday (Anthology 2 early take)\"]</p>\n<p>\"Yesterday\" was released as a Beatles track, on a Beatles album, but it had absolutely no involvement from John, George, and Ringo -- nobody could figure out how to adapt the song to a guitars/bass/drums format. Instead George Martin scored it for a string quartet, with some assistance from McCartney who, worried that strings would end up meaning something Mantovani-like, insisted that the score be kept as simple as possible, and played with almost no vibrato. The result was a Beatles track that featured five people, but only one Beatle:</p>\n<p>[Excerpt: The Beatles, \"Yesterday\"]</p>\n<p>The group's next album would see all the band members appearing on every track, and no musicians brought in from outside the group and their organisation, but the genie was now out of the bottle -- the label \"The Beatles\" on a record no longer meant that it featured John, Paul, George, and Ringo, but just that at least one of them was on the track and the others had agreed it could go out under their name. This would lead to immense changes in the way the group worked, and we'll be seeing how that played out throughout the rest of the 1960s.</p>",
  "itunes:subtitle": "This week’s episode looks at Ticket to Ride, the making of the Beatles second film, and the influence of Bob Dylan on the Beatles work and lives. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon",
  "itunes:keywords": "Bob Dylan,Bobby Parker,cannabis,Dudley Moore,feedback,George Harrison,George Martin,Jimmy Nicol,John Lennon,Mal Evans,Norman Rossington,P.J. Proby,Paul McCartney,Peter Cook,Richard Lester,Ringo Starr,The Beatles",
  "itunes:episodeType": "full",
  "itunes:episode": 127,
  "content:encoded": "<p>This week’s episode looks at \"Ticket to Ride\", the making of the Beatles' second film, and the influence of Bob Dylan on the Beatles' work and lives. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, o<a href=\"https://www.patreon.com/posts/53645310\">n \"The Game of Love\" by Wayne Fontana and the Mindbenders</a>.</p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>No Mixcloud this week, as there are too many songs by the Beatles.</p>\n<p>I have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>, <a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>, <a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles </em>by Steve Lambley</a>, <a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>, <a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and <a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a></p>\n<p>For material on the making of the film, I referred to <em><a href=\"https://amzn.to/3tXKWpv\">Getting Away With It</a></em><a href=\"https://amzn.to/3tXKWpv\"> by Steven Soderbergh</a>, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.</p>\n<p>Sadly the only way to legally get the original mix of \"Ticket to Ride\" is <a href=\"https://amzn.to/2U0tGmS\">this ludicrously-expensive out-of-print box set,</a> but the 1987 remix is widely available on <a href=\"https://amzn.to/3AUrEoZ\">the CD issue of the <em>Help! </em>soundtrack</a>. The film is <a href=\"https://amzn.to/2TY92np\">available on DVD</a>.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>When we last looked at the Beatles, they had just achieved their American success, and had appeared in their first film, A Hard Day's Night. Today, we're going to look at the massive artistic growth that happened to them between late 1964 and mid 1965, the making of their second film, Help!, the influence, both artistic and personal, of Bob Dylan on the group, and their introduction both to studio experimentation and to cannabis. We're going to look at \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>1964 was a tremendously busy year for the Beatles. After they'd finished making A Hard Day's Night, but even before it was released, they had gone on yet another tour, playing Denmark, the Netherlands, Hong Kong, Australia, and New Zealand, though without Ringo for much of the tour -- Ringo had to have his tonsils removed, and so for the first eight shows of the tour he was replaced by session drummer Jimmy Nicol, the former drummer with Colin Hicks and his Cabin Boys, who had played on several cheap soundalike records of Beatles songs. Nicol was a competent drummer, though very different in style from Ringo, and he found his temporary moment of celebrity hugely upsetting -- he later described it as the worst thing to ever happen to him, and ended up declaring bankruptcy only nine months after touring with the group. Nicol is now a recluse, and hasn't spoken to anyone about his time with the Beatles in more than thirty years.</p>\n<p>After Ringo returned to the group and the film came out they went back into the studio, only two months after the release of their third album, to start work on their fourth. They recorded four songs in two sessions before departing on their first full US tour. Those songs included two cover versions -- a version of \"Mr. Moonlight\" by Doctor Feelgood and the Interns that appeared on the album, and a version of Little Willie John's \"Leave My Kitten Alone\" that didn't see release until 1995 -- and two originals written mostly or entirely by John Lennon, \"Baby's In Black\", and \"I'm a Loser\":</p>\n<p>[Excerpt: The Beatles, \"I'm a Loser\"]</p>\n<p>\"I'm a Loser\" was an early sign of an influence that had particularly changed Lennon's attitude to songwriting -- that of Bob Dylan. Dylan had been on the group's radar for some time -- Paul McCartney in the Anthology book seems to have a confused memory of seeing Madhouse on Castle Street, the TV play Dylan had appeared in in January 1963 -- but early 1964 had seen him rise in prominence to the point that he was a major star, not just an obscure folk singer. And Lennon had paid particular attention to what he was doing with his lyrics.</p>\n<p>We've already seen that Lennon had been writing surreal poetry for years, but at this point in his life he still thought of his songwriting and his poetry as separate. As he would later put it \"I had a sort of professional songwriter's attitude to writing pop songs; we would turn out a certain style of song for a single, and we would do a certain style of thing for this and the other thing. I'd have a separate songwriting John Lennon who wrote songs for the meat market, and I didn't consider them (the lyrics or anything) to have any depth at all.\"</p>\n<p>This shouldn't be taken as Lennon saying that the early Beatles songs were lacking in quality, or that he didn't take the work seriously, but that it wasn't about self-expression. He was trying to do the best work he could as a craftsman. Listening to Dylan had showed him that it was possible instead to treat pop songwriting as art, in the sense Lennon understood the term -- as a means of personal expression that could also allow for experimentation and playing games.</p>\n<p>\"I'm a Loser\" is a first tentative step towards that, with Lennon for one of the first times consciously writing about his own emotions -- though careful to wrap those feelings both in a conventional love song structure and in a thick layer of distancing irony, to avoid making himself vulnerable -- and the stylistic influence of Dylan is very noticeable, as much in the instrumentation as in the lyrics. While several early Beatles singles had featured Lennon playing harmonica, he had been playing a chromatic harmonica, a type of harmonica that's mostly used for playing single-note melodies, because it allows the player to access every single note, but which is not very good for bending notes or playing chords. If you've heard someone playing the harmonica as a single-note melody instrument with few or no chords, whether Stevie Wonder, Larry Adler, or Max Geldray, the chances are they were playing a chromatic harmonica.</p>\n<p>On \"I'm a Loser\", though, Lennon plays a diatonic harmonica -- an instrument that he would refer to as a \"harp\" rather than a harmonica, because he associated it with the blues, where it's often referred to as a harp. Diatonic harmonicas are the instrument of choice for blues players because they allow more note-bending, and it's easier to play a full chord on them -- the downside, that you have a smaller selection of notes available, is less important in the blues, which tends towards harmonic minimalism. Diatonic harmonicas are the ones you're likely to hear on country, blues, and folk recordings -- they're the instrument played by people like Little Walter, Sonny Boy Williamson, Charlie McCoy, and Bob Dylan.</p>\n<p>Lennon had played a diatonic before, on \"I Should Have Known Better\", another song which shows Dylan's influence in the performance, though not in the lyrics. In both cases he is imitating Dylan's style, which tends to be full of chordal phrases rather than single-note melody.</p>\n<p>What's interesting about “I'm a Loser” though is contrasting John's harmonica solo with George's guitar solo which follows immediately after:</p>\n<p>[Excerpt: The Beatles, \"I'm a Loser\"]</p>\n<p>That's a pure Carl Perkins solo, and the group would, in their choices of cover versions for the next few months, move away somewhat from the soul and girl-group influences that dominated the covers on their first two albums, and towards country and rockabilly -- they would still cover Larry Williams, Little Richard, and Chuck Berry, but there were no more covers of contemporary Black artists, and instead there were cover versions of Buddy Holly, Carl Perkins, and Buck Owens, and Harrison switched from the Rickenbacker that had been his main instrument on A Hard Day's Night to playing a Gretsch -- the brand of guitar that Chet Atkins and Eddie Cochrane played. </p>\n<p>The consensus among commentators -- with which, for once, I agree -- seems to be that this was also because of the influence of Dylan. The argument is that the Beatles heard Dylan's music as a form of country music, and it inspired them to go back to their other country-oriented influences. And this makes a lot of sense -- it was only fifteen years earlier, at the same time as they replaced \"race\" with \"rhythm and blues\", that Billboard magazine chose to rename their folk chart to the country and western chart -- as Tyler Mahan Coe puts it, \"after years of trying to figure out what to call their “poor Black people music” and “poor white people music” charts\". And Dylan had been as influenced by Hank Williams as by Woody Guthrie.</p>\n<p>In short what the Beatles, especially Lennon, heard in Dylan seems to have been three things -- a reminder of the rockabilly and skiffle influences that had been their first love before they'd discovered R&B and soul, permission to write honestly about one's own experiences, and an acknowledgement that such writing could include surrealistic wordplay. Fundamentally, Dylan, as much as being a direct influence, seems to have given the group a kind of permission -- to have shown them that there was room in the commercial sphere in which they were now operating for them to venture into musical and lyrical areas that had always appealed to them.</p>\n<p>But of course, that was not the only influence that Dylan had on the group, as anyone who has ever read anything at all about their first full US tour knows. That tour saw them playing huge venues like the Hollywood Bowl -- a show which later made up a big part of their only official live album, which was finally released in 1977:</p>\n<p>[Excerpt: The Beatles, \"Things We Said Today (live at the Hollywood Bowl 1964)\"]</p>\n<p>It was nine days into the tour, on the twenty-eighth of August 1964, that they met Bob Dylan for the first time.</p>\n<p>The meeting with Dylan is usually called the first time the Beatles ever smoked cannabis -- and that's true, at least if you're talking about them as a group. Lennon had tried it around 1960, and both Lennon and Harrison had tried it at a show at the Southport Floral Hall in early 1962, but neither had properly understood what they were smoking, and had both already been drunk before smoking it. According to a later interview with Harrison, that had led to the two of them madly dancing the Twist in their dressing room, shouting \"This stuff isn't doing anything!\"</p>\n<p>But it was at this meeting that Paul and Ringo first smoked it, and it also seems to have been taken by Lennon and Harrison as their \"real\" first time, possibly partly because being introduced to cannabis by Bob Dylan in a New York hotel sounds a lot cooler than being introduced to it by your support band's drummer in Southport, possibly because it was the first time that they had all smoked it together as a group, but mostly because this was the time when it became a regular part of the group's life.</p>\n<p>Oddly, it happened because of a misheard lyric. Dylan had loved \"I Want to Hold Your Hand\", and had misheard \"I can't hide\" as \"I get high\", and thus just assumed that the British band were already familiar with cannabis.</p>\n<p>The drug had a profound effect on them -- McCartney later recalled being convinced he had discovered the meaning of life, writing it down on a bit of paper, and getting their roadie Mal Evans to hold the paper for safekeeping. The next morning, when he looked at the paper, he found it merely said \"there are seven levels\". Lennon, on the other hand, mostly remembered Dylan playing them his latest demos and telling them to listen to the words, but Lennon characteristically being unable to concentrate on the lyrics because in his stoned state he was overwhelmed by the rhythm and general sound of the music.</p>\n<p>From this point on, the use of cannabis became a major part of the group's life, and it would soon have a profound effect on their lifestyles, their songwriting, the production on their records, and every other aspect of their career.</p>\n<p>The Beatle on whom it seems to have had the strongest and most immediate effect was Lennon, possibly because he was the one who was coping least well with success and most needed something to take his mind off things. Lennon had always been susceptible to extremes of mood -- it's likely that he would these days be diagnosed as bipolar, and we've already seen how as soon as he'd started writing personally, he'd written \"I'm a Loser\". He was feeling trapped in suburbia, unsuited for his role as a husband and father, unhappy about his weight, and just generally miserable. Cannabis seemed, at least at first, to offer a temporary escape from that. All the group spent much of the next couple of years stoned, but Lennon probably more than any of them, and he was the one whose writing it seemed to affect most profoundly.</p>\n<p>On the group's return from the US, they carried on working on the next album, and on a non-album single designed to be released simultaneously with it.</p>\n<p>\"I Feel Fine\" is a major milestone in the group's career in a number of ways. The most obvious is the opening -- a brief bit of feedback which Lennon would always later claim to be the first deliberate use of the technique on a record:</p>\n<p>[Excerpt: The Beatles, \"I Feel Fine\"]</p>\n<p>Feedback had, up until this point, been something that musicians generally tried to avoid -- an unwanted sound that could wreck a performance. But among guitarists in London, especially, it was becoming the fashionable sound to incorporate, in a carefully controlled manner, in order to make sounds that nobody had heard before. Jeff Beck, Dave Davies, and Pete Townshend would all argue about which of them was the first to use the technique, but all were using it on stage by the time the Beatles recorded \"I Feel Fine\".</p>\n<p>But the Beatles were, if not the first to deliberately use feedback on a record (as I've said in the past, there is no such thing as a first anything, and there are debatable examples where feedback may be deliberate going back to the 1930s and some records by Bob Wills), certainly the most prominent artists to do so up to that point, and also the first to make it a major, prominent feature of a hit record in this manner. If they hadn't done it, someone else undoubtedly would, but they were the first to capture the sound that was becoming so popular in the London clubs, and as so often in their career they were able to capture something that was at the cutting edge of the underground culture and turn it into something that would be accepted by millions.</p>\n<p>\"I Feel Fine\" was important to the Beatles in another way, though, in that it was the first Beatles original to be based entirely around a guitar riff, and this was if anything a more important departure from their earlier records than the feedback was. Up to this point, while the Beatles had used riffs in covers like \"Twist and Shout\", their originals had avoided them -- the rhythm guitar had tended to go for strummed chords, while the lead guitar was usually reserved for solos and interjections. Rather than sustaining a riff through the whole record, George Harrison would tend to play answer phrases to the vocal melody, somewhat in the same manner as a backing vocalist.</p>\n<p>This time, though, Lennon wrote an entire song around a riff -- one he had based on an R&B record from a few years earlier that he particularly loved, \"Watch Your Step\" by Bobby Parker:</p>\n<p>[Excerpt: Bobby Parker, \"Watch Your Step\"]</p>\n<p>Parker's record had, in turn, been inspired by two others -- the influence of Ray Charles' \"What'd I Say\" is very obvious, but Parker had based the riff on one that Dizzy Gillespie had used in \"Manteca\", a classic early Afro-Cuban jazz record from 1947:</p>\n<p>[Excerpt: Dizzy Gillespie, \"Manteca\"]</p>\n<p>Parker had played that riff on his guitar, varied it, and come up with what may be the most influential guitar riff of all time, one lifted not only by the Beatles (on both \"I Feel Fine\" and, in a modified form, \"Day Tripper\") but Led Zeppelin, Deep Purple, the Allman Brothers Band, and many, many others:</p>\n<p>[Excerpt: Bobby Parker, \"Watch Your Step\"]</p>\n<p>Lennon took that riff and based a new song around it -- and it's important to note here that \"I Feel Fine\" *is* a new song. Both songs share the same riff and twelve-bar blues structure, but Lennon's lyric and melody are totally different, and the record has a different feel. There's a blurry line between plagiarism and homage, and to my mind \"I Feel Fine\" stays on the right side of that line, although it's a difficult issue because the Beatles were so much more successful than the unknown Parker.</p>\n<p>Part of the reason \"I Feel Fine\" could be the Beatles' first single based around a riff was it was recorded on a four-track machine, EMI having finally upgraded their equipment, which meant that the Beatles could record the instrumental and vocal tracks separately. This allowed Lennon and Harrison to hold down the tricky riff in unison, something Lennon couldn't do while also singing the melody -- it's noticeable that when they performed this song live, Lennon usually strummed the chords on a semi-acoustic guitar rather than doubling the riff as he does on the record.</p>\n<p>It's also worth listening to what Ringo's doing on the drums on the track. One of the more annoying myths about the Beatles is the claim made by a lot of people that Starr was in some way not a good drummer. While there has been some pushback on this, even to the extent that there is now a contrarian counterconsensus that says he was the best drummer in the world at the time, the general public still thinks of him as having been not particularly good. One listen to the part Starr played on \"I Feel Fine\" -- or indeed a close listen to any of his drum parts -- should get rid of that idea. While George and John are basically duplicating Parker's riff, Ringo picks up on the Parker record's similarity to \"What'd I Say\" and plays essentially the same part that Ray Charles' drummer had:</p>\n<p>[Excerpt: The Beatles, \"I Feel Fine (isolated drum part)\"]</p>\n<p>There are copies of that posted on YouTube, and almost all of them have comments from people claiming that the drumming in question must be a session drummer, because Starr couldn't play that well. </p>\n<p>Several of the Beatles' singles for the next two years would feature a heavy guitar riff as their main instrumental hook. Indeed, it seems like late 1964 is a point where things start to change a little for the Beatles in how they conceptualise singles and albums. Up to this point, they seem to have just written every song as a potential single, then chosen the ones they thought of as the most commercial as singles and stuck the rest out as album tracks.</p>\n<p>But from autumn 1964 through early 1966 there seems, at least on Lennon's part, to be a divide in how he looked at songs. The songs he brought in that became singles were almost uniformly guitar-driven heavy rockers with a strong riff. Meanwhile, the songs recorded for albums were almost all based on strummed acoustic guitars, usually ballads or at most mid-tempo, and often with meditative lyrics. He clearly seems to have been thinking in terms of commercial singles and less commercial album tracks, even if he didn't quite articulate it that way. </p>\n<p>I specify Lennon here, because there doesn't seem to be a comparable split in McCartney's writing -- partly because McCartney didn't really start writing riff-based songs until Lennon dropped the idea in late 1966. McCartney instead seems to start expanding his palette of genres -- while Lennon seems to be in two modes for about an eighteen-month period, and not really to venture out of either the bluesy riff-rocker or the country-flavoured folk rock mode, McCartney starts becoming the stylistic magpie he would become in the later period of the group's career.</p>\n<p>The B-side to the single, \"She's a Woman\" is, like the A-side, blues-based, but here it's McCartney in Little Richard mode. The most interesting aspect to it, though, is the rhythm guitar part -- off-beat stabs which sound very much like the group continuing to try to incorporate ska into their work:</p>\n<p>[Excerpt: The Beatles, \"She's a Woman\"]</p>\n<p>The single went to number one, of course, as all the group's singles in this period did.</p>\n<p>Beatles For Sale, the album that came out of these sessions, is generally regarded as one of the group's weaker efforts, possibly because of the relatively large number of cover versions, but also because of its air of bleakness. From the autumnal cover photo to the laid-back acoustic feel of much of the album, to the depressing nature of Lennon's contributions to the songwriting -- \"No Reply\", \"I'm a Loser\", \"Baby's in Black\", and \"I Don't Want to Spoil the Party\" all being a far cry from \"I Feel Fine\" – it's not a fun album by any means. I've always had a soft spot for the album myself, but it's clearly the work of people who were very tired, depressed, and overworked.</p>\n<p>And they were working hard -- in the four months after the end of their American tour on the twentieth of September, they recorded most of Beatles For Sale and the accompanying single, played forty-eight gigs, made TV appearances on Shindig, Scene at 6:30, Thank Your Lucky Stars, Ready Steady Go, and Top of the Pops, radio appearances on Top Gear and Saturday Club, and sundry interviews. On top of that John also made an appearance on Peter Cook and Dudley Moore's show \"Not Only... But Also\", performing versions of some of his poetry with Moore and Norman Rossington, who had co-starred in A Hard Day's Night:</p>\n<p>[Excerpt: John Lennon, Dudley Moore and Norman Rossington, \"All Abord Speeching\"]</p>\n<p>They did get a month off from mid-January 1965 through mid-February, but then it was back to work on a new film and accompanying soundtrack album.</p>\n<p>The group's second film, Help!, is generally regarded with rather less fondness than A Hard Day's Night, and it's certainly the case that some aspects of the film have not dated at all well -- in particular the way that several characters are played by white actors in brownface doing very unconvincing Indian accents, and the less than respectful attitude to Hindu religious beliefs, are things which will make any modern viewer with the slightest sensitivity to such issues cringe terribly. </p>\n<p>But those aren't the aspects of the film which most of its critics pick up on -- rather they tend to focus only on the things that the Beatles themselves criticise about the film, mostly that the group spent most of the filming stoned out of their minds, and the performances are thus a lot less focused than those in A Hard Day's Night, and also that the script -- written this time by Richard Lester's regular collaborator Charles Wood, from a story by Marc Behm, rather than by Alun Owen -- is also a little unfocused.</p>\n<p>All these are fair criticisms as far as they go, but it's also the case that Help! is not a film that is best done justice by being viewed on a small screen on one's own, as most of its critics have viewed it most of the time. Help! is part of a whole subgenre of films which were popular in the 1960s but largely aren't made today -- the loose, chaotic, adventure comedy in which a nominal plot is just an excuse for a series of comedy sketches strung together with spectacular visuals. The genre encompasses everything from It's a Mad Mad Mad Mad World to Casino Royale to The Pink Panther, and all of these films are meant to be seen on a big screen which allows the audience to appreciate their visual inventiveness, and in a communal audience which is laughing along with them.</p>\n<p>And when seen in that light, Help! is actually a remarkably entertaining example of the type. Yes, it doesn't hold together as well as A Hard Day's Night, and it doesn't resolve so much as just stop, but structurally it's remarkably close to the films of the Marx Brothers, especially their Paramount films, and it's odd that the Marx comparisons get made about A Hard Day's Night, a slice-of-life film inspired by the French New Wave, and not about the screwball comedy that ends in a confused chase sequence.</p>\n<p>There is one thing that is worth noting about Help! that is often obscured -- part of the reason for its globetrotting nature was because of the levels of taxation in Britain at the time. For top earners, like the Beatles were, the marginal rate of income tax was as high as ninety-five percent in the mid-sixties. Many of us would think this was a reasonable rate for people who were earning many, many times in a year what most people would earn in a lifetime, but it's also worth noting that the Beatles'  success had so far lasted only two years, and that a pop act who was successful for five years was remarkably long-lived -- in the British pop industry only Cliff Richard and the Shadows had had a successful career as chart artists for longer than that, and even they were doing much less well in 1965 than they had been in 1963. In retrospect, of course, we know that the Beatles would continue to sell millions of records a year for more than sixty years, but that was not something any of them could possibly have imagined at the time, and we're still in a period where Paul McCartney could talk about going into writing musicals once the Beatles fad passed, and Ringo could still imagine himself as the owner of a hairdresser's.</p>\n<p>So it's not completely unreasonable of them to want to keep as much of their money as they could, while they could, and so while McCartney will always talk in interviews about how many of the scenes in the film were inspired by a wishlist from the group -- \"We've never been skiing\", \"We've never been to the Bahamas\" -- and there might even be some truth to that, it's also the case that the Bahamas were as known for their lax tax regime as for their undoubted charm as a tourist destination, and these journeys were not solely about giving the group a chance to have fun.</p>\n<p>But of course, before making the film itself, the group had to record songs for its soundtrack, and so on February the sixteenth they went into the studio to record four songs, including the next single, \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>While \"Ticket to Ride\" is mostly -- or possibly solely -- John's song, the record is very much Paul's record. For most of 1964, McCartney hadn't really been pulling his weight in the songwriting department when compared to John -- the handful of songs he had written had included some exceptional ones, but for the most part he hadn't written much, and John had been the more productive member of their partnership, writing almost all of the A Hard Day's Night album, most of the better tracks on Beatles For Sale, and the non-album single \"I Feel Fine\". </p>\n<p>But now, John was sinking into one of his periodic bouts of depression -- he was still writing strong material, and would produce some of the best songs of his career in 1965, but he was unfocused and unhappy, and it was showing in his slowed productivity -- while McCartney was energised by living in London, the cultural capital of the world at that point in time, and having a famous girlfriend who was exposing him to vast areas of culture he had never been aware of before. </p>\n<p>I say that \"Ticket to Ride\" is written by John, but there is some slight dispute about who contributed what to the writing. John's statement was that the song was all him, and that Paul's main contribution was the drum pattern that Ringo plays. Paul, on the other hand, claims that the song is about a sixty-forty split, with John being the sixty. McCartney's evidence for that is the strong vocal harmony he sings -- usually, if there's a two-part harmony like that on a Beatles song, it came about because Lennon and McCartney were in the same room together while writing it, and singing the part together as they were writing. He also talks about how when writing it they were discussing Ryde in the Isle of Wight, where McCartney's cousin ran a pub.</p>\n<p>I can certainly see it being the case that McCartney co-wrote the song, but I can also easily see the musicianly McCartney feeling the need to harmonise what would otherwise have been a monotonous melody, and adding the harmonies during the recording stage. </p>\n<p>Either way, though, the song is primarily John's in the writing, but the arrangement is primarily McCartney's work -- and while Lennon would later claim that McCartney would always pay less attention to Lennon's songs than to McCartney's own, in this middle period of the group's career most of their truly astounding work comes when  Lennon brings in the song but McCartney experiments with the arrangement and production. Over and over again we see McCartney taking control of a Lennon song in the studio and bringing out aspects of it that its composer either had not considered or had not had the musical vocabulary or patience to realise on his own.</p>\n<p>Indeed one can see this as part of the dynamic that eventually led to the group breaking up. Lennon would bring in a half-formed idea and have the whole group work on it, especially McCartney, and turn it into the best version of itself it could be, but this would then seem like McCartney trying to take over. McCartney, meanwhile, with his greater musical facility, would increasingly not bother asking for the input of the group's other members, even when that input would have turned a mediocre song into a good one or a good one into a great one. </p>\n<p>But at this point in their careers, at least, the collaboration brought out the best in both Lennon and McCartney -- though one must wonder what Harrison and Starr felt about having their parts dictated to them or simply replaced. In the case of \"Ticket to Ride\", one can trace the evolution of McCartney's drum pattern idea over a period of a few months. He was clearly fascinated by Hal Blaine's drum intro to \"Be My Baby\":</p>\n<p>[Excerpt: The Ronettes, \"Be My Baby\"]</p>\n<p>and came up with a variation of it for his own song \"What You're Doing\", possibly the most interesting song on Beatles For Sale on a pure production level, the guitar part for which, owing a lot to the Searchers, is also clearly a pointer to the sound on “Ticket to Ride”:</p>\n<p>[Excerpt: The Beatles, \"What You're Doing\"]</p>\n<p>\"Ticket to Ride\"s drum part is a more complex variation on that slightly broken pattern, as you can hear if you listen to the isolated drum part:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride (isolated drums)\"]</p>\n<p>Interestingly, Ringo doesn't keep that precise pattern up all the way through in the studio recording of the song, though he does in subsequent live versions. Instead, from the third verse onwards he shifts to a more straightforward backbeat of the kind he would more normally play:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride (isolated drums)\"]</p>\n<p>The mono mix of \"Ticket to Ride\", which is how most listeners of the time encountered it, shows much more than the stereo mix just what the group, and particularly Paul, were trying to do.  It's a bass-heavy track, sluggish and thundering. It's also a song that sounds *obsessed*. For the first six bars of the verse, and the whole intro, the song stays on a single chord, A, only changing on the word \"away\", right before the chorus:</p>\n<p>[Excerpt: The Beatles, \"Ticket to Ride\"]</p>\n<p>This obsession with one chord was possibly inspired by soul music, and in particular by \"Dancing in the Street\", which similarly stays on one chord for a long time:</p>\n<p>[Excerpt: Martha and the Vandellas, \"Dancing in the Street\"]</p>\n<p>We'll be looking more at how soul music was increasingly doing away with chord progressions in favour of keeping to an extended groove on a single chord when we next look at James Brown in a few weeks' time. But in its single-chord focus and its broken drum beat, \"Ticket to Ride\" is very much a precursor of what the group would do a little over a year later, when they recorded \"Tomorrow Never Knows\".</p>\n<p>Of course, it was also around this time that the group discovered Indian music for the first time. There are scenes in the film Help! which feature musicians playing Indian instruments, and George Harrison became fascinated by the sound of the sitar and bought one, and we'll be seeing the repercussions of that for much of the next year. But it's interesting to note that a lot of the elements that make Indian classical music so distinctive to ears used to Western popular music -- the lack of harmonic movement, the modal melodies, the use of percussion not to keep a steady beat but in melodic interplay with the string instruments -- were all already present in songs like \"Ticket to Ride\", albeit far less obviously and in a way that still fit very much into pop song conventions. The Beatles grew immensely as musicians from their exposure to Indian music, but it's also the case that Indian music appealed to them precisely because it was an extension of the tastes they already had.</p>\n<p>Unlike when recording Beatles For Sale, the group clearly had enough original material to fill out an album, even if they ended up not doing so and including two mediocre cover versions on the album -- the last time that would happen during the group's time together. The B-sides of the two singles, John's \"Yes It Is\" and Paul's \"I'm Down\", both remained only available on the singles, even though the previous film soundtrack had included the B-sides of both its singles. Not only that, but they recorded two Lennon/McCartney songs that would remain unreleased until more than thirty years later. \"If You've Got Troubles\" was left unreleased for good reason -- a song written for Ringo to sing, it's probably the single worst Lennon/McCartney song ever attempted by the group, with little or nothing to redeem it.</p>\n<p>McCartney's \"That Means a Lot\" is more interesting. It's clearly an attempt by McCartney to write a \"Ticket to Ride\" part two, with a similar riff and feel:</p>\n<p>[Excerpt: The Beatles, \"That Means a Lot\"]</p>\n<p>It even has a sped-up repurposing of the hook line at the end, just as \"Ticket to Ride\" does, with \"Can't you see?\" taking the place of \"My baby don't care\":</p>\n<p>[Excerpt: The Beatles, \"That Means a Lot\"]</p>\n<p>The group spent a couple of sessions on that track, but seem to have given up on it. While it's far from the best thing they did, it's not worthless or unreleasable, and one suspects that they ended up thinking that the track couldn't go on the same album as \"Ticket to Ride\" because the two songs were just too close. Instead, they ended up giving the song to P.J. Proby, the American singer who had been brought over by Jack Good for the About The Beatles show, and who had built something of a career for himself in the UK with a string of minor hits. Lennon said \"we found we just couldn't sing it. In fact, we made a hash of it, so we thought we'd better give it to someone who could do it well\". And Proby *could* have done it well -- but whether he did or not is something you can judge for yourself:</p>\n<p>[Excerpt: P.J. Proby, \"That Means a Lot\"]</p>\n<p>Somehow, Proby's version of the song made the top thirty.</p>\n<p>When the group started filming \"Help!\", the film was still going under the working title \"Eight Arms to Hold You\", which absolutely nobody involved liked -- the title was even included on the label of some copies of \"Ticket to Ride\", but Lennon and McCartney particularly disliked the idea of writing a song to that title. Some have suggested that the plan was to use McCartney's \"Eight Days a Week\", an album track from Beatles For Sale that had been released as an American single, as a title track, but it seems unlikely that anyone would have considered that -- United Artists wanted something they could put out on a soundtrack album, and the song had already been out for many months.</p>\n<p>Instead, at almost the last minute, it was decided to name the film \"Help!\". This was actually close to the very first working title for the film, which had been \"Help, Help\". According to Lester, \"the lawyer said it had already been registered and you mustn’t use it so we had Beatles Two and then Eight Arms to Hold You\". The only film I've been able to discover with the title \"Help, Help\", though, is a silent film from 1912, which I don't imagine would have caused much problem in this case. </p>\n<p>However, after the group insisted that they couldn't possibly write a song called \"Eight Arms to Hold You\", Lester realised that if he put an exclamation mark after the word \"help\", that turned it into a different title. After getting legal approval he announced that the title of the new film was going to be \"Help!\", and that same day John came up with a song to that title:</p>\n<p>[Excerpt: The Beatles, \"Help!\"]</p>\n<p>Lennon later said that the song had started out as a slow, intense, ballad, and he had been persuaded to speed it up in the studio somewhat against his will. The song being performed as an upbeat pop song possibly made it harder for the public to see what was obvious to Lennon himself, that the song itself was a cry for help from someone going through a mental health crisis. Despite the title not being his, the sentiments certainly were, and for the first time there was barely even the fig-leaf of romantic love to disguise this. The song's lyrics certainly could be interpreted as being the singer wanting help from a romantic partner, but they don't actually specify this, which is not something that could be said about any of the group's other originals up to this point.</p>\n<p>The soundtrack album for Help! is also notable in other ways. George Harrison writes two songs on the album, when he'd only written one in total for the first four albums. From this point on he would be a major songwriting presence in the group. It also contains the most obvious Dylan homage yet, with Lennon impersonating Dylan's vocal style on \"You've Got to Hide Your Love Away\", recorded three days after \"Ticket to Ride\":</p>\n<p>[Excerpt: The Beatles, \"You've Got to Hide Your Love Away\"] </p>\n<p>\"You've Got to Hide Your Love Away\" was notable in another way as well -- it was the first time that a musician other than the Beatles or George Martin was called in to work on a Beatles record (other than Andy White on the \"Love Me Do\" session, which was not something the Beatles chose or approved of). The flute player Johnny Scott overdubbed two tracks of flute at the end of the recording:</p>\n<p>[Excerpt: The Beatles, \"You've Got to Hide Your Love Away\"]</p>\n<p>That was a sign of things to come, because in June, once filming had completed, the group went into the studio to continue recording for the non-soundtrack side of the soundtrack album. This was the height of the group's success and embrace by the establishment -- two days earlier it had been announced that they were all to be awarded MBEs -- and it's also the point at which McCartney's new creative growth as a songwriter really became apparent. They recorded three songs on the same day -- his Little Richard soundalike \"I'm Down\", which ended up being used as the B-side for \"Help!\", an acoustic country song called \"I've Just Seen a Face\", and finally a song whose melody had come to him in a dream many months earlier.</p>\n<p>McCartney had been so impressed by the melody he'd dreamed that he'd been unable to believe it was original to him, and had spent a long time playing it to other people to see if they recognised it. When they didn't, he eventually changed the lyrics from his original jokey \"Scrambled eggs/Oh my baby how I love your legs\" to something more appropriate, and titled it \"Yesterday\":</p>\n<p>[Excerpt: The Beatles, \"Yesterday (Anthology 2 early take)\"]</p>\n<p>\"Yesterday\" was released as a Beatles track, on a Beatles album, but it had absolutely no involvement from John, George, and Ringo -- nobody could figure out how to adapt the song to a guitars/bass/drums format. Instead George Martin scored it for a string quartet, with some assistance from McCartney who, worried that strings would end up meaning something Mantovani-like, insisted that the score be kept as simple as possible, and played with almost no vibrato. The result was a Beatles track that featured five people, but only one Beatle:</p>\n<p>[Excerpt: The Beatles, \"Yesterday\"]</p>\n<p>The group's next album would see all the band members appearing on every track, and no musicians brought in from outside the group and their organisation, but the genie was now out of the bottle -- the label \"The Beatles\" on a record no longer meant that it featured John, Paul, George, and Ringo, but just that at least one of them was on the track and the others had agreed it could go out under their name. This would lead to immense changes in the way the group worked, and we'll be seeing how that played out throughout the rest of the 1960s.</p>",
  "enclosure": "",
  "itunes:summary": "This week’s episode looks at \"Ticket to Ride\", the making of the Beatles' second film, and the influence of Bob Dylan on the Beatles' work and lives. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"The Game of Love\" by Wayne Fontana and the Mindbenders.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nNo Mixcloud this week, as there are too many songs by the Beatles.\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: The Complete Beatles Chronicle by Mark Lewisohn, All The Songs: The Stories Behind Every Beatles Release by Jean-Michel Guesdon, And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles by Steve Lambley, The Beatles By Ear by Kevin Moore, Revolution in the Head by Ian MacDonald, and The Beatles Anthology.\nFor material on the making of the film, I referred to Getting Away With It by Steven Soderbergh, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.\nSadly the only way to legally get the original mix of \"Ticket to Ride\" is this ludicrously-expensive out-of-print box set, but the 1987 remix is widely available on the CD issue of the Help! soundtrack. The film is available on DVD.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nWhen we last looked at the Beatles, they had just achieved their American success, and had appeared in their first film, A Hard Day's Night. Today, we're going to look at the massive artistic growth that happened to them between late 1964 and mid 1965, the making of their second film, Help!, the influence, both artistic and personal, of Bob Dylan on the group, and their introduction both to studio experimentation and to cannabis. We're going to look at \"Ticket to Ride\":\n[Excerpt: The Beatles, \"Ticket to Ride\"]\n1964 was a tremendously busy year for the Beatles. After they'd finished making A Hard Day's Night, but even before it was released, they had gone on yet another tour, playing Denmark, the Netherlands, Hong Kong, Australia, and New Zealand, though without Ringo for much of the tour -- Ringo had to have his tonsils removed, and so for the first eight shows of the tour he was replaced by session drummer Jimmy Nicol, the former drummer with Colin Hicks and his Cabin Boys, who had played on several cheap soundalike records of Beatles songs. Nicol was a competent drummer, though very different in style from Ringo, and he found his temporary moment of celebrity hugely upsetting -- he later described it as the worst thing to ever happen to him, and ended up declaring bankruptcy only nine months after touring with the group. Nicol is now a recluse, and hasn't spoken to anyone about his time with the Beatles in more than thirty years.\nAfter Ringo returned to the group and the film came out they went back into the studio, only two months after the release of their third album, to start work on their fourth. They recorded four songs in two sessions before departing on their first full US tour. Those songs included two cover versions -- a version of \"Mr. Moonlight\" by Doctor Feelgood and the Interns that appeared on the album, and a version of Little Willie John's \"Leave My Kitten Alone\" that didn't see release until 1995 -- and two originals written mostly or entirely by John Lennon, \"Baby's In Black\", and \"I'm a Loser\":\n[Excerpt: The Beatles, \"I'm a Loser\"]\n\"I'm a Loser\" was an early sign of an influence that had particularly changed Lennon's attitude to songwriting -- that of Bob Dylan. Dylan had been on the group's radar for some time -- Paul McCar",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week’s episode looks at \"Ticket to Ride\", the making of the Beatles' second film, and the influence of Bob Dylan on the Beatles' work and lives. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"The Game of Love\" by Wayne Fontana and the Mindbenders.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nNo Mixcloud this week, as there are too many songs by the Beatles.\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: The Complete Beatles Chronicle by Mark Lewisohn, All The Songs: The Stories Behind Every Beatles Release by Jean-Michel Guesdon, And The Band Begins To",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}