{
  "title": "S17 Ep119: By The Side Of The Road: The Abduction and Murder of Ann Harrison w/ Marla Bernard",
  "link": "https://audioboom.com/posts/8168661",
  "itunes:episode": 119,
  "itunes:title": "By The Side Of The Road: The Abduction and Murder of Ann Harrison w/ Marla Bernard",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 12468,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents: By The Side Of The Road: The Abduction and Murder of Ann Harrison with Author. Marla Bernard.  <br>\n<br>\nIn the early hours of March 22, 1989, two friends – career criminals with violent felony convictions - drove around the eastern Kansas City area in a stolen car committing a series of crimes. The weather was mild for late March in Kansas City; the sky was clear, and there was the pale remnant of a Full Moon that bore the dubious name of Death Moon, the last full moon of winter.<br>\n<br>\nA little before 7 a.m., 15-year-old Ann Harrison walked to the end of her driveway on Kansas City’s east side to wait for the bus to take her to Raytown South High School. Ten minutes later, she disappeared but no one saw what happened. As if waiting for her return, her belongings were still stacked carefully by the side of the road.<br>\n<br>\nBY THE SIDE OF THE ROAD is the true crime story of the kidnapping, rape, and murder of Ann Harrison and the long journey forced upon her family who had to wait nearly three decades to see her killers brought to final justice. Marla Barnard joins TCT today to outline the story and talk about the struggles that Ann, her parents, and the community went through as justice was trying to be served in this case! <br>\n<br>\nPLUS: An ALL NEW Dumb Crimes/Stupid Criminals w/ Beer City Bruiser! <br>\n<br>\nGet your Copy of BY THE SIDE OF THE ROAD Here:   <a href=\"https://amzn.to/3yhf2Z9\">https://amzn.to/3yhf2Z9</a><br>\n<br>\n#crime #truecrime #truecrimepodcasts #truecrimetuesday #marlabernard #bythesideoftheroad #annharrison # #michaeltaylor #rodericknunley #aldevalkenaere #mattrog #raytown #Grandview #murder #rape #armedrobbery #centerformissingandexploitedchildren #deathbystabbing #kidnapping  #dumbcrimesstupidcriminals #TimDennis #BeerCityBruiser #ROH #RingofHonorWrestling #floridaman #drugcrimes #foodcrimes #stupidcrimes #funnycrimes<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 04 Oct 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-04:/posts/8168661",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}