{
  "title": "EPISODE 58 Sitting Bull: Wounded Knee",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sun, 05 Apr 2020 21:02:46 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/4/5/episode-58-wounded-knee",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5e8a439b8c5a9226d7e7d9cf",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1586119787255-Q6RX30KU6TK6W012INNU/HOF-58-SittingBull-Pt05+%281%29.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-58-SittingBull-Pt05 (1).jpg\" data-load=\"false\" data-image-id=\"5e8a4469d7a6d83f2f17775b\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1586119787255-Q6RX30KU6TK6W012INNU/HOF-58-SittingBull-Pt05+%281%29.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“There a papoose cries by its mother’s breast which, cold and insensible, can nourish it no more; there lies a young girl with her long hair sticky of blood, hiding her mutilated face… And here—here rests the beautiful young squaw whom yesterday I offered a cigarette—dying, with both her legs shot off. She lies there without wailing and greets me with a faint smile on her pale lips.”</em> — First Sergeant Ragnar Ling-Vannerus</p><p class=\"\"><em>“The Pioneer has before declared that our only safety depends upon the total extermination of the Indians. Having wronged them for centuries, we had better, in order to protect our civilization, follow it up by one more wrong and wipe these untamed and untamable creatures from the face of the earth.”</em> — Frank Baum, author of <em>The Wonderful Wizard of Oz</em>&nbsp;</p><p class=\"\"><em>&nbsp;“Who would have thought that dancing could make such trouble? We had no thought of fighting.” —</em> Short Bull&nbsp;</p><p class=\"\"><em>“When he went to the bottom of the ravine, he saw many little children lying dead… He was now pretty weak from his wounds. Now when he saw all those little infants lying there dead in their blood, his feeling was that even if he ate one of the soldiers, it would not appease his anger… The Indians all knew that Dewey was wounded, but those in the ravine wanted him to help them. So, he fought with his life to defend his own people.”</em> — From <em>The Dull Knifes of Pine Ridge</em>&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">“What we saw was terrible. Dead and wounded women and children and little babies were scattered all along there where they had been trying to run away. The soldiers had followed along the gulch, as they ran, and murdered them in there. Sometimes they were in heaps because they had huddled together, and some were scattered all along. Sometimes bunches of them had been killed and torn to pieces where the wagon guns hit them. I saw a little baby trying to suck its mother, but she was bloody and dead. There were two little boys at one place in this gulch. They had guns and they had been killing soldiers all by themselves. We could see the soldiers they had killed. The boys were all alone there, and they were not hurt. These were very brave little boys.” From <em>Black Elk Speaks</em>&nbsp;</p><p class=\"\">By 1890, the Ghost Dance religion was spreading like wildfire in many reservations across United States. At a time when most Natives were facing utter hopelessness, it gave them something to hope in. But the murder of Sitting Bull orchestrated by a reservation agent, and the political machinations of the Harrison administration initiated a military crackdown against an otherwise peaceful movement. The sequence of events thus started would end in bloodshed at Wounded Knee on December 29, 1890, as the 7th Cavalry massacred nearly 300 Lakota—mostly women and kids. In this final episode of the Sitting Bull series, we explore the dynamics that led to Wounded Knee, the insane story of Iron Hail (aka Dewey Beard), how the Yanktons dealt with a traitor, the genocidal fantasies of the author of <em>The Wonderful Wizard of Oz</em>, and how Lakota culture endured—in spite of it all.&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p>",
  "media:content": {
    "media:title": "EPISODE 58 Sitting Bull: Wounded Knee"
  }
}