{
  "title": "Episode 55: &#8220;Searchin&#039;&#8221; by the Coasters",
  "link": "https://500songs.com/podcast/episode-55-searchin-by-the-coasters/",
  "pubDate": "Mon, 04 Nov 2019 09:34:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-55-searchin-by-the-coasters/",
  "description": "Episode fifty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Searchin'\" by The Coasters, and at the lineup changes and conflicts that led to them becoming the perfect vehicle for Leiber and Stoller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/31298795\">on \"Raunchy\" by Bill Justis.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-55-searchin/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nI've used multiple sources to piece together the information here.\n\nMarv Goldberg's page is always the go-to for fifties R&B groups, and his <a href=\"http://www.uncamarvy.com/Robins/robins.html\">piece on the Robins is essential.</a>\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\n<a href=\"https://amzn.to/2NClIJp\">Yakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner</a> is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\n<a href=\"http://www.angelfire.com/mn/coasters/\">Those Hoodlum Friends</a> is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/33qFfms\">I Must Be Dreamin': The Robins on RCA, Crown, and Spark 1953-55</a> compiles all the material from the last couple of years of the Robins' career before Nunn and Gardner departed.\n\nAnd <a href=\"https://amzn.to/2NbPRAb\">The Definitive Coasters</a> is a double-CD set that has some overlap with the Robins CD, as it contains all the Robins tracks on Sparks, which were later reissued as Coasters tracks. But it also contains all the group's classic hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Erratum</strong>\n\nI call “Ding Dong Ding” “Ding A Ling”. Also at one point I say “sunk” when I mean “sank”, but didn't think it worth retaking to fix that.\n\n<strong>Transcript</strong>\n\nIt's been a while since we last looked at the careers of Jerry Leiber and Mike Stoller -- the last we heard of them, they had just put out a hit record with \"Riot in Cell Block Number Nine\" by the Robins, and they had seen Elvis Presley put out a cover version of a song they had written for Big Mama Thornton, \"Hound Dog\".\n\nThat hit record had caused a permanent breach between them and Johnny Otis, who had been credited as a co-writer on \"Hound Dog\" right up until the point it looked like becoming a big hit, but then had been eased out of the songwriting credits.\n\nBut Leiber and Stoller were, with the help of Lester Sill, starting to establish themselves as some of the preeminent songwriters and producers in the R&B field.\n\nTheir production career started as a result of the original \"Hound Dog\" -- Big Mama Thornton's version. That record had sold a million or so copies, according to the notoriously dodgy statistics of the time, but Leiber and Stoller had seen no money from it. Mike Stoller's father, Abe, had been furious at how little they'd made for writing it, and had suggested that they should form their own record company, so they could make sure that if they had any more hits they would get their fair share of the money. Lester Sill, their business associate, suggested that as well as a record company they should form a publishing company.\n\nAbe Stoller had recently inherited some money from his father, and while Sill was broke himself, he had a friend, Jack \"Jake the Snake\" Levy, who would happily chip in money for an equal share of the company. So they formed Spark Records and Quintet Publishing, with Leiber, Mike Stoller, and Sill handling the music side of the business and Jake the Snake and Abe Stoller providing the money, with each of the five partners having an equal share in the companies.\n\nThe first record the new label put out was a record by a duo called Willy and Ruth, in the Gene and Eunice mould. The song was a Leiber and Stoller original -- as almost everything released on Spark was -- although it was based around the old \"My Bucket's Got a Hole in It\" melody:\n\n[Excerpt: Willy and Ruth, \"Come a Little Bit Closer\"]\n\nBut the act that had the most success on Spark, and to which Leiber and Stoller were devoting the most attention, was the Robins.\n\nNow we've already talked, back in the episode on \"The Wallflower\" about one of the Robins' hits on Spark Records, \"Riot in Cell Block Number Nine\", but Leiber and Stoller did a lot more work with them than just that one hit. They'd worked with the group before forming Spark – indeed the very first song they'd had released was “That's What The Good Book Says” by the Robins – and were eager to sign them once they got their label up and running.\n\nWhile the Robins had started as a four-piece group, their lineup had slowly expanded. Grady Chapman had joined them as a fifth member in 1953, becoming their joint lead singer with Bobby Nunn, and singing leads on tracks like \"Ten Days in Jail\":\n\n[Excerpt: The Robins, \"Ten Days in Jail\"]\n\nBut Chapman himself ended up in jail, and so they took on Carl Gardner as a lead vocalist in Chapman's place. Gardner didn't really want to be in a vocal group -- he was a solo singer, and had moved to LA to become a pop singer with the big bands. But Johnny Otis had explained to him that there was no longer much of a market for solo singers in the big band style, and that if he was going to make it as a singer in the current market he was going to have to join a vocal group.\n\nGardner originally only joined for ten days, while Chapman was serving a short jail sentence, but then Chapman didn't come back straight away, and by the time he did Gardner was firmly established in the group, and the Robins became a sextet for a while.\n\nWhile Chapman was out of the group, the rest of them had recorded not only \"Riot in Cell Block Number Nine\", but also several other hits, most notably \"Smokey Joe's Cafe\", which featured Gardner on lead vocals, and was also written by Leiber and Stoller:\n\n[Excerpt: The Robins, \"Smokey Joe's Cafe\"]\n\nBut when Chapman returned, Gardner and Chapman started sharing the lead vocals between them. But they only had one recording session where this was the case, before problems started to surface in the group.\n\nGardner was, by his own account at least, far more ambitious than the rest of the group, who were quite reluctant to have any greater level of success than they were already getting, while Gardner wanted to become a major star.\n\nGardner claimed in his autobiography that one of the reasons for this reluctance was that most of the Robins were also pimps, and were making more money from that than from singing, and that they didn't want to give up that money. Whatever the reason, there were tensions within the group, and not only about their relative levels of ambition. Gardner believed that R&B was going to be a passing fad, and was pushing for the group to go more in the big band style, which he was convinced was going to make a comeback.\n\nBut there were other problems. Abe Stoller was disappointed to see that the venture he had invested in, which he'd believed was going to make everyone rich, was losing money like most other independent labels.\n\nDespite this, Leiber and Stoller continued to pump out great records for the Robins, including records like \"The Hatchet Man\", a response to Billy Ward and the Dominoes' \"Sixty Minute Man\":\n\n[Excerpt: The Robins, \"The Hatchet Man\"]\n\nMany of the other songs they recorded had a certain amount of social commentary mixed in with the humour, as in \"Framed\", which was for the time a rather pointed look at the way the law treated -- and still treats -- black men:\n\n[Excerpt: The Robins, \"Framed\"]\n\nBut no matter how good the records they put out were, there was still the fact that the label wasn't bringing in money. And Leiber and Stoller were having other problems. Stoller's mother had died from what seemed to be suicide, while Leiber had been the driver in a car accident that had left one woman dead. Both were sunk in depression.\n\nBut then Jerry Leiber bumped into Neshui Ertegun at the home of a mutual friend. Ertegun was an admirer of Leiber and Stoller's writing, and said he wanted to get to know Leiber better -- and invited Leiber along on his honeymoon. Ertegun was about to get married, and he was planning to spend much of his honeymoon playing tennis while his wife went swimming.\n\nHe invited Leiber to join them on their honeymoon, so he would always have a tennis partner. The two quickly became good friends, and Ertegun made Leiber and Stoller a proposition. It was clear to Ertegun that Leiber and Stoller made great records, but that Spark Records had no understanding of how to get those records out to the public. So he put them in touch with his brother, Ahmet Ertegun, at Atlantic Records, who agreed to give Leiber and Stoller a freelance contract with Atlantic. They became, according to everything I've read, the first freelance production team *ever* in the US -- though I strongly suspect that that depends on how you define \"freelance production team\". They had contracts to make whatever records they wanted, independently of Atlantic's organisation, and Atlantic would then release and distribute those records on their new label, Atco.\n\nAnd they took the Robins with them – or at least some of the Robins. The group found out that it was losing two of its members in the middle of the session for the song that was going to be the follow-up to “Smokey Joe's Cafe”, \"Cherry Lips\":\n\n[Excerpt: The Robins, \"Cherry Lips\"]\n\nThat song was going to be a lead vocal for Carl Gardner, but just as the session started, Leiber and Stoller walked in with some legal documents. No-one has ever been clear as to what exactly those documents were -- and Gardner later claimed that they were faked, while Leiber and Stoller always said that wasn't the case, and that Gardner had already signed to Atco -- but the documents were enough to extricate Gardner from the session. Grady Martin sang lead on the song instead. Carl Gardner and Bobby Nunn were now part of Leiber, Stoller, and Sill's new project with Atco. The rest of the Robins weren't\n\nThere has been quite a bit of confusion as to exactly why Leiber and Stoller only wanted two of the Robins to come across with them. Carl Gardner claimed that Leiber and Stoller wanted to get him away from the rest of the group, who he and they considered unhealthy influences. Ty Terrell, one of the other Robins, always claimed that Leiber and Stoller wanted people who would be easier to control, and that they were paying Gardner and Nunn far less money than the other Robins wanted. And Leiber and Stoller claimed that they just thought the others weren't very good -- Mike Stoller said, \"The Richard brothers and Ty Terrell didn't sing lead at all. They usually sang 'do-wah,' 'do-wah' and had their hands up in the air.\"\n\nI suspect, myself, that it's a combination of reasons, but whatever caused the split, Gardner and Nunn were off into the new group, leaving the other four to carry on without them.\n\nWithout Gardner and Nunn, the Robins continued recording for several years, but stopped having hits. To add insult to injury, many of the Robins' last few singles on Spark were included on the first album by the new group, \"the Coasters\", listed as Coasters recordings. To this day, if you buy a Coasters compilation, you're likely to find \"Riot in Cell Block #9\" and \"Smokey Joe's Cafe\" on there.\n\nFor their new group Gardner and Nunn teamed up with new singers Leon Hughes and Billy Guy, along with the guitarist Adolph Jacobs.\n\nBilly Guy had been part of a duo known as \"Bip and Bop\", who had recorded a \"Ko Ko Mo\" knock-off, \"Ding a Ling\", backed by \"Johnny's Combo\" -- the name Johnny Otis had used when backing Gene and Eunice on \"Ko Ko Mo\":\n\n[Excerpt: Bip and Bop\", \"Ding Dong Ding\"]\n\nHughes, meanwhile, had been one of the many, many, singers who had been in the stew of different groups that had formed the Hollywood Flames, the Penguins, and the Platters. He had been in the Hollywood Flames for a while, at a time when their lineup was in constant flux -- he had been in the group when Curtis Williams, who formed the Penguins, was still in the group, and when he left the Flames he was replaced by Gaynel Hodge, who had just quit the Platters. While he was in the Hollywood Flames, they recorded songs like this:\n\n[Excerpt: The Flames, \"Keep on Smiling\"]\n\nSo this new group had the two strongest vocalists from the Robins, plus two other experienced singers. Carl Gardner was still in two minds about this, because he still wanted to be a solo artist, not part of a group, and when they came together he seems to have been under the impression that they were being formed as his backing group, rather than as a group that would include him as just one of the members. Lester Sill became the new group's manager, and largely took charge of their career.\n\nThe group became known as \"the Coasters\", supposedly because they were from the West Coast but recording for a label on the East Coast. Carl Gardner would later claim that the group's name was his idea, and that it was originally intended that they be promoted as \"Carl Gardner and the Coasters\", but that when he saw the label on the first record he was horrified to see that it just said \"the Coasters\", with no mention of Gardner's name as the lead singer:\n\n[Excerpt: The Coasters, \"Down in Mexico\"]\n\nEverything seemed, at first, to be looking good for the Coasters. Carl Gardner was happy with the other members, as they seemed to be as hungry for success as he was, and they went out on tour, while Stoller went on holiday in Europe -- and the boat he was on sunk on the way back. He and his wife survived, however, and when he got off the rescue boat he was greeted by Leiber, who informed him that Elvis Presley had just recorded \"Hound Dog\", and they were going to make a lot of money as a result.\n\nBut the distraction caused by that, and by the other factors in Leiber and Stoller's life, meant that for much of the rest of the year they were occupied with things other than the Coasters. The Coasters kept touring, and Leiber and Stoller relocated to New York, where they started making records for other Atlantic acts. They started a relationship with the Drifters that would last for years, and through many different lineups of the group. This one, by the Drifters' tenth lineup, became a top ten R&B single:\n\n[Excerpt: The Drifters, \"Fools Fall in Love\"]\n\nThey also recorded \"Lucky Lips\" with Ruth Brown:\n\n[Excerpt: Ruth Brown, \"Lucky Lips\"]\n\nThat became her first single to hit the pop charts since \"Mama, He Treats Your Daughter Mean\", four years earlier.\n\nBut Leiber and Stoller were still going through all sorts of personal problems, ping-ponging from coast to coast, and apart from each other for months at a time. At one point Leiber relocated again, to LA, and Stoller stayed behind in New York, playing piano on records like Big Joe Turner's \"Teenage Letter\";\n\n[Excerpt: Big Joe Turner, \"Teenage Letter\"]\n\nBut eventually they were together for long enough to write more songs for the Coasters. Their next work with the group was a double-sided smash hit.\n\n\"Young Blood\", was a collaboration with another writer. Doc Pomus' birth name was Jerome Felder, but he'd taken on his stage name when he decided to become a blues shouter in the style of Big Joe Turner or Jimmy Rushing. Pomus was not a normal blues shouter -- he was an extremely fat Jewish man, who used crutches to get around as his legs were paralysed with post-polio syndrome.\n\nPomus had been recording for labels like Chess since 1944, and many of the records were very good:\n\n[Excerpt: Doc Pomus, \"Send For the Doctor\"]\n\nPomus had become a central figure in the group of musicians around Atlantic Records, performing regularly with people like Mickey Baker, King Curtis, and the jazz vibraphone player Milt Jackson. But no matter how many records he made, he'd not had any success as a singer, and he'd fairly recently decided to move into songwriting instead.\n\nThe year before, he'd written \"Lonely Avenue\", which had been a minor hit for Ray Charles:\n\n[Excerpt: Ray Charles, \"Lonely Avenue\"]\n\nBut he didn't really understand this new rock and roll music -- he was a fan of jump blues, and swing bands like Count Basie's, not this newer music aimed at a younger audience, and so his songwriting hadn't been massively successful either. He was casting around for a songwriting partner who did understand the new music, so far without success. But Leiber and Stoller liked Pomus a lot -- not only did they like \"Lonely Avenue\" and the records he'd been making recently, but Stoller even had fond memories of a radio jingle Pomus had written and recorded for a pants shop in Brooklyn, which he remembered from growing up.\n\nPomus had written a song called \"Young Blood\", which he thought had potential, but it wasn't quite right. Depending on what version of events you believe, Leiber and Stoller either radically reworked the song, or threw away everything except the title, which they thought had immense commercial potential, and wrote a whole new song around it. Either way, the song was a huge success, and Pomus was grateful for his share of the credit and royalties, while Leiber and Stoller were happy to give someone they admired a boost.\n\n[Excerpt: The Coasters, \"Young Blood\"]\n\n\"Young Blood\" was ostensibly the A-side of the single that resulted, but the record that actually made the biggest splash was the B-side, \"Searchin'\", which had Billy Guy singing lead. The song was one of Leiber and Stoller's best, and showed Leiber's sense of humour to its best effect, as Guy sang about how he was going to be a better detective than Charlie Chan or Sam Spade in tracking down his missing girlfriend:\n\n[Excerpt: The Coasters, \"Searchin'\"]\n\nOn this session, Leon Hughes wasn't present -- I've not seen any explanation from anyone involved as to why he was absent, but his place was taken by Young Jessie. Young Jessie was a singer who had previously been a member of the Flairs, with Richard Berry, and had later recorded a handful of solo records for Modern Records, and had signed a contract with Leiber and Stoller.\n\nAround the time of the session Young Jessie released this, with Leiber and Stoller producing, for Atco:\n\n[Excerpt: Young Jessie, \"Shuffle in the Gravel\"]\n\nDespite what some people have said, Young Jessie never became a full-time member of the Coasters (though he did later tour with a group calling itself the Coasters, led by Leon Hughes) and the original lineup of the group continued touring for a while.\n\nAfter the success of \"Searchin'\" and \"Young Blood\", Atco released a series of flop singles, all of which were recorded by the original lineup, and all of which, like the hit, featured one side with a Carl Gardner lead vocal and the other with a Billy Guy lead.\n\nSome of these, like \"Idol With the Golden Head\", were classic Leiber and Stoller story songs along the lines of the earlier Robins records, but they didn't yet, quite, have the classic Coasters sound:\n\n[Excerpt: The Coasters, \"Idol With the Golden Head\"]\n\nBut then, towards the end of the year, the group split up.\n\nIt's hard to tell exactly what happened, as most of the stories about who left the group and why have been told by people who were involved, most of whom wanted to bolster their own later legal cases for ownership of the Coasters name. But whatever actually happened, Leon Hughes and Bobby Nunn were out of the group, suddenly. Depending on which version of the story you believe, they either got tired of the road and wanted to see their families, or they were sacked mid-tour because of their behaviour.\n\nFor one recording session, Tommy Evans from the Drifters substituted for Hughes and Nunn, until Lester Sill went out and found two replacement members, Cornell Gunter and Dub Jones.\n\nWe've met Gunter before -- he was part of the collection of singers who were all in half a dozen different groups, centered around Gaynel Hodge. He had been an early member of the Platters, and had also been in the Flairs with Richard Berry and Young Jessie, and had recorded a handful of solo singles:\n\n[Excerpt: Cornell Gunter, “Neighborhood Dance”]\n\nGunter was also unusual for the time in being an out gay man, and was initially apprehensive about joining the group in case the other members were homophobic. For the time, they weren't especially -- Carl Gardner apparently felt the need to let Gunter know that he was straight himself and wouldn't be interested, but they took a live and let live attitude, and Gunter quickly became friendly with the rest of the group.\n\nDub Jones, meanwhile, had been the bass singer for the Cadets, and had done the spoken-word vocals on their biggest hit, \"Stranded in the Jungle\":\n\n[Excerpt: The Cadets, \"Stranded in the Jungle\"]\n\nJones would quickly become an integral part of the group's sound.\n\nThis new lineup met for the first time on the plane to a gig in Hawaii, and Gardner at least was very worried that these new singers would not be able to fit in with the routines the others had already worked out.\n\nHe had no need to worry. It only took one quick rehearsal before the show for Gunter and Jones to slot in perfectly, and the classic lineup of the Coasters was now in place.\n\nLeiber and Stoller loved working with the Coasters, but it had been almost a year since they'd written the group a hit at this point. \"Hound Dog\" had been a big enough success for Elvis that his management team wanted more from Leiber and Stoller, and fast, and most of their most commercial work in 1957 went to Elvis. But that changed in 1958, and the Coasters were the beneficiaries.\n\nWe'll be picking up with Leiber, Stoller, and Elvis, in a few weeks' time. And a few weeks after that, we'll see what happened when they got back into the studio with the Coasters...",
  "itunes:subtitle": "Episode fifty-five of A History of Rock Music in Five Hundred Songs looks at Searchin by The Coasters, and at the lineup changes and conflicts that led to them becoming the perfect vehicle for Leiber and Stoller. Click the full post to read liner notes, ",
  "itunes:keywords": "Atlantic Records,Cornell Gunter,Doc Pomus,Hollywood Flames,Johnny Otis,Leiber and Stoller,Lester Sill,Neshui Ertegun,Spark Records,The Coasters,The Robins",
  "itunes:episodeType": "full",
  "itunes:episode": 55,
  "content:encoded": "Episode fifty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Searchin'\" by The Coasters, and at the lineup changes and conflicts that led to them becoming the perfect vehicle for Leiber and Stoller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/31298795\">on \"Raunchy\" by Bill Justis.</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-55-searchin/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nI've used multiple sources to piece together the information here.\n\nMarv Goldberg's page is always the go-to for fifties R&B groups, and his <a href=\"http://www.uncamarvy.com/Robins/robins.html\">piece on the Robins is essential.</a>\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a> by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\n<a href=\"https://amzn.to/2NClIJp\">Yakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner</a> is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\n<a href=\"http://www.angelfire.com/mn/coasters/\">Those Hoodlum Friends</a> is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/33qFfms\">I Must Be Dreamin': The Robins on RCA, Crown, and Spark 1953-55</a> compiles all the material from the last couple of years of the Robins' career before Nunn and Gardner departed.\n\nAnd <a href=\"https://amzn.to/2NbPRAb\">The Definitive Coasters</a> is a double-CD set that has some overlap with the Robins CD, as it contains all the Robins tracks on Sparks, which were later reissued as Coasters tracks. But it also contains all the group's classic hits.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Erratum</strong>\n\nI call “Ding Dong Ding” “Ding A Ling”. Also at one point I say “sunk” when I mean “sank”, but didn't think it worth retaking to fix that.\n\n<strong>Transcript</strong>\n\nIt's been a while since we last looked at the careers of Jerry Leiber and Mike Stoller -- the last we heard of them, they had just put out a hit record with \"Riot in Cell Block Number Nine\" by the Robins, and they had seen Elvis Presley put out a cover version of a song they had written for Big Mama Thornton, \"Hound Dog\".\n\nThat hit record had caused a permanent breach between them and Johnny Otis, who had been credited as a co-writer on \"Hound Dog\" right up until the point it looked like becoming a big hit, but then had been eased out of the songwriting credits.\n\nBut Leiber and Stoller were, with the help of Lester Sill, starting to establish themselves as some of the preeminent songwriters and producers in the R&B field.\n\nTheir production career started as a result of the original \"Hound Dog\" -- Big Mama Thornton's version. That record had sold a million or so copies, according to the notoriously dodgy statistics of the time, but Leiber and Stoller had seen no money from it. Mike Stoller's father, Abe, had been furious at how little they'd made for writing it, and had suggested that they should form their own record company, so they could make sure that if they had any more hits they would get their fair share of the money. Lester Sill, their business associate, suggested that as well as a record company they should form a publishing company.\n\nAbe Stoller had recently inherited some money from his father, and while Sill was broke himself, he had a friend, Jack \"Jake the Snake\" Levy, who would happily chip in money for an equal share of the company. So they formed Spark Records and Quintet Publishing, with Leiber, Mike Stoller, and Sill handling the music side of the business and Jake the Snake and Abe Stoller providing the money, with each of the five partners having an equal share in the companies.\n\nThe first record the new label put out was a record by a duo called Willy and Ruth, in the Gene and Eunice mould. The song was a Leiber and Stoller original -- as almost everything released on Spark was -- although it was based around the old \"My Bucket's Got a Hole in It\" melody:\n\n[Excerpt: Willy and Ruth, \"Come a Little Bit Closer\"]\n\nBut the act that had the most success on Spark, and to which Leiber and Stoller were devoting the most attention, was the Robins.\n\nNow we've already talked, back in the episode on \"The Wallflower\" about one of the Robins' hits on Spark Records, \"Riot in Cell Block Number Nine\", but Leiber and Stoller did a lot more work with them than just that one hit. They'd worked with the group before forming Spark – indeed the very first song they'd had released was “That's What The Good Book Says” by the Robins – and were eager to sign them once they got their label up and running.\n\nWhile the Robins had started as a four-piece group, their lineup had slowly expanded. Grady Chapman had joined them as a fifth member in 1953, becoming their joint lead singer with Bobby Nunn, and singing leads on tracks like \"Ten Days in Jail\":\n\n[Excerpt: The Robins, \"Ten Days in Jail\"]\n\nBut Chapman himself ended up in jail, and so they took on Carl Gardner as a lead vocalist in Chapman's place. Gardner didn't really want to be in a vocal group -- he was a solo singer, and had moved to LA to become a pop singer with the big bands. But Johnny Otis had explained to him that there was no longer much of a market for solo singers in the big band style, and that if he was going to make it as a singer in the current market he was going to have to join a vocal group.\n\nGardner originally only joined for ten days, while Chapman was serving a short jail sentence, but then Chapman didn't come back straight away, and by the time he did Gardner was firmly established in the group, and the Robins became a sextet for a while.\n\nWhile Chapman was out of the group, the rest of them had recorded not only \"Riot in Cell Block Number Nine\", but also several other hits, most notably \"Smokey Joe's Cafe\", which featured Gardner on lead vocals, and was also written by Leiber and Stoller:\n\n[Excerpt: The Robins, \"Smokey Joe's Cafe\"]\n\nBut when Chapman returned, Gardner and Chapman started sharing the lead vocals between them. But they only had one recording session where this was the case, before problems started to surface in the group.\n\nGardner was, by his own account at least, far more ambitious than the rest of the group, who were quite reluctant to have any greater level of success than they were already getting, while Gardner wanted to become a major star.\n\nGardner claimed in his autobiography that one of the reasons for this reluctance was that most of the Robins were also pimps, and were making more money from that than from singing, and that they didn't want to give up that money. Whatever the reason, there were tensions within the group, and not only about their relative levels of ambition. Gardner believed that R&B was going to be a passing fad, and was pushing for the group to go more in the big band style, which he was convinced was going to make a comeback.\n\nBut there were other problems. Abe Stoller was disappointed to see that the venture he had invested in, which he'd believed was going to make everyone rich, was losing money like most other independent labels.\n\nDespite this, Leiber and Stoller continued to pump out great records for the Robins, including records like \"The Hatchet Man\", a response to Billy Ward and the Dominoes' \"Sixty Minute Man\":\n\n[Excerpt: The Robins, \"The Hatchet Man\"]\n\nMany of the other songs they recorded had a certain amount of social commentary mixed in with the humour, as in \"Framed\", which was for the time a rather pointed look at the way the law treated -- and still treats -- black men:\n\n[Excerpt: The Robins, \"Framed\"]\n\nBut no matter how good the records they put out were, there was still the fact that the label wasn't bringing in money. And Leiber and Stoller were having other problems. Stoller's mother had died from what seemed to be suicide, while Leiber had been the driver in a car accident that had left one woman dead. Both were sunk in depression.\n\nBut then Jerry Leiber bumped into Neshui Ertegun at the home of a mutual friend. Ertegun was an admirer of Leiber and Stoller's writing, and said he wanted to get to know Leiber better -- and invited Leiber along on his honeymoon. Ertegun was about to get married, and he was planning to spend much of his honeymoon playing tennis while his wife went swimming.\n\nHe invited Leiber to join them on their honeymoon, so he would always have a tennis partner. The two quickly became good friends, and Ertegun made Leiber and Stoller a proposition. It was clear to Ertegun that Leiber and Stoller made great records, but that Spark Records had no understanding of how to get those records out to the public. So he put them in touch with his brother, Ahmet Ertegun, at Atlantic Records, who agreed to give Leiber and Stoller a freelance contract with Atlantic. They became, according to everything I've read, the first freelance production team *ever* in the US -- though I strongly suspect that that depends on how you define \"freelance production team\". They had contracts to make whatever records they wanted, independently of Atlantic's organisation, and Atlantic would then release and distribute those records on their new label, Atco.\n\nAnd they took the Robins with them – or at least some of the Robins. The group found out that it was losing two of its members in the middle of the session for the song that was going to be the follow-up to “Smokey Joe's Cafe”, \"Cherry Lips\":\n\n[Excerpt: The Robins, \"Cherry Lips\"]\n\nThat song was going to be a lead vocal for Carl Gardner, but just as the session started, Leiber and Stoller walked in with some legal documents. No-one has ever been clear as to what exactly those documents were -- and Gardner later claimed that they were faked, while Leiber and Stoller always said that wasn't the case, and that Gardner had already signed to Atco -- but the documents were enough to extricate Gardner from the session. Grady Martin sang lead on the song instead. Carl Gardner and Bobby Nunn were now part of Leiber, Stoller, and Sill's new project with Atco. The rest of the Robins weren't\n\nThere has been quite a bit of confusion as to exactly why Leiber and Stoller only wanted two of the Robins to come across with them. Carl Gardner claimed that Leiber and Stoller wanted to get him away from the rest of the group, who he and they considered unhealthy influences. Ty Terrell, one of the other Robins, always claimed that Leiber and Stoller wanted people who would be easier to control, and that they were paying Gardner and Nunn far less money than the other Robins wanted. And Leiber and Stoller claimed that they just thought the others weren't very good -- Mike Stoller said, \"The Richard brothers and Ty Terrell didn't sing lead at all. They usually sang 'do-wah,' 'do-wah' and had their hands up in the air.\"\n\nI suspect, myself, that it's a combination of reasons, but whatever caused the split, Gardner and Nunn were off into the new group, leaving the other four to carry on without them.\n\nWithout Gardner and Nunn, the Robins continued recording for several years, but stopped having hits. To add insult to injury, many of the Robins' last few singles on Spark were included on the first album by the new group, \"the Coasters\", listed as Coasters recordings. To this day, if you buy a Coasters compilation, you're likely to find \"Riot in Cell Block #9\" and \"Smokey Joe's Cafe\" on there.\n\nFor their new group Gardner and Nunn teamed up with new singers Leon Hughes and Billy Guy, along with the guitarist Adolph Jacobs.\n\nBilly Guy had been part of a duo known as \"Bip and Bop\", who had recorded a \"Ko Ko Mo\" knock-off, \"Ding a Ling\", backed by \"Johnny's Combo\" -- the name Johnny Otis had used when backing Gene and Eunice on \"Ko Ko Mo\":\n\n[Excerpt: Bip and Bop\", \"Ding Dong Ding\"]\n\nHughes, meanwhile, had been one of the many, many, singers who had been in the stew of different groups that had formed the Hollywood Flames, the Penguins, and the Platters. He had been in the Hollywood Flames for a while, at a time when their lineup was in constant flux -- he had been in the group when Curtis Williams, who formed the Penguins, was still in the group, and when he left the Flames he was replaced by Gaynel Hodge, who had just quit the Platters. While he was in the Hollywood Flames, they recorded songs like this:\n\n[Excerpt: The Flames, \"Keep on Smiling\"]\n\nSo this new group had the two strongest vocalists from the Robins, plus two other experienced singers. Carl Gardner was still in two minds about this, because he still wanted to be a solo artist, not part of a group, and when they came together he seems to have been under the impression that they were being formed as his backing group, rather than as a group that would include him as just one of the members. Lester Sill became the new group's manager, and largely took charge of their career.\n\nThe group became known as \"the Coasters\", supposedly because they were from the West Coast but recording for a label on the East Coast. Carl Gardner would later claim that the group's name was his idea, and that it was originally intended that they be promoted as \"Carl Gardner and the Coasters\", but that when he saw the label on the first record he was horrified to see that it just said \"the Coasters\", with no mention of Gardner's name as the lead singer:\n\n[Excerpt: The Coasters, \"Down in Mexico\"]\n\nEverything seemed, at first, to be looking good for the Coasters. Carl Gardner was happy with the other members, as they seemed to be as hungry for success as he was, and they went out on tour, while Stoller went on holiday in Europe -- and the boat he was on sunk on the way back. He and his wife survived, however, and when he got off the rescue boat he was greeted by Leiber, who informed him that Elvis Presley had just recorded \"Hound Dog\", and they were going to make a lot of money as a result.\n\nBut the distraction caused by that, and by the other factors in Leiber and Stoller's life, meant that for much of the rest of the year they were occupied with things other than the Coasters. The Coasters kept touring, and Leiber and Stoller relocated to New York, where they started making records for other Atlantic acts. They started a relationship with the Drifters that would last for years, and through many different lineups of the group. This one, by the Drifters' tenth lineup, became a top ten R&B single:\n\n[Excerpt: The Drifters, \"Fools Fall in Love\"]\n\nThey also recorded \"Lucky Lips\" with Ruth Brown:\n\n[Excerpt: Ruth Brown, \"Lucky Lips\"]\n\nThat became her first single to hit the pop charts since \"Mama, He Treats Your Daughter Mean\", four years earlier.\n\nBut Leiber and Stoller were still going through all sorts of personal problems, ping-ponging from coast to coast, and apart from each other for months at a time. At one point Leiber relocated again, to LA, and Stoller stayed behind in New York, playing piano on records like Big Joe Turner's \"Teenage Letter\";\n\n[Excerpt: Big Joe Turner, \"Teenage Letter\"]\n\nBut eventually they were together for long enough to write more songs for the Coasters. Their next work with the group was a double-sided smash hit.\n\n\"Young Blood\", was a collaboration with another writer. Doc Pomus' birth name was Jerome Felder, but he'd taken on his stage name when he decided to become a blues shouter in the style of Big Joe Turner or Jimmy Rushing. Pomus was not a normal blues shouter -- he was an extremely fat Jewish man, who used crutches to get around as his legs were paralysed with post-polio syndrome.\n\nPomus had been recording for labels like Chess since 1944, and many of the records were very good:\n\n[Excerpt: Doc Pomus, \"Send For the Doctor\"]\n\nPomus had become a central figure in the group of musicians around Atlantic Records, performing regularly with people like Mickey Baker, King Curtis, and the jazz vibraphone player Milt Jackson. But no matter how many records he made, he'd not had any success as a singer, and he'd fairly recently decided to move into songwriting instead.\n\nThe year before, he'd written \"Lonely Avenue\", which had been a minor hit for Ray Charles:\n\n[Excerpt: Ray Charles, \"Lonely Avenue\"]\n\nBut he didn't really understand this new rock and roll music -- he was a fan of jump blues, and swing bands like Count Basie's, not this newer music aimed at a younger audience, and so his songwriting hadn't been massively successful either. He was casting around for a songwriting partner who did understand the new music, so far without success. But Leiber and Stoller liked Pomus a lot -- not only did they like \"Lonely Avenue\" and the records he'd been making recently, but Stoller even had fond memories of a radio jingle Pomus had written and recorded for a pants shop in Brooklyn, which he remembered from growing up.\n\nPomus had written a song called \"Young Blood\", which he thought had potential, but it wasn't quite right. Depending on what version of events you believe, Leiber and Stoller either radically reworked the song, or threw away everything except the title, which they thought had immense commercial potential, and wrote a whole new song around it. Either way, the song was a huge success, and Pomus was grateful for his share of the credit and royalties, while Leiber and Stoller were happy to give someone they admired a boost.\n\n[Excerpt: The Coasters, \"Young Blood\"]\n\n\"Young Blood\" was ostensibly the A-side of the single that resulted, but the record that actually made the biggest splash was the B-side, \"Searchin'\", which had Billy Guy singing lead. The song was one of Leiber and Stoller's best, and showed Leiber's sense of humour to its best effect, as Guy sang about how he was going to be a better detective than Charlie Chan or Sam Spade in tracking down his missing girlfriend:\n\n[Excerpt: The Coasters, \"Searchin'\"]\n\nOn this session, Leon Hughes wasn't present -- I've not seen any explanation from anyone involved as to why he was absent, but his place was taken by Young Jessie. Young Jessie was a singer who had previously been a member of the Flairs, with Richard Berry, and had later recorded a handful of solo records for Modern Records, and had signed a contract with Leiber and Stoller.\n\nAround the time of the session Young Jessie released this, with Leiber and Stoller producing, for Atco:\n\n[Excerpt: Young Jessie, \"Shuffle in the Gravel\"]\n\nDespite what some people have said, Young Jessie never became a full-time member of the Coasters (though he did later tour with a group calling itself the Coasters, led by Leon Hughes) and the original lineup of the group continued touring for a while.\n\nAfter the success of \"Searchin'\" and \"Young Blood\", Atco released a series of flop singles, all of which were recorded by the original lineup, and all of which, like the hit, featured one side with a Carl Gardner lead vocal and the other with a Billy Guy lead.\n\nSome of these, like \"Idol With the Golden Head\", were classic Leiber and Stoller story songs along the lines of the earlier Robins records, but they didn't yet, quite, have the classic Coasters sound:\n\n[Excerpt: The Coasters, \"Idol With the Golden Head\"]\n\nBut then, towards the end of the year, the group split up.\n\nIt's hard to tell exactly what happened, as most of the stories about who left the group and why have been told by people who were involved, most of whom wanted to bolster their own later legal cases for ownership of the Coasters name. But whatever actually happened, Leon Hughes and Bobby Nunn were out of the group, suddenly. Depending on which version of the story you believe, they either got tired of the road and wanted to see their families, or they were sacked mid-tour because of their behaviour.\n\nFor one recording session, Tommy Evans from the Drifters substituted for Hughes and Nunn, until Lester Sill went out and found two replacement members, Cornell Gunter and Dub Jones.\n\nWe've met Gunter before -- he was part of the collection of singers who were all in half a dozen different groups, centered around Gaynel Hodge. He had been an early member of the Platters, and had also been in the Flairs with Richard Berry and Young Jessie, and had recorded a handful of solo singles:\n\n[Excerpt: Cornell Gunter, “Neighborhood Dance”]\n\nGunter was also unusual for the time in being an out gay man, and was initially apprehensive about joining the group in case the other members were homophobic. For the time, they weren't especially -- Carl Gardner apparently felt the need to let Gunter know that he was straight himself and wouldn't be interested, but they took a live and let live attitude, and Gunter quickly became friendly with the rest of the group.\n\nDub Jones, meanwhile, had been the bass singer for the Cadets, and had done the spoken-word vocals on their biggest hit, \"Stranded in the Jungle\":\n\n[Excerpt: The Cadets, \"Stranded in the Jungle\"]\n\nJones would quickly become an integral part of the group's sound.\n\nThis new lineup met for the first time on the plane to a gig in Hawaii, and Gardner at least was very worried that these new singers would not be able to fit in with the routines the others had already worked out.\n\nHe had no need to worry. It only took one quick rehearsal before the show for Gunter and Jones to slot in perfectly, and the classic lineup of the Coasters was now in place.\n\nLeiber and Stoller loved working with the Coasters, but it had been almost a year since they'd written the group a hit at this point. \"Hound Dog\" had been a big enough success for Elvis that his management team wanted more from Leiber and Stoller, and fast, and most of their most commercial work in 1957 went to Elvis. But that changed in 1958, and the Coasters were the beneficiaries.\n\nWe'll be picking up with Leiber, Stoller, and Elvis, in a few weeks' time. And a few weeks after that, we'll see what happened when they got back into the studio with the Coasters...",
  "enclosure": "",
  "itunes:summary": "Episode fifty-five of A History of Rock Music in Five Hundred Songs looks at \"Searchin'\" by The Coasters, and at the lineup changes and conflicts that led to them becoming the perfect vehicle for Leiber and Stoller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Raunchy\" by Bill Justis.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used multiple sources to piece together the information here.\n\nMarv Goldberg's page is always the go-to for fifties R&B groups, and his piece on the Robins is essential.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nYakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner is a self-published, rather short, autobiography, which gives Gardner's take on the formation of the Coasters.\n\nThose Hoodlum Friends is a Coasters fansite, with a very nineties aesthetic (frames! angelfire domain name! Actual information rather than pretty, empty, layouts!)\n\nLonely Avenue, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\nI Must Be Dreamin': The Robins on RCA, Crown, and Spark 1953-55 compiles all the material from the last couple of years of the Robins' career before Nunn and Gardner departed.\n\nAnd The Definitive Coasters is a double-CD set that has some overlap with the Robins CD, as it contains all the Robins tracks on Sparks, which were later reissued as Coasters tracks. But it also contains all the group's classic hits.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nErratum\n\nI call “Ding Dong Ding” “Ding A Ling”. Also at one point I say “sunk” when I mean “sank”, but didn't think it worth retaking to fix that.\n\nTranscript\n\nIt's been a while since we last looked at the careers of Jerry Leiber and Mike Stoller -- the last we heard of them, they had just put out a hit record with \"Riot in Cell Block Number Nine\" by the Robins, and they had seen Elvis Presley put out a cover version of a song they had written for Big Mama Thornton, \"Hound Dog\".\n\nThat hit record had caused a permanent breach between them and Johnny Otis, who had been credited as a co-writer on \"Hound Dog\" right up until the point it looked like becoming a big hit, but then had been eased out of the songwriting credits.\n\nBut Leiber and Stoller were, with the help of Lester Sill, starting to establish themselves as some of the preeminent songwriters and producers in the R&B field.\n\nTheir production career started as a result of the original \"Hound Dog\" -- Big Mama Thornton's version. That record had sold a million or so copies, according to the notoriously dodgy statistics of the time, but Leiber and Stoller had seen no money from it. Mike Stoller's father, Abe, had been furious at how little they'd made for writing it, and had suggested that they should form their own record company, so they could make sure that if they had any more hits they would get their fair share of the money. Lester Sill, their business associate, suggested that as well as a record company they should form a publishing company.\n\nAbe Stoller had recently inherited some money from his father, and while Sill was broke himself, he had a friend, Jack \"Jake the Snake\" Levy, who would happily chip in money for an equal share of the company. So they formed Spark Records and Quintet Publishing, with Leiber, Mike Stoller, and Sill handling the music side of the business and Jake the Snake and Abe Stoller providing the money, with each of the five partners having an equal share in the companies.\n\nThe first record the new label put out was a record by a duo called Willy and Ruth, in the Gene and Eunice mould. The song was a Leiber and Stoller original -- as almost ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode fifty-five of A History of Rock Music in Five Hundred Songs looks at \"Searchin'\" by The Coasters, and at the lineup changes and conflicts that led to them becoming the perfect vehicle for Leiber and Stoller. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Raunchy\" by Bill Justis.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI've used multiple sources to piece together the information here.\n\nMarv Goldberg's page is always the go-to for fifties R&B groups, and his piece on the Robins is essential.\n\nHound Dog: The Leiber and Stoller Autobiography by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nYakety Yak, I Fought Back: My Life With the Coasters by Carl and Veta Gardner is a self-published, rather short, autobiography, which gives G",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}