{
  "title": "Tesla Inside: The Ultimate Vintage Land Rover Retrofit",
  "link": "https://spectrum.ieee.org/electric-land-rover",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/this-photo-shows-a-parked-land-rover-that-is-plugged-into-a-tesla-charging-station.jpg?id=29696930&width=600&height=600&coordinates=1280%2C0%2C1280%2C0\"/><br/><br/><p>\n<strong>From the outside,</strong> this Land Rover Defender looks like any other example of the <a href=\"https://www.youtube.com/watch?v=ZdB1tLdTY9E\" target=\"_blank\">postwar British classic</a> that conquered the African outback—and the automotive world’s heart. But when I step on the accelerator, my own heart jumps. The Defender charges like a lioness on a wildebeest’s scent, slaying 60 miles per hour (almost 100 kilometers per hour) in about 5 seconds. That acceleration is so out of character for this doughty old truck, and so fun, that I’m forced to do it again.\n</p><p>\n\tClearly, that’s no lazy Rover diesel chugging below the hood—or even a Chevrolet V-8, a current go-to engine for vintage-car fans seeking a contemporary edge. This Defender, known for\n\t<a href=\"https://www.automuse.co.nz/news/land-rover-defender-tomb-raider-up-for-auction-lara-croft-not-included\" target=\"_blank\"> raiding tombs</a>, has raided Tesla’s temple of tech.\n</p><p>\n\tThe Insta-worthy specimen I’m driving—dubbed “Project Britton” and built by \n\t<a href=\"https://ecdautodesign.com/\" target=\"_blank\">E.C.D. Automotive Design</a> (formerly East Coast Defenders), in Kissimmee, Fla.—highlights the small-but-growing phenomenon of people converting fossil-fueled cars to run on electricity. It’s also a plug-in twist on the hottest thing in car customization: “<a href=\"https://books.google.com/ngrams/graph?content=restomod&year_start=1800&year_end=2019&corpus=26&smoothing=3&direct_url=t1%3B%2Crestomod%3B%2Cc0\" target=\"_blank\">restomods</a>,” which update classics with modern power trains, suspensions, and creature comforts, all hidden under their vintage skins.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Photo of the body-off frame of the vehicle.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b89919a48108fbb7968f10fb2d4cb24f\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"b1d01\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/photo-of-the-body-off-frame-of-the-vehicle.jpg?id=29692416&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Refurbishment begins with the vehicle’s frame, which is stripped, galvanized, and repainted.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\tAround the world, specialists like E.C.D. and its power-train designer and supplier, \n\t<a href=\"https://www.electricclassiccars.co.uk/\" target=\"_blank\">Electric Classic Cars,</a> in Newton, Wales, will replace a car’s petroleum-clogged heart and give it a new, electric lease on life.\n</p><p>\n\tFor this baby-blue Rover, the conversion includes a powerful electric drive unit from a \n\t<a href=\"https://www.tesla.com/blog/new-tesla-model-s-now-quickest-production-car-world\" target=\"_blank\">Tesla Model S P100D,</a> which provides 450 horsepower (331 kilowatts) in this application. That’s three times the output of the <a href=\"https://www.ultimatespecs.com/car-specs/Land-Rover/417/1979-Land-Rover-Range-Rover-V8.html\" target=\"_blank\">Buick-based Rover V-8</a> that first powered these trucks in 1979, and nine times that of the anemic 50-hp gasoline engine the Rover boasted at its birth, in 1948.\n</p><p>\n\tThe car holds about 100 kilowatt-hours’ worth of lithium-iron phosphate (LFP) batteries—a lower-cost approach used for the Teslas sold in China and Europe (and \n\t<a href=\"https://www.cnbc.com/2021/10/20/tesla-switching-to-lfp-batteries-in-all-standard-range-cars.html\" target=\"_blank\">recently adopted</a> for standard-range Teslas in the United States).\n</p><p>\n\tAbout 60 percent of those cells go into the front engine bay; the rest reside below the cargo hold. That gives the hardy Rover a range of up to 350 kilometers (about 220 miles)—plenty for weekend joy rides. A port mounted on a rear fender connects a standard CCS (<a href=\"https://en.wikipedia.org/wiki/Combined_Charging_System\" target=\"_blank\">Combined Charging System</a>) plug to an onboard 7-kW charger.\n</p><p>\n\tE.C.D. Automotive Design is the brainchild of three British petrolheads, Scott Wallace and brothers Tom and Elliot Humble, who grew up not far from the \n\t<a href=\"https://en.wikipedia.org/wiki/Solihull_plant\" target=\"_blank\">Lode Lane factory</a> that built the Defender. The company was founded in 2013, after a brainstorming session over a case of beer in a Florida garage.\n</p><p>\n\t“We said, ‘Let’s take a British farm vehicle and turn it into a luxury SUV for the American market,’ ” Wallace recounts during my tour of E.C.D.’s “<a href=\"https://ecdautodesign.com/facility/\" target=\"_blank\">Rover Dome</a>,” its 45,000-square-foot (about 4,200-square-meter) production facility. “After every beer, it sounded like a better idea.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Photo of a technician working on wiring harnesses.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"78b5ff550405432cfd8c4e3138b6aea7\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"357c7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/photo-of-a-technician-working-on-wiring-harnesses.jpg?id=29692520&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Technicians revamp the car’s electrical wiring, including the notoriously unreliable 12-volt circuits.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\tThe lads might want to pop another cold one: Business is rocking, as evidenced by a visit to the company’s sparkling 100,000-square-foot (about 9,300-square-meter) \n\t<a href=\"https://ecdautodesign.com/2021/09/07/ecd-new-facility/\" target=\"_blank\">production center</a>, set to open in August. There, more than 60 employees and two production lines will have the capacity for 100 conversions a year.\n</p><p>\n\tWallace figures one in five customers will choose an electric power train, with the rest opting for more-traditional, hot-rod-style upgrades such as “LS swaps,” named after the LS family of Chevrolet V-8 gasoline engines. EV conversions here and elsewhere are seizing both imaginations and wallets, as classic-car fans focus on improved performance, reliability, and ease of maintenance, with the environmental benefits a green icing on the cake.\n</p><p>\n\tPorsches, Jaguars, Fiats, VW Beetles and Buses, even Ferraris, have all gone under the knife, with an increasing number of entrepreneurs serving this growing market. Some major automakers are even getting in on the act. They see a potential sideline in electric versions of the “<a href=\"https://spectrum.ieee.org/an-electric-motor-that-works-in-any-classic-car\" target=\"_self\">crate motors</a>” that they’ve sold for decades to hobbyists, hot-rodders, restorers, and racing teams.\n</p><p>\n<strong>The Land Rover</strong> Defender is a good candidate for conversion because it has long had a fanatical following, with 2 million units sold around the globe between 1948 and its retirement in 2016. Rover estimates that 70 percent of these hardy survivors—beginning with the Land Rover “Series” models, with the “Defender” name added in 1990—<a href=\"https://media.landrover.com/news/2015/04/land-rover-heritage-be-launched-techno-classica-show\" target=\"_blank\">remain on the road</a>.\n</p><p>\n\tDespite some cosmetic changes, and steadily upgraded power trains, the design of its stout-yet-primitive chassis barely changed for more than half a century. In America, Defenders have typically been weekend playthings for boomers with fond memories of \n\t<a href=\"https://en.wikipedia.org/wiki/Born_Free\" target=\"_blank\"><em>Born Free</em></a> or “<a href=\"https://en.wikipedia.org/wiki/Daktari\" target=\"_blank\">Daktari</a>”—a typical SUV buyer might run screaming after five minutes in this crude, jouncy beast. Roughly 7,000 Americans got their hands on a new Defender via the NAS models that Rover sold to Yanks between 1993 and 1995, with a final encore in 1997.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt='A photo of what is seen under the hood: a large metal box marked \"Powered by Tesla.\"' class=\"rm-shortcode\" data-rm-shortcode-id=\"dd077071781befb42f61bd8f8d867586\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5ba7c\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-of-what-is-seen-under-the-hood-a-large-metal-box-marked-powered-by-tesla.jpg?id=29692526&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Running at higher voltage is the car’s new electric power electronics, originally designed to propel a Tesla.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\tTheir rarity only fueled a desire for Defenders among U.S. car buyers, spawning a gray market for imports. Non-NAS Rovers were never officially “federalized” to meet U.S. regulatory standards, so that booming trade led to many confiscations, and at least one Defender crushing by border officials and the Department of Homeland Security.\n</p><p>\n\tTo avoid breaking the law, the Defender you import must be at least 25 years old. But even ratty junkyard specimens are now worth serious money as the starting point for Cinderella-like makeovers. Those taking on such a challenge benefit from the Defender’s rust-free aluminum body panels, born from necessity during the steel shortages of postwar England.\n</p><p>\n\tToday’s love affair with the Defender is just part of a larger craze. Nostalgic 4x4 trucks, including Toyota Land Cruisers and Jeeps, have never been more popular or prized. Ford took advantage with a rock-crawling, retro-tinged \n\t<a href=\"https://www.motortrend.com/reviews/2021-ford-bronco-first-drive-review/\" target=\"_blank\">Bronco</a>, revived in 2021: Its entire production sold out in advance for two years. And yes, <a href=\"https://spectrum.ieee.org/2021s-top-ten-tech-cars-land-rover-defender\" target=\"_self\">in 2020</a> Land Rover introduced the first fully redesigned Defender since the Second World War, one so posh and powerful that old-school fans might barely recognize it.\n</p><p>\n\tGiving an older Defender an electric powertrain doesn’t alter its charming looks, of course, nor its ability to conquer forbidding terrain. And while restorers are at it, they figure, there’s no harm in addressing long-standing design flaws or adding a few modern conveniences.\n</p><p>\n\tIn an outdoor courtyard at E.C.D., sit a motley group of Defenders and Range Rover Classics (an up-market model that Land Rover introduced in 1969) in various stages of construction. Two scabrous Defender pickups languish at one end, both soon to have their steel frames stripped to bare metal, dipped in molten zinc, and powder-coated. The results could pass for brand-new frames.\n</p><p class=\"pull-quote\">\n\tWith Tesla now building close to 1 million cars a year, conversion companies need only a tiny percentage to crash to fill their warehouses with needed components with needed components.\n</p><p>\n\tFarther down the line are somewhat newer Defender body panels waiting to be refurbished, hand-sanded, and then covered with Ferrari-quality \n\t<a href=\"https://us.ppgrefinish.com/PPG-Refinish/products.aspx\" target=\"_blank\">PPG paint</a>. Many customers choose a custom, one-off shade. Wallace recalls a woman tearing a strip of fabric from her dress to use as a color swatch, then accompanying a tech into the paint booth to help spray samples.\n</p><p>\n\tEach of E.C.D.’s electric conversions spends about 100 days moving through 20 discrete shop bays, where it undergoes about 2,200 person-hours of meticulous restoration.\n</p><p>\n\tIn a nearby office, a technician creates interactive animated renderings of ongoing projects, which owners can scrutinize from afar to make adjustments. A dizzying range of bespoke features includes seats upholstered in alligator or ostrich hide, audiophile sound systems, and \n\t<a href=\"https://www.warn.com/\" target=\"_blank\">Warn</a> winches for off-road recoveries.\n</p><p>\n\tThe buyer of the Defender I test-drove specified a teak-lined cargo area with boxed storage for his ski gear. E.C.D. had to create that yacht-style trim while still maintaining access to the Tesla batteries and cooling system below.\n</p><p>\n\tIn one work bay, I see the beefy drive unit from a Tesla peeking from the console space between front seats of this Defender, where the transfer case once lived. This drive unit was designed to send power through two half-shafts to the rear wheels of the Tesla Model S. For this application, the motor is pushed forward and rotated 90 degrees to drive both front and rear Rover axles, with the torque evenly split.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"This black-and-white image shows a 1954 Land Rover Series 1 model, a boxy vehicle with a flat windshield and its spare tire mounted on the hood. \" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"d30689d4f9f855f9940f4d9d2d23613e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3712d\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/this-black-and-white-image-shows-a-1954-land-rover-series-1-model-a-boxy-vehicle-with-a-flat-windshield-and-its-spare-tire-moun.jpg?id=29709037&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">The Defender is an outgrowth of Land Rover’s original Series 1 model, whose utilitarian lines are evident in this 1954 example.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">Land Rover</small></p><p>\n\tFor the Defender application, the single-speed Tesla motor unit required adding a limited-slip differential to divvy power between front and rear wheels, with a 50/50 torque split. The Rover’s axles and driveshafts are beefed up to withstand the electric motor’s immense power and torque. Project leaders explain to me that there’s no need for the low-range “crawl” gear typically found on such vehicles, because Tesla’s electric motor provides a whopping 475 newton-meters (350 pound-feet) of torque at zero speed.\n</p><p>\n\tThe biggest retrofitting challenge is finding space for motors and batteries in cars that were never designed for them—and ensuring the chassis can carry them safely and securely. Richard Morgan, the founder of Electric Classic Cars, says the stars aligned with the Defender: The drive unit fits perfectly between the Rover’s frame rails, with just a few millimeters to spare on either side. Fitting the batteries was harder, requiring the fabrication of custom battery cases.\n</p><p>\n\tAnd while safety experts emphasize that EVs are as safe as fossil-fueled cars in crashes, if not more so, customers still want reassurance, Morgan says. His systems look to match OEM safety standards as much as possible, with service disconnects, ground-fault monitors, and layers of redundancy.\n</p><p>\n\tBattery boxes use 3-millimeter-thick steel, unlike some electric conversions that use flimsy transparent plastic cases to show off the cells inside—Morgan will have none of that. “If you’ve got 280 kilos of batteries in a box, that needs to be strong and rigid in an impact,” he says.\n</p><p>\n\tThe original 12-volt electrical system remains, but only to run various low-power accessories. But with no engine to drive belts, Tesla’s 400-volt architecture handles the electric motors that provide for power steering, as well as for cooling pumps and the car’'s A/C compressor.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\" A photo showing a steel battery case being lowered by forklift into the rear of the car during refurbishment.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"056654a3af7466ec43fd7b22d7ae1874\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"3712f\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-showing-a-steel-battery-case-being-lowered-by-forklift-into-the-rear-of-the-car-during-refurbishment.jpg?id=29692566&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The traction batteries are split, some being housed under the hood and others [shown at left during installation] going beneath the rear seating.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\tWhile such a conversion is plenty challenging, Tesla’s electronics have been jailbroken by enterprising hackers, so E.C.D.’s techs have full access to throttle maps, regenerative-braking levels, thermal management, and so forth.\n</p><p>\n\tMorgan estimates that salvaged Teslas and other EVs provide about 40 percent of his motors and batteries. The rest are sourced new from Chinese suppliers such as \n\t<a href=\"https://www.catl.com/en/\" target=\"_blank\">CATL</a> (Contemporary Amperex Technology Co. Ltd.), which manufactures cells that also power new Teslas. With Tesla now building close to 1 million cars a year, conversion companies need only a tiny percentage to crash to fill their warehouses with needed components.\n</p><p>\n<strong>Morgan has heard</strong> griping from some purists who call what he is doing a sacrilege. They assert that ripping out a car’s internal-combustion-guts also tears out its soul.\n</p><p>\n\tHis response: “These are mass-produced classic cars,” not seven-figure Ferraris or other models whose stem-to-stern originality is integral to their value. He points out that removing “all the dirty and smelly bits” eliminates the stress, expense, and TLC required by classic cars—including finicky British and Italian cars. “I like classic cars to be used,” says Morgan.\n</p><p>\n\tTo that end, the Rover’s original electricals—from \n\t<a href=\"https://en.wikipedia.org/wiki/Lucas_Industries\" target=\"_blank\">Lucas Industries</a>, a company whose founder was sometimes called “the Prince of Darkness” for the notorious unreliability of its products in almost every U.K. car brand—are replaced. Technicians hand-assemble the 23 wiring harnesses required for each conversion. It all looks insanely complicated, but Wallace insists that swapping a fossil-fuel engine is, in many ways, a bigger headache. Electric conversions are far simpler, he asserts: “This is just a motor, a battery, and two driveshafts.”\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A photo showing wood paneling in the rear of the interior.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"f2f27c81ea876f76b8bf466d15abb464\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e6215\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-showing-wood-paneling-in-the-rear-of-the-interior.jpg?id=29692567&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The rear of this particular car also includes teak storage compartments.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\tMorgan and his colleagues freely admit that the environmental benefits of powering a car on electricity are largely an afterthought. “I’m a classic-car guy; I’m not coming at it from the save-the-planet side.”\n</p><p>\n\tYet these conversions \n\t<em>do</em> have environmental benefits. The most obvious one is zero tailpipe emissions. The more subtle one is giving second lives to two cars—the vintage Rover and the wrecked Tesla from which the motor and batteries came. A typical gasoline family car produces about 24 tonnes of CO<sub>2</sub> over its lifetime, versus 18 tonnes for a comparable EV. Yet <a href=\"https://www.zemo.org.uk/assets/workingdocuments/MC-P-11-15a%20Lifecycle%20emissions%20report.pdf\" target=\"_blank\">about 46 percent</a> of an EV’s lifetime emissions are generated during manufacturing, double those of an internal-combustion car. So, keeping that electric hardware on the road for as long as possible, where it can pay off through sharply reduced emissions, is indeed being kind to the planet.\n</p><p>\n<strong>On my test</strong> drive, the Rover turns the tables on late-model gasoline SUVs, this ancient truck transmogrified into a speedy tech avenger. Elliot Humble, riding shotgun, notes that every conversion gets 1,000 miles (about 1,600 km) of shakedown testing, all performed by a single technician.\n</p><p>\n\tThis Defender still steers like a farm implement, but that trait is just part of its boundless charm. The telltale hum of the Tesla motor is louder in this Rover than it is in a Model S, despite the many sound-deadening layers of \n\t<a href=\"https://kilmat.com/\" target=\"_blank\">Kilmat</a>, jute, and carpet that have been added.\n</p><p>\n\tBut an electric motor makes just a whisper compared with the din of a gasoline engine, let alone the clatter of a Rover diesel. A new air suspension enormously improves the car’s notoriously rough ride, and the body barely creaks. The upgraded brakes, a \n\t<a href=\"https://www.brembo.com/en\" target=\"_blank\">Brembo</a> system with six-piston front calipers, provide plenty of stopping power.\n</p><p class=\"pull-quote\">\n\tPull up to the valet line in this whisper-quiet Rover, and you’ll probably get as much attention as if you had arrived in a Ferrari or a Bentley.\n</p><p>\n\t“And it’s got modern fuses and relays—things that actually work,” Humble says as we ride. “No more glass fuses wrapped in tinfoil to stay on.”\n</p><p>\n\tFor Project Britton, niceties include \n\t<a href=\"https://www.recaro-automotive.com/us/\" target=\"_blank\">Recaro</a> seats swaddled in diamond-stitched leather and an <a href=\"https://www.alpine-usa.com/product/alpine-halo11-multimedia-receiver-ilxf411\" target=\"_blank\">Alpine Halo</a> audio system. The appeal is clear: In such status-conscious places as Napa Valley or the Hamptons, a Tesla Model S might as well be a Toyota Camry now. But pull up to the valet line in this whisper-quiet Rover, and you’ll draw as much attention as if you had arrived in a Ferrari or a Bentley.\n</p><p>\n\t“At the end of the day, it’s a toy, isn’t it?” Humble says. “We could all get by with a 1.6-liter petrol engine. But it’s about having something no one else has.”\n</p><p>\n\tIt’s also about having your cake and eating it too—at least for people who can afford the rich frosting. E.C.D. Defenders start from $209,000, and the Tesla-based drivetrain adds roughly $40,000. Add a la carte upgrades, and these electrified dream machines hover around $300,000.\n</p><p>\n\tFor do-it-yourselfers who choke on those prices, there are less expensive options. \n\t<a href=\"https://electricgt.com/\" target=\"_blank\">Electric GT</a>’s Tesla motor-swap system, for example, costs about $40,000 and includes a drive unit, power module, battery-management system, and more. And Electric Classic Cars is developing a bolt-in conversion kit for vintage Mini Coopers, in tandem with <a href=\"https://www.supercoopers.com/\" target=\"_blank\">Super Coopers</a> in Buellton, Calif. Like Electric GT’s kits, it features connectors-for-dummies that don’t allow, say, a positive lead to plug into a negative terminal.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A photo showing the completed car being recharged. \" class=\"rm-shortcode\" data-rm-shortcode-id=\"930278f771a04bde3cfabca7a69842bf\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"6ebe7\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-photo-showing-the-completed-car-being-recharged.jpg?id=29692756&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The result is a superbly restored vehicle, but one that the owner can now plug in rather than fuel up. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">E.C.D. Automotive Design</small>\n</p><p>\n\t“With an EV, you’ve got to know more about what you’re doing,” Morgan says. “If you pick up the wrong end of a 400-volt DC cable, something bad’s going to happen. But [with such kits], you don’t need special high-voltage knowledge.”\n</p><p>\n\tSystems can be installed in as little as two days by a pair of experienced technicians—or more slowly by a handy owner with the help of a skilled pal. Such kits are a modern take on the electric conversions that became popular with some enthusiasts starting in the 1970s, before it was possible to buy a new electric car.\n</p><p>\n\tMajor automakers, which together \n\t<a href=\"https://www.reuters.com/article/electric-vehicles-investment-idCNL1N2RZ1CB\" target=\"_blank\">will be spending hundreds of billions</a> of dollars to evolve into EV companies, may offer such kits themselves in an effort to squeeze as much revenue as possible from that pricey investment. In 2020, for example, General Motors announced it would <a href=\"https://arstechnica.com/cars/2020/10/chevrolet-readies-an-electric-crate-motor-for-homebuilt-ev-hotrods/\" target=\"_blank\">sell a conversion kit</a> based on the Chevrolet Bolt—although that kit is yet to go on sale.\n</p><p>\n\tFor now, electric conversions remain a tiny niche in the massive business of restorations and aftermarket equipment. But as EVs mature, the generations that grow up driving them might view today’s plug-ins as the classic cars \n\t<em>they </em>aspire to own, improve, and restore—having no fondness at all for those oil-leaking, exhaust-spewing oddities their grandparents once drove. <span class=\"ieee-end-mark\"></span>\n</p><p>\n<em>This article appears in the May 2022 print issue as “Tesla Inside.”</em>\n</p>",
  "pubDate": "Sat, 23 Apr 2022 15:00:01 +0000",
  "guid": "https://spectrum.ieee.org/electric-land-rover",
  "category": [
    "Electric vehicles",
    "Evs"
  ],
  "dc:creator": "Lawrence Ulrich",
  "media:content": ""
}