{
  "id": "yt:video:S7usqwT-ty4",
  "yt:videoId": "S7usqwT-ty4",
  "yt:channelId": "UCMmaBzfCCwZ2KqaBJjkj0fw",
  "title": "Ukraine Continues Attacking - Russian Invasion DOCUMENTARY",
  "link": "",
  "author": {
    "name": "Kings and Generals",
    "uri": "https://www.youtube.com/channel/UCMmaBzfCCwZ2KqaBJjkj0fw"
  },
  "published": "2022-10-20T12:59:49+00:00",
  "updated": "2022-10-21T09:43:48+00:00",
  "media:group": {
    "media:title": "Ukraine Continues Attacking - Russian Invasion DOCUMENTARY",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Purchase shares in great masterpieces from artists like Pablo Picasso, Banksy, Andy Warhol, and more: https://www.masterworks.art/kingsandgenerals 🎨\nSee important Regulation A disclosures at masterworks.io/cd. \n*Average net returns/Net IRR\" reflects annualized return on investment, net of all fees and expenses. Past performance is not indicative of future results. **Dollar-weighted estimated annualized returns [IRR] of the Masterworks portfolio from inception through June 30, 2022, net of fees and expenses.\n\nKings and Generals animated historical documentary series on Modern Warfare continues with the aftermath of the first phase of the Russian Invasion of Ukraine in 2022 (https://youtu.be/yBZPE9o2gHU). Previously we talked about the build-up to the new stage of the Russo-Ukrainian War, how Putin's unprovoked invasion of Ukraine continued, and covered events between February 24th and April 7th, as we saw how Ukraine managed to win the first phase of the war. This set up the second phase of the war - battle of Donbas. In the previous video we covered the events of April of 2022 (https://youtu.be/K2N_fHKrWIg) including the sinking of the rocket cruiser Moskva - https://www.youtube.com/watch?v=QvB2CPpdTMY, and how the conflict turned into the war of attrition in May (https://youtu.be/D-93q4GMFT0) and continued with Russia's best month in June (https://youtu.be/SIm4mQihHdA). In the video dedicated to July - the 5th month of the war, we talked about the arrival of the HIMARS systems which strengthened Ukrainian positions and changed the war (https://youtu.be/WS0D0X8V6rg), while this video will focus on the events of August, as we will see how Russian logistics and manpower problems were worsened by the HIMARS strikes, the risk and intrigue around the Zaporizhia (Enerhodar) Nuclear Powerplant and the long expected beginning of the Ukrainian counter-offensive in Kherson (https://youtu.be/2hZoQ4xebGw). Previously we discussed the Kherson counteroffensive in the first 2 weeks of September and showed how the Ukrainian counteroffensive in Kharkiv Oblast - Balakliya-Izium counter-offensive succeeded, pushing the Russians across Oskil and Lyman (https://youtu.be/gJRjKuss_Co) This video will continue with the events of the second half of September\n\nPacific War Series: https://youtu.be/MEgIHN63ojU?list=PLaBYW76inbX4kE52CPUvx8gZ7CQyjweEg\nCold War channel: http://bit.ly/2UHebLI\nModern Warfare series: http://bit.ly/2W2SeXF\nBattle of Khalkhin Gol 1939: https://youtu.be/GGwUlET2tbw \nWinter War: https://youtu.be/1Uk5bY22RSE\nGreco-Italian War, Battle of Greece, Battle of Crete: https://youtu.be/_jDBQijICTo\nSoviet Invasion of Afghanistan - Operation Storm-333: https://youtu.be/bpm5dPIULF0\nGerman Raiders in the Pacific: https://youtu.be/JbiWX9pkWns\nBattle of Hong Kong 1941: https://youtu.be/TrqlSSA2xUc\nItalian Raids on Alexandria and Gibraltar: Italian Raids on Alexandria and Gibraltar\nBattle of Taranto 1940: https://youtu.be/Wdbel62kZl0\nSihang Warehouse 1937 - Chinese Thermopylae: https://youtu.be/IxpG19OTmns\n\nSupport us on Patreon: http://www.patreon.com/KingsandGenerals or Paypal: http://paypal.me/kingsandgenerals or by joining the youtube membership: https://www.youtube.com/channel/UCMmaBzfCCwZ2KqaBJjkj0fw/join We are grateful to our patrons and sponsors, who made this video possible: https://docs.google.com/document/d/1ooKPbpq0z8ciEjz5Zmrga4-gWRmripm0u4BHMkkXHVc/edit?usp=sharing\n\nThe video was made by Leif Sick, while the script was developed by Turgut Gambar (https://youtube.com/c/ThePacificWarChannel). The video was narrated by Officially Devin (https://www.youtube.com/user/OfficiallyDevin)\n\n✔ Merch store ► https://teespring.com/stores/kingsandgenerals\n✔ Patreon ► https://www.patreon.com/KingsandGenerals\n✔ Podcast ► http://www.kingsandgenerals.net/podcast/\n✔ PayPal ► http://paypal.me/kingsandgenerals\n✔ Twitter ► https://twitter.com/KingsGenerals\n✔ Facebook ► https://www.facebook.com/KingsGenerals\n✔ Instagram ►http://www.instagram.com/Kings_Generals\n\nProduction Music courtesy of Epidemic Sound: http://www.epidemicsound.com\n\n#Documentary #RussianInvasion #RussoUkrainianWar",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}