{
  "title": "Can Malaysia effectively ban tobacco?",
  "link": "https://www.eastasiaforum.org/2022/11/05/can-malaysia-effectively-ban-tobacco/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=can-malaysia-effectively-ban-tobacco",
  "comments": "https://www.eastasiaforum.org/2022/11/05/can-malaysia-effectively-ban-tobacco/#respond",
  "dc:creator": "Sumit Kane",
  "pubDate": "Fri, 04 Nov 2022 23:00:15 +0000",
  "category": [
    "Economic Policy",
    "Health",
    "Malaysia",
    "Regulation",
    "externalities",
    "health policy",
    "malaysia health",
    "Malaysia Legislation",
    "malaysia policy",
    "Malaysia regulations",
    "Tobacco regulation"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1316617",
  "description": "<p>Authors: Ajay Mahal and Sumit Kane, University of Melbourne The Control of Tobacco Products and Smoking Bill 2022 currently under parliamentary examination marks a dramatic change in Malaysia’s strategy to limit tobacco consumption. Among its provisions are the prohibition of the sale, purchase and possession of cigarettes, tobacco and vaping products as well as a [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/05/can-malaysia-effectively-ban-tobacco/\">Can Malaysia effectively ban tobacco?</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Authors: Ajay Mahal and Sumit Kane, University of Melbourne</p>\n<p>The Control of Tobacco Products and Smoking Bill 2022 currently under parliamentary examination marks a dramatic change in Malaysia’s strategy to limit tobacco consumption. Among its provisions are the prohibition of the sale, purchase and possession of cigarettes, tobacco and vaping products as well as a ban on cigarette smoking, tobacco use and vaping among those born after 1 January 2007. <span id=\"more-1316617\"></span></p>\n<p><img class=\"aligncenter wp-image-1316630 size-medium\" title=\"Malaysia's Prime Minister Ismail Sabri walks with Finance Minister Tengku Zafrul as they arrive to present the 2023 budget at the parliament house in Kuala Lumpur, Malaysia, 7 October 2022 (Photo: Reuters/Nazri Rapaai).\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-400x267.jpg\" alt=\"Malaysia's Prime Minister Ismail Sabri walks with Finance Minister Tengku Zafrul as they arrive to present the 2023 budget at the parliament house in Kuala Lumpur, Malaysia, 7 October 2022 (Photo: Reuters/Nazri Rapaai).\" width=\"400\" height=\"267\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-400x267.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-600x400.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-150x100.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-768x512.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-1536x1024.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-300x200.jpg 300w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-100x67.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2022-10-07T095022Z_679009990_RC26WW9AW7RF_RTRMADP_3_MALAYSIA-ECONOMY-BUDGET-500x333.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>Accompanying these provisions are enforcement mechanisms, including monetary fines for users. If <a href=\"https://www.thestar.com.my/news/nation/2022/08/03/further-scrutiny-for-geg-bill\" target=\"_blank\" rel=\"noopener noreferrer\">the bill passes</a>, Malaysia would join New Zealand as the only other country that has introduced legislation to promote a ‘generational end’ to tobacco use. It is not hard to see why Malaysia would want to pursue legislation to limit smoking among younger age groups and future generations.</p>\n<p>More than one-fifth of Malaysians over 15 years of age currently smoke, the average age of smoking initiation is 18 years old and there are high rates of <a href=\"https://iku.gov.my/images/IKU/Document/REPORT/NHMS2019/Report_NHMS2019-NCD.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">vaping product</a> use among younger populations. Almost 20,000 Malaysians are <a href=\"https://pubmed.ncbi.nlm.nih.gov/35702648/\" target=\"_blank\" rel=\"noopener noreferrer\">estimated to die annually</a> from the use of tobacco products. Smoking and tobacco use are major drivers of ischemic heart disease, stroke, chronic obstructive pulmonary disease and lung cancer — the <a href=\"https://www.healthdata.org/malaysia\" target=\"_blank\" rel=\"noopener noreferrer\">top causes of disease burden</a> in Malaysia.</p>\n<p>Many of these conditions are <a href=\"https://www.eastasiaforum.org/2020/05/15/malaysia-needs-innovative-fiscal-measures-for-sustainable-health-financing/\" target=\"_blank\" rel=\"noopener noreferrer\">expensive to treat</a>, so there is a <a href=\"https://www.healthaffairs.org/doi/10.1377/hlthaff.2015.0863\" target=\"_blank\" rel=\"noopener noreferrer\">significant budgetary impact</a> from the heavy subsidisation of health services. Smoking initiation at an earlier age is associated with an increased risk of transitioning to greater smoking and drug use. <a href=\"https://www.eastasiaforum.org/2022/03/04/malaysias-need-for-universal-child-benefits/\" target=\"_blank\" rel=\"noopener noreferrer\">Younger populations</a> discount the future at <a href=\"https://journal.sjdm.org/8816/jdm8816.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">much higher rates</a> than the average person, <a href=\"https://pubmed.ncbi.nlm.nih.gov/29986103/\" target=\"_blank\" rel=\"noopener noreferrer\">highlighting the importance</a> of early public intervention. Another concern is the significant negative externalities of smoker behaviours in the form of second-hand smoking experienced by non-smokers.</p>\n<p>Malaysia already has a host of restrictions on smoking and tobacco use. The Control of Tobacco Use Regulations 2004, and subsequent amendments, impose major restrictions on tobacco sales and advertising. There are also additional sales taxes on tobacco products, amounting to almost 60 per cent of the retail price, which are likely to reduce consumption.</p>\n<p>But tobacco taxes need to be constantly revised upwards to combat the effects of rising incomes. That is not always politically or technically easy. There are also incentives for the Ministry of Health, the driving force behind the current bill, given the significant share of hospital expenditures in its budget. At 60 per cent, it is among the highest in the world. The Ministry is being challenged by tight budget constraints and a lack of access to revenue from the tobacco tax. The bill signals a stronger government commitment to lowering tobacco use in the country.</p>\n<p>There is some evidence that partial bans on smoking and tobacco use in public places and transportation can be effective. Bans on smoking in public places have <a href=\"https://docs.iza.org/dp11631.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">reduced hospitalisations</a> in Germany. But this conclusion is not universal. The impacts of partial bans are <a href=\"https://www.cochranelibrary.com/cdsr/doi/10.1002/14651858.CD011856.pub2/full\" target=\"_blank\" rel=\"noopener noreferrer\">context-dependent</a>, and the methodologies used to evaluate these impacts are generally weak.</p>\n<p>None of the previously evaluated policies involved a comprehensive ban of the kind envisaged under the Control of Tobacco Products and Smoking Bill 2022. There is no real-world experience with a comprehensive ban on tobacco use and sales. One must then look to the impacts of policies on alcohol and drugs that have involved such bans. These are concerning, even if we disregard the tobacco industry’s concerns about job losses and adverse macroeconomic impacts.</p>\n<p>Prohibition in the United States during 1920–33 and <a href=\"https://www.orfonline.org/research/experiments-in-alcohol-prohibition/\" target=\"_blank\" rel=\"noopener noreferrer\">in India</a>, more recently, increased <a href=\"https://www.cato.org/policy-analysis/alcohol-prohibition-was-failure\" target=\"_blank\" rel=\"noopener noreferrer\">criminal activity and illicit products</a>. The loss of tax revenue had follow-on impacts, and these outcomes ultimately led to reversals of prohibition policies in both the United States and several Indian states.</p>\n<p>Enforcement costs will likely rise dramatically as law enforcement officers chase after small-time users and suspected users. That might result in abuses of power, which have been a major concern during discussions about the bill in Malaysia. The health impacts are not guaranteed if less quality-controlled products emerge in the illicit market or if consumers move to other products such as alcohol or drugs.</p>\n<p>The core public health principles underpinning this policy are sound and, under conditions of perfect implementation, could deliver remarkable population health gains. But policies, including the Tobacco and Smoking Products Control Bill of 2022, live or die on the implementation battlefront.</p>\n<p>While the adage ‘nothing ventured, nothing gained’ generally holds true, in policy matters, the cost of failure is high and second chances are hard to come by. That raises key questions for the Parliamentary Select Committee of Malaysia over the feasibility and timing of this complex multi-sectoral policy.</p>\n<p>Parliaments and governments have significant resources and power. To get the implementation of this policy right, both would need to be mobilised and applied in a sustained manner. The question remains whether the parliament and government are willing and able to do this.</p>\n<p><em>Ajay Mahal is Professor, Deputy Director and Unit Head of Emerging Programs in Global Health, Nossal Institute for Global Health, The University of Melbourne.</em></p>\n<p><em>Sumit Kane is Associate Professor and Unit Head of Social & Cultural Dimensions of Health Systems, Nossal Institute for Global Health, The University of Melbourne.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/05/can-malaysia-effectively-ban-tobacco/\">Can Malaysia effectively ban tobacco?</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/05/can-malaysia-effectively-ban-tobacco/feed/",
  "slash:comments": 0,
  "post-id": 1316617
}