{
  "id": "yt:video:ABYBtcM2D28",
  "yt:videoId": "ABYBtcM2D28",
  "yt:channelId": "UCsooa4yRKGN_zEE8iknghZA",
  "title": "Would you stop dating someone your parents didn’t like?",
  "link": "",
  "author": {
    "name": "TED-Ed",
    "uri": "https://www.youtube.com/channel/UCsooa4yRKGN_zEE8iknghZA"
  },
  "published": "2022-10-04T15:00:59+00:00",
  "updated": "2022-10-07T18:54:32+00:00",
  "media:group": {
    "media:title": "Would you stop dating someone your parents didn’t like?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Dig into the Romeo and Juliet Effect, which describes the tendency to find someone more desirable when met by parental opposition.\n\n--\n\nIn 1972, psychologists at the University of Colorado surveyed 140 couples to determine whether a relationship facing parental disapproval was more likely to strengthen or crumble under the pressure. Can long-term success of a romantic relationship be predicted by the perceived approval or disapproval of the couple’s friends and family? Dig into the trend known as the Romeo and Juliet Effect.\n\nDirected by Maryna Buchynska, and action creative agency.\n\nThis video made possible in collaboration with Character Lab\nLearn more about how TED-Ed partnerships work: https://bit.ly/TEDEdPartners\n\nA special thanks to H. Colleen Sinclair and Diane Felmlee who provided information and insights for the development of this video.\n\nSupport Our Non-Profit Mission\n----------------------------------------------\nSupport us on Patreon: http://bit.ly/TEDEdPatreon\nCheck out our merch: http://bit.ly/TEDEDShop\n----------------------------------------------\n\nConnect With Us\n----------------------------------------------\nSign up for our newsletter: http://bit.ly/TEDEdNewsletter\nFollow us on Facebook: http://bit.ly/TEDEdFacebook\nFind us on Twitter: http://bit.ly/TEDEdTwitter\nPeep us on Instagram: http://bit.ly/TEDEdInstagram\n----------------------------------------------\n\nKeep Learning\n----------------------------------------------\nView full lesson: https://ed.ted.com/lessons/would-you-stop-dating-someone-your-parents-didn-t-like\nDig deeper with additional resources: https://ed.ted.com/lessons/would-you-stop-dating-someone-your-parents-didn-t-like#digdeeper\n\nAnimator's website: https://and-action.net/\n----------------------------------------------\n\nThank you so much to our patrons for your support! Without you this video would not be possible! Barbara Smalley, Megan Douglas, Tim Leistikow, Ka-Hei Law, Hiroshi Uchiyama, Mark Morris, Misaki Sato, EdoKun, SookKwan Loong, Bev Millar, Lex Azevedo, Michael Aquilina, Jason A Saslow, Yansong Li, Cristóbal Moenne, Dawn Jordan, Prasanth Mathialagan, Samuel Doerle, David Rosario, Dominik Kugelmann - they-them, Siamak Hajizadeh, Ryohky Araya, Mayank Kaul, Christophe Dessalles, Heather Slater, Sandra Tersluisen, Zhexi Shan, Bárbara Nazaré, Andrea Feliz, Victor E Karhel, Sydney Evans, Latora, Noel Situ, emily lam, Sid, Niccolò Frassetto, Mana, I'm here because of Knowledge Fight Facebook group., Linda Freedman, Edgardo Cuellar, Jaspar Carmichael-Jack, Michael Burton, VIVIANA A GARCIA BESNE, The Vernon's, Olha Bahatiuk, Jesús Bíquez Talayero, Chels Raknrl, Sai Pranavi Jonnalagadda, Stuart Rice, Jing Chen, Vector-Dopamine math, Jasper Song, Giorgio Bugnatelli, Chardon, Eddy Trochez, OnlineBookClub.org, Eric Shear, Leith Salem, Omar Hicham and Adrian Rotaru.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}