{
  "guid": "urn:uuid:9f59677f-4571-439b-bc73-962e0949cb66",
  "link": "https://www.who.int/news/item/13-03-2022-stop-attacks-on-health-care-in-ukraine",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Stop attacks on health care in Ukraine",
  "description": "<p>&ldquo;Today,&nbsp;we&nbsp;call for an immediate cessation of&nbsp;all attacks on health&nbsp;care in Ukraine. These horrific attacks are killing and causing serious injuries to patients and health workers, destroying vital health infrastructure and forcing thousands to forgo accessing health services despite catastrophic needs.</p><p>\"To attack the most vulnerable &ndash; babies, children, pregnant women, and those already suffering from illness and disease, and health workers risking their own lives to save lives &ndash; is an act of unconscionable cruelty.</p><p>&ldquo;In Ukraine, since the start of the war, 31 attacks on health care have been documented via the <a href=\"https://extranet.who.int/ssa/LeftMenu/Index.aspx?utm_source=Stopping%20attacks%20on%20health%20care%20QandA&amp;utm_medium=link&amp;utm_campaign=Link_who\">WHO&rsquo;s Surveillance System for Attacks on Health Care (SSA).</a> According to these reports, in 24 incidents health care facilities were damaged or destroyed, while in five cases ambulances were damaged or destroyed. These attacks have led to at least 12 deaths and 34 injuries, and affected access to and availability of essential health services. WHO is verifying further reports, as attacks continue to be reported despite the calls for protection of health care.</p><p>&ldquo;Attacks on health care and health workers directly impact people&rsquo;s ability to access essential health services &ndash; especially women, children and other vulnerable groups. We have already seen that the health care needs of pregnant women, new mothers, younger children and older people inside Ukraine are rising, while access to services is being severely limited by the violence.</p><p>&ldquo;For example, more than 4,300 births have occurred in Ukraine since the start of war and 80,000 Ukrainian women are expected to give birth in next three months. Oxygen and medical supplies, including for the management of pregnancy complications, are running dangerously low.<br />&ldquo;The health care system in Ukraine is clearly under significant strain, and its collapse would be a catastrophe. Every effort must be made to prevent this from happening.</p><p>&ldquo;International humanitarian and human rights law must be upheld, and the protection of civilians must be our top priority.</p><p>&ldquo;Humanitarian partners and health care workers must be able to safely maintain and strengthen essential&nbsp;health&nbsp;service&nbsp;delivery, including immunization against COVID-19 and polio,&nbsp;and the supply of life-saving medicines for civilians across Ukraine as well as to refugees crossing into neighbouring countries. Health services should be systematically available at border crossings, including rapid care and referral processes for children and pregnant women.&nbsp;  &ldquo;It is critical that humanitarian actors have safe and unimpeded access to reach ALL civilians in need wherever they may be. UNICEF, UNFPA and WHO are working with partners to scale up life-saving services and support to meet urgent health needs. We must be able to safely deliver emergency medical supplies &ndash; including those required for obstetric and neonatal care &ndash; to health centers, temporary facilities and underground shelters.</p><p>&ldquo;Health care and services should be protected from all acts of violence and obstruction. Amidst the ongoing COVID-19 pandemic, which has already put health systems and health care workers under enormous strain, such attacks have the potential to be even more devastating for the civilian population. For the sake of health workers, and for all people in Ukraine who need access to the lifesaving services they provide, attacks on all health care and other civilian infrastructure must stop.</p><p>&ldquo;Finally, we call for an immediate ceasefire, which includes unhindered access so that people in need can access humanitarian assistance. A peaceful resolution to end the war in Ukraine is possible.&rdquo;</p><p>&nbsp;</p><p><strong>Signatures:</strong></p><ul><li><strong>UNICEF </strong>Catherine Russell, Executive Director<strong></strong></li><li><strong>UNFPA </strong>Dr. Natalia Kanem, Executive Director<strong></strong></li><li><strong>WHO </strong>Dr.<strong> </strong>Tedros Adhanom Ghebreyesus, Director-General</li></ul><p>&nbsp;</p>",
  "pubDate": "Sun, 13 Mar 2022 15:39:21 Z"
}