{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-663519889483315100",
  "published": "2019-10-30T08:21:00.000-07:00",
  "updated": "2020-01-07T13:31:04.780-08:00",
  "category": "",
  "title": "My Path to Google - Mizuki Hsu, Community Inclusion Advisor",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Welcome to the 38th installment of our blog series “My Path to Google.” These are real stories from Googlers, interns, and alumni highlighting how they got to Google, what their roles are like, and even some tips on how to prepare for interviews.<br /><br />Today’s post is all about Mizuki Hsu. Read on!<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-g4FuX-nYKYs/XbdnDDikaeI/AAAAAAAAAtY/ez43axdd7qsICc1fqpvkRor3NZjUxHzNACEwYBhgL/s1600/_MG_3655.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1067\" data-original-width=\"1600\" height=\"425\" src=\"https://1.bp.blogspot.com/-g4FuX-nYKYs/XbdnDDikaeI/AAAAAAAAAtY/ez43axdd7qsICc1fqpvkRor3NZjUxHzNACEwYBhgL/s640/_MG_3655.jpg\" width=\"640\" /></a></div><b>Can you tell us a bit about yourself?</b><br />I was born and raised in Kyoto, Japan. When I was 2 years old, all of a sudden I got a mobility disability. Regardless of countless medical examinations, the doctors couldn’t find the exact cause of my disability. Since then, I have been living as a person with a disability.<br /><br />Thanks to my parents who are strong advocates for me, I could access general education, which wasn’t common for kids with disabilities. All of my teachers and friends were supportive, however, my school wasn’t accessible for wheelchair users. Most public schools in Japan still have only stairs, even today. Therefore, I had to go up and down stairs by sitting then lifting myself up stair by stair everyday from elementary school to high school.<br /><br />After I finished 2 years of college in Japan, I transferred to the University of Wisconsin-River Falls in the U.S. where I majored in communication and international studies. Living and studying in the US changed my life completely. I found that I had equal opportunities and access to almost everything. I also learned how to advocate for myself and show my appreciation by saying “thank you” to the people who help me, instead of saying “sorry.”<br /><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto; text-align: center;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://1.bp.blogspot.com/-4xvFe3ObJGw/XbdobW2QyyI/AAAAAAAAAtg/jTSYx_yMdNg6Augr4X37u8oUwOrOZGOWwCLcBGAsYHQ/s1600/DSC07450.ARW.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"1067\" data-original-width=\"1600\" height=\"426\" src=\"https://1.bp.blogspot.com/-4xvFe3ObJGw/XbdobW2QyyI/AAAAAAAAAtg/jTSYx_yMdNg6Augr4X37u8oUwOrOZGOWwCLcBGAsYHQ/s640/DSC07450.ARW.jpg\" width=\"640\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Mizuki with her husband, Jeff, and their daughter, Emma.</td></tr></tbody></table><br />I returned to Japan with a bachelor’s degree and started job hunting in Tokyo. However, I faced unexpected difficulties. Japan has a quota system for the employment of People with Disabilities (PwD). Because of that, I found that most companies focused on my disability first, not my abilities. I received a lot of email replies saying “Sorry, we are not hiring a person with disabilities.” Some companies offered me a job interview, but they limited job positions for PwD. Therefore, it was really hard to find a company that truly saw me as a candidate.<br /><br /><b>Can you tell us about your decision to enter the process?</b><br />After I returned to Japan, I wanted to continue my research of PwD employment. I was accepted to a graduate school in Tokyo and waiting for school to start, which was five months away.<br /><a href=\"https://1.bp.blogspot.com/-YC5IjzM-yUo/XbdpPdAM2iI/AAAAAAAAAto/3nWuKgZNAA4w-PpAIBHk6iAeEWmDBuMbgCLcBGAsYHQ/s1600/_K9A1363.JPG\" imageanchor=\"1\" style=\"clear: left; float: left; margin-bottom: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1067\" data-original-width=\"1600\" height=\"426\" src=\"https://1.bp.blogspot.com/-YC5IjzM-yUo/XbdpPdAM2iI/AAAAAAAAAto/3nWuKgZNAA4w-PpAIBHk6iAeEWmDBuMbgCLcBGAsYHQ/s640/_K9A1363.JPG\" width=\"640\" /></a>I contacted some companies where I had connections for my research, and asked for a short-time job that I could do until the graduate school started. One of the places was <a href=\"https://goo.gle/2pHlKXQ\">Google Japan</a>. They recommended an internship program and I gave it a try.<br /><br />Two months after I joined Google, my mind had changed. I wanted to work longer than four months (the original internship period), because of the unique working environment. My manager and team members were very supportive and I was able to become a full time employee.<br /><div><br /></div><b>What’s your role at Google?</b><br />I am a Community Inclusion Advisor on the Employee Engagement team supporting various kinds of underrepresented groups across the globe and raising awareness about diversity, equity and inclusion (DEI). I love this job because each employee cares about DEI.<br /><br />I’m currently working on a global project to create office accessibility guidelines by partnering with other teams who manage office facilities and accommodations. If the project goes well, it would make Googlers and visitors with disabilities feel more included at Google.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-DeQfxMakBGw/Xbdp-7ABu0I/AAAAAAAAAt0/Zky3l-uZqMIUVnWji36CLHVV0mVcME0IQCLcBGAsYHQ/s1600/IMG_8326.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"400\" src=\"https://1.bp.blogspot.com/-DeQfxMakBGw/Xbdp-7ABu0I/AAAAAAAAAt0/Zky3l-uZqMIUVnWji36CLHVV0mVcME0IQCLcBGAsYHQ/s400/IMG_8326.JPG\" width=\"300\" /></a></div><br /><b>What inspires you to come in every day?</b><br />I’ve been working at Google for more than two years, and I still feel like it’s is a very special place. Coming to the office is like traveling to a foreign country. We have a diverse group of people with a variety of unique experiences and ideas, so I learn new things everyday.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-8iXxU2Qwt8k/XbdqQurjLoI/AAAAAAAAAt8/4IrHYg_MSzU8XAgX8HKtNVBVTN44uKcjgCLcBGAsYHQ/s1600/IMG_9577.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1600\" data-original-width=\"1200\" height=\"400\" src=\"https://1.bp.blogspot.com/-8iXxU2Qwt8k/XbdqQurjLoI/AAAAAAAAAt8/4IrHYg_MSzU8XAgX8HKtNVBVTN44uKcjgCLcBGAsYHQ/s400/IMG_9577.JPG\" width=\"300\" /></a></div><div><br /></div><b>What do you wish you’d known when you started the recruitment process?</b><br />My experience was very good. I didn’t request any accommodation personally, but I was surprised how Google offers accommodation for candidates from the beginning of the interview process. That was something I hadn’t been asked in a job interview at other companies.<br /><br /><div style=\"text-align: left;\"><b>Do you have any tips you’d like to share with aspiring Googlers?</b></div>I would recommend you spend time on what you are very good at or passionate about, and become an expert in the field. By doing so, you will feel more confident in yourself and there is nothing to be afraid of taking on a challenging opportunity.<br /><b><br /></b><br /><div style=\"text-align: left;\">Learn more about Mizuki’s story on her <a href=\"https://moonrider7.com/en/\">blog</a>.</div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 9
}