{
  "title": "The Edition: Can Elon Musk take on the tech censors?",
  "link": "https://audioboom.com/posts/8074485",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1487,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In this week’s episode: Is Elon Musk heading for a clash with the British Government over free speech?</div>\n<div><br>\n</div>\n<div>Elon Musk is buying Twitter. But might the Tesla CEO be in for a battle he wasn’t expecting with the UK government? <em>Spectator</em> Editor Fraser Nelson writes about this potential clash in this week’s issue and he joins the podcast to expand on his thesis. (00:49)</div>\n<div><br>\n</div>\n<div>Also this week: Where is it ever ok to stare at someone? </div>\n<div><br>\n</div>\n<div>If you’ve been on the tube recently you might have spotted a rather startling sign. This poster warns passengers about intrusive staring on public transport, so as to protect women from feeling intimidated on their commute. But who, we ask, will speak up for those who love staring at people on public transport? The answer is Cosmo Landesman who defends his love of people watching in this week’s <em>Spectator</em>. He joins the podcast along with Emily Hill who also has written for us on how silly she thinks this policy is. (09:56)</div>\n<div><br>\n</div>\n<div>And finally: Is getting a fringe a cry for help? </div>\n<div><br>\n</div>\n<div>Martha Gill writes in this week’s <em>Spectator</em> on the subject of fringes. Why have they come to signify a difficult or traumatic phase in a woman’s life? She joins the podcast along with celebrity hairdresser Cristiano Basciu who has a defence of the fringe. (17:35)</div>\n<div><br>\n</div>\n<div>Hosted by Lara Prendergast and William Moore</div>\n<div><br>\n</div>\n<div>Produced by Sam Holmes</div>\n<div><br>\n</div>\n<div>Subscribe to <em>The Spectator</em> today and get a £20 Amazon gift voucher:<a href=\"http://www.spectator.co.uk/voucher\">www.spectator.co.uk/voucher</a>\n</div>\n<div><br>\n</div>\n<div>Listen to Lara's food podcast <em>Table Talk</em>: <a href=\"https://www.spectator.co.uk/podcasts/table-talk\">https://www.spectator.co.uk/podcasts/table-talk</a>\n</div>\n",
  "pubDate": "Thu, 28 Apr 2022 15:55:56 +0000",
  "guid": "tag:audioboom.com,2022-04-28:/posts/8074485",
  "itunes:author": "The Spectator",
  "dc:creator": "The Spectator",
  "media:rights": ""
}