{
  "title": "Ep 431: The Grape Mini-Series -- Sémillon",
  "itunes:title": "The Grape Mini-Series -- Sémillon",
  "pubDate": "Mon, 27 Jun 2022 17:31:39 +0000",
  "guid": "317d8e09-2df2-4971-8b4a-263d0004a84d",
  "link": "https://winefornormalpeople.libsyn.com/ep-431-the-grape-mini-series-smillon",
  "itunes:image": "",
  "description": "<p>Sémillon used to be the most planted white grape in the world. From its native home in France to Australia, Chile, South Africa, Argentina, and beyond, it was planted <em>en masse</em> to pump out large quantities of flavorless bulk white wine. The problem was that Sémillon doesn’t cooperate when it’s forced to high yields. It loses acidity and it lacks flavor unlike some other grapes that can still muster some umph when over-cropped (Chenin blanc, Sauvignon blanc, Colombard, to name three).  For this reason, plantings were replaced and the grape became unpopular.</p> <p><a href=\"http://www.bordeaux.com\" target=\"_blank\" rel= \"noopener\"><img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/Semillon-10.jpeg\" alt= \"\" width=\"200\" height=\"253\" /></a></p> <p style=\"text-align: center;\"><a href=\"http://www.bordeaux.com\" target=\"_blank\" rel=\"noopener\"><span style=\"font-size: 8pt;\">Photo: Sémillon, Bordeaux.com </span></a></p> <p>Today it is grown in limited quantities but two distinct areas– <a href= \"https://winefornormalpeople.libsyn.com/ep-369-the-greats-sauternes-and-barsac\"> Sauternes/Barsac</a> and Pessac-Leognan in Bordeaux and the Hunter Valley of Australia --  create wines that are incredibly specific and unique. Demand and fascination with these iconic wines means that cultivation of this grape is not doomed!</p> <p> </p> <p>Here are the show notes:</p> <p><strong>The origins of the grape</strong></p> <ul> <li>Although we don’t know the parentage, we do know the grape is from southwestern France. It is likely from Bordeaux</li> <li>Until the 1700s, producers were only using the grape in Sauternes (at this point it was already a sweet wine, as records from 1717-1736 at the local abbey show)</li> <li>Later, it was found in St-Emilion, from which it derives its name. The name most likely comes from Selejun – the local pronunciation of Saint-Emilion</li> </ul> <p> </p> <p> </p> <p><strong>Sémillon in the vineyard</strong></p> <ul> <li>A thick-skinned grape, part of the reason it was so widely planted was that this feature makes Sémillon pretty resistant to molds and mildews (although, thankfully not botrytis). This feature of the grape helps make it easy to grow and it can be quite vigorous, which is why it was so used and abused in the past!</li> <li>The grape buds later and ripens earlier than its blending partner, Sauvignon blanc, and this short growing window means it is not as susceptible to spring or autumn frosts</li> <li>The grape is versatile on soil types – it can thrive on gravel, calcareous clay, sand, and other types making it incredibly adaptable</li> <li>Fully ripe Sémillon will have big yellow to nearly copper colored berries</li> <li>Low yields are best <ul> <li>Château d’Yquem, the most famous Sauternes producer in the world, allegedly makes one glass per vine. The rest of Sauternes yields about 24hl/ha, and lower quality regions yield 80 -100 hl/ha. Hunter Valley in Australia – 60 hl/ha<br /> <br /></li> </ul> </li> </ul> <p align=\"center\">**M.C. Ice and I fully acknowledge that we have no idea what a hl/ha looks like but we use the numbers for comparison sake – ratios are still helpful, right? **<br /> <br /></p> <p align=\"center\"><a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\"><img src= \"https://assets.libsyn.com/secure/show/45638/103515-Semillon-2000.jpeg\" alt=\"\" width=\"400\" height=\"120\" /></a><br /> <a href=\"https://www.australianwine.com/en-AU/our-wines/semillon\" target=\"_blank\" rel=\"noopener\"><span style=\"font-size: 8pt;\">Photo: Australian Semillon, courtesy Wine Australia</span></a></p> <ul> <li>Climate can vary enormously and the grape can still perform: <ul> <li>In Sauternes, special climate conditions must exist (we discuss later)</li> <li>Top dry white areas of Graves and Pessac-Leognan have warmer sites for Sémillon, which allows it to get fully ripe, adding lushness to the blend with Sauvignon blanc</li> <li>In Hunter valley, humidity with tropical storms are best! Because the area has strong cloud cover there is less direct sun so it slows photosynthesis, despite heat. The humid afternoons somehow help build acidity. The light, sandy soils that contain some loam and iron have good drainage, during rain</li> </ul> </li> </ul> <p> </p> <p> </p> <p>We discuss the growing regions for most of the remaining part of the show</p> <p><strong>France: Bordeaux</strong></p> <ul> <li>France grows more Sémillon than any other country and most of the plantings are in Bordeaux, specifically – Graves, Pessac-Leognan, and Sauternes</li> <li>50 or so years ago, half the production in Bordeaux was white, mostly from Semillon, which traditionally made up 4/5 of any white wine in the area, sweet or white, but now has taken a backseat to Sauvignon Blanc, which offers more acidity to the wine in a warming climate</li> </ul> <p style=\"text-align: center;\"><strong> <img style= \"display: block; margin-left: auto; margin-right: auto;\" src= \"https://assets.libsyn.com/secure/show/45638/1.png\" alt=\"\" width= \"325\" height=\"325\" /></strong><span style=\"font-size: 8pt;\">Photo: Bordeaux vineyard, Getty Images via Canva subscription<br /> <br /></span></p> <p><strong>  Sauternes, Barsac</strong></p> <ul> <li>In Sauternes, Barsac (<a href= \"https://winefornormalpeople.libsyn.com/ep-369-the-greats-sauternes-and-barsac\">please see episode 369 for more info</a>) and the sweet appellations of Cadillac, Ste Croix du Mont, Loupiac, and Cerons Sémillon is always partnered with Sauvignon blanc, which also receives botrytis well but maintains its acidity. Wines are hand harvested, with several passes through the vineyard to get the right level of botrytis, which can be patchy and can be grey rot if it developed poorly on the grapes</li> <li>Botrytis is a fungus that affects the grapes right when the fruit forms. It concentrates sugar and creates honeyed, apricot, mango flavors with a viscous mouthfeel from the glycerol it produces. Alcohol levels range in the region -- the minimum in Sauternes is 13% but it can well over 20% ABV</li> <li>For botrytis to form, a region needs foggy nights and early morning, followed by warm and sunny days. This is essential in the autumn, and is a very consistent weather pattern in the sweet wine regions of Bordeaux, which botrytized wine can be made nearly every year</li> <li>These wines are aged for long periods in oak barrels</li> <li>Some, like Chateau Climens in Barsac, are 100% Sémillon</li> </ul> <p><strong> </strong></p> <p><strong>Dry white appellations</strong></p> <ul> <li>In Graves and the lighter, sandier regions of Pessac-Leognan, Sémillon is often the biggest percentage of the blend. The best versions – Haut-Brion Blanc and La Mission Haut-Brion Blanc (different Châteaux, owned by the same group = confusing, I know) – are hundreds of dollars a bottle and often have Sémillon as the main component, but it’s vintage dependent <ul> <li>In <strong>Pessac-Leognan</strong>, 25% of blend must be Sauvignon Blanc, and the trend is to favor that grape over Sémillon both because it’s easier to grow, and because it has acidity. From good producers, these wines can age for decades</li> <li>The grape can be in Côtes de Bordeaux blancs and in basic Bordeaux blanc from better producers</li> <li>Sémillon adds fullness to the texture and when it is aged in oak (as is the case with Sauternes, Barsac and in Graves and Pessac-Leognan), it can have peach, mango, nuts, and toast flavors, which contrast well with Sauvignon blanc’s more “green” aromas. If Sémillon is not aged in oak, it can have citrus, grass, notes without much flavor. When it is fully ripe and aged in oak, it is fat in texture with lemon and tropical fruit and has lower acidity.</li> </ul> </li> </ul> <p> </p> <p>Other places in France Sémillon grows...</p> <ul> <li>Southwest France has the sweet wine of Monbazillac (like Sauternes) and dry white of Bergerac</li> <li>Provence and the Languedoc, but not of any quality</li> </ul> <p> </p> <p> </p> <p><strong>Australia</strong></p> <ul> <li>Makes the most distinctive dry white in Australia and was first planted in the Hunter Valley where it gained popularity for its ease to grow, high yields, and resistance to disease</li> <li>It went from being the workhorse grape in the 1980s, to accounting for only 3.1% of the total Australian crush today</li> <li>More than half of Australia’s Semillon comes from the bulk New South Wales region of Riverina<br /> <br /></li> </ul> <p><strong>Hunter Valley in New South Wales</strong></p> <ul> <li>The warm, humid climate of the Hunter Valley isn’t conducive to most grapes but Semillon (no accent on the “e” in Australia!) changes from a grassy, lemony acidic wine into a dark yellow, nutty, honey and straw-scented viscous wine if grown and made under certain conditions</li> <li>To achieve this, growers pick early, before the summer rains and the grapes have very high acidity. Alcohol levels are around 10-11% ABV, and most of the wine spends no time in oak for fermentation nor for aging – it is put in stainless, fermented cold, and bottled. Wines in their youth are like Sauvignon blanc – citrus, green herbs, and straw flavors persist, with high acidity. After 5-10 years of storage the wine darkens and tastes like honey, toasted, grilled nuts and seems like it has been in an oak barrel (hasn’t) – a total odd ball. Although the grapes can have some botrytis, this phenomenon is just a result of the rainy, tropical growing conditions</li> <li><a href=\"https://winefornormalpeople.libsyn.com/ep-309\">To learn more about Hunter Valley and the Semillon, listen to ep 309, with the amazing Connie Paur Griffiths of Tranquil Vale, an excellent small producer located there</a></li> <li>Tyrells is the famous producer here (especially Vat 1 Semillon). Also Brokenwood, Silkman, Andrew Thomas</li> </ul> <p> </p> <p style=\"text-align: center;\"><a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\"><img src= \"https://assets.libsyn.com/secure/show/45638/101586-Hunter-Valley-2000.jpeg\" alt=\"\" width=\"500\" height=\"150\" /></a><br /> <span style=\"font-size: 8pt;\"> <a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\">Photo: Hunter Valley Vineyard, credit Wine Australia</a></span></p> <p> </p> <p><strong>Western Australia:</strong></p> <ul> <li><strong>Margaret River:</strong> Popular for blends of Semillon and Sauvignon blanc</li> <li>You will see Semillon-Sauvignon Blanc or Sauvignon Blanc-Semillon on the bottle, the first name indicates which grape dominates the blend</li> <li>These wines can be made in a juicy, fruit style with no oak, or oak fermented and/or oak matured to last longer</li> <li>Producers: Vasse Felix, Cullen, Cape Mentelle, Leeuwin</li> </ul> <p><strong> </strong></p> <p><strong>South Australia</strong></p> <ul> <li><strong>Adelaide Hills:</strong> Wines are like white Bordeaux in that they are picked early and blended with Sauvignon Blanc to avoid oiliness, too much ripeness. They sometimes use oak, sometimes not. Charlotte Dalton is the big producer here.</li> <li><strong>Barossa:</strong> Sometimes makes varietal versions that show the purity of the grape, sometimes use big oak and can be toasty and Chardonnay-esque. Producers: Torbreck, Peter Lehmann, Henschke in Eden Valley</li> <li><strong>Clare Valley:</strong> Can be more refined than Barossa but still peachy with apple and citrus and fuller body. Oak influence is common. Producers: Mount Harrocks, Pauletts</li> <li><strong>Riverina:</strong> Is notorious for low quality bulk wine but a pocket of it develops botrytis easily and makes high quality sweet wines: McWilliams, De Bortoli</li> </ul> <p> </p> <p> </p> <p>New Zealand has a small amount of Semillon in Marlborough, Hawkes Bay, and Gisbourne</p> <p><strong> </strong></p> <p><strong>South Africa</strong></p> <ul> <li>Semillon was once so important it was called “greengrape” because of its bring green foliage</li> <li>By 1822, 93% of the vineyard land planted was Semillon. Then it was commonly just called “wine grape” but by the 1900s it began its sharp decline</li> <li>It is grown now in Stellenbosch, Swartland, and Franschhoek. Some areas have older bush vines.</li> <li>Producers like: Cederberg, Steenberg, Vergelegen , Mullineux are using more Semillon in blends with Sauvignon Blanc (some sweet, some dry versions)</li> </ul> <p><strong> </strong></p> <p><strong>United States</strong></p> <p><strong>  California</strong></p> <ul> <li>Barely uses Semillon but vines that were imported in the 1880s to the Livermore Valley in northern California, were allegedly from Château d’Yquem</li> <li>Vines that live in the Monte Rosso vineyard in Sonoma date from 1886 and can make excellent wines. Morgon is an example</li> <li>Sierra Foothills: Some here, notably my friend Lorenzo Muslia of Andis makes the <a href= \"https://www.andiswines.com/product/2020Semillon\" target=\"_blank\" rel=\"noopener\">Bill Dillian Semillon</a> that has great acidity but silkiness and hay, herb, and melon notes <a href= \"https://podcasts.apple.com/us/podcast/lorenzo-muslija-from-andis-wine-in-sierra-foothills/id413879919?i=1000443999010\"> (for the podcast with Lorenzo click here)</a></li> </ul> <p style=\"text-align: center;\"><a href= \"https://www.andiswines.com/product/2020Semillon\" target=\"_blank\" rel=\"noopener\"><img src= \"https://assets.libsyn.com/secure/show/45638/Andis_Wines_Bill_Dillian_Reserve_Front.jpg\" alt=\"\" width=\"300\" height=\"386\" /></a><br /> <a href=\"https://www.andiswines.com/product/2020Semillon\" target= \"_blank\" rel=\"noopener\"><span style=\"font-size: 8pt;\">Photo: Andis Wines</span></a></p> <p><strong>  Washington State</strong></p> <ul> <li>Big decline in plantings and they usually a blend with Sauvignon Blanc</li> <li>Popular from Walla Walla producers: L’Ecole 41 – lemon curd, nut and toast notes with a pretty full body, Amavi (<a href= \"https://winefornormalpeople.libsyn.com/ep-294-walla-walla-washingtons-fathers-of-the-vine-eric-mckibben-of-pepper-bridge-winery-and-amavi-cellars\">episode with Amavi here</a>) – slightly more acidic and less full with more citrus and grass notes but still with a rich body</li> </ul> <p> </p> <p><strong> </strong></p> <p><strong>Others countries that use Sémilllon</strong></p> <ul> <li><strong>Chile:</strong> Because of the Bordeaux link, has Semillon and usually uses it for blends or Sauternes-like sweet wines. Semillon used be 75% of white vines in Chile!</li> <li><strong>Argentina, Uruguay</strong> have some nice examples</li> <li><strong>Canada</strong></li> </ul> <p> </p> <p><strong> </strong></p> <p><strong>Food Pairing Ideas</strong></p> <ul> <li><strong><em>Sauternes/dessert styles:</em></strong> blue (Roquefort) cheese, foie gras, scallops, fruit based-dessert</li> <li><strong><em>Lighter styles:</em></strong> Oysters, shellfish, white fish or chicken dishes with citrus or herbal sauces or creamy sauces, salads, goat and sheep’s milk cheeses</li> </ul> <p><span style= \"font-size: 10pt;\"><strong>_____________________________________________</strong></span></p> <p><span style=\"font-size: 10pt;\"><strong>Research Sources:</strong></span></p> <ul> <li><span style=\"font-size: 10pt;\">“Wine Grapes” by Jancis Robinson, Dr. José Vouillamoz, Julia Harding</span></li> <li><span style=\"font-size: 10pt;\">“Grapes & Wines” by Margaret Rand and Oz Clarke</span></li> <li><span style=\"font-size: 10pt;\"><a href= \"https://www.bordeaux.com/us/\">https://www.bordeaux.com/us/</a></span></li> <li><span style=\"font-size: 10pt;\"><a href= \"https://www.wineaustralia.com/market-insights/regions-and-varieties/semillon\"> https://www.wineaustralia.com/</a></span></li> <li><span style=\"font-size: 10pt;\">Fiona Beckett – <a href= \"https://www.matchingfoodandwine.com/news/pairings/the-best-food-matches-for-smillon-and-smillon-sauvignon-blends/\"> Matching Food & Wine</a></span></li> <li><span style=\"font-size: 10pt;\">As always, talking to people about the grape who grow it, and drinking a lot of the wine itself – Sémillon is awesome!</span></li> </ul> <p>__________________________________________________________</p> <p>____________________________________________________</p> <p>From our Sponsors...<img class=\"img-responsive\" style= \"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/Wine_Spies_Logo.jpg\" alt=\"\" width=\"219\" height=\"115\" /></p> <p><a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">Wine Spies</a> uncovers incredible wines at unreal prices - on big names or boutique brands from all over the world at up to 75% off! It’s not a club and there’s no obligation to buy. They have a build-a-case option, so you can mix and match wines while enjoying free shipping on every purchase. Visit <a href= \"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">www.winespies.com/normal</a> you’ll get $20 credit to use on your first order! Don't forget to go to the store page to see what wines I love with descriptions I have written. </p> <p> </p> <p><a href=\"http://www.patreon.com/winefornormalpeople\" target= \"_blank\" rel=\"noopener\"><img class=\"img-responsive\" style= \"float: right;\" src= \"https://assets.libsyn.com/secure/show/45638/width_100_Patreon.jpg\" alt=\"\" width=\"100\" height=\"100\" /></a>If you think our podcast is worth the price of a bottle or two of wine a year, please become a member of Patreon... you'll get even more great content, live interactions and classes! </p> <p><a href= \"http://www.patreon.com/winefornormalpeople\">www.patreon.com/winefornormalpeople</a></p> <p align=\"center\"> </p> <p align=\"center\">To register for an AWESOME, LIVE WFNP class with Elizabeth go to: <a href= \"http://www.winefornormalpeople.com/classes\">www.winefornormalpeople.com/classes</a></p> <p> </p>",
  "content:encoded": "<p>Sémillon used to be the most planted white grape in the world. From its native home in France to Australia, Chile, South Africa, Argentina, and beyond, it was planted <em>en masse</em> to pump out large quantities of flavorless bulk white wine. The problem was that Sémillon doesn’t cooperate when it’s forced to high yields. It loses acidity and it lacks flavor unlike some other grapes that can still muster some umph when over-cropped (Chenin blanc, Sauvignon blanc, Colombard, to name three).  For this reason, plantings were replaced and the grape became unpopular.</p> <p><a href=\"http://www.bordeaux.com\" target=\"_blank\" rel= \"noopener\"></a></p> <p style=\"text-align: center;\"><a href=\"http://www.bordeaux.com\" target=\"_blank\" rel=\"noopener\">Photo: Sémillon, Bordeaux.com </a></p> <p>Today it is grown in limited quantities but two distinct areas– <a href= \"https://winefornormalpeople.libsyn.com/ep-369-the-greats-sauternes-and-barsac\"> Sauternes/Barsac</a> and Pessac-Leognan in Bordeaux and the Hunter Valley of Australia --  create wines that are incredibly specific and unique. Demand and fascination with these iconic wines means that cultivation of this grape is not doomed!</p> <p> </p> <p>Here are the show notes:</p> <p>The origins of the grape</p> <ul> <li>Although we don’t know the parentage, we do know the grape is from southwestern France. It is likely from Bordeaux</li> <li>Until the 1700s, producers were only using the grape in Sauternes (at this point it was already a sweet wine, as records from 1717-1736 at the local abbey show)</li> <li>Later, it was found in St-Emilion, from which it derives its name. The name most likely comes from Selejun – the local pronunciation of Saint-Emilion</li> </ul> <p> </p> <p> </p> <p>Sémillon in the vineyard</p> <ul> <li>A thick-skinned grape, part of the reason it was so widely planted was that this feature makes Sémillon pretty resistant to molds and mildews (although, thankfully not botrytis). This feature of the grape helps make it easy to grow and it can be quite vigorous, which is why it was so used and abused in the past!</li> <li>The grape buds later and ripens earlier than its blending partner, Sauvignon blanc, and this short growing window means it is not as susceptible to spring or autumn frosts</li> <li>The grape is versatile on soil types – it can thrive on gravel, calcareous clay, sand, and other types making it incredibly adaptable</li> <li>Fully ripe Sémillon will have big yellow to nearly copper colored berries</li> <li>Low yields are best <ul> <li>Château d’Yquem, the most famous Sauternes producer in the world, allegedly makes one glass per vine. The rest of Sauternes yields about 24hl/ha, and lower quality regions yield 80 -100 hl/ha. Hunter Valley in Australia – 60 hl/ha </li> </ul> </li> </ul> <p align=\"center\">**M.C. Ice and I fully acknowledge that we have no idea what a hl/ha looks like but we use the numbers for comparison sake – ratios are still helpful, right? ** </p> <p align=\"center\"><a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\"></a> <a href=\"https://www.australianwine.com/en-AU/our-wines/semillon\" target=\"_blank\" rel=\"noopener\">Photo: Australian Semillon, courtesy Wine Australia</a></p> <ul> <li>Climate can vary enormously and the grape can still perform: <ul> <li>In Sauternes, special climate conditions must exist (we discuss later)</li> <li>Top dry white areas of Graves and Pessac-Leognan have warmer sites for Sémillon, which allows it to get fully ripe, adding lushness to the blend with Sauvignon blanc</li> <li>In Hunter valley, humidity with tropical storms are best! Because the area has strong cloud cover there is less direct sun so it slows photosynthesis, despite heat. The humid afternoons somehow help build acidity. The light, sandy soils that contain some loam and iron have good drainage, during rain</li> </ul> </li> </ul> <p> </p> <p> </p> <p>We discuss the growing regions for most of the remaining part of the show</p> <p>France: Bordeaux</p> <ul> <li>France grows more Sémillon than any other country and most of the plantings are in Bordeaux, specifically – Graves, Pessac-Leognan, and Sauternes</li> <li>50 or so years ago, half the production in Bordeaux was white, mostly from Semillon, which traditionally made up 4/5 of any white wine in the area, sweet or white, but now has taken a backseat to Sauvignon Blanc, which offers more acidity to the wine in a warming climate</li> </ul> <p style=\"text-align: center;\"> Photo: Bordeaux vineyard, Getty Images via Canva subscription </p> <p>  Sauternes, Barsac</p> <ul> <li>In Sauternes, Barsac (<a href= \"https://winefornormalpeople.libsyn.com/ep-369-the-greats-sauternes-and-barsac\">please see episode 369 for more info</a>) and the sweet appellations of Cadillac, Ste Croix du Mont, Loupiac, and Cerons Sémillon is always partnered with Sauvignon blanc, which also receives botrytis well but maintains its acidity. Wines are hand harvested, with several passes through the vineyard to get the right level of botrytis, which can be patchy and can be grey rot if it developed poorly on the grapes</li> <li>Botrytis is a fungus that affects the grapes right when the fruit forms. It concentrates sugar and creates honeyed, apricot, mango flavors with a viscous mouthfeel from the glycerol it produces. Alcohol levels range in the region -- the minimum in Sauternes is 13% but it can well over 20% ABV</li> <li>For botrytis to form, a region needs foggy nights and early morning, followed by warm and sunny days. This is essential in the autumn, and is a very consistent weather pattern in the sweet wine regions of Bordeaux, which botrytized wine can be made nearly every year</li> <li>These wines are aged for long periods in oak barrels</li> <li>Some, like Chateau Climens in Barsac, are 100% Sémillon</li> </ul> <p> </p> <p>Dry white appellations</p> <ul> <li>In Graves and the lighter, sandier regions of Pessac-Leognan, Sémillon is often the biggest percentage of the blend. The best versions – Haut-Brion Blanc and La Mission Haut-Brion Blanc (different Châteaux, owned by the same group = confusing, I know) – are hundreds of dollars a bottle and often have Sémillon as the main component, but it’s vintage dependent <ul> <li>In Pessac-Leognan, 25% of blend must be Sauvignon Blanc, and the trend is to favor that grape over Sémillon both because it’s easier to grow, and because it has acidity. From good producers, these wines can age for decades</li> <li>The grape can be in Côtes de Bordeaux blancs and in basic Bordeaux blanc from better producers</li> <li>Sémillon adds fullness to the texture and when it is aged in oak (as is the case with Sauternes, Barsac and in Graves and Pessac-Leognan), it can have peach, mango, nuts, and toast flavors, which contrast well with Sauvignon blanc’s more “green” aromas. If Sémillon is not aged in oak, it can have citrus, grass, notes without much flavor. When it is fully ripe and aged in oak, it is fat in texture with lemon and tropical fruit and has lower acidity.</li> </ul> </li> </ul> <p> </p> <p>Other places in France Sémillon grows...</p> <ul> <li>Southwest France has the sweet wine of Monbazillac (like Sauternes) and dry white of Bergerac</li> <li>Provence and the Languedoc, but not of any quality</li> </ul> <p> </p> <p> </p> <p>Australia</p> <ul> <li>Makes the most distinctive dry white in Australia and was first planted in the Hunter Valley where it gained popularity for its ease to grow, high yields, and resistance to disease</li> <li>It went from being the workhorse grape in the 1980s, to accounting for only 3.1% of the total Australian crush today</li> <li>More than half of Australia’s Semillon comes from the bulk New South Wales region of Riverina </li> </ul> <p>Hunter Valley in New South Wales</p> <ul> <li>The warm, humid climate of the Hunter Valley isn’t conducive to most grapes but Semillon (no accent on the “e” in Australia!) changes from a grassy, lemony acidic wine into a dark yellow, nutty, honey and straw-scented viscous wine if grown and made under certain conditions</li> <li>To achieve this, growers pick early, before the summer rains and the grapes have very high acidity. Alcohol levels are around 10-11% ABV, and most of the wine spends no time in oak for fermentation nor for aging – it is put in stainless, fermented cold, and bottled. Wines in their youth are like Sauvignon blanc – citrus, green herbs, and straw flavors persist, with high acidity. After 5-10 years of storage the wine darkens and tastes like honey, toasted, grilled nuts and seems like it has been in an oak barrel (hasn’t) – a total odd ball. Although the grapes can have some botrytis, this phenomenon is just a result of the rainy, tropical growing conditions</li> <li><a href=\"https://winefornormalpeople.libsyn.com/ep-309\">To learn more about Hunter Valley and the Semillon, listen to ep 309, with the amazing Connie Paur Griffiths of Tranquil Vale, an excellent small producer located there</a></li> <li>Tyrells is the famous producer here (especially Vat 1 Semillon). Also Brokenwood, Silkman, Andrew Thomas</li> </ul> <p> </p> <p style=\"text-align: center;\"><a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\"></a>  <a href= \"https://www.australianwine.com/en-AU/our-wines/semillon\" target= \"_blank\" rel=\"noopener\">Photo: Hunter Valley Vineyard, credit Wine Australia</a></p> <p> </p> <p>Western Australia:</p> <ul> <li>Margaret River: Popular for blends of Semillon and Sauvignon blanc</li> <li>You will see Semillon-Sauvignon Blanc or Sauvignon Blanc-Semillon on the bottle, the first name indicates which grape dominates the blend</li> <li>These wines can be made in a juicy, fruit style with no oak, or oak fermented and/or oak matured to last longer</li> <li>Producers: Vasse Felix, Cullen, Cape Mentelle, Leeuwin</li> </ul> <p> </p> <p>South Australia</p> <ul> <li>Adelaide Hills: Wines are like white Bordeaux in that they are picked early and blended with Sauvignon Blanc to avoid oiliness, too much ripeness. They sometimes use oak, sometimes not. Charlotte Dalton is the big producer here.</li> <li>Barossa: Sometimes makes varietal versions that show the purity of the grape, sometimes use big oak and can be toasty and Chardonnay-esque. Producers: Torbreck, Peter Lehmann, Henschke in Eden Valley</li> <li>Clare Valley: Can be more refined than Barossa but still peachy with apple and citrus and fuller body. Oak influence is common. Producers: Mount Harrocks, Pauletts</li> <li>Riverina: Is notorious for low quality bulk wine but a pocket of it develops botrytis easily and makes high quality sweet wines: McWilliams, De Bortoli</li> </ul> <p> </p> <p> </p> <p>New Zealand has a small amount of Semillon in Marlborough, Hawkes Bay, and Gisbourne</p> <p> </p> <p>South Africa</p> <ul> <li>Semillon was once so important it was called “greengrape” because of its bring green foliage</li> <li>By 1822, 93% of the vineyard land planted was Semillon. Then it was commonly just called “wine grape” but by the 1900s it began its sharp decline</li> <li>It is grown now in Stellenbosch, Swartland, and Franschhoek. Some areas have older bush vines.</li> <li>Producers like: Cederberg, Steenberg, Vergelegen , Mullineux are using more Semillon in blends with Sauvignon Blanc (some sweet, some dry versions)</li> </ul> <p> </p> <p>United States</p> <p>  California</p> <ul> <li>Barely uses Semillon but vines that were imported in the 1880s to the Livermore Valley in northern California, were allegedly from Château d’Yquem</li> <li>Vines that live in the Monte Rosso vineyard in Sonoma date from 1886 and can make excellent wines. Morgon is an example</li> <li>Sierra Foothills: Some here, notably my friend Lorenzo Muslia of Andis makes the <a href= \"https://www.andiswines.com/product/2020Semillon\" target=\"_blank\" rel=\"noopener\">Bill Dillian Semillon</a> that has great acidity but silkiness and hay, herb, and melon notes <a href= \"https://podcasts.apple.com/us/podcast/lorenzo-muslija-from-andis-wine-in-sierra-foothills/id413879919?i=1000443999010\"> (for the podcast with Lorenzo click here)</a></li> </ul> <p style=\"text-align: center;\"><a href= \"https://www.andiswines.com/product/2020Semillon\" target=\"_blank\" rel=\"noopener\"></a> <a href=\"https://www.andiswines.com/product/2020Semillon\" target= \"_blank\" rel=\"noopener\">Photo: Andis Wines</a></p> <p>  Washington State</p> <ul> <li>Big decline in plantings and they usually a blend with Sauvignon Blanc</li> <li>Popular from Walla Walla producers: L’Ecole 41 – lemon curd, nut and toast notes with a pretty full body, Amavi (<a href= \"https://winefornormalpeople.libsyn.com/ep-294-walla-walla-washingtons-fathers-of-the-vine-eric-mckibben-of-pepper-bridge-winery-and-amavi-cellars\">episode with Amavi here</a>) – slightly more acidic and less full with more citrus and grass notes but still with a rich body</li> </ul> <p> </p> <p> </p> <p>Others countries that use Sémilllon</p> <ul> <li>Chile: Because of the Bordeaux link, has Semillon and usually uses it for blends or Sauternes-like sweet wines. Semillon used be 75% of white vines in Chile!</li> <li>Argentina, Uruguay have some nice examples</li> <li>Canada</li> </ul> <p> </p> <p> </p> <p>Food Pairing Ideas</p> <ul> <li><em>Sauternes/dessert styles:</em> blue (Roquefort) cheese, foie gras, scallops, fruit based-dessert</li> <li><em>Lighter styles:</em> Oysters, shellfish, white fish or chicken dishes with citrus or herbal sauces or creamy sauces, salads, goat and sheep’s milk cheeses</li> </ul> <p>_____________________________________________</p> <p>Research Sources:</p> <ul> <li>“Wine Grapes” by Jancis Robinson, Dr. José Vouillamoz, Julia Harding</li> <li>“Grapes & Wines” by Margaret Rand and Oz Clarke</li> <li><a href= \"https://www.bordeaux.com/us/\">https://www.bordeaux.com/us/</a></li> <li><a href= \"https://www.wineaustralia.com/market-insights/regions-and-varieties/semillon\"> https://www.wineaustralia.com/</a></li> <li>Fiona Beckett – <a href= \"https://www.matchingfoodandwine.com/news/pairings/the-best-food-matches-for-smillon-and-smillon-sauvignon-blends/\"> Matching Food & Wine</a></li> <li>As always, talking to people about the grape who grow it, and drinking a lot of the wine itself – Sémillon is awesome!</li> </ul> <p>__________________________________________________________</p> <p>____________________________________________________</p> <p>From our Sponsors...</p> <p><a href=\"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">Wine Spies</a> uncovers incredible wines at unreal prices - on big names or boutique brands from all over the world at up to 75% off! It’s not a club and there’s no obligation to buy. They have a build-a-case option, so you can mix and match wines while enjoying free shipping on every purchase. Visit <a href= \"http://www.winespies.com/normal\" target=\"_blank\" rel= \"noopener\">www.winespies.com/normal</a> you’ll get $20 credit to use on your first order! Don't forget to go to the store page to see what wines I love with descriptions I have written. </p> <p> </p> <p><a href=\"http://www.patreon.com/winefornormalpeople\" target= \"_blank\" rel=\"noopener\"></a>If you think our podcast is worth the price of a bottle or two of wine a year, please become a member of Patreon... you'll get even more great content, live interactions and classes! </p> <p><a href= \"http://www.patreon.com/winefornormalpeople\">www.patreon.com/winefornormalpeople</a></p> <p align=\"center\"> </p> <p align=\"center\">To register for an AWESOME, LIVE WFNP class with Elizabeth go to: <a href= \"http://www.winefornormalpeople.com/classes\">www.winefornormalpeople.com/classes</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "46:57",
  "itunes:explicit": false,
  "itunes:keywords": "wine,australia,tasting,bordeaux,pairing,semillon",
  "itunes:subtitle": "Sémillon used to be the most planted white grape in the world. From its native home in France to Australia, Chile, South Africa, Argentina, and beyond, it was planted en masse to pump out large quantities of flavorless bulk white wine. The problem...",
  "itunes:episode": 431,
  "itunes:episodeType": "full",
  "itunes:author": "Wine for Normal People"
}