{
  "title": "Does AI stand for Alchemical Intelligence?",
  "link": "http://edersantana.github.io/articles/ai_alchemy/",
  "pubDate": "Mon, 14 Dec 2015 16:00:00 -0500",
  "guid": "http://edersantana.github.io/articles/ai_alchemy/",
  "author": "",
  "description": "<p>AI stands for artificial intelligence, but it currently has a lot in\ncommon with chemistry in the ages when it was named\nAlchemy. </p>\n<p><span class=\"more\"></span></p>\n<p><img src=\"/articles/ai_alchemy/alchemy.png\" alt=\"alchemy symbols\"></p>\n<p>Alex net recipe:  </p>\n<ol>\n<li>5 five convolutional layers  </li>\n<li>2 fully-connected layers    </li>\n<li>Softmax layer with 1000 outputs on top  </li>\n<li>Use Imagenet dataset for training   </li>\n<li>Train it carefully with SGD for 2 weeks if you don’t have proper equipment, or\nfor 16 hours if you do.  </li>\n</ol>\n<p>In high school we learn that knowledge evolves from myths. The demystification\nis carried by careful investigation, experimentation, reproducibility and\nanalysis, all guided by the scientific method. </p>\n<p>The scientific method is a fantastic tool, but I have always been equally\nfascinated by what was accomplished with other knowledge tools such as\nart and mythical approaches. My main question was “What did the human mind feel like\nin pre-scientific method ages?”. For PhD candidate in deep learning, it was \nhumbling to observe that we somewhat live\nin such an age with respect to artificial intelligence.</p>\n<p>Deep learning is one of the computational approaches to unlocking\nthe mysteries of intelligence. The understanding intelligence today, resembles\nthe understanding chemistry in the times of the alchemists. Those chemical\nexperimentalists of the old ages developed practical recipes for manipulating\nthe dowries of Nature, all without the guide of today’s chemistry and physics.\nSimilarly, we can achieve arguably intelligent-like behavior with deep learning. \nThere is no broadly accepted definition in chemistry, physics, mathematics,\nnor in philosophy or poetry about what is Intelligence. Yet over and over\nagain we have been able to write programs to tackle tasks that years ago would require a\nhuman to solve. These solutions are developed with intuition and arduous repetition,\njust like the alchemist’s workings.</p>\n<p>I’ve noticed a few other parallels between the fields of artificial and alchemical\nintelligence that I list next.</p>\n<h3 id=\"philosopher-s-stone\">Philosopher’s stone</h3>\n<pre><code>Our mission SOLVE INTELLIGENCE - Google DeepMind\n</code></pre><p>Alchemists’ ultimate goal was to turn any base metal into gold and\nfind the Elixir of Life. Artificial Intelligence seeks general purpose\nintelligence, universal program solvers, and building machines with human-like\nintelligence. These ambitious goals are\nsuccessfully motivating investigators and patrons alike. </p>\n<p>On the other hand, although those involved in the research know how far they are from their\nPhilosopher’s Stone, possible consequences of their declared ultimate goals can\nbe fearsome for outsiders.</p>\n<h3 id=\"fear\">Fear</h3>\n<pre><code>Our greatest existential threat - Elon Musk on AI\n</code></pre><p>Control over gold and life would be nothing but disruptive. It would break\neconomies, health, politics, religion, and any other power systems. Equally\nworld changing would be a\nmachine with human intelligence and without human weaknesses, built as a\nsingle owner homunculus. Couldn’t that owner use his homunculus as the ultimate\nworker and accumulate unequal wealth or use it as the perfect soldier to conquer less\ntechnologically gifted societies?</p>\n<p>The unknown is scary and not everybody understands how AI or Alchemy works\nespecially when practitioners are so fond of their mystic terminologies.</p>\n<h3 id=\"mysticism\">Mysticism</h3>\n<pre><code>This state has a 2-dimensional structure: it consists of\nw × h vectors of m numbers, i.e., it is a 3-dimensional\ntensor of shape [w, h, m]. This &quot;mental image&quot; evolves\nin time in a way defined by a convolutional gated\nrecurrent unit. - Łukasz Kaiser and Ilya Sutskever\non Neural GPUs Learn Algorithms.\n(Quotation marks are ours)\n</code></pre><p>Arthur C. Clarke noticed that, “Any sufficiently advanced technology is\nindistinguishable from magic”. This resonates deeply with our minds so much that\nwe sometimes avoid attributing mundane descriptions to what we recently\ndiscovered possible with our\nmagic. For example, alchemists used to name their elements after Roman gods\nto represent their powers. Deep learners like to attribute cognitive\nproperties to their algorithms such as attention and dreaming, even if they are\njust calculating first order moments or sampling from a parametric probability\ndistribution. Esoteric terminology has also been widely accepted in names such\nas Hidden Layers, Dark Knowledge, Skip-Thought Vectors and algorithms that \nLearn to Think.</p>\n<p>After all, we have always calculated first order moments, but only now we\nuse it to filter context relevant values. Also,\nrandom number generators have never consistently generated realistic or scary images. </p>\n<p>It takes a few generations for a technology to feel common enough for\npractitioners to retract their mystic terminologies.</p>\n<h3 id=\"enlightenment\">Enlightenment</h3>\n<pre><code>&quot;in recognition of the extraordinary services he has\nrendered by the discovery of the laws of chemical\ndynamics and osmotic pressure in solutions&quot; - First\nNobel of Chemistry, awarded to Jacobus H. van&#39;t Hoff \n</code></pre><p>No one can deny the importance of chemistry to our daily life. Although\nwe can’t easily transform metals into gold, we know the Quantum laws that would\nexplain how that might work. On average we now live about twice as long \nas those seeking the Elixir of Life. For that, we should thank\nunderstandings of the human body and medicines and all that started by claiming\ngod’s workings in alchemists labs. </p>\n<p>One day, AI might lose its mystic veil and we will no longer say that Neural\nNetworks can dream or pay attention. But when that time comes we will also be\npracticing much more than smoke, self-driving cars, image recognition and mirrors.</p>\n<p>Obviously, we will also rationally regulate AI the same way we regulate chemical\nweapons, by focusing on the people, companies and governments that might exploit\nit with bad will, and by teaching the technology alongside ethics classes.</p>\n<h3 id=\"predicting-the-future\">Predicting the future</h3>\n<p>I feel happy with  better understanding of how the mind of our predecessors might\nhave worked. Looking back also helps me to understand the nature of the fear\nand wonder surrounding today’s advanced technologies. But these same \ntechnologies don’t evolve\nin unexplainable jumps. By the time we were able to fly, blow up a mountain,\ntransform metal or extend our life spans we no longer felt it was appropriate to\ncall it magic or threatening to human existence.</p>\n<p>Right now we are still waiting for an AI theory that may enlighten the field in\nthe same way that Quantum Theory unveiled the real magic of Chemistry. A theory\nthat will not only explain what we did but also make even more possible.\nAt that point robots will be able to talk, draw, dance, work, navigate\nusing information in the spectrum of visible light and hearing sound, and behave\nindistinguishably from humans. When AI becomes less alchemical,\nI doubt that the majority of us will be scared, expecting the\nprotection of an AI Inquisition or worrying about what a machine is thinking.</p>"
}