{
  "id": "tag:blogger.com,1999:blog-37798047.post-5951653034642667450",
  "published": "2021-10-24T19:46:00.005-04:00",
  "updated": "2021-10-24T19:46:46.119-04:00",
  "title": "Review: Dune (2021)",
  "content": "<p>One of the most important classic sci-fi stories is the book \"<i>Dune</i>\" from Frank Herbert. It was recently made into a movie. I thought I'd write a quick review.</p><p>The summary is this: just read the book. It's a classic for a good reason, and you'll be missing a lot by not reading it.</p><p>But the movie <i>Dune</i> (2021) movie is very good. The most important thing to know is <b>see it in IMAX</b>. IMAX is this huge screen technology that partly wraps around the viewer, and accompanied by huge speakers that overwhelm you with sound. If you watch it in some other format, what was visually stunning becomes merely very pretty.</p><span><a name='more'></a></span><p>This is Villeneuve's trademark, which you can see in his other works, like his sequel to Bladerunner. The purpose is to marvel at the visuals in every scene. The story telling is just enough to hold the visuals together. I mean, he also seems to do a good job with the story telling, but it's just not the reason to go see the movie. (I can't tell -- I've read the book, so see the story differently than those of you who haven't).</p><p>Beyond the story and visuals, many of the actor's performances were phenomenal. Javier Bardem's \"Stilgar\" character steals his scenes.&nbsp;Stellan Skarsgård exudes evil. The two character actors playing the mentats were each perfect. I found the lead character (Timothée Chalamet) a bit annoying, but simply because he is at this point in the story.</p><p>Villeneuve's splits the book into two parts. This movie is only the first part. This presents a problem, because up until this point, the main character is just responding to events, not the hero who yet drives the events. It doesn't fit into the traditional Hollywood accounting model. I really want to see the second film even if the first part, released in the post-pandemic turmoil of the movie industry, doesn't perform well at the box office.</p><p>In short, if you haven't read the books, I'm not sure how well you'll follow the storytelling. But the visuals (seen at IMAX scale) and the characters are so great that I'm pretty sure most people will enjoy the movie. And go see it on IMAX in order to get the second movie made!!</p><p><br /></p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}