{
  "title": "Ancient Christian monastery found in Arabia",
  "link": "https://www.rt.com/news/565974-ancient-monastery-found-uae/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565974-ancient-monastery-found-uae/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636578f485f54046a47d48bf.jpg\" /> Archaeologists have discovered an ancient Christian monastery on an island off the United Arab Emirates <br/><a href=\"https://www.rt.com/news/565974-ancient-monastery-found-uae/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The site, discovered on an island off the coast of the UAE, could predate the advent of Islam</strong></p>\n            \n                        \n            <p>Archaeologists in the United Arab Emirates have unearthed the ruins of a Christian monastery on an island off the coast of the Umm al-Quwain emirate. Hidden for more than a millennium beneath a sand dune, the monastery may predate the rise of Islam across the Arabian Peninsula.</p>\n<p>The emirate&rsquo;s tourism and archaeology department announced the find on Thursday. Archaeologists discovered the remains of a church, a refectory (dining hall), cisterns, and cells for the monks where they spent time in solitude, <a href=\"https://www.thenationalnews.com/uae/heritage/2022/11/03/ancient-christian-monastery-discovered-in-umm-al-quwain/\" target=\"_blank\" rel=\"noopener noreferrer\">The National</a>, a Dubai-based news site, reported.</p>\n<p>Carbon dating on pottery excavated at the site revealed that it was occupied between the late sixth century and the middle of the eighth century.</p>\n<p>The Prophet Mohammed was born in the late sixth century, and it would take until the mid-seventh century for the first Caliph, Abu Bakr, to bring the entire Arabian peninsula under Islamic rule. Prior to this first Islamic conquest, Arabia was home to Christians, Jews, and clans and tribes of pagan Arabs.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.02/thumbnail/6205158185f5406e63547930.jpg\" alt=\"FILE PHOTO.\" />\n            <figcaption><a href=\"https://www.rt.com/news/548929-research-challenges-date-modern-humans-europe/\">Research challenges date of modern humans’ arrival in Europe</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p><em>&ldquo;It is an extremely rare discovery,&rdquo;</em> Professor Tim Power, an archaeologist at the UAE University who took part in the dig, told The National.<em> &ldquo;It is an important reminder of a lost chapter of Arab history.&rdquo;</em></p>\n<p>Power explained that the monks probably weren&rsquo;t driven from the site by the forces of the Caliphate. Rather, <em>&ldquo;the place was slowly abandoned.&rdquo;</em> Christians and Muslims generally coexisted for around 300 years after the rise of Islam, he continued, adding that <em>&ldquo;there was no sign of devastation or violence or burning&rdquo;</em> at the monastery.</p>\n<p>Instead, Power&rsquo;s team discovered glass chalices used for mixing wine, a cistern potentially used for baptisms, a kitchen and an oven used for baking communion bread.&nbsp;</p>\n<p>The monastery is the second such early Christian site discovered in the UAE. Archaeologists working on Sir Bani Yas Island off Abu Dhabi in 1990 discovered a Christian monastery dating from a similar period. Six ancient monasteries in total have been discovered along the shores of the Arabian Gulf.</p>\n<p></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 21:25:06 +0000",
  "dc:creator": "RT"
}