{
  "title": "US airline blocks out seats because passengers get heavier – report",
  "link": "https://www.rt.com/news/565987-us-airlines-seats-weight-restrictions/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565987-us-airlines-seats-weight-restrictions/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636620e585f5403a0204b68b.jpg\" /> United Airlines reportedly blocks off some seats to comply with government weight restrictions as Americans become fatter <br/><a href=\"https://www.rt.com/news/565987-us-airlines-seats-weight-restrictions/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>United Airlines has reportedly been forced to keep some seats vacant to comply with weight restrictions due to America’s obesity epidemic</strong></p>\n            \n                        \n            <p>United Airlines, the third-largest US air carrier, is reportedly unable to sell some seats on its flights due to the increased weight of the average American passenger.&nbsp;</p>\n<p>The carrier began blocking off three to six middle seats on each of its Boeing 757 aircraft earlier this week, according to travel blog Live and Let&rsquo;s Fly.&nbsp;</p>\n<p><em>&ldquo;The temporary change is a result of the increased average customer winter weights as prescribed by the FAA (The Federal Aviation Administration),&rdquo;</em> the airline said, according to the website. The FAA imposes weight limits and balance requirements on airlines.</p>\n<p>The affected seats are apparently covered with red sleeves and a sign saying:<em> &ldquo;Seat inoperative &ndash; do not occupy.&rdquo;</em> The seatbelts are zip-tied together.</p>\n<p>United will have to keep the seats out of service through April 30, as the FAA requires airlines to factor in higher average passenger weights during the winter months, when people wear heavier clothing. The agency raised the base weight averages that carriers use for their calculations in 2019, reflecting Americans&rsquo; expanding waistlines.</p>\n<p>The averages during the summer months, including carry-on items, rose to 179 pounds (81kg) from 145 pounds (65kg) for female passengers and to 200 pounds (90.7kg ) from 185 pounds (83kg) for males. Airlines tack on an additional 5 pounds (2.2 kg) for clothing during winter months as they balance their loads for safety reasons.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.01/thumbnail/61eeb256203027729031b11c.jpg\" alt=\"(FILE PHOTO) © Photo By Tom Williams/CQ-Roll Call, Inc via Getty Images\" />\n            <figcaption><a href=\"https://www.rt.com/news/547195-emirates-punishes-overweight-employees/\">Top airline punishes overweight employees, former staff claim</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The carriers also are apparently given the option of using actual weights, either by asking passengers to self-report or step on a scale, but that idea is not being implemented so far in the US. Reports last year suggesting that airlines might start weighing their customers led to a flurry of media coverage. The FAA said carriers will likely use other methods to calculate passenger weights, which are supposed to be updated every three years.</p>\n<p>The average US adult male weighs 199.8 pounds (90.1 kg) and has a 40.5-inch (102.87 cm) waist, according to the Centers for Disease Control and Prevention. That compares with 166.3 pounds (75.4 kg) in 1960. The average woman weighs 170.8 pounds (77.5kg) , up from 140.2 pounds (63.6) in 1960, and has a 38.7-inch (98 cm) waist.</p>\n<p>Those figures are based on data from 2015-2018 and therefore do not include the weight that many Americans gained during the Covid-19 pandemic. A New Mexico State University study found that 48% of US adults said their weight increased during the first year of the pandemic.</p>\n<p>A separate study by the American Psychological Association found that the average weight gain among those who reported increases was 29 pounds (13 kg).</p>\n<p>More than 42% of US adults are obese. The obesity epidemic is so severe, in fact, that nearly 71% of Americans born after 1997 are ineligible for military service, most commonly because they are too overweight to qualify, according to Pentagon data.<br /><a href=\"https://www.webmd.com/lung/news/20220119/nearly-half-of-americans-gained-weight-in-pandemics-first-year\"></a></p>\n<p><a href=\"https://www.armytimes.com/news/your-army/2018/10/10/americas-obesity-is-threatening-national-security-according-to-this-study/\"></a></p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 08:41:44 +0000",
  "dc:creator": "RT"
}