{
  "id": "https://bibleinoneyear.org/en/youth/89",
  "title": "Day 89: A Hundredfold Return",
  "description": "Psalm 38:21–22, Numbers 27:15–18, Luke 8:4–8.  He heard the word, retained it and by persevering has produced a crop hundreds of times more than was sown (Luke 8:8,15)  He encountered Jesus as his Saviour, Sower and Shepherd",
  "pubDate": "Wed, 30 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/89/",
  "itunes:duration": "13:13",
  "guid": "enyouth30032022-89",
  "length": 793.03,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 89: A Hundredfold Return",
  "itunes:subtitle": "Psalm 38:21–22, Numbers 27:15–18, Luke 8:4–8.  He heard the word, retained it and by persevering has produced a crop hundreds of times more than was sown (Luke 8:8,15)  He encountered Jesus as his Saviour, Sower and Shepherd",
  "itunes:summary": "He was brought up on one of the roughest estates in Manchester. His father was an alcoholic. He left school at fifteen. He ran away from home. He lived on the streets. He joined a gang. He got involved in crime and ended up in prison. When he came out, he joined the army. He went through two divorces.\nIn 1994, he walked into our church and did Alpha. He encountered Jesus and was filled with the Holy Spirit. He started visiting prisoners. He joined the HTB staff team to head up the work in prisons. He started an organisation to care for ex-offenders. He set up a homeless project. He started a course to help those with addictions and courses to help those struggling with depression and debt.\nUnder his leadership, Alpha for Prisons has spread through the prisons in the UK and seventy-six countries around the world. Thousands have come to faith in Jesus Christ. Hundreds of men and women have been placed in churches through the ministry of Caring for Ex-Offenders.\nPaul Cowley, author of Thief, Prisoner, Soldier, Priest, is an example of someone who was the good soil on which the seed fell. He has a noble and good heart. He heard the word, retained it and by persevering has produced a crop hundreds of times more than was sown (Luke 8:8,15). He encountered Jesus as his Saviour, Sower and Shepherd.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 454
}