{
  "id": "tag:blogger.com,1999:blog-2957813557601703695.post-4946655452917647717",
  "published": "2022-10-20T14:43:00.002+05:00",
  "updated": "2022-10-20T14:43:24.509+05:00",
  "category": [
    "",
    ""
  ],
  "title": "Shell Pakistan announces financial results for Q3 2022",
  "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhzaMvIJF_5B9nttmFis6jER9klBzTYtiKZKu8G1ltbnAt2sF-i0rpPZRvGhEvGbrH2u_tP9qWvf5ezbsI2ulmMGe-MniyapyjVCAuUokQTZKCk61JZIF0WwTRRgUrDAJ1r1_0jBpTBI7MTRVdHrMPAYriZYMmDrKtf9phXqtJsyYVXSLQKFtBffKc4FQ/s530/Shell%20logo.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"252\" data-original-width=\"530\" height=\"304\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhzaMvIJF_5B9nttmFis6jER9klBzTYtiKZKu8G1ltbnAt2sF-i0rpPZRvGhEvGbrH2u_tP9qWvf5ezbsI2ulmMGe-MniyapyjVCAuUokQTZKCk61JZIF0WwTRRgUrDAJ1r1_0jBpTBI7MTRVdHrMPAYriZYMmDrKtf9phXqtJsyYVXSLQKFtBffKc4FQ/w640-h304/Shell%20logo.png\" width=\"640\" /></a></div><br /><p><br /></p><p>Pakistan: The Board of Directors of Shell Pakistan Limited (SPL) announced the Company’s 3rd quarter results on October 19th, 2022.&nbsp; The Company posted a loss after tax of PKR 4,644 million for the quarter which translated into the cumulative profit after tax of PKR 2,863 million for the nine months as compared to last year’s profit after tax of PKR 297 million and PKR 2,447 million for the quarter and nine months respectively.</p><p><br /></p><p>The oil sector felt the impact of macro-economic challenges such as unprecedented devaluation of the Rupee, continued volatility in the international oil prices as well as the impact of devastating floods, which resulted in a reduction in industry volumes.&nbsp; The Company was able to maintain its market share and remained focused on its strategic priorities, operational excellence, and fiscal prudence.</p><p><br /></p><p>During the period, the Mobility business, with a strong supply and distribution network, delivered product in a safe and compliant manner at a time when most of the supply routes were severely challenged. The Company is also on track with its network expansion.&nbsp;&nbsp;</p><p><br /></p><p>The Lubricants business was successful in increasing market share in the consumer channel, through consumer and influencer interventions; and the B2B channel has demonstrated agility to win new businesses.&nbsp;&nbsp;</p><p><br /></p><p>Furthermore, a solar-powered milk refrigeration plant has been built in Basti Katimar, South Punjab, in collaboration with the National Rural Support Program (NRSP), giving 240 dairy farmers access to a milk refrigeration unit. This programme assists dairy farmers in increasing milk shelf life and increasing their own profitability.</p><p><br /></p><p>Shell Tameer Awards 2022, a nationwide competition was launched to reward and recognize young Pakistani innovators who are working towards fuelling their entrepreneurial passion in the areas of Clean Energy Solutions, Technology Innovations, Empowering Women, Circular Economy, Transportation and Mobility and Bright Ideas. Winning entrepreneurs will get a chance to win seed capital, business mentoring, high value networking and local as well as global recognition through Shell. Campus drives and partner engagements were conducted to create awareness around the program and 253 innovative start-ups and prototype stage ideas were received from across Pakistan.&nbsp;&nbsp;</p><p><br /></p><p>SPL remains focused and committed in ensuring that its financial position remains robust and a Goal-Zero approach to safety performance is maintained.&nbsp;&nbsp;</p><p><br /></p><p>SPL is also thankful to the Government for timely settlement of the recent price differential claims and looks forward to a positive settlement of the remaining legacy receivables.&nbsp;</p><p><br /></p><p>Going forward, SPL will actively work to minimize impact of current challenges and endeavour to capture opportunities to ensure that it plays a key role in developing Pakistan’s energy future.</p><div><br /></div><div class=\"blogger-post-footer\"><script async src=\"//pagead2.googlesyndication.com/pagead/js/adsbygoogle.js\"></script>\n<!-- MobileAds -->\n<ins class=\"adsbygoogle\"\n     style=\"display:inline-block;width:320px;height:50px\"\n     data-ad-client=\"ca-pub-2762820915666464\"\n     data-ad-slot=\"9814557735\"></ins>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Admin",
    "uri": "https://www.blogger.com/profile/00179371387546033311",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}