{
  "title": "NIPS 2016 Workshop on Approximate Inference",
  "link": "http://dustintran.com/blog/nips-2016-workshop-on-approximate-inference",
  "guid": "http://dustintran.com/blog/nips-2016-workshop-on-approximate-inference",
  "description": "<p>We’re organizing a NIPS workshop on approximate inference. It is together with Tamara Broderick, Stephan Mandt, and James McInerney—and alongside an incredible cast of seminal researchers: David Blei, Andrew Gelman, Mike Jordan, and Kevin Murphy. [<a href=\"http://approximateinference.org\">Workshop homepage</a>]</p>\n\n<p>This year, we set a theme based on what we believe are some of the most important challenges. In particular, there’s an emphasis on the practice of approximate inference, whether it be challenges which arise in applications or in software. Advances in both methodology and theory are of course crucial to achieve this end-goal; we also highly encourage such work.</p>\n\n<p><strong>Note</strong>: We have (quite a few!) travel awards. If you’re interested in applying, the travel\naward and early application deadline is October 7.</p>\n\n<p>Call for papers below.</p>\n\n<div class=\"highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>We invite researchers in machine learning and statistics to participate in the:\n\nNIPS 2016 Workshop on Advances in Approximate Bayesian Inference\nFriday 9 December 2016, Barcelona, Spain\nwww.approximateinference.org\nSubmission deadline: 1 November 2016\n\n1. Call for Participation\n\nWe invite researchers to submit their recent work on the development, analysis, or application of approximate Bayesian inference. A submission should take the form of an extended abstract of 2-4 pages in PDF format using the NIPS style. Author names do not need to be anonymized and references may extend as far as needed beyond the 4 page upper limit. If authors' research has previously appeared in a journal, workshop, or conference (including the NIPS 2016 conference), their workshop submission should extend that previous work. Submissions may include a supplement/appendix, but reviewers are not responsible for reading any supplementary material.\n\nSubmissions will be accepted either as contributed talks or poster presentations. Extended abstracts should be submitted by 1 November; see website for submission details. Final versions of the extended abstract are due by 5 December, and will be posted on the workshop website.\n\n2. Workshop Overview\n\nBayesian analysis has seen a resurgence in machine learning, expanding its scope beyond traditional applications. Increasingly complex models have been trained with large and streaming data sets, and they have been applied to a diverse range of domains. Key to this resurgence has been advances in approximate Bayesian inference. Variational and Monte Carlo methods are currently the mainstay techniques, where recent insights have improved their approximation quality, provided black box strategies for fitting many models, and enabled scalable computation.\n\nIn this year's workshop, we would like to continue the theme of approximate Bayesian inference with additional emphases. In particular, we encourage submissions not only advancing approximate inference but also regarding (1) unconventional inference techniques, with the aim to bring together diverse communities; (2) software tools for both the applied and methodological researcher; and (3) challenges in applications, both in non-traditional domains and when applying these techniques to advance current domains.\n\nThis workshop is a continuation of past years:\n+ NIPS 2015 Workshop: Advances in Approximate Bayesian Inference\n+ NIPS 2014 Workshop: Advances in Variational Inference\nThis workshop has been endorsed by the International Society for Bayesian Analysis (ISBA) and is supported by Disney Research.\n\n3. Confirmed Speakers and Panelists\n\nInvited speakers:\nBarbara Engelhardt (Princeton University)\nSurya Ganguli (Stanford University)\nJonathan Huggins (MIT)\nJeffrey Regier (UC Berkeley)\nMatthew Johnson (Harvard University)\n\nPanel: Software\nTBA (Stan)\nNoah Goodman (WebPPL; Stanford University)\nDustin Tran (Edward; Columbia University)\nTBA (TensorFlow, BayesFlow; Google)\nMichael Hughes (BNPy; Harvard University)\n\nPanel: On the Foundations and Future of Approximate Inference\nRyan Adams (Harvard University, Twitter Cortex)\nBarbara Engelhardt (Princeton University)\nPhilip Hennig (Max Planck Institute for Intelligent Systems)\nRichard Turner (University of Cambridge)\nNeil Lawrence (University of Sheffield)\n\n4. Key Dates\n\nTravel award application deadline: 7 October 2016\nEarly acceptance notification: 7 October 2016\nPaper submission: 1 November 2016\nAcceptance notification: 16 November 2016\nTravel award notification: 16 November 2016\nFinal paper submission: 5 December 2016\n\nWorkshop organizers:\nTamara Broderick (MIT)\nStephan Mandt (Disney Research)\nJames McInerney (Columbia University)\nDustin Tran (Columbia University)\n\nAdvisory committee:\nDavid Blei (Columbia University)\nAndrew Gelman (Columbia University)\nMichael Jordan (UC Berkeley)\nKevin Murphy (Google)\n</code></pre></div></div>",
  "pubDate": "Fri, 30 Sep 2016 00:00:00 -0700"
}