{
  "guid": "urn:uuid:01cbdab5-20c2-44c1-a3ff-88ec6dcb4b81",
  "link": "https://www.who.int/news/item/04-04-2022-billions-of-people-still-breathe-unhealthy-air-new-who-data",
  "a10:author": {
    "a10:name": ""
  },
  "title": "Billions of people still breathe unhealthy air: new WHO data",
  "description": "Almost the entire global population (99%) breathes air that exceeds WHO air quality limits, and threatens their health.  A record number of over 6000 cities in 117 countries are now monitoring air quality, but the people living in them are still breathing unhealthy levels of fine particulate matter and nitrogen dioxide, with people in low and middle-income countries suffering the highest exposures.",
  "pubDate": "Fri, 01 Apr 2022 09:44:11 Z",
  "a10:content": "<p>Almost the entire global population (99%) breathes air that exceeds WHO air quality limits, and threatens their health.&nbsp; A record number of over 6000 cities in 117 countries are now monitoring air quality, but the people living in them are still\n    breathing unhealthy levels of fine particulate matter and nitrogen dioxide, with people in low and middle-income countries suffering the highest exposures. <br /></p><p>The findings have prompted the World Health Organization to highlight the importance of curbing fossil fuel use and taking other tangible steps to reduce air pollution levels.<br /></p><p>Released in the lead-up to World Health Day, which this year celebrates the theme Our planet, our health, the 2022 update of the World Health Organization&rsquo;s air quality database introduces, for the first time, ground measurements of annual mean\n    concentrations of nitrogen dioxide (NO<sub>2</sub>), a common urban pollutant and precursor of particulate matter and ozone. It also includes measurements of particulate matter with diameters equal or smaller than 10 &mu;m (PM<sub>10</sub>) or 2.5\n    &mu;m (PM<sub>2.5</sub>).&nbsp; Both groups of pollutants originate mainly from human activities related to fossil fuel combustion.<br /></p><p>The new air quality database is the most extensive yet in its coverage of air pollution exposure on the ground. Some 2,000 more cities/human settlements are now recording ground monitoring data for particulate matter, PM<sub>10</sub> and/or PM<sub>2.5</sub>,\n than the last update. This marks an almost 6-fold rise in reporting since the database was launched in 2011.<br /></p><p>Meanwhile, the evidence base for the damage air pollution does to the human body has been growing rapidly and points to significant harm caused by even low levels of many air pollutants.</p><p>Particulate matter, especially PM<sub>2.5</sub>, is capable of penetrating deep into the lungs and entering the bloodstream, causing cardiovascular, cerebrovascular (stroke) and respiratory impacts. There is emerging evidence that particulate matter impacts\n    other organs and causes other diseases as well. <br /></p><p>NO<sub>2 </sub>is associated with respiratory diseases, particularly asthma, leading to respiratory symptoms (such as coughing, wheezing or difficulty breathing), hospital admissions and visits to emergency rooms </p><p>WHO last year revised its Air Quality Guidelines, making them more stringent in an effort to help countries better evaluate the healthiness of their own air. <br /></p><p>&ldquo;Current energy concerns highlight the importance of speeding up the transition to cleaner, healthier energy systems,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;High fossil fuel prices, energy security, and the urgency\n    of addressing the twin health challenges of air pollution and climate change, underscore the pressing need to move faster towards a world that is much less dependent on fossil fuels.&rdquo;&nbsp;</p><h2>Steps governments can take to improve air quality and health<br /></h2><p>A number of governments are taking steps to improve air quality, but WHO is calling for a rapid intensification of actions to:</p><ul><li>Adopt or revise and implement national air quality standards according to the latest WHO Air Quality Guidelines </li><li>Monitor air quality and identify sources of air pollution</li><li>Support the transition to exclusive use of clean household energy for cooking, heating and lighting</li><li>Build safe and affordable public transport systems and pedestrian- and cycle-friendly networks<strong></strong></li><li>Implement stricter vehicle emissions and efficiency standards; and enforce mandatory inspection and maintenance for vehicle<strong></strong><ul><li>Invest in energy-efficient housing and power generation</li><li>Improve industry and municipal waste management</li><li>Reduce agricultural waste incineration, forest fires and certain agro-forestry activities (e.g. charcoal production)</li><li>Include air pollution in curricula for health professionals and providing tools for the health sector to engage.</li></ul></li></ul><h2>Higher income countries see lower particulate pollution, but most cities have trouble with nitrogen dioxide<strong></strong><br /></h2><p>In the 117 countries monitoring air quality, the air in 17% of cities in high-income countries fall below the<a href=\"https://www.who.int/publications-detail-redirect/9789240034228\"> WHO&rsquo;s Air Quality Guidelines</a> for PM<sub>2.5</sub> or PM\n    <sub>10.&nbsp; </sub>In low- and middle-income countries, air quality in less than 1% of the cities complies with WHO recommended thresholds.</p><p>Globally, low- and middle-income countries still experience greater exposure to unhealthy levels of PM<strong> </strong>compared to the global average, but NO<sub>2</sub> patterns are different, showing less difference between the high- and low- and middle-income\n    countries. </p><p>About 4000 cities/human settlements in 74 countries collect NO<sub>2</sub> data at ground level. Aggregated, their measurements show that only 23% of people in these places breathe annual average concentrations of NO<sub>2 </sub>that meet levels in the\n    recently updated version of <a href=\"https://www.who.int/publications-detail-redirect/9789240034228\">WHO&rsquo;s Air Quality Guidelines</a>.\n</p><p>&ldquo;After surviving a pandemic, it is unacceptable to still have 7 million preventable deaths and countless preventable lost years of good health due to air pollution. That&rsquo;s what we&rsquo;re saying when we look at the mountain of air pollution\n    data, evidence, and solutions available. Yet too many investments are still being sunk into a polluted environment rather than in clean, healthy air,&rdquo; said Dr Maria Neira, WHO Director, Department of Environment, Climate Change and Health.</p><h2>Improvement in monitoring needed<br /></h2><p>People living in lower and middle-income countries are the most exposed to air pollution. They are also the least covered in terms of air quality measurement &mdash; but the situation is improving. </p><p>Europe and, to some extent, North America, remain the regions with the most comprehensive data on air quality. In many low- and middle-income countries, while PM<sub>2.5</sub> measurements are still not available, they have seen large improvements for\n    measurements between the last database update in 2018 and this one, with an additional 1500 human settlements in these countries monitoring air quality. </p><h2>WHO&rsquo;s Air Quality Guidelines</h2><p>The evidence base for the harm caused by air pollution has been growing rapidly and points to significant harm caused by even low levels of many air pollutants. Last year, the WHO responded by revising its Air Quality Guidelines to reflect the evidence,\n    making them more stringent, especially for PM and NO<sub>2</sub>, a move strongly supported by the health community, medical associations and patient organizations.</p><p>The 2022 database aims to monitor the state of the world&rsquo;s air and feeds into progress tracking of the Sustainable Development Goals. </p><h2>World Health Day 2022</h2><p>World Health Day, marked on 7 April, will focus global attention on urgent actions needed to keep humans and the planet healthy and foster a movement to create societies focused on well-being. WHO estimates that more than 13 million deaths around the\n    world each year are due to avoidable environmental causes. </p><p>&nbsp;</p><p align=\"center\">###</p><p><strong>Note for editors:</strong><strong></strong></p><p>The report and <a href=\"https://www.who.int/data/gho/data/themes/air-pollution/who-air-quality-database\">WHO air quality database 2022</a>.<br /></p><p>The latest <a href=\"https://www.who.int/publications-detail-redirect/9789240034228\">WHO Air Quality Guidelines</a> (2021) recommend the following concentration limits for these pollutants:</p><p>For PM<sub>2.5</sub>: Annual average 5 &micro;g/m<sup>3</sup>; 24-hour average 15 &micro;g/m<sup>3</sup><strong></strong></p><p>For PM<sub>10</sub>: Annual average 15 &micro;g/m<sup>3</sup>; 24-hour average 45 &micro;g/m<sup>3</sup></p><p>For NO<sub>2</sub>: Annual average 10 &micro;g/m<sup>3</sup>; 24-hour average 25 &micro;g/m<sup>3</sup></p><p><strong></strong>Interim targets also exist to guide action to protect health in places where air pollution is very high. </p><p>&nbsp;</p>"
}