{
  "id": "tag:blogger.com,1999:blog-1747027701196237068.post-165148297602246906",
  "published": "2021-11-08T06:05:00.002-05:00",
  "updated": "2021-11-08T11:36:05.162-05:00",
  "title": "Liard Aboriginal Women’s Society Selected for Google.org Impact Challenge for Women and Girls Funding",
  "content": "<div class=\"separator\" style=\"clear: both;\"><a href=\"https://1.bp.blogspot.com/-bM8hod7Bkk4/YYhY1LzFLZI/AAAAAAAAEoc/2_BxY-CL7EELBjDQr1B6XKdJwauwGD57wCNcBGAsYHQ/s2048/GIC_Announcement_TW_Liard_Aboriginal_Womens_Society_Watson_Lake_Canada.jpg\" style=\"display: block; padding: 1em 0; text-align: center; \"><img alt=\"\" border=\"0\" width=\"600\" data-original-height=\"1152\" data-original-width=\"2048\" src=\"https://1.bp.blogspot.com/-bM8hod7Bkk4/YYhY1LzFLZI/AAAAAAAAEoc/2_BxY-CL7EELBjDQr1B6XKdJwauwGD57wCNcBGAsYHQ/s600/GIC_Announcement_TW_Liard_Aboriginal_Womens_Society_Watson_Lake_Canada.jpg\"/></a></div>   <b>Editor's Note:</b> This blog was guest written by <a href=\"http://www.liardaboriginalwomen.ca/index.php/about/kaska-women\" target=\"_blank\">Ann Maje Raider</a>, Kaska Elder and <a href=\"http://www.liardaboriginalwomen.ca/index.php\" target=\"_blank\">Liard Aboriginal Women’s Society</a> Executive Director <br /><br />  More than 20 years ago, a small group of Indigenous women in northern Canada created an organization to address the impacts of abuse committed by residential schools in the region. I am honored to have shared in the humble beginnings of our organization which has since grown into a significant social movement. Known today as the <a href=\"http://www.liardaboriginalwomen.ca/index.php\" target=\"_blank\">Liard Aboriginal Women’s Society</a> (LAWS), we offer leading-edge social development services to Kaska communities in southern Yukon and northern British Columbia, addressing barriers to economic empowerment  including gender discrimination, cultural displacement, addictions and violence.<br /><br />  Over the next 20 years we intend to deepen the impact and reach of our services, creating a Centre in the form of a virtual hub to vastly improve services and support for Indigenous women. Using culturally informed training and mentorship, the Centre will strengthen access to safe, culturally appropriate practices that enable Indigenous women to recover from violence, realize their economic potential and improve their quality of life. <br /><br />  It is with this Centre in mind that we submitted our ideas and plan to the <a href=\"https://impactchallenge.withgoogle.com/womenandgirls2021\" target=\"_blank\">Google.org Impact Challenge for Women and Girls</a>, and we are gratified that our project is one of 34 global projects selected for funding out of nearly 8,000 applications globally. In addition to funding, we will participate in a four-month accelerator program led by Google’s Accelerator and Women Techmakers communities and Impact Challenge partner <a href=\"https://www.vitalvoices.org/\" target=\"_blank\">Vital Voices</a> to move our project forward. <br /><br />  The LAWS Centre Project is focused on transformative action enabling Indigenous women to reclaim power and place through a multi-faceted, community-led approach, drawing on cultural and critical expertise, and built upon three core principles: <b>Empowerment:</b> The project opens pathways to economic independence for Indigenous women through the sharing of traditional knowledge, through specialized training in leadership and in culturally grounded responses to gender-based violence, and through a skills and knowledge transfer process, empowering Indigenous women as their own trainers.<br /><b>Indigenous Women-Led:</b> The project will provide diverse opportunities for Indigenous women to engage in training design and delivery, by and for Indigenous women and survivors of violence.<br /><b>Paradigm shift:</b> Led by Indigenous women/LGBTQ2S, the project intends to decolonize and transform the service field at multiple levels, understanding violence using the response-based lens, addressing racism and promoting justice-oriented and dignity-driven responses to the needs of Indigenous women and girls.<br /><br />  The assistance of the <a href=\"https://impactchallenge.withgoogle.com/womenandgirls2021\" target=\"_blank\">Google.org Impact Challenge for Women and Girls</a> will enable the LAWS Centre Project to support Indigenous women, who are amongst the most marginalized in Canadian society, and help them overcome socio-economic barriers. This assistance comes at a crucial time and will be used to create an intra-community support system marked by Indigenous women supporting other Indigenous women. <br /><br />  As Indigenous women, we already have the power and solutions to transform public policies that will enable us to achieve our economic potential – the power and solutions borne of our cultural knowledge developed over a millennia and awaiting recognition and implementation by and within current colonial systems. Our ancestors and our cultural knowledge guide us and show the way forward for ourselves and for future generations to rise up and thrive. <br /><br />   <b><i>Editor's note: More about the <a href=\"https://impactchallenge.withgoogle.com/womenandgirls2021\" target=\"_blank\">Google.org Impact Challenge for Women and Girls</a></i><i></i></b><br /> The $25 million philanthropy challenge was <a href=\"https://blog.google/outreach-initiatives/google-org/women-and-girls-challenge-2021/\" target=\"_blank\">launched in March</a> with a challenge to submit the boldest and most innovative ideas to create a more equitable economic reality for women and girls.<br /><br /> Google.org partnered with a women-led panel of experts, including leaders like Rona Ambrose, and gender equity-focused organizations <a href=\"https://www.vitalvoices.org/\" target=\"_blank\">Vital Voices</a> and <a href=\"http://www.project-everyone.org/\" target=\"_blank\">Project Everyone</a> to evaluate proposals based on <a href=\"https://impactchallenge.withgoogle.com/womenandgirls2021/criteria\" target=\"_blank\">four key criteria</a>: innovation, impact, feasibility, and scalability. The selected organizations have outlined projects that will help women and girls, especially those in geographically, economically, or socially marginalized populations, reach their full economic potential. <br /><br /> For more information about our project, other Google.org Impact Challenge for Women and Girls recipients, please follow <a href=\"https://impactchallenge.withgoogle.com/womenandgirls2021/organizations\" target=\"_blank\">this website link</a>.",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Aaron Brindle",
    "uri": "http://www.blogger.com/profile/13885417405401273013",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}