{
  "id": "https://bibleinoneyear.org/en/youth/50",
  "title": "Day 50: God Loves Me",
  "description": "Psalm 23:1–6, Exodus 25:1–9, 26:33, Mark 5:1–20.  He is ‘*My* God’ (Philippians 4:19)  God loves *me*",
  "pubDate": "Sat, 19 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/50/",
  "itunes:duration": "13:30",
  "guid": "enyouth19022022-50",
  "length": 810.5,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 50: God Loves Me",
  "itunes:subtitle": "Psalm 23:1–6, Exodus 25:1–9, 26:33, Mark 5:1–20.  He is ‘*My* God’ (Philippians 4:19)  God loves *me*",
  "itunes:summary": "High on the moors in the Welsh highlands, two ministers met a young shepherd boy who had impaired hearing and was illiterate. They explained that Jesus wanted to be his shepherd, who would always look after him as he, the boy, looked after his sheep. They taught him to repeat the words, ‘The Lord is my shepherd’ (Psalm 23:1), using the fingers and thumb of his right hand to help him remember, starting with his thumb and then a finger for each word. They told him to pause at the fourth word ‘my’, and remember, ‘this psalm was meant for me’.\nSome years later, one of them was passing through that same village and asked after the shepherd boy. The previous winter there had been terrible storms and the boy had died on the hills, buried in a snowdrift. The villager who was telling the story said, ‘There was one thing, however, that we didn’t understand. When his body was discovered he was holding the fourth finger of his right hand.’\nThe ‘parable’ illustrates the nature of God’s personal love for each one of us.\nMany people today think of God as some great impersonal force. However, the God of the Bible is very different. His relationship with us is personal. St Paul wrote, ‘The Son of God, who loved me and gave himself for me’ (Galatians 2:20). He is ‘My God’ (Philippians 4:19). God loves me.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 415
}