{
  "published": "2022-11-01T18:10:00-04:00",
  "updated": "2022-11-01T18:10:00-04:00",
  "title": "Israel votes. Palestine is under siege.",
  "content": "<figure>\n      <img alt=\"\" src=\"https://cdn.vox-cdn.com/thumbor/aRrdCV-F6NcOMmhSbaxCcKf_xHY=/0x0:4403x3302/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71572544/1244400017.0.jpg\" />\n        <figcaption>Israeli soldiers stop a vehicle at a checkpoint south of the city of Nablus in the occupied West Bank on November 1, as Palestinian protesters demand the reopening of roads around the closed-off city, which has been under military lockdown since October 11. | Jaafar Ashtiyeh/AFP via Getty Images</figcaption>\n    </figure>\n\n  <p>The Lions’ Den, a new Palestinian resistance group, has emerged. Here’s what that says about the state of the Israel-Palestine conflict. </p> <p id=\"zsxljJ\">As <a href=\"https://www.nytimes.com/2022/11/01/world/middleeast/israel-why-many-elections.html\">Israel headed to the polls</a> on Tuesday for its fifth election since 2019, Israeli forces have spent the last month putting Palestinian cities in the occupied West Bank under siege. </p>\n<p id=\"rsDfj8\">Since early October, <a href=\"https://www.972mag.com/nablus-siege-lions-den-settlers-army/\">the city of Nablus</a> has been choked off by Israeli settlers. Nablus and the refugee camp of <a href=\"http://972mag.com/jenin-refugee-camp-armed-resistance/\">Jenin</a>, both in the West Bank, have also been the site of <a href=\"https://www.nytimes.com/2022/04/16/world/middleeast/palestinians-israel-violence.html\">Israeli security raids</a>. The clampdown of Nablus comes in response to the emergence of the Lions’ Den, a Palestinian militant group that <a href=\"https://www.aljazeera.com/news/2022/10/11/palestinian-fighters-kill-israeli-soldier-in-occupied-west-bank\">shot dead an Israeli soldier</a> at a checkpoint outside the city in early October. </p>\n<p id=\"UnxNF5\">Lions’ Den has been using armed resistance against Israeli security forces in the occupied West Bank. Unlike Hamas or Islamic Jihad, they are not a religious or ideological faction, and they’re not affiliated with any party. Lions’ Den is specifically <a href=\"https://carnegie-mec.org/diwan/88234\">resisting the presence of Israeli security forces or settler violence</a> to defend Palestinian cities. “The change here is that they have been using arms as a defensive mechanism when there are raids by Israelis,” Nur Arafeh, a researcher at the Carnegie Middle East Center, told me. “We’re talking about an oppressed people choosing to resist the occupation.” </p>\n<p id=\"YtKwOe\">Meanwhile, Israelis voted Tuesday for a new parliament after the collapse of a short-lived “change” government. Initial <a href=\"https://www.reuters.com/world/middle-east/netanyahu-bids-comeback-tight-israeli-election-2022-10-31/\">exit polls suggest a narrow lead</a> by former Prime Minister Benjamin Netanyahu’s Likud Party. He’s a security-focused hawk who has only <a href=\"https://www.reuters.com/article/us-israel-palestinians/netanyahu-renews-support-for-two-state-solution-with-palestinians-idUSKBN0O529Z20150520\">reluctantly</a> backed a Palestinian state and has been willing to downplay his commitment to two states to garner votes. Netanyahu has served longer as prime minister than any other Israeli, but what may be different this time is a much more unified coalition. While he has previously run the country with a bloc of many smaller parties, this right-wing coalition would have fewer parties and would be easier to hold together. </p>\n<p id=\"cg494I\">This will be a more coherent government that can institute policy more effectively. And <a href=\"https://www.npr.org/2022/10/31/1132246865/israel-election-netanyahu\">extreme-right, pro-settler</a> members of his coalition are likely to push for an even harsher crackdown on Palestinians in the occupied West Bank.</p>\n<p id=\"0cadA4\">The violence has increased. More than 125 Palestinians have been killed in the occupied West Bank and East Jerusalem already this year. A United Nations official says that this is the most lethal year for Palestinians <a href=\"https://www.nbcnews.com/news/world/israel-west-bank-palestinians-deadliest-year-united-nations-report-rcna54643\">since 2005</a>. And there is also <a href=\"https://www.nytimes.com/2022/03/29/world/middleeast/israel-shooting-deaths.html\">rising violence</a> against Israelis, <a href=\"https://news.un.org/en/story/2022/10/1129977\">according to the UN</a>, with two Israeli security personnel and 25 civilians killed so far this year. </p>\n<p id=\"5Q2PXm\">Israel has responded with violent raids in Nablus and other West Bank cities, widespread <a href=\"https://www.nytimes.com/2022/10/26/world/middleeast/israel-palestinians-insurgency-blockade-nablus-jenin.html\">crackdowns</a>, and what human rights groups allege to be the revival of <a href=\"https://theintercept.com/2022/02/15/israel-assassination-west-bank-palestine/\">targeted assassinations</a> in the West Bank. </p>\n<p id=\"kZ1NYk\">For two decades, Israel would conduct arrests and shootouts, or collaborate with the Palestinian Authority’s security services, but would not engage in extrajudicial killing in the West Bank. Then in February, <a href=\"https://theintercept.com/2022/02/15/israel-assassination-west-bank-palestine/\">an attack by Israeli security forces</a> killed three Palestinian men who were part of a separate militant group; Israeli forces denied it was a targeted assassination at the time, but human rights groups said the tactics looked similar to that old policy. </p>\n<p id=\"PS7WMt\">In late October, the Lions’ Den <a href=\"https://www.aljazeera.com/news/2022/10/23/israel-kills-palestinian-top-member-of-armed-group-in-west-bank\">cited two videos</a> and said that Israel <a href=\"https://www.reuters.com/world/middle-east/palestinian-militant-killed-by-israel-targeted-explosion-group-says-2022-10-23/\">planted</a> a bomb on the motorcycle of operative Tamer al-Kilani that killed him. (Israel and the Palestinian Authority would not comment on the attack to news organizations at the time, and the Israeli military declined to comment to Vox on whether it has revived targeted assassinations as a policy.) But both incidents show the risks Israel is willing to take. </p>\n<p id=\"04yJGa\">This comes as Lions’ Den, and what Al-Jazeera <a href=\"https://www.aljazeera.com/news/2022/10/26/who-are-the-lions-den-armed-group-in-occupied-west-bank-explainer\">describes</a> as its “core 15-20 members,” is gaining popular support among Palestinians. Last month, Israelis put the Jerusalem refugee camp Shuafat under siege in response to its civil disobedience. Lions’ Den called for a <a href=\"https://www.aljazeera.com/news/2022/10/12/palestinians-strike-against-israeli-siege-jerusalem-camp\">one-day general strike</a> in the West Bank in solidarity that showed the group’s organizing power.</p>\n<p id=\"Jib99j\">This is a uniquely tense moment in the occupied West Bank. The lack of a Palestinian-Israeli peace process, the entrenchment of a 55-year-old military occupation of the West Bank and East Jerusalem, the blockade of Gaza, and the lack of political accountability within the Palestinian government offer few alternatives. This is not yet a widespread movement. But Lions’ Den or future groups like it could galvanize support within, and beyond, the occupied West Bank, which could ultimately lead to more political violence and changing political realities. </p>\n<p id=\"dgMDZk\">Yara Asi, a global health researcher at the University of Central Florida, recently returned from visiting family in Nablus. She described in vivid detail the persistent hum of Israeli surveillance drones patrolling above the West Bank city and the intense security queues monitoring every vehicle and person entering and exiting it. </p>\n<div id=\"14LRBq\">\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">Here in Nablus, the buzz of Israeli surveillance drones has been constant for days. Entrances to the city are still blocked. Just minutes away in Huwwara, settlers are vandalizing Palestinian property. In Jenin, a Palestinian doctor was killed this morning &amp; 2 paramedics injured.</p>— Yara Asi, PhD (@Yara_M_Asi) <a href=\"https://twitter.com/Yara_M_Asi/status/1580889493036404736?ref_src=twsrc%5Etfw\">October 14, 2022</a>\n</blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p id=\"WHL3sd\">“You’re always kind of told the media narrative is ‘it’s a time of relative calm, it’s a time of relative peace.’ And then something happens, and you’ll hear ‘tensions escalated,’ ‘clashes escalated,’” Asi says. She says this framing that we so often read in the press misses the larger point. “For Palestinians, the situation is consistently intolerable.” </p>\n<h3 id=\"IN6I5r\">What is driving this moment of increased violence?</h3>\n<p id=\"5Oc7Ik\">This is the culmination of political forces of the last 30 years that have disenfranchised Palestinians. The <a href=\"https://www.vox.com/world/2019/4/15/18306224/palestinians-israel-khaled-elgindy-blind-spot\">1993 Oslo Accords</a>, signed on the White House lawn between Israel and the Palestine Liberation Organization (PLO), held out <a href=\"https://merip.org/palestine-israel-primer/\">the possibility</a> of an independent, sovereign Palestinian state alongside Israel. </p>\n<p id=\"9xKDu9\">But that possibility seems further away than ever. The Israeli occupation is so ingrained in the West Bank and East Jerusalem that <a href=\"https://www.hrw.org/report/2021/04/27/threshold-crossed/israeli-authorities-and-crimes-apartheid-and-persecution\">many</a> <a href=\"https://www.nbcnews.com/news/world/b-tselem-labels-israel-apartheid-regime-first-time-n1253863\">human rights organizations</a> and <a href=\"https://www.ohchr.org/en/press-releases/2022/03/israels-55-year-occupation-palestinian-territory-apartheid-un-human-rights\">UN experts</a> have started to<strong> </strong>describe the situation as apartheid. There is a <a href=\"https://www.reuters.com/world/middle-east/growing-israeli-west-bank-settlements-test-us-position-ahead-biden-visit-2022-07-11/\">massive expansion of Israeli settlements</a>, and Israeli settlers live under different laws and hold more rights than Palestinians living nearby. The devastating <a href=\"https://www.aljazeera.com/news/2021/3/14/a-guide-to-the-gaza-strip\">blockade of Gaza</a> and Israel’s persistent <a href=\"https://www.aljazeera.com/news/2022/8/7/timeline-israels-attacks-on-gaza-since-2005\">bombing of civilian life and infrastructure</a> there has made it untenable. And Palestinians who hold Israeli citizenship have far fewer opportunities than Israelis. </p>\n<p id=\"3zospd\">Today, the Oslo generation is frustrated and has no means by which to channel it. </p>\n<p id=\"ZgjJA4\">Even as the Palestinian Authority, the Biden administration, and the international community keep talking about a nonexistent two-state solution, the Israeli government often shows signs that it is not interested. Few Israeli politicians have <a href=\"https://www.al-monitor.com/originals/2022/10/two-state-solution-shrinks-campaigning-wraps-israel\">mentioned</a> it on the campaign trail.</p>\n<p id=\"xK7EWZ\">Lions’ Den is emerging from a political vacuum among Palestinians. Mahmoud Abbas, the leader of the PLO, is 87 years old. He is also the president of the Palestinian Authority, which has <a href=\"https://carnegieendowment.org/2022/09/27/procedural-guide-to-palestinian-succession-how-of-who-pub-88020\">not held elections since 2009</a> — he is serving the 17th year of a term that ended long ago. It’s part of why the PA has little legitimacy and has led some Palestinians to view it as a <a href=\"https://www.972mag.com/palestinian-authority-nablus-occupation-subcontractor/\">subcontractor of the Israeli occupation</a>. </p>\n<p id=\"wF8Es2\">“The representative body for Palestinians is the PLO, not the PA, and those elections have never taken place,” Akram Salhab, a Palestinian activist, told me. “The political process doesn’t exist, and no one even pretends it exists anymore.”</p>\n<div id=\"JTtIcY\">\n<blockquote class=\"twitter-tweet\">\n<p lang=\"en\" dir=\"ltr\">As Israelis go vote today, remember the millions of people living under this regime that don’t choose the entity that rules them.The illusion of democracy masks a violent &amp; segregationist system of apartheid.The answer isn’t just civil rights for all,but decolonisation &amp; justice.</p>— Salem Barahmeh (@Barahmeh) <a href=\"https://twitter.com/Barahmeh/status/1587371239886110721?ref_src=twsrc%5Etfw\">November 1, 2022</a>\n</blockquote>\n<script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n</div>\n<p id=\"uLEL0D\">The political system in Palestine has in practice excluded young people. “Now you have these new groups of young men in their early 20s who are so disenchanted with the Palestinian Authority, who are under intense oppression by the Israeli occupation, and who decided to take things into their own hands because there’s no political outlook,” says Arafeh. </p>\n<p id=\"abRz5z\">Another driver is the growing violence of Israeli settlers. Lions’ Den has mobilized in areas where <a href=\"https://www.972mag.com/face-to-face-with-settler-violence-road-to-nablus/\">settler violence</a> is the highest and the <a href=\"https://jewishcurrents.org/israeli-settler-violence-surges-as-palestinians-turn-to-armed-resistance\">most extremist settlers live</a>. Neither Palestinian authorities nor Israeli forces have done much to stem settler violence. In many cases, the settlers have the <a href=\"https://www.vox.com/23207299/israel-palestine-settlements-chart-two-state-biden-visit\">backing of the Israeli state</a>. Haaretz reported that, according to an Israeli security source, there were more than <a href=\"https://www.haaretz.com/israel-news/2022-10-21/ty-article/.highlight/settlers-commit-100-crimes-against-west-bank-palestinians-in-last-10-days/00000183-f93d-d2c9-a3e7-f9ff40800000\">100 incidents of settler violence in the West Bank</a> over 10 days in October. </p>\n<p id=\"pzb6n0\">A UN report from last month <a href=\"https://www.ohchr.org/sites/default/files/documents/hrbodies/hrcouncil/coiopt/2022-10-19/Report-COI-OPT-14Sept2022-EN.pdf\">noted</a> that by “ignoring settler violence originating in outposts and not applying legal sanctions against settlers breaking the law,” Israel sends a “clear message” that such behavior is okay. A senior Biden diplomat condemned the UN report as <a href=\"https://www.haaretz.com/us-news/2022-10-22/ty-article/.premium/u-s-decries-un-commission-of-inquirys-one-sided-report-on-israel-palestine/00000184-00b6-dd10-a7cd-d8f6a2990000\">one-sided</a>. Yet the US State Department has <a href=\"https://www.jta.org/2021/12/17/united-states/in-reset-to-pre-trump-norm-state-department-terrorism-report-includes-extensive-reporting-on-west-bank-settler-violence\">reported extensively on settler violence</a>, including in its <a href=\"https://www.state.gov/reports/country-reports-on-terrorism-2020/israel/\">annual reporting on terrorism</a>, where it noted that in 2020 the UN had “documented 771 incidents of settler violence that brought injury to 133 Palestinians and damaged 9,646 trees and 184 vehicles, mostly in the areas of Hebron, Jerusalem, Nablus, and Ramallah.”</p>\n<p id=\"6JCQsW\">That’s all set against the broader ongoing oppression. The United Nations <a href=\"https://news.un.org/en/story/2022/10/1129977\">notes</a> that in the last three months, “In total, 32 Palestinians, including six children, were killed by Israeli security forces during demonstrations, clashes, search-and-arrest operations, attacks and alleged attacks against Israelis, and other incidents.”</p>\n<p id=\"obYgOL\">It’s in this context that the Palestinians also feel abandoned by the United States, which is one of Israel’s closest international partners. President Joe Biden’s administration has changed some of its rhetoric from staunchly <a href=\"https://prospect.org/world/dont-call-it-a-peace-plan-israel-palestine-trump/\">anti-Palestinian Trump policies</a>, but Biden has also quietly <a href=\"https://www.aljazeera.com/news/2022/7/12/israel-palestine-us-policy-what-changed-under-biden-what-didnt\">maintained much of Trump’s status quo</a>, including keeping the US embassy in Jerusalem and focusing on deals between Israel and Arab states rather than Israeli-Palestinian talks. </p>\n<p id=\"O7yYtV\">There’s also a sense of abandonment from Arab governments. Countries like the United Arab Emirates, Morocco, and Bahrain have normalized relations with Israel, breaking their pledge to hold off doing so until there was an independent Palestinian state. Even Saudi Arabia, a longtime supporter of Palestinian rights, has become a <a href=\"https://www.wsj.com/articles/israeli-business-in-saudi-arabia-emerges-from-shadows-at-investment-conference-11666892535\">comfortable place for Israeli business</a>. </p>\n<p id=\"VGIhIV\">This suggests to Israel that it can have it both ways: a clampdown on Palestinians and lucrative normalization deals with Arab states. In October, Israel announced a new law in which citizens of Arab countries it now has diplomatic ties to (Jordan, Egypt, Morocco, and Bahrain) visiting Israel are largely <a href=\"https://www.theguardian.com/world/2022/oct/20/israel-imposes-strict-rules-on-travel-to-west-bank\">restricted from visiting the West Bank</a>. </p>\n<p id=\"WkdoWY\">“Big picture: These accords have facilitated Israel’s capacity for repression in some ways, but also exacerbated the conditions where Palestinians are on the sidelines, that there isn’t really any kind of international pressure or movement to resolve some of the worsening political conditions,” Dana El Kurd, a political scientist at the University of Richmond, told me. </p>\n<h3 id=\"ctr7Ir\">Where does Palestinian resistance go from here?</h3>\n<p id=\"3yV3x5\">The Lions’ Den’s actual membership is small, but it has proved galvanizing for many living under occupation. Though Israeli forces have put entire cities under siege, it’s not likely they’ll be able to eradicate the new group. Even as Israel targets its more prominent members, Lions’ Den is fragmented, dispersed, and essentially leaderless by design, according to the experts I interviewed. </p>\n<p id=\"7mxrQQ\">A Palestinian Authority governor in Nablus <a href=\"https://www.jpost.com/middle-east/article-719337\">met</a> last month with Lions’ Den members and urged them to give up their weapons in return for an amnesty arrangement, but they <a href=\"https://www.middleeastmonitor.com/20221004-pa-is-negotiating-with-resistance-fighters-in-nablus-to-sell-their-weapons-israel-media/\">rebuffed</a> the offer. </p>\n<p id=\"0yphMj\">Israel, meanwhile, has vowed to continue targeting the group, alleging it is “trying to carry out attacks.”</p>\n<p id=\"qubSlf\">“Our goal was and remains to strike hard and continuously at terrorists and those who dispatch them in Jenin, Nablus and wherever terrorism takes root; we will not relent even for a moment,” Prime Minister Yair Lapid <a href=\"https://www.gov.il/en/departments/news/spoke-quality251022\">said</a> in October after Israeli forces conducted a raid that killed a member of Lions’ Den.</p>\n<p id=\"oBUbbn\">Elderly neighbors that Asi, the global health scholar, spoke to in Nablus explained that this was the harshest blockade that they had experienced in 50 years. In the past, maybe Israelis would shut down the city for a couple of days, but now it has been a couple of weeks with checkpoints controlling all movement in and out of Nablus. People can’t leave to get urgent medical care, to visit family or to work, all while Israeli settlers are able to travel via an alternate network of roads that allows them to bypass Palestinian cities. </p>\n<p id=\"kzWrxE\">“It has been really devastating to the city, especially just the uncertainty of it,” Asi says. “The tea kettle is screaming, it’s boiling, and occasionally that leads to violence.”</p>\n<p id=\"06qGeD\">One question is whether this leads to unification among disparate Palestinians in disparate locales — across the occupied West Bank and in Gaza, in Jerusalem and in Israel’s 1948 borders.</p>\n<p id=\"S3zu9M\">“Israel has imposed collective punishment,” says Arafeh, “so that Palestinians wouldn’t be able to go to universities or to schools. The Israeli assumption is that Palestinians would be fed up with this resistance because it’s not allowing them to go to schools, universities, or to ship products.”</p>\n<p id=\"dqzRzl\">But that assumption might not hold. <a href=\"https://www.nytimes.com/2022/09/16/world/middleeast/ibrahim-al-nabulsi-west-bank-violence.html\">Ibrahim al-Nabulsi</a> was the <a href=\"https://mondoweiss.net/2022/10/ibrahim-al-nabulsi-turns-19-in-the-grave/\">18-year-old</a> apparent co-founder of Lions’ Den. He was killed in a shootout with Israeli forces in September, and his final hideout has since become a shrine.</p>\n<p id=\"519LBR\">“If you’re Palestinian today, and you look around you, what you see is an extreme, violent military occupation, which manifests in every tiny detail of your life,” says Salhab, the Jerusalem-based activist.</p>\n<p id=\"Z0uCLo\">And not all aspects of the suppression of Palestinians are so headline-grabbing. Salhab emphasizes the mundane aspects of occupation, the way he says that Israeli authorities count the number of toothbrushes there are in Palestinian homes in Jerusalem, where he lives, to confirm how many residents live in a given home. As he put it, “People don’t understand how that builds to a societal pressure that will lead to Palestinians only seeing one solution, which is resistance to Israel.”</p>",
  "link": "",
  "id": "https://www.vox.com/world/2022/11/1/23434741/israel-election-palestine-under-siege-lions-den",
  "author": {
    "name": "Jonathan Guyer"
  }
}