{
  "title": "203: Dateline: \"Lori Vallow: What Happened to the Children\"",
  "link": "https://audioboom.com/posts/7964768",
  "itunes:episode": 203,
  "itunes:title": "Dateline: \"Lori Vallow: What Happened to the Children\"",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3316,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>\n<strong>HAPPY DATELINE THURSDAY! For the next 10 Thursdays, we're giving you a bonus episode covering A KEITH MORRISON DATELINE EPISODE! <br>\n<br>\n</strong>This week we're diving into the case of Lori Vallow who was charged with deserting her children Tylee and JJ who, at the time the episode aired, had not been seen in months. This episode gives the backstory of the case and is the precursor to \"Mommy Doomsday\" (next Thursday's episode) in which we get the gripping conclusion to the story. FIRE UP YOUR GARBAGE BELLS....WE GOT SOME S**T TO SAY ABOUT HIS MONSTER!<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> <br>\n<br>\nFAM! IF YOU'RE COMING TO SEE US ON BROADWAY ON APRIL 11, 2020 YOU MUST CONFIRM YOUR TICKETS BY OCTOBER 31  <a href=\"https://2st.formstack.com/forms/tcoexchange?promo&fbclid=IwAR2eunIi0uQwxh6-ecXOflE11pmu9fwRkqdYm5WZcwxeHk7AI-8pOowdmlc\">BY USING THIS LINK</a> (you can also use this link to cancel and get a refund). <strong>If you do not confirm your tickets by 10/31 you will be automatically refunded and your tickets will be resold!</strong> WE LOVE YOU AND WE CAN'T WAIT TO SEE YOU ON BROADWAY!</div>\n",
  "pubDate": "Thu, 21 Oct 2021 10:25:42 +0000",
  "guid": "tag:audioboom.com,2021-10-21:/posts/7964768",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}