{
  "title": "Episode 56: What is Music Therapy?",
  "pubDate": "Sat, 10 May 2008 16:53:17 +0000",
  "guid": "episode-56-what-is-music-therapy",
  "link": "http://www.thepsychfiles.com/2008/05/10/episode-56-what-is-music-therapy/",
  "itunes:image": "",
  "description": "Interested in Music Therapy?  Music therapy, which is often used with children with autism, can also be used in the classroom to help children learn patterns.  In this interview music therapist Kamile Geist talks about types and techniques of music therapy along with her research in this fascinating field.  On the website Kamile talks about courses and programs that will prepare you to be a music therapist, as well as how insurance programs deal with this type of therapy.",
  "content:encoded": "Interested in Music Therapy?  Music therapy, which is often used with children with autism, can also be used in the classroom to help children learn patterns.  In this interview music therapist Kamile Geist talks about types and techniques of music therapy along with her research in this fascinating field.  On the website Kamile talks about courses and programs that will prepare you to be a music therapist, as well as how insurance programs deal with this type of therapy.",
  "enclosure": "",
  "itunes:duration": "37:55",
  "itunes:explicit": false,
  "itunes:keywords": "music,Therapy",
  "itunes:subtitle": "Interested in Music Therapy? Music therapy, often used with children with autism, can also be used in the classroom to help children learn patterns. In this interview music therapist Kamile Geist talks about types and techniques of music therapy.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Interested in Music Therapy? Music therapy, which is often used with children with autism, can also be used in the classroom to help children learn patterns. In this interview music therapist Kamile Geist talks about types and techniques of music therapy along with her research in this fascinating field. On the website Kamile talks about courses and programs that will prepare you to be a music therapist, as well as how insurance programs deal with this type of therapy."
}