{
  "itunes:episode": 108,
  "title": "A Life in Letterpress: a Live Podcast",
  "pubDate": "Wed, 06 Feb 2019 22:14:22 +0000",
  "link": "https://newdisrupt.org/blog/2019/2/6/living-a-life-in-letterpress-live-at-adas-episode-108",
  "guid": "tag:soundcloud,2010:tracks/571285218",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "00:54:26",
  "description": "<p>My love of letterpress printing is no secret, and in this episode, I speak to two designers who devote parts of their working lives to modern letterpress. This episode was taped live at Ada’s Technical Books and Café in Seattle on January 23.</p>\n<p>Printing didn’t change much from about 1450 to 1950. It became faster, motorized, and blew up to industrial scale, but it was only when the “relief” (or letterpress) method of printing—putting ink on a surface and then pressing paper onto it—was replaced with offset lithography, which relies on flat printing plates and thin films of ink, that everything changed for good. Letterpress printing has remained as a craft, though, and it has thrived in the last 20 years as it’s been rediscovered and taught fresh to new generations.</p>\n<p>Two Seattle practitioners have deep ties to this great resurgence of letterpress. We talk about how they got sucked into an old-school printing method and how the medium affects their design and vice-versa.</p>\n<ul>\n<li>\n<p>Sarah Kulfan is a visual designer, illustrator, and letterpress printer. She is the proprietrix of <a href=\"https://gallopintopress.com\">Gallo Pinto Press</a> and <a href=\"http://beansnrice.com\">Beans n’ Rice</a> where she respectively prints limited edition prints and runs her freelance graphic design business.</p>\n</li>\n<li>\n<p>Demian Johnston is the Designer and Pressman at Annie’s Art & Press, a letterpress shop in Ballard. At SVC, he teaches both introductory and advanced classes in the letterpress program. His design and illustration work has appeared in <em>The Stranger</em>, <em>Seattle Weekly</em>, <em>City Arts</em>, and <em>Beer Advocate</em>.</p>\n</li>\n</ul>\n<h2>Sponsors</h2>\n<p>Thanks to the patrons in the crowdfunding campaign who brought the New Disruptors back, and these Disruptor-level backers in particular: Elliott Payne, my friends at Lumi, Kirk McElhearn, Kuang-Yu Liu, and Marc Schwieterman. (Marc, and another Disruptor backer, Kim Ahlberg, attended the taping!) You can <a rel=\"payment\" href=\"https://newdisrupt.org/support/\">become a patron of the show</a> on a one-time or recurring basis, and get rewards like an exclusive enamel pin and being thanked in this fashion!</p>\n<h2>Show notes:</h2>\n<p>We talk about a lot of concepts and old tech in this show, so the notes are a little more extensive to help you understand some of the things we mentioned just in passing:</p>\n<ul>\n<li>\n<p>SVC is the <a href=\"https://www.svcseattle.com\">School of Visual Concepts</a> in Seattle, where Jenny Wilkson runs the letterpress program. It’s a for-profit analog and digital design school, teaching letterpress, UI/UX, graphic design, copywriting and more. It’s where I had my 2017 design residency, too!</p>\n</li>\n<li>\n<p>Demian has a <a href=\"http://www.excelsiorpress.org/Chandler_and_Price/index.html\">10x15 Chandler and Price</a> (C&P), which is a workhorse press, <a href=\"https://circuitousroot.com/artifice/letters/press/presses/cp-gordon/index.html\">manufactured from 1884 to 1964</a>.</p>\n</li>\n<li>\n<p><a href=\"http://www.sternandfaye.com\">Stern & Faye</a>: Jules Remedios Faye and Chris Stern ran this press together for decades. Jules continues to print and bind, and handbound my book, <em><a href=\"https://glog.glennf.com/general-shop/letterpress-fine-point\">Not To Put Too Fine a Point on It</a></em> (copies still available). The <a href=\"http://www.metaltype.org/ccstf/\">C.C. Stern Type Foundry</a>, a working museum in Portland, Oregon, is named for Chris and features a lot of Jules and Chris’s casting equipment.</p>\n</li>\n<li>\n<p>“dissed type”: <a href=\"https://www.youtube.com/watch?v=SgQa_BvaS-w\">Type distribution</a> is an incredibly tedious part of hand setting type. Each character you pull out of a type case has to be “distributed” back into its original compartment in the case when you’re done with a printing job.</p>\n</li>\n<li>\n<p><a href=\"https://www.kurzke.co.uk/ruling-pens-and-technical-pens-part-i-ruling-pens/\">Ruling pens</a>: These pens were used for making lines, or “rules,” and hold ink in a reservoir between two jaws. The gap of the jaws can be adjusted to create lines of different thickness.</p>\n</li>\n<li>\n<p>Plates: Printing plates are solid sheets of metal or plastic made from source material and intended to be printed as a full sheet, sometimes including dozens of pages. Starting in the 1800s, printers would cast metal plates (called “stereotypes”); in more recent decades, printers rely on a rubbery plastic called photopolymer that’s light sensitive. Digital files can be output to high-contrast film and exposed to the plastic plastic, and make a letterpress-printable plate.</p>\n</li>\n<li>\n<p><a href=\"https://www.davidsongalleries.com/artists/contemporary/carl-v-montford/\">Carl Montford</a>: a local renowned wood block engraver, who has taught thousands of people how to carve linoleum blocks and hundreds how to carve in wood.</p>\n</li>\n<li>\n<p><a href=\"https://letterpresscommons.com/linoleum/\">Linoleum blocks</a>: These are really just pieces of linoleum glued to a wood base. A designer carves the linoleum to leave high areas to receive ink.</p>\n</li>\n<li>\n<p>Type high: The exact height needed for type and other material on the “bed” of a press to be inked by rollers and press exactly at the right distance into paper. It’s 0.918 inches in America and England.</p>\n</li>\n<li>\n<p>Touche plate: This may have been a regionalism, but a “touche” (French, pronounced <em>toosh</em>) is a touch-up plate used to fix an error in offset printing.</p>\n</li>\n<li>\n<p><a href=\"http://www.boardingallrows.com/linoleum-reduction-prints/\">Reduction cut</a>: On a block, you engrave a starting image that prints in the lightest color, carve away details, print the next-lightest color, and so forth. The block is creatively destroyed in the process.</p>\n</li>\n<li>\n<p>A <a href=\"https://letterpresscommons.com/impression/\">“kiss” impression</a></p>\n</li>\n<li>\n<p><a href=\"http://vandercookpress.info\">Vandercook cylinder presses</a> are the hot thing in letterpress today, originally designed largely as a “proof press”: to pull a copy of a section of text for proofreading, layout, and evenness, before it went on a <em>real</em> press.</p>\n</li>\n<li>\n<p><a href=\"https://www.youtube.com/watch?v=rHhiJ3wGuCM\">Printing the Oxford English Dictionary</a> (YouTube)</p>\n</li>\n<li>\n<p><a href=\"https://vimeo.com/127605643\">“Farewell, Etaoin Shrdlu”</a>: The last day of hot-metal Linotype typesetting at the <em>New York Times</em></p>\n</li>\n<li>\n<p>The quote I was trying to recall was from <em><a href=\"https://isbn.nu/0881791547\">A Short History of the Printed Word</a></em>, written by Warren Chappell and, in a second edition, updated and extended by Robert Bringhurst. Bringhurst wrote the following devastating sentence about the entire era following relief printing:</p>\n</li>\n</ul>\n<blockquote>\n<p>In the 1970s and 1980s, the practitioners of photocomposition and offset printing were, like Gutenberg, engaged in a simultaneously innovative and imitative act. But they were not imitating writing; they were imitating printing—and were doing so in a world where reading had become, for most, a passive, cerebral act, unconnected with any physical sense of the making of letters, and unconnected with any sense of the intellectual urgency of publishing.</p>\n</blockquote>",
  "itunes:subtitle": "Two letterpress printers describe how they live in the 19th and 21st centuries at the same time with their analog and digital work.",
  "itunes:summary": "My love of letterpress printing is no secret, and in this episode, I speak to two designers who devote parts of their working lives to modern letterpress. This episode was taped live at Ada’s Technical Books and Café in Seattle on January 23.\n\nPrinting didn’t change much from about 1450 to 1950. It became faster, motorized, and blew up to industrial scale, but it was only when the “relief” (or letterpress) method of printing—putting ink on a surface and then pressing paper onto it—was replaced with offset lithography, which relies on flat printing plates and thin films of ink, that everything changed for good. Letterpress printing has remained as a craft, though, and it has thrived in the last 20 years as it’s been rediscovered and taught fresh to new generations.\n\nTwo Seattle practitioners have deep ties to this great resurgence of letterpress. We talk about how they got sucked into an old-school printing method and how the medium affects their design and vice-versa.\n\nSarah Kulfan is a visual designer, illustrator, and letterpress printer. She is the proprietrix of Gallo Pinto Press and Beans n’ Rice where she respectively prints limited edition prints and runs her freelance graphic design business.\n\nDemian Johnston is the Designer and Pressman at Annie’s Art & Press, a letterpress shop in Ballard. At SVC, he teaches both introductory and advanced classes in the letterpress program. His design and illustration work has appeared in The Stranger, Seattle Weekly, City Arts, and Beer Advocate.\n\nSponsors\n\nThanks to the patrons in the crowdfunding campaign who brought the New Disruptors back, and these Disruptor-level backers in particular: Elliott Payne, my friends at Lumi, Kirk McElhearn, Kuang-Yu Liu, and Marc Schwieterman. (Marc, and another Disruptor backer, Kim Ahlberg, attended the taping!) You can become a patron of the show and get a special pin and be thanked on the air, too, at newdisrupt.org/support"
}