{
  "title": "Nonlinear Landauer formula: Nonlinear response theory of disordered and topological materials. (arXiv:2110.08304v2 [cond-mat.mes-hall] UPDATED)",
  "link": "http://arxiv.org/abs/2110.08304",
  "description": "<p>The Landauer formula provides a general scattering formulation of electrical\nconduction. Despite its utility, it has been mainly applied to the\nlinear-response regime, and a scattering theory of nonlinear response has yet\nto be fully developed. Here, we extend the Landauer formula to the\nnonlinear-response regime. We show that while the linear conductance is\ndirectly related to the transmission probability, the nonlinear conductance is\ngiven by its derivatives with respect to energy. This sensitivity to the energy\nderivatives is shown to produce unique nonlinear transport phenomena of\nmesoscopic systems including disordered and topological materials. By way of\nillustration, we investigate nonlinear conductance of disordered chains and\nidentify their universal behavior according to symmetry. In particular, we find\nlarge singular nonlinear conductance for zero modes, including Majorana zero\nmodes in topological superconductors. We also show the critical behavior of\nnonlinear response around the mobility edges due to the Anderson transitions.\nMoreover, we study nonlinear response of graphene as a prime example of\ntopological materials featuring quantum anomaly. Furthermore, considering the\ngeometry of electronic wave functions, we develop a scattering theory of the\nnonlinear Hall effect. We establish a new connection between the nonlinear Hall\nresponse and the nonequilibrium quantum fluctuations. We also discuss the\ninfluence of disorder and Anderson localization on the nonlinear Hall effect.\nOur work opens a new avenue in quantum physics beyond the linear-response\nregime.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Kawabata_K/0/1/0/all/0/1\">Kohei Kawabata</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ueda_M/0/1/0/all/0/1\">Masahito Ueda</a>"
}