{
  "title": "How to build Raspberry Pi Pico programs with no software installation",
  "link": "https://petewarden.com/2022/09/20/how-to-build-raspberry-pi-pico-programs-with-no-software-installation/",
  "comments": "https://petewarden.com/2022/09/20/how-to-build-raspberry-pi-pico-programs-with-no-software-installation/#comments",
  "dc:creator": "Pete Warden",
  "pubDate": "Tue, 20 Sep 2022 01:41:44 +0000",
  "category": "Uncategorized",
  "guid": "http://petewarden.com/?p=7719",
  "description": "I love using the Raspberry Pi Pico board to teach students about microcontrollers, especially as it only costs $4 and is currently in stock despite the supply chain crisis. I have run into some problems though, because building a program requires installing software. This might not sound like a big barrier, but when people arrive [&#8230;]",
  "content:encoded": "\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe class=\"youtube-player\" width=\"550\" height=\"310\" src=\"https://www.youtube.com/embed/bDDgihwDhRE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation\"></iframe>\n</div><figcaption class=\"wp-element-caption\"><a href=\"https://www.youtube.com/watch?v=bDDgihwDhRE\"><em>youtube.com/watch?v=bDDgihwDhRE</em></a></figcaption></figure>\n\n\n\n<p>I love using the <a href=\"https://www.raspberrypi.com/products/raspberry-pi-pico/\">Raspberry Pi Pico board</a> to teach students about microcontrollers, especially as it only costs $4 and is currently in stock despite the supply chain crisis. I have run into some problems though, because building a program requires installing software. This might not sound like a big barrier, but when people arrive with a mix of Windows, MacOS, ChromeOS, and Linux laptops, often with different versions or architectures within each group, trying to guide them through the process can easily take a whole lesson, and require individual attention from me to debug each particular problem while the other students get bored. It&#8217;s also frustrating for the class to have to wait an hour before they get to do anything cool, I much prefer giving them a success as early as possible.</p>\n\n\n\n<p>To solve this problem, I&#8217;ve actually turned to what might seem an unlikely tool, <a href=\"https://colab.research.google.com/\">Google&#8217;s Colab service</a>. If you have run across this, you probably associate it with Python notebooks, because that&#8217;s its primary use case. I&#8217;ve found it to be useful for a lot more though, because it effectively gives you a free, temporary Linux virtual machine that you control through the browser. Instead of running Python commands, you can run Linux shell commands by putting an exclamation point at the start. There are some restrictions, such as needing a Google account to sign in, and the file system disappearing after you leave the page or are idle too long, but I&#8217;ve found it great for documenting all sorts of installation and build processes in an accessible way.</p>\n\n\n\n<p>I&#8217;m getting ready to teach <a href=\"https://ee292d.github.io/\">EE292D (TinyML)</a> at Stanford again this year, but we&#8217;re switching over to the Pico boards instead of the Arduino Nano BLE Sense 33s that we have used, because the latter have been out of stock for quite a while. As part of that, I wanted to have an easy getting started guide for the students to help them build and run their first program. I put together <a href=\"https://colab.research.google.com/github/petewarden/pico_colabs/blob/main/Building_Blink_for_the_Raspberry_Pi_Pico.ipynb\">a Colab notebook</a> that follows the steps in the great <a href=\"https://datasheets.raspberrypi.com/pico/getting-started-with-pico.pdf\">Pico Getting Started Guide</a>, installing the SDK, examples, and then building blink and running it on a board. To give some extra guidance, I also recorded <a href=\"https://www.youtube.com/watch?v=bDDgihwDhRE\">the YouTube video above</a>. Please excuse the hair and occasional distraction, I did it in a hurry.</p>\n\n\n\n<p>It&#8217;s not a complete solution, students will still need to install OS-specific software to access debug logs, it requires a Google login that&#8217;s not available for kids under 13, and the vanishing file system will cause frustration if they don&#8217;t remember to save their code, but I do like it as a simple way to give them a win in just a few minutes. There&#8217;s nothing like seeing that first LED blink on a new board, I still get a kick out of it myself!</p>\n",
  "wfw:commentRss": "https://petewarden.com/2022/09/20/how-to-build-raspberry-pi-pico-programs-with-no-software-installation/feed/",
  "slash:comments": 2,
  "media:content": {
    "media:title": "petewarden"
  }
}