{
  "title": "Women and Market Mechanisms in North Korea",
  "description": " <p>The growth of markets is one of the most significant socioeconomic developments to occur in North Korea over the past two decades. While many understand that North Korea now has a thriving market system, the important role that the women of North Korea play is not as well known or appreciated.</p>\n<p> The CSIS Korea Chair and the North Korea Freedom Coalition invite you to join us for a special event featuring expert discussions on markets and civil society in North Korea as well as a presentation of <a href=\"https://beyondparallel.csis.org/markets-private-economy-capitalism-north-korea/\"><b>Beyond Parallel's mapping of 436 officially sanctioned markets across North Korea</b></a>. The panel discussion will be followed by testimonies from North Korean escapees on the importance of women's roles and experiences in North Korea's markets.</p>\n<p> <b>2:00 PM | WELCOMING REMARKS</b><br /> <b>Mr. H. Andrew Schwartz</b>, <i>Chief Communications Officer, CSIS</i><br /> <b>Dr. Suzanne Scholte</b>, <i>Chair, North Korea Freedom Coalition</i></p>\n<p> <b>2:05 PM | SESSION I: </b><b>Markets and Civil Society in North Korea</b><br /> <b>Ms. Amy Lehr</b>, <i>Director, Human Rights Initiative, CSIS </i><br /> <b>Dr. Victor Cha</b>, <i>Senior Adviser and Korea Chair, CSIS; D.S. Song-KF Professor of Government, Georgetown University</i><br /> <b>Dr. Andrew Yeo</b>, <i>Associate Professor and Director of Asian Studies, The Catholic University of America</i><br /> <b>Ms. Olivia Enos</b>, <i>Policy Analyst, Asian Studies Center, The Heritage Foundation</i></p>\n<p> <b>2:55 PM | SESSION II: Women in the Markets<br /> Dr. Suzanne Scholte</b>, <i>North Korea Freedom Coalition</i><br /> <b>Ms. Lee, Hyo-joo</b>, <i>North Korean Escapee with Experience as Wholesale Market Vendor and Diesel Oil Trader</i><br /> <b>Ms. Park, Ji-hye</b>, <i>North Korean Escapee with Experience as Rice and Corn Trader</i><br /> <b>Ms. Heo, Cho-hee</b>, <i>North Korean Escapee with Experience as Small Consumer Goods Trader</i><br /> <b>Ms. Kim, Ji-young</b>, <i>North Korean Escapee</i></p>\n<p> <b>4:00 PM | ADJOURNMENT</b></p>\n<p> <i>This event is made possible by the general support to CSIS.</i></p>\n ",
  "itunes:author": "Victor Cha, Amy K. Lehr",
  "pubDate": "Mon, 29 Apr 2019 14:00:00 -0400",
  "enclosure": "",
  "itunes:duration": "1:48:12",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/Women%20and%20Market%20Mechanisms%20in%20North%20Korea_0.mp3"
}