{
  "title": "Summer Internships",
  "link": "https://blog.wolframalpha.com/2014/10/16/summer-internships/",
  "comments": "https://blog.wolframalpha.com/2014/10/16/summer-internships/#comments",
  "pubDate": "Thu, 16 Oct 2014 18:13:21 +0000",
  "dc:creator": "Jenna Giuffrida",
  "category": [
    "Education",
    "News",
    "Socioeconomic Data"
  ],
  "guid": "https://blog.wolframalpha.com/?p=28866",
  "description": "Summer has drawn to a close, and so too have our annual internships. Each year Wolfram welcomes a new group of interns to work on an exciting array of projects ranging all the way from Bell polynomials to food science. It was a season for learning, growth, and making strides across disciplinary and academic divides. [&#8230;]",
  "content:encoded": "<div style=\"width: 557px; padding-bottom: 20px;\">\n<p>Summer has drawn to a close, and so too have our annual internships. Each year Wolfram welcomes a new group of interns to work on an exciting array of projects ranging all the way from Bell polynomials to food science. It was a season for learning, growth, and making strides across disciplinary and academic divides. The Wolfram interns are an invaluable part of our team, and they couldn&#8217;t wait to tell us all about their time here. Here are just a few examples of the work that was done.<span id=\"more-28866\"></span></p>\n<p><img class=\"alignnone size-full wp-image-21313\" title=\"2014 summer interns\" src=\"http://blog.wolfram.com/data/uploads/2014/09/2014-interns.png\" alt=\"2014 summer interns\" width=\"505\" height=\"198\" /></p>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\">\n<p><img class=\"aligleft size-full wp-image-21544\" title=\"Paco Jain\" src=\"http://blog.wolfram.com/data/uploads/2014/10/pacoj.png\" alt=\"Paco Jain\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; line-height: 14px;margin-top:-10px;\"><span>Paco Jain<br />\nWolfram|Alpha Scientific Content,<br />\nWolfram|Alpha<br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 216px;\">&#8220;This summer, I worked on adding scientific content to the physical systems domain in Wolfram|Alpha. While there is a lot to learn, everyone I worked with seemed enthusiastic to help me get up to speed, and I was able to form several valuable mentoring relationships. I also felt that I was given the resources and responsibility I needed to allow me to make meaningful contributions to the Wolfram|Alpha product. The experience has me already thinking about pursuing a full-time position at Wolfram!&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-22114\" title=\"Daniel McDonald\" src=\"http://blog.wolfram.com/data/uploads/2014/10/dmcdonald.png\" alt=\"Daniel McDonald\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Daniel McDonald<br />\nWolfram|Alpha Scientific Content,<br />\nBell Polynomials and Recursive Algorithms</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 280px;\">&#8220;This summer at Wolfram|Alpha I worked as the Special Functions Intern. My primary project was reading mathematical literature in order to extract and verify formulas that could be useful for The Wolfram Functions Site as well as for possible <em>Mathematica</em> implementation. The most interesting part of my work involved creating a compendium of information about <em>Mathematica</em>&#8216;s <tt><a href=\"http://reference.wolfram.com/language/ref/BellY.html\">BellY</a></tt> function that computes various types of Bell polynomials, which are used in Faà di Bruno&#8217;s formula for computing arbitrary derivatives of the composition <em>f</em>(<em>g</em>) (as well as in generalizations of this formula for computing arbitrary derivatives of compositions of arbitrary depth). I devised an original functional recurrence that suggested a quick recursive algorithm for computing generalized Bell polynomials; as this algorithm ran much faster than <em>Mathematica</em>&#8216;s at the time, it was implemented into <em>Mathematica</em> 10.0.1. This recurrence and thus the algorithm (with different base cases) can be applied in a more general environment, and I am currently drafting a paper to submit to an algorithms journal.&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-21558\" title=\"Mark Peterson\" src=\"http://blog.wolfram.com/data/uploads/2014/10/mpeterson.png\" alt=\"Mark Peterson\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Mark Peterson<br />\nScientific Information Group,<br />\nWolfram Demonstrations Project<br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px;\">&#8220;During my internship in the Scientific Information Group at Wolfram Research, my work has primarily been centered on the Wolfram Demonstrations Project. Essentially, Demonstrations are self-contained programs written in the Wolfram Language that are designed to appeal to the user in a highly intuitive and interactive way. Whether working on the Project directly or on alternate applications for its material, my time has been spent developing this sort of content.&#8221;<br />\n<a href=\"http://demonstrations.wolfram.com/VisualizingTheThomsonProblem/\"><img class=\"alignleft size-full wp-image-21568\" style=\"padding: 20px 0px 40px 0px; float: left;\" title=\"Visualizing the Thomson Problem\" src=\"http://blog.wolfram.com/data/uploads/2014/10/visualizing-thompson-problem.png\" alt=\"Visualizing the Thomson Problem\" width=\"216\" height=\"200\" /></a></div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-21559\" title=\"Jake Wood\" src=\"http://blog.wolfram.com/data/uploads/2014/10/jakew.png\" alt=\"Jake Wood\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Jake Wood<br />\n<em>Mathematica</em> Algorithms R&D,<br />\n<em>Mathematica</em> <tt>GeoGraphics</tt><br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 260px;\">&#8220;Joining the Wolfram team earlier this summer was an exciting professional milestone for me. I am a big fan of not only the software that has come from Wolfram, but also the mission and ambition to proliferate and nurture big ideas. My patient mentor explained that I was to figure out how to make the generated maps in <tt><a href=\"http://reference.wolfram.com/language/ref/GeoGraphics.html?q=GeoGraphics\">GeoGraphics</a></tt> (new in <em>Mathematica</em> 10) move around and update from mouse clicking and dragging. Additionally, the maps needed to be zoomable, similar to maps online used for navigation. Right now my prototypes deal with the maps themselves instead of the verbose layers of graphics data that <em>Mathematica</em> is capable of imbuing. In the future, though, who knows. Getting the panning and zooming to work proved a difficult task; however, the brunt of the summer was spent on improving the performance speed. No one wants to use an interactive map that is insufferably unresponsive. The utility of this application is pretty clear, as it is similar to programs that people already use daily.&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-21560\" title=\"Jessica Zhang\" src=\"http://blog.wolfram.com/data/uploads/2014/10/jessicaz.png\" alt=\"Jessica Zhang\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Jessica Zhang<br />\nUser Experience,<br />\nWolfram<em>Tones</em><br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 193px;\">&#8220;People would think as a User Experience Designer I would only be designing detailed features within a product or workflow. However, at Wolfram, I not only got to do those things, I also got to take part in the bigger decision-making design processes, even as an intern. I was given the opportunity to learn a variety of skills that are important and also at the cutting edge of the field. Technical skills include wireframing, wireflowing, diagramming, and interface design. Oh, and also using the espresso machine!&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-21561\" title=\"Andrew Blanchard\" src=\"http://blog.wolfram.com/data/uploads/2014/10/andrewb.png\" alt=\"Andrew Blanchard\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Andrew Blanchard<br />\nWolfram|Alpha Scientific Content,<br />\nNamed Physical Effects<br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 211px;\">&#8220;For my internship with Wolfram Alpha, I assembled a list of named physical effects. A typical effect provides a link between measurable physical quantities, which are already incorporated into Wolfram|Alpha. Thus, making information about known physical effects computable enables the exploration of relationships between measurable quantities. In addition, the searchable data provides a window into the relationship between the discovery of new effects and advances in the field of physics. By making scientific information searchable, Wolfram|Alpha is providing a wonderful service for researchers, students, and anyone curious about exploring science.&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\"><img class=\"alignleft size-full wp-image-21562\" title=\"Surojit Ganguli\" src=\"http://blog.wolfram.com/data/uploads/2014/10/surojitg.png\" alt=\"Surojit Ganguli\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -20px; line-height: 14px;\"><span><br />\nSurojit Ganguli<br />\nWolfram|Alpha Socioeconomic Content,<br />\nComputational Capabilities<br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px; height: 223px;\">&#8220;I was part of the team that was involved in increasing the computational capabilities of Wolfram|Alpha in the domain of vehicle dynamics. As a Computational Science and Engineering Minor at UIUC, the opportunity to explore the various ways in which computations are being performed at Wolfram was in itself a rewarding experience. As an additional bonus, I definitely improved in the area of functional programming by using <em>Mathematica</em>.&#8221;</div>\n</div>\n<div style=\"padding-top: 20px;\">\n<div style=\"float: left;\">\n<p><img class=\"alignleft size-full wp-image-21563\" title=\"Ying Qin\" src=\"http://blog.wolfram.com/data/uploads/2014/10/yingq.png\" alt=\"Ying Qin\" width=\"80\" height=\"100\" /></p>\n<div style=\"width: 110px; margin-top: -10px; line-height: 14px;\"><span>Ying Qin<br />\nWolfram|Alpha Scientific Content,<br />\nFood Data<br />\n</span></div>\n</div>\n<div style=\"float: left; width: 425px;height:190px;\">&#8220;I&#8217;ve been working on expanding food-related information in the Wolfram Knowledgebase. Among other things, this included the characterization and classification of food; I did research involving USDA data and other data sources. I was also working on expanding the food glossary, which gives a more detailed description of the available content. Furthermore, using my knowledge as a Food Science student, I was able to do things like classify fatty acids into groups. My advice to prospective interns is that you shouldn’t hesitate to apply even though your major is not computer science or engineering. As a Food Science major, I was happy to get involved here, and felt like it was a truly valuable experience.&#8221;</div>\n</div>\n</div>\n<p>It&#8217;s been an amazing summer all around, and we couldn&#8217;t be happier with the contributions our interns have made. While we are sad to see some of them go, we are excited by the new talent that has been added to our team and can&#8217;t wait to see what next year will bring!</p>\n",
  "wfw:commentRss": "https://blog.wolframalpha.com/2014/10/16/summer-internships/feed/",
  "slash:comments": 10
}