{
  "title": "Are Gun Detectors the Answer to Mass Shootings?",
  "link": "https://www.aclu.org/news/privacy-technology/are-gun-detectors-the-answer-to-mass-shootings",
  "pubDate": "Wed, 02 Nov 2022 17:13:31 +0000",
  "dc:creator": "Jay Stanley",
  "category": [
    "Privacy & Technology",
    "National Security",
    "Video Surveillance",
    "Privacy and Surveillance",
    "Surveillance Technologies"
  ],
  "guid": "https://www.aclu.org/news/privacy-technology/are-gun-detectors-the-answer-to-mass-shootings",
  "description": "<p>A number of companies have responded to recent horrific mass shootings by touting technology that can ostensibly detect people with guns. Two companies in particular have attracted a lot of press attention for their products: one that makes AI-enhanced metal detectors, and another that sells video analytics software that “watches” surveillance camera feeds and sounds an alarm when the machine vision thinks it sees a person holding a gun.</p>\n<p>While such technologies can have their place, we need to think carefully as a society about if, how, and where we want to deploy them. And at the end of the day, surveillance <a href=\"https://www.aclu.org/news/privacy-technology/student-surveillance-versus-gun-control-school\">cannot be the answer</a> to our gun problem.</p>\n\t<div class=\"wp-heading mb-md\">\n\t\t\n\t\t\t\t\t<h2 id=\"\" class=\"wp-heading-h2 with-standard\">Enhanced metal detectors</h2>\n\t\t\n\t\t\t</div>\n<p>One product, made by a company called Evolv, is a metal detector enhanced with machine learning, which the company claims increases accuracy. Metal detectors and other body scanners are already deployed in various venues in the United States, and in our view, many of these deployments are unjustified and harmful. Still, where scanners nonetheless exist, making them more accurate and less intrusive is a good thing, all other things being equal.</p>\n<p>The problem is, all other things are not equal. Evolv is pushing for a sharp expansion of metal detectors in American life, not simply an upgrade of existing deployments. The company, which has <a href=\"https://ipvm.com/reports/evolv-public\">raised</a> half a billion dollars in funding, claims that it currently scans over three quarters of a million people each day, and has <a href=\"https://ipvm.com/reports/evolv-objects\">ambitions</a> to install thousands of new detectors around the U.S. and the world.</p>\n<p>Improving current scanners is one thing, but expanding the number of scanning checkpoints is another matter. We don’t want to see America turned into a big airport — a checkpoint society where we have to undergo searches at every gathering, including little league games and up from there.</p>\n\n  <div class=\"wp-sizing-container sizing--half alignment--left\">\n      <figure class=\"wp-image mb-md\">\n\t\t  <img width=\"2000\" height=\"1333\" src=\"https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246.jpg\" class=\"attachment-original size-original\" alt=\"The Evolv Express weapons detection system.\" loading=\"lazy\" srcset=\"https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246.jpg 2000w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-768x512.jpg 768w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-1536x1024.jpg 1536w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-400x267.jpg 400w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-600x400.jpg 600w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-800x533.jpg 800w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-1000x667.jpg 1000w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-1200x800.jpg 1200w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-1400x933.jpg 1400w, https://www.aclu.org/wp-content/uploads/2022/11/AP22145627735246-1600x1066.jpg 1600w\" sizes=\"(max-width: 2000px) 100vw, 2000px\" />\t\n\t\t  <figcaption class=\"wp-image__caption is-caption mt-xs\"><p>The Evolv Express weapons detection system.</p>\n</figcaption>\n\t\n\t\t  <span class=\"wp-image__credit is-credit\"><p>Credit: AP Images/Mary Altaffer</p>\n</span>\n\t  </figure>\n  </div>\n<p>And metal detectors don’t operate themselves. Wherever a search checkpoint is set up, there are going to be guards. They may bark orders at you, demand you open your bags, remove your jacket, etc. However common such scans may already be, we should never lose sight of the fact that they are a significant invasion of privacy. You may have private things on your person, such as medical equipment, that are nobody’s business but yours. Guards may also engage in racial profiling, or simply gruff and rude behavior.</p>\n<p>Perhaps the worst place for these checkpoints to spread further is in our schools, which companies view as a large market. School metal detectors are in keeping with a broken approach to student well-being — the same approach that has led to the U.S. having <a href=\"https://www.aclu.org/sites/default/files/field_document/030419-acluschooldisciplinereport.pdf\">more police officers than social workers</a> in our schools. Metal detectors are expensive, <a href=\"https://www.vice.com/en/article/5d3dw5/the-least-safe-day-rollout-of-gun-detecting-ai-scanners-in-schools-has-been-a-cluster-emails-show\">disruptive</a>, alienating, come hand-in-hand with aggressive police tactics, and have a <a href=\"https://www.theatlantic.com/education/archive/2016/09/when-school-feels-like-prison/499556/\">racially disparate impact</a> on students of color. Like other surveillance methods, they are not good for kids. And ample research suggests that metal detectors don’t improve school safety; even the U.S. Secret Service has <a href=\"http://powerreporting.com/files/shoot.pdf\">concluded</a> that the devices are unlikely to stop school shootings.</p>\n<p>The effectiveness of metal detectors is dubious outside schools as well, and for the same reasons. As Motherboard <a href=\"https://www.vice.com/en/article/5d3dw5/the-least-safe-day-rollout-of-gun-detecting-ai-scanners-in-schools-has-been-a-cluster-emails-show\">put it</a>, “Security experts broadly believe body scanners and metal detectors do not prevent mass shootings.” Although the independent security analysis publication IPVM found that Evolv is better than traditional (and far cheaper) metal detectors at not alarming at keys and cellphones, Evolv’s overall accuracy claims have been <a href=\"https://ipvm.com/reports/evolv-no-stop\">sharply</a> <a href=\"https://ipvm.com/reports/evolv-objects\">questioned</a> by IPVM. In particular, an investigation by <a href=\"https://ipvm.com/reports/bbc-evolv\">IPVM</a> and <a href=\"https://www.bbc.com/news/technology-63476769\">the BBC</a> found that the company had worked with an “independent” testing lab to exaggerate the performance of their scanners, which was actually worse than regular metal detectors in some cases.</p>\n\t<div class=\"wp-heading mb-md\">\n\t\t\n\t\t\t\t\t<h2 id=\"\" class=\"wp-heading-h2 with-standard\">ZeroEyes video gun detection</h2>\n\t\t\n\t\t\t</div>\n<p>A company called ZeroEyes is marketing video analytics techniques that can purportedly identify when someone is holding a firearm in a surveillance camera feed.</p>\n<p>In many contexts, there is no reason that anybody should ever be holding a firearm, and it is usually legitimate for security staff to be alarmed at the sight of someone brandishing a gun in a public place. (In many states, it may be legal to have a holstered firearm, either in concealed or open carry, but holding a gun in one’s hands in public is <a href=\"https://www.uslawshield.com/everything-you-need-to-know-about-brandishing/\">typically illegal</a> under state brandishing and assault laws.) So at first blush, many people may see no issues with a system that alarms only when that happens. There are several issues that I see with this concept, however.</p>\n<p>First, this concept incentivizes the installation of surveillance cameras everywhere. And because gun detection analytics acts as an add-on to existing cameras, it’s not as if the cameras involved will only be used to look for guns. They can simultaneously be used for the full range of surveillance uses, including face recognition, <a href=\"https://www.aclu.org/news/privacy-technology/a-scary-demonstration-of-what-unchecked-face-recognition-could-look-like\">forensic search</a>, and even marketing and “business intelligence.”</p>\n<p>Second, like all alarm systems, and especially AI systems, there will be false positives — potentially a lot of them. Blanketing public spaces with buggy gun detectors may increase the incidence of tragic confrontations sparked by people holding <a href=\"https://duckduckgo.com/?q=police+shoot+man+holding+cell+phone&amp;t=ha&amp;va=j&amp;ia=web\">cell phones</a>, toy guns, or other everyday objects that police have mistaken for firearms. ZeroEyes has humans in the loop that review camera images before alarms are sent, which is helpful — but that’s no guarantee against errors. And if this concept is successful, we’re likely to see this company or competitors discard the expensive and complicated element of human review.</p>\n<p>Third, as with Evolv’s gun detectors, there are also questions about effectiveness. The system is premised on a gun being visible for some significant period of time before any shooting starts. How often does that happen? In addition, if this technology becomes widespread, future shooters will simply keep their gun(s) hidden from the AI (which might be easier than hiding it from a human) until the last moment. As the industry analysts at IPVM <a href=\"https://ipvm.com/reports/zeroeyes-presents\">conclude</a>, video analytics “cannot stop [violent] events and will not add significant advance warning time to an event.”</p>\n<p>Fourth, it&#8217;s also important to understand a larger context here: Video gun detection is part of a larger trend of using machine vision as a cheap replacement for humans in enforcement and monitoring work. We’re already starting to see AI-enhanced cameras being deployed to monitor driving behavior and cell phone use, for example, and (as we explored in this <a href=\"https://www.aclu.org/sites/default/files/field_document/061819-robot_surveillance.pdf\">report</a>) that’s likely just the tip of the coming iceberg that could lead to intrusive and oppressive levels of monitoring throughout our lives.</p>\n<p>Finally, both ZeroEyes and Evolv raise questions about transparency. It’s hard for policymakers and the public to make decisions about technologies if they don’t have accurate and complete information about their false negative and false positive rates. Evolv has actually <a href=\"https://ipvm.com/reports/evolv-objects\">refused</a> to let IPVM buy a scanner for independent accuracy testing.</p>\n<p>At the end of the day, ubiquitous surveillance is not the solution to gun violence. Americans should say no to intrusive technologies that threaten privacy, bring dubious benefits, and have negative side effects such as racial profiling and disrupting education.</p>\n\t\t<div class=\"rss-cta__title\">We need you with us to keep fighting</div><a href=\"https://action.aclu.org/give/now\" class=\"rss-cta__button\">Donate today</a></div>",
  "source": "American Civil Liberties Union"
}