{
  "title": "TU102: Finding Neurological Safety through Relationships, with Guest Bonnie Badenoch (Replay)",
  "link": "https://therapistuncensored.com/episodes/tu102-finding-neurological-safety-through-relationships-with-guest-bonnie-badenoch-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu102-finding-neurological-safety-through-relationships-with-guest-bonnie-badenoch-replay",
  "pubDate": "Thu, 01 Aug 2019 11:00:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7299",
  "description": "The Power of Co-Regulation\nExplore the myth of self-regulation, the natural neurobiology of co-regulation and it’s capacity to engage safety and heal trauma. Learn about using interpersonal neurobiology (IPNB) and Polyvagal Theory to establish safety and security in therapy and in relationships.\nTherapist Uncensored co-host Sue Marriott LCSW CGP talks with author and therapist Bonnie Badenoch about the concept of using safety to reshape your neural landscape through authentic relationships. Badenoch guides us through her progression of building a bridge between science and practice to cultivate the best therapeutic mind.\n\nYou’ll learn how exercising “happy humility” and compassion can allow for an ideal presence in our day-to-day life using our autonomic nervous system. Also, special hats off to Steve Porges and polyvagal theory.\n\n0:00-30:00\n\nWhat creates safety? How do our internal systems want us to be received?\n\nSympathetic activation happens when there’s a need to control something in light of an obstacle.\n\nInternal systems challenge to remain in an open and receptive state. Polyvagal theory and Steve Porges.\n\nHow can we explore the relationship between safety and curiosity and best use the language of “safety,” versus “comfort” and “discomfort”, especially towards the beginning of therapy and in new relationships?\n\nBadenoch contends that there’s no such thing as a maladaptive experience; that humans are always adaptive and require co-regulation.\n\nWhat’s the difference between co-regulation and auto-regulation? Is there a “myth” of self-regulation? Discussion of ideal parent figure protocol.\n\nBadenoch explores the connection between co-regulation, neural circuitry and forging relationships in your life.\n\n30:00-60:00\n\nSocial Baseline Theory is what happens to our perceptions when someone we trust is with us. The difficulty and pain of tasks is always reduced when we’re with a trusted beloved and this relaxes our amygdala response.\n\nBadenoch walks us through her experience of feeling safe during and between client sessions.\n\nIt’s key to have mutual, caring, receptive relationships with people who are willing to listen rather than jump in and try to offer advice. Young therapists.\n\nEveryone’s doing the best they can with what they have in their neural make up but how can we embody a therapeutic presence in the world through compassion or a “happy humility”?\n\nResources:\n\nA Symphony of Gifts From Relational Neuroscience (1) Excellent PDF from Bonnie Badenoch\n\nBeing a Brain-Wise Therapist: A Practical Guide to Interpersonal Neurobiology [2008] Badenoch \n\nThe Brain-Savvy Therapist’s Workbook [2011] Badenoch \n\nThe Heart of Trauma: Healing the Embodied Brain in the Context of Relationships [2017] Badenoch\n\nThe Heart of Trauma Healing the Embodied Brain in the Context of Relationships by Steve Porges!\n\n \nFor our listeners!\nOur long-awaited Advanced Course is launching soon! Purchase today for the lowest price possible. Pre-sale pricing ends September 18. \nCLICK HERE TO PURCHASE\n \n\nJoin Us On Patreon\n\nFor as little as $5 a month you can join our exclusive community of Therapist Uncensored Neuronerds to gain private, more in-depth episodes AND to support production of this podcast to provide access to the science of relationships across the globe.  \n\nYES SIGN ME UP FOR PATREON, OR FIND OUT MORE, click here!\nTHANK YOU to all of our current Patrons!!\nTweet",
  "enclosure": "",
  "itunes:subtitle": "The Power of Co-Regulation Explore the myth of self-regulation, the natural neurobiology of co-regulation and it’s capacity to engage safety and heal trauma. Learn about using interpersonal neurobiology (IPNB) and Polyvagal Theory to establish safety ...",
  "itunes:summary": "Bonnie Badenoch discusses how exercising “happy humility” and compassion can allow for an ideal presence in our lives using our autonomic nervous system.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "50:47"
}