{
  "id": "yt:video:TMzo9zjkuHc",
  "yt:videoId": "TMzo9zjkuHc",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Rock-Throwing Catapult (Trebuchet)",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-08-04T20:56:43+00:00",
  "updated": "2022-09-26T23:38:09+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Rock-Throwing Catapult (Trebuchet)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Trebuchet\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newsest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nI built a trebuchet, a type of catapult that uses a counter weight to store gravitational potential energy which is then used to fire a projectile via a sling. I first built the frame which was made of two tripods set close together. They were of wood and lashed together with cane. Then I made a basket from cane to hold the large rocks that would act as the counterweight. For the sling I used bark fiber from dead branches of a certain type of tree. The bark was stripped and the inner bark woven into rope. The rope was then made into a sling using 2 knots and thinner rope was used to weave the sling pouch. A simple toggle release was used hold the throwing arm in position and act as the trigger. The counter weight was then filled with rocks and pulled into position to be held by the toggle. A shot-put sized stone was then placed into the sling pouch. When the toggle was released the stone would be launched 18- 20 meters (the length of the clearing) but could undoubtedly shoot further if more weight was added. Targets were set up and destroyed. Range can be adjusted by adding or subtracting weight from the basket, while shooting to the left or right is done by turning the whole catapult while the basket is empty. The whole build took 5 weeks, the hardest part being collecting the bark fiber to make the rope. The trebuchet is a simple but effective way to deliver payloads to a target destination.\n\nAbout Primitive Technology:\nPrimitive technology is a hobby where you build things in the wild completely from scratch using no modern tools or materials. These are the strict rules: If you want a fire, use a fire stick - An axe, pick up a stone and shape it - A hut, build one from trees, mud, rocks etc. The challenge is seeing how far you can go without utilizing modern technology. I do not live in the wild, but enjoy building shelter, tools, and more, only utilizing natural materials. To find specific videos, visit my playlist tab for building videos focused on pyrotechnology, shelter, weapons, food & agriculture, tools & machines, and weaving & fiber.\n\n#PrimitiveTechnology #Trebuchet #Catapult",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}