{
  "title": "S15 Ep31: Supernatural News/Parashare: Death by Extraterrestrial Edition",
  "link": "https://audioboom.com/posts/8098492",
  "itunes:episode": 31,
  "itunes:title": "Supernatural News/Parashare: Death by Extraterrestrial Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6694,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio returns with Supernatural News Death by Extraterrestrial Edition!<br>\n<br>\nMurdered by an E.T, John Lennon Alien encounter & the proof he brought back, Ghostly Children, Haunted Morgues and Convents! Plus excellent Paranormal stories shared by the audience today as Dave & Tim explore the weird world around us.<br>\n<br>\nVisit our shop for exciting new items, clothes, books and more:  <a href=\"https://www.amazon.com/shop/darknessradiodave?fbclid=IwAR3GOOfRj-AlHuvaLFzCIM2wHZuckf9Fp3V30QSD7-HhLgJEpMy0jF5G5lM\">https://www.amazon.com/shop/darknessradiodave?fbclid=IwAR3GOOfRj-AlHuvaLFzCIM2wHZuckf9Fp3V30QSD7-HhLgJEpMy0jF5G5lM</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nWhite Castle Sliders have a unique, one-of-kind taste that’s totally crave worthy! They are the perfect home solution for lunches, snacks and dinners , eat them by yourself or eat them with family!  Pick up White Castle Sliders in freezer aisles nationwide!<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio returns with Supernatural News Death by Extraterrestrial Edition!\n\nMurdered by an E.T, John Lennon Alien encounter & the proof he brought back, Ghostly Children, Haunted Morgues and Convents! Plus excellent Paranormal...",
  "pubDate": "Sat, 18 Apr 2020 08:00:00 +0000",
  "guid": "ffbdeb12-b920-4808-930c-7266c248c2b6",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}