{
  "guid": "urn:uuid:d5fd3524-514c-4c55-81fe-1513082642b5",
  "link": "https://www.who.int/news/item/28-09-2022-in-strategic-dialogues--the-united-states-and-who-seek-to-maximize-their-longstanding-partnership",
  "a10:author": {
    "a10:name": ""
  },
  "title": "In strategic dialogues, the United States and WHO seek to maximize their longstanding partnership",
  "description": "<p>Washington &ndash; WHO Director-General Dr Tedros Adhanom Ghebreyesus&nbsp;and United States Secretary of Health and Human Services Xavier Becerra agreed Tuesday to develop a work plan in 2023 to tackle shared priorities, chief among them the world&rsquo;s\n    health security and pandemic preparedness.</p><p>&ldquo;As always, good to see Dr Tedros and discuss how we can promote the health of all people across the globe,&rdquo; Secretary Becerra tweeted after the meeting.</p><p>The strategic dialogue focused on universal health coverage, primary health care, equity, and the global health workforce.</p><p>While in Washington, Dr Tedros also met with US Surgeon General Dr Vivek Murthy, White House COVID-19 Response Coordinator Dr Ashish K. Jha, US Rep. Barbara Lee, US Sen. Bob Menendez, Deputy Secretary of State for Management and Resources Brian McKeon\n    and USAID Administrator Samantha Power.</p><p>Dr Tedros said he was grateful to Secretary Becerra for the &ldquo;very productive strategic dialogue on how to strengthen WHO and reinforce global health security, including via a pandemic accord, investment in health-systems strengthening and prioritizing\n    primary health care across the world.</p><p>Dr Tedros and the Surgeon General discussed ways that the United States and WHO could collaborate on mental health and touched upon the impact of loneliness on people&rsquo;s health.</p><p><a href=\"https://www.who.int/news/item/27-09-2022-joint-statement-of-the-united-states-of-america-and-the-world-health-organization-on-the-u.s.-who-strategic-dialogue\">WHO and the United States released a joint statement following the meetings</a>.</p><p>For many years, the United States has been one of WHO&rsquo;s largest donors. It was the third largest in 2020-21, investing about US$ 700 million. In December 2021, the United States announced a US$ 280 million contribution to support critical work to\n    help end the COVID-19 pandemic, strengthen public health systems and provide urgent relief.</p><p>The United States is a longtime supporter of WHO&rsquo;s fight against polio, HIV/AIDS, tuberculosis and malaria, while helping advance global health priorities such as primary care for women and children, food and drug safety, and global health security.</p><p>The United States maintains a strong presence in WHO collaborating centres, lending its expertise across areas such as &nbsp;addressing cancer, occupational health, communicable diseases, nutrition, mental health, chronic diseases and improving health\n    technologies.&nbsp;</p><p>The next strategic dialogues between the United States and WHO are tentatively planned for late 2023.</p><p>&nbsp;</p><p><strong>Note to readers:</strong></p><p>This news piece was edited on 29 September 2022 to improve clarity.&nbsp;</p><p>&nbsp;</p>",
  "pubDate": "Wed, 28 Sep 2022 14:25:21 Z"
}