{
  "title": "Maastricht at 30",
  "link": "https://audioboom.com/posts/8023539",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 3944,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On 7 February 1992, twelve states signed the Maastricht Treaty, the foundation treaty of the European Union. As the treaty enters its 30s, what has it achieved? And where do we go from here? Bruegel’s <a href=\"https://www.bruegel.org/author/maria-demertzis/\">Maria Demertzis</a> talks to <a href=\"https://www.bruegel.org/author/amy-verdun/\">Amy Verdun</a>, Professor at the University of Victoria and visiting Professor at Leiden University, and <a href=\"https://www.bruegel.org/author/mathieu-segers/\">Mathieu Segers</a>, Professor in Contemporary European History at Maastricht University and Europe Chair at Studio Europa Maastricht, starting with their own personal recollection of 1992.<br>\n<br>\n\n</div>\n<div>\n<em>This episode is recorded in collaboration with </em><a href=\"https://studioeuropamaastricht.nl/\"><em>Studio Europa Maastricht</em></a><em>. Studio Europa Maastricht is a centre of expertise for Europe-related debate and research founded in 2018 and supported by the partners of the Maastricht, Working on Europe programme: Maastricht University, the Province of Limburg and the City of Maastricht. Together we aim to position Maastricht, the capital of Limburg, as a meeting place for citizen dialogue and debate and establish a centre of excellence for research on Europe and European integration.<br>\n</em><br>\n\n</div>\n<div>\n<em>Conversation on 30 years EMU will continue on 26 & 27 September – more information can be found here: </em><a href=\"https://studioeuropamaastricht.nl/debate-dialogue/regeneration-maastricht/\"><em><a href=\"https://studioeuropamaastricht.nl/debate-dialogue/regeneration-maastricht/\">https://studioeuropamaastricht.nl/debate-dialogue/regeneration-maastricht/</a></em></a>\n</div>\n",
  "itunes:summary": "How has this founding treaty changed European integration?",
  "pubDate": "Wed, 02 Feb 2022 12:06:39 +0000",
  "guid": "tag:audioboom.com,2022-02-02:/posts/8023539",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}