{
  "title": "6: Episode 6",
  "link": "https://audioboom.com/posts/7316363",
  "itunes:episode": 6,
  "itunes:title": "Episode 6",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2556,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On our September 11, 2005 edition of MuggleCast…<br>\n<br>\n\n</div>\n<div><br>\n</div>\n<div>While the Voldemort Contest has come to a close, just why was the door to 12 Grimmauld Place wide open for Mundungus Fletcher? And though it is clear those closest to Harry may be in grave danger in the final book, the Harry-Horcrux connection remains rather blurred. Plus, why was Professor Slughorn so knowledgeable about Tom Riddle’s objects of desire?<br>\n<br>\n\n</div>\n<div>From Dumbledore-faced whole-wheat toast to Billy Joe’s great audio-post… all that and more ahead with Andrew, Ben, Eric, and Jamie on this week’s edition of MuggleCast.<br>\n<br>\n\n</div>\n<ul>\n<li>Micah buys Dumbledore toast on eBay…and eats it</li>\n<li>Our ‘101 Ways to Kill Voldemort’ ends right now!</li>\n<li>Ben tells us about different ways people listen to the show</li>\n<li>Andrew planned to speak at the Apple keynote with Steve but had no plane ticket</li>\n<li>Note to JKR: audiobooks can be pirated from iTunes!</li>\n<li>Why could Mundungus get into Grimmauld place?</li>\n<li>Our new favorite voicemail caller: Billy Joe</li>\n<li>A fellow staff member asks how we make the show</li>\n<li>We discuss Fortescue’s involvement</li>\n<li>If Harry or his scar were a Horcrux, why would Voldemort try to kill him?</li>\n<li>Are Ron and Hermione on death’s door?</li>\n<li>What stops Voldemort from creating more Horcruxes?</li>\n<li>How did Slughorn find out about the Horcruxes?</li>\n<li>Jamie’s British Joke of the Day</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Sun, 11 Sep 2005 00:00:00 +0000",
  "guid": "tag:audioboom.com,2019-07-15:/posts/7316363",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}