{
  "title": "Don&#8217;t worry if college isn&#8217;t the happiest time of your life",
  "link": "https://petewarden.com/2022/06/27/dont-worry-if-college-isnt-the-happiest-time-of-your-life/",
  "comments": "https://petewarden.com/2022/06/27/dont-worry-if-college-isnt-the-happiest-time-of-your-life/#comments",
  "dc:creator": "Pete Warden",
  "pubDate": "Mon, 27 Jun 2022 04:03:36 +0000",
  "category": "Uncategorized",
  "guid": "http://petewarden.com/?p=7688",
  "description": "I was digging through paperwork today to help complete my PhD admission process, and I stopped short when I saw the academic transcript from my undergraduate years. I was a terrible student! I got 0% on one course, awful scores on many others, and had to do a lot of retakes. It brought back memories [&#8230;]",
  "content:encoded": "\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><a href=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png\"><img data-attachment-id=\"7689\" data-permalink=\"https://petewarden.com/2022/06/27/dont-worry-if-college-isnt-the-happiest-time-of-your-life/pete_transcript/\" data-orig-file=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png\" data-orig-size=\"564,461\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"pete_transcript\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png?w=300\" data-large-file=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png?w=550\" src=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png?w=564\" alt=\"\" class=\"wp-image-7689\" srcset=\"https://petewarden.files.wordpress.com/2022/06/pete_transcript.png 564w, https://petewarden.files.wordpress.com/2022/06/pete_transcript.png?w=150 150w, https://petewarden.files.wordpress.com/2022/06/pete_transcript.png?w=300 300w\" sizes=\"(max-width: 564px) 100vw, 564px\" /></a></figure>\n\n\n\n<p>I was digging through paperwork today to help complete my PhD admission process, and I stopped short when I saw the academic transcript from my undergraduate years. I was a terrible student! I got 0% on one course, awful scores on many others, and had to do a lot of retakes. It brought back memories of how I was feeling when I was 18. I was a mess. I was totally unprepared for life away from home, suffered from so much anxiety I wasn&#8217;t even able to name it, like a fish having no concept of water, and jumped right into a terrible relationship the first chance I got. I was working almost full-time at Kwik-Save to pay rent, and didn&#8217;t even have a computer at home I could use.</p>\n\n\n\n<p>It wasn&#8217;t supposed to be like this. Since I was a kid I&#8217;d dreamed of escaping my tiny village for university. I wasn&#8217;t sure what it was going to be like, since nobody in my immediate family had completed college, but I had vague ideas from being a townie in Cambridge and shows like <a href=\"https://en.wikipedia.org/wiki/Brideshead_Revisited_(TV_serial)\">Brideshead Revisited</a> that I would be transported to a magical world of privilege and <a href=\"https://en.wikipedia.org/wiki/Punt_(boat)\">punts</a>. Most of all, I looked forward to meeting people I could talk to about important things, people who might listen to me. I also knew I was &#8220;good at computers&#8221;, and was looking forward to diving deeper into programming. The reality of being just one of hundreds of students, with little ability to connect with any of the staff, and discovering that most of what I&#8217;d learned about coding wasn&#8217;t a big help with Computer Science, left me more than deflated. I was still the same screwed-up person, there had been no magical transformation. A lot of the time I resented time spent on my classes, and felt I wasn&#8217;t learning what I needed for my true vocation, being a programmer, and you can see that in my grades.</p>\n\n\n\n<p>Looking back, this wasn&#8217;t Manchester&#8217;s fault. It&#8217;s a fantastic university with a CS program that&#8217;s world-class, and despite my best efforts I did learn a lot from great teachers like <a href=\"https://en.wikipedia.org/wiki/Steve_Furber\">Steve Furber</a> and <a href=\"https://www.research.manchester.ac.uk/portal/carole.goble.html\">Carole Goble</a>. Their lessons turned out to be far more useful in my career than I ever would have expected. The staff were kind and helpful on the few occasions I did reach out, but I had such a lack of confidence I seldom dared try. I managed to scrape through, with a lot of retakes, and helped by the fact that the overall marks were heavily weighted to the final year. It left me feeling cheated though, somehow. I&#8217;d always heard the cliche that these would be the happiest days of my life. If I was miserable and it was all downhill from here, what was even the point of carrying on? It didn&#8217;t help that the first technical job I could find out of college paid less than I&#8217;d made stacking shelves at a supermarket.</p>\n\n\n\n<p>The good news is that life has pretty much continuously got better from that point on. Years of <a href=\"https://www.scu.edu/cas/academics/graduate-program-in-pastoral-ministries/faculty-staff/donald-st-louis/st-louis.html\">therapy</a>, a career path that has gifted me some fascinating and impactful problems to work on, along with enough money to be comfortable, and building the kind of community I&#8217;d dreamed of at college through writing and the internet, have left me feeling happier than I&#8217;ve ever been. I feel very lucky to have found a way to engage with so many smart people, and find my voice, through open source coding, blogging, research papers, and teaching.</p>\n\n\n\n<p>I didn&#8217;t write this post to humblebrag about how wonderful my life is, I still have plenty of challenges and disappointments. I just want to provide a datapoint for anyone else who is struggling or has struggled at college. It doesn&#8217;t have to define you for the rest of your life. If the experience isn&#8217;t what you&#8217;d expected and hoped, there&#8217;s no need for despair. Life can get so much better.</p>\n\n\n\n<p></p>\n",
  "wfw:commentRss": "https://petewarden.com/2022/06/27/dont-worry-if-college-isnt-the-happiest-time-of-your-life/feed/",
  "slash:comments": 1,
  "media:content": [
    {
      "media:title": "petewarden"
    },
    ""
  ]
}