{
  "title": "Surface-barrier detector with smoothly tunable thickness of depleted layer for study of ionization loss and dechanneling length of negatively charged particles channeling in a crystal. (arXiv:2211.01913v1 [physics.ins-det])",
  "link": "http://arxiv.org/abs/2211.01913",
  "description": "<p>A new method for the experimental study of ionization loss of relativistic\nnegatively charged particles moving in a crystal in the channeling regime using\na semiconductor surface-barrier detector with smoothly tunable thickness of the\ndepleted layer is proposed. The ionization loss can only be measured in the\ndepleted layer of the detector. The thickness of the depleted layer in a flat\nsemiconductor detector can be smoothly regulated by the value of the bias\nvoltage of the detector. Therefore, the energy distribution of the ionization\nloss of relativistic particles which cross the detector and move in the\nchanneling regime in the detector crystal can be measured along the path of the\nparticles at variation of the bias voltage of the detector. Ionization loss\nspectra should be different for channeling and nonchanneling particles, and\nboth fractions can be determined. The application of a Si surface-barrier\ndetector-target is considered. Measurements with such a detector would make it\npossible to study: the energy distribution of ionization loss of channeling\nnegatively and positively charged particles; spatial distribution of ionization\nloss as a function of the path length of channeling particles; the dechanneling\nlength of negatively charged particles; and to clear up the role of\nrechanneling of the particles in the crystal. Comparison of experimental data\nwith calculations can help to develop a description of the dynamics of motion\nof negatively charged particles channeling in a crystal. A better understanding\nof the dechanneling length properties can be useful in the production of\npositrons and other particles such as neutrons by an electron beam in crystals,\nand in the development of crystalline undulators, and at a crystal-based\nextraction of electron beams from a synchrotron.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Shchagin_A/0/1/0/all/0/1\">A.V. Shchagin</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Kube_G/0/1/0/all/0/1\">G. Kube</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Strokov_S/0/1/0/all/0/1\">S.A. Strokov</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Lauth_W/0/1/0/all/0/1\">W. Lauth</a>"
}