{
  "title": "PEL Special: Nightcap Late September 2020",
  "pubDate": "Mon, 21 Sep 2020 16:09:47 +0000",
  "guid": "d31959e0-aacc-420f-8f9b-c9b11840986d",
  "link": "https://podtrac.com/pts/redirect.mp3/traffic.libsyn.com/secure/partiallyexaminedlife/PEL_Special_Nightcap_8-28-20.mp3",
  "itunes:image": "",
  "description": "<p>We're releasing JUST THIS ONE Nightcap to the wider public so induce you all to go <a href= \"https://partiallyexaminedlife.com/support\" target=\"_blank\" rel= \"noopener\">support us</a> and so gain the ability to hear these free-wheeling, feeling-sharing, email-reading fiestas between every regular episode.</p> <p>This time we gripe about Habermas and reflect on what secondary sources we use. We consider whether to have an episode on anarchism and if we should ever have guests on who are hard-core adherents of the philosophy we're discussing. We reveal which reading we've covered has pleasantly surprised each of us the most.<br /> <br /> Finally, we talk about how to front-load our episodes so that folks who do not sign up to hear the part 2's still get a satisfying, self-contained experience.</p>",
  "content:encoded": "<p>We're releasing JUST THIS ONE Nightcap to the wider public so induce you all to go <a href= \"https://partiallyexaminedlife.com/support\" target=\"_blank\" rel= \"noopener\">support us</a> and so gain the ability to hear these free-wheeling, feeling-sharing, email-reading fiestas between every regular episode.</p> <p>This time we gripe about Habermas and reflect on what secondary sources we use. We consider whether to have an episode on anarchism and if we should ever have guests on who are hard-core adherents of the philosophy we're discussing. We reveal which reading we've covered has pleasantly surprised each of us the most.  Finally, we talk about how to front-load our episodes so that folks who do not sign up to hear the part 2's still get a satisfying, self-contained experience.</p>",
  "enclosure": "",
  "itunes:duration": "23:17",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "We're releasing JUST THIS ONE Nightcap to the wider public so induce you all to go  and so gain the ability to hear these free-wheeling, feeling-sharing, email-reading fiestas between every regular episode. This time we gripe about Habermas and...",
  "itunes:episodeType": "full"
}