{
  "id": "yt:video:oWEB31FMsno",
  "yt:videoId": "oWEB31FMsno",
  "yt:channelId": "UC9K5PLkj0N_b9JTPdSRwPkg",
  "title": "\"Groomer Schools\" | James Lindsay",
  "link": "",
  "author": {
    "name": "New Discourses",
    "uri": "https://www.youtube.com/channel/UC9K5PLkj0N_b9JTPdSRwPkg"
  },
  "published": "2022-11-03T15:51:05+00:00",
  "updated": "2022-11-04T15:02:24+00:00",
  "media:group": {
    "media:title": "\"Groomer Schools\" | James Lindsay",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Marxification of Education Workshop, Session 3 \n\nThe word of the year in education and regarding our children has been \"groomer,\" which is widely banned across social media now as a result (along with James Lindsay from Twitter for calling this problem out). In the Marxification of education, which is its remaking into a system of Marxist conscientization, schools can be said to have been transformed into groomer schools. Specifically, while the terms \"thought reform\" and \"brainwashing\" have been used in the past to describe this process, the term \"grooming\" is even more applicable given the nature of the process of conscientization, including its specific subject matter. It's a tremendous problem that demands understanding and a solution. Here, New Discourses Founder James Lindsay summarizes what he means by the term \"Groomer Schools\" in this third of four presentations on the Marxification of Education delivered in late July 2022 in Arlington, Virginia, on location in the now-famous Loudoun County, ground zero for the fight for America's schools. \n\nAs a result of the research that produced this lecture series, Lindsay has written a detailed and accessible book on the issue titled The Marxification of Education, which is available for preorder now: https://amzn.to/3RYZ0tY #ad \n\nSession 1: https://newdiscourses.com/2022/10/the-critical-turn-in-education/\nSession 2: https://newdiscourses.com/2022/10/paulo-freires-critical-method-of-education/\n\nSupport New Discourses: https://newdiscourses.com/support\n\nSubscribe to New Discourses on other platforms: https://newdiscourses.com/subscribe\n\nFollow James Lindsay: https://linktr.ee/conceptualjames\n\n© 2022 New Discourses. All rights reserved.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}