{
  "title": "88: Oklahoma City",
  "link": "https://audioboom.com/posts/7287566",
  "itunes:episode": 88,
  "itunes:title": "Oklahoma City",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3585,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On April 19, 1995, Timothy McVeigh, a former soldier deeply influenced by the literature and ideas of the radical right, parked a Ryder truck with a five-ton fertilizer bomb in front of the Alfred P. Murrah Federal building in Oklahoma City. Moments later, 168 people were killed and 675 were injured in the blast. OKLAHOMA CITY traces the events--including the deadly encounters between American citizens and law enforcement at Ruby Ridge and Waco--that led McVeigh to commit the worst act of domestic terrorism in American history.<br>\n<br>\n<strong>LOOKING FOR MORE TCO? WHO COULD BLAME YOU</strong>! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join our Patreon famand</a> instantly get over <strong>80 FULL BONUS episodes to BINGE RIGHT NOW!</strong>Including our episode-by-episode coverage of <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!<br>\n</a><br>\n\n</div>\n<div>\n<a href=\"https://www.truecrimeobsessed.com/see-us-live\"><strong>COME TO OUR PRIDE SHOW!</strong></a><strong> </strong>Come hang with us in NYC on Saturday, June 29th--the 50th Anniversary of The Stonewall Riots! It will be one of our most special and memorable live shows to date! <strong>All ticket holders are welcome to join Patrick on a FREE walking tour of the West Village on the morning of the show!</strong> He'll show you all the spots from the gay liberation movement, old New York movies, and even Sex and the City--all within a few blocks! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Get tickets to the Pride Show here!<br>\n</a><br>\n\n</div>\n<div>\n<strong>To learn about our sponsors AND GET THOSE PROMO CODES,</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Click her</a>\n</div>\n",
  "pubDate": "Thu, 13 Jun 2019 04:01:00 +0000",
  "guid": "tag:audioboom.com,2019-06-13:/posts/7287566",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}