{
  "title": "TAYLER HOLDER CALLS OUT JOSH RICHARDS AND BRI BREAKS DOWN BOA GATE — BFFs EP. 98",
  "description": "<p>We start the show with headlines caused by our last episode with Mads Lewis, as her insinuation that she was a victim of Tayler Holder caused him to speak publicly for the first time about the accusations since his appearance on our podcast in February. We break down missing the Mads admission in real time, Tayler making his response video claiming he sent a C&D, Dave reaching out to both Mads and Tayler, Tayler calling out Josh, and Tayler's mom getting in the mix calling out both BFFs and Mads.\n\nWe then get into the regular headlines of people thinking Nessa was saying Mads and her were not friendly, Mads response, Vinnie Hacker signifying the death of Tik Tok houses after leaving the Hype House, Trisha Paytas giving birth, Adam Levine's bizarre cheating scandal, Leo and Gigi Hadid dating, Kim Kardashian saying her next man will not be famous, Short King Surgery, Britney Spears and Christina Aguilera beefing, Post Malone's fall at his show, and Tik Tokkers making NyQuil Chicken.\n\nWe finish with BFFs corner with the long awaited explantation with what truly happened with Bri's encounter at the Harry Styles concert (#BoaGate), the fallout since, and finish up with Grace's RNR opponent getting some work in with David Dobrik and the Vlog Squad. \n\nSupport Our Sponsors!\nRaising Canes: Get your Cane’s fix fast by ordering through their app or online at RaisingCanes.com\nTakis: Try Takis and face the intensity!\nSummer: Download Summer at https://barstool.link/SummerBFFs</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "c989cb2f-660d-4278-b739-3360553c0d39",
  "pubDate": "Thu, 22 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:48:48",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}