{
  "title": "New zine: How DNS Works!",
  "link": "",
  "updated": "2022-04-26T07:28:10+00:00",
  "id": "https://jvns.ca/blog/2022/04/26/new-zine--how-dns-works-/",
  "content": "\n\n<p>Hello! On Thursday we released a new zine about one of my favourite computer systems: DNS!</p>\n\n<p>You can get it for $12 here:\n<a href=\"https://wizardzines.com/zines/dns\">https://wizardzines.com/zines/dns</a>, or get\nan <a href=\"https://wizardzines.com/zines/all-the-zines/\">11-pack of all my zines here</a>.</p>\n\n<p>Here&rsquo;s the cover and table of contents:</p>\n\n<div align=\"center\">\n<a href=\"https://wizardzines.com/zines/dns\"><img width=\"400px\" src=\"https://jvns.ca/images/dns-cover.png\"></a>\n<a href=\"https://jvns.ca/images/dns-toc.png\"><img width=\"400px\" src=\"https://jvns.ca/images/dns-toc.png\"></a>\n</div>\n\n<h3 id=\"why-dns\">why DNS?</h3>\n\n<p>I wanted to write about DNS for three reasons:</p>\n\n<ol>\n<li><strong>DNS is everywhere!</strong> You basically can’t use the internet without using\nDNS — nobody is going to memorize all the IP addresses for every domain they\nuse. You need to look them up with DNS!</li>\n<li><strong>DNS has a really cool decentralized design!</strong> I love that it gives you\ncontrol of your own little corner of the internet (it just costs ~$12/year to\nown a domain!), I love that the basic design is relatively straightforward,\nand I love that it’s worked basically the same way for 40 years and scaled\nrelatively well over time</li>\n<li><strong>DNS is very frustrating!</strong> I’ve run into some VERY weird DNS problems over\nthe years, and it can feel magical and incomprehensible if you don’t know\nhow it works. But once you learn how DNS works, these problems all become\ntotally possible to understand.</li>\n</ol>\n\n<p>And I&rsquo;ve never seen a clear explanation of DNS that included all of the\ntechnical details I wanted to know, so I decided to write one.</p>\n\n<h3 id=\"a-dns-playground\">a DNS playground!</h3>\n\n<p>I find the most fun way to learn is by experimenting and breaking things! So back in December,\n<a href=\"https://marieflanagan.com/\">Marie</a> and I built a playground where you can do\nweird DNS experiments with no consequences if you mess something up.</p>\n\n<p>It’s called <a href=\"https://messwithdns.net\">Mess With DNS</a>. It has examples of\nexperiments you can try, and you’ve very encouraged to come up with your own\nexperiments.</p>\n\n<p>There&rsquo;s also <a href=\"https://jvns.ca/blog/2021/12/15/mess-with-dns/\">a blog post</a> from when we released it in December.</p>\n\n<h3 id=\"a-simple-dns-lookup-tool\">a simple DNS lookup tool</h3>\n\n<p>I also built a little DNS lookup tool at <a href=\"https://dns-lookup.jvns.ca\">https://dns-lookup.jvns.ca</a> to provide\nan easy way to do DNS queries without using the command line. Even though I\nlove the command line I actually find myself using it all the time.</p>\n\n<h3 id=\"what-we-left-out-dns-security\">what we left out: DNS security</h3>\n\n<p>The main thing that <em>isn&rsquo;t</em> in the zine is DNS security (DNS over HTTPS, DNS\nover TLS, DNSSEC).  This is because the DNS security landscape still seems to\nbe evolving, and I didn&rsquo;t feel confident that we could write something that\nwould still be true in 5-10 years.</p>\n\n<p>I think I&rsquo;ll try to write a blog post about DNS security at some point though.</p>\n\n<h3 id=\"identifying-common-points-of-confusion-is-amazing\">identifying common points of confusion is amazing</h3>\n\n<p>I mentioned earlier that my friend <a href=\"https://marieflanagan.com/\">Marie Claire LeBlanc Flanagan</a> and I built\nMess With DNS together in December. That was really fun, so Marie and I decided\nto work together on this zine too &ndash; we paired on it for about an hour every\nweekday for almost 4 months. I&rsquo;m pretty sure I wouldn&rsquo;t have finished the zine\nwithout her.</p>\n\n<p>She was incredibly helpful with everything to do with the zine (editing!\ncharacter design! marketing! rewriting the NS records page 5 times!), but one\nof the biggest things she improved for this zine was <em>feedback</em>.</p>\n\n<p>Usually I only get feedback from maybe 10 beta readers, but this time we wanted\nto hear from more people and get better at identifying common points of confusion.</p>\n\n<p>We did this by building a small custom feedback website where people could\nclick on a page and leave feedback (&ldquo;I have a question! This is confusing! I\nlearned something! I have a suggestion! I love this!&ldquo;).</p>\n\n<p>Building a custom website let us organize the feedback way more easily and hear\nfrom more people &ndash; in the end we got ~1200 feedback items from ~60 people and\nall of the feedback made the zine a LOT better.</p>\n\n<p>I might write a longer meta post about all of this later.</p>\n\n<h3 id=\"some-blog-posts-leading-up-to-this-zine\">some blog posts leading up to this zine</h3>\n\n<p>I wrote a bunch of blog posts about DNS over the last year or so while thinking\nabout this zine. Here they all are:</p>\n\n<ul>\n<li><a href=\"https://jvns.ca/blog/how-updating-dns-works/\">What happens when you update your DNS?</a></li>\n<li><a href=\"https://jvns.ca/blog/2021/02/24/a-little-tool-to-make-dns-queries/\">A little tool to make DNS queries</a></li>\n<li><a href=\"https://jvns.ca/blog/2021/03/31/dnspeep-tool/\">A tool to spy on your DNS queries: dnspeep</a></li>\n<li><a href=\"https://jvns.ca/blog/2021/11/04/how-do-you-tell-if-a-problem-is-caused-by-dns/\">How do you tell if a problem is caused by DNS?</a></li>\n<li><a href=\"https://jvns.ca/blog/2021/12/06/dns-doesn-t-propagate/\">DNS &ldquo;propagation&rdquo; is actually caches expiring</a></li>\n<li><a href=\"https://jvns.ca/blog/2022/01/05/why-might-you-run-your-own-dns-server-/\">Why might you run your own DNS server?</a></li>\n<li><a href=\"https://jvns.ca/blog/2022/01/15/some-ways-dns-can-break/\">Some ways DNS can break</a></li>\n<li><a href=\"https://jvns.ca/blog/2022/02/01/a-dns-resolver-in-80-lines-of-go/\">A toy DNS resolver</a></li>\n<li><a href=\"https://jvns.ca/blog/2022/02/14/some-dns-terminology/\">The multiple meanings of &ldquo;nameserver&rdquo; and &ldquo;DNS resolver&rdquo;</a></li>\n</ul>\n\n<h3 id=\"you-can-get-a-print-copy-shipped-to-you\">you can get a print copy shipped to you!</h3>\n\n<p>There&rsquo;s always been the option to print the zines yourself on your home printer.</p>\n\n<p>But this time there&rsquo;s a new option too: you can get a print copy shipped to\nyou! (just click on the &ldquo;print version&rdquo; link on <a href=\"https://wizardzines.com/zines/dns/\">this\npage</a>)</p>\n\n<p>The only caveat is that the international shipping costs are unreasonably high,\nso if you&rsquo;re outside the US it probably doesn&rsquo;t make sense to get just 1 zine\nshipped to you. I&rsquo;m still trying to find a workaround for that. Orders of $60+\ndo include free international shipping though.</p>\n\n<p>Here&rsquo;s the link to get the zine again:\n<a href=\"https://wizardzines.com/zines/dns/\">https://wizardzines.com/zines/dns/</a></p>\n\n<h3 id=\"thank-you\">thank you</h3>\n\n<p>If you&rsquo;ve bought zines in the past, thanks so much for all your support over\nthe years. None of this would be possible without you.</p>\n"
}