{
  "title": "Kinesis Savant Elite 2 Foot pedals",
  "link": "",
  "published": "2016-06-14T14:00:00-07:00",
  "updated": "2016-06-14T14:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2016-06-14:/blog/kinesis-savant-elite-2/",
  "summary": "<p><a href=\"http://www.kinesis-ergo.com/\">Kinesis Corporation</a> has produced a long-awaited update to their Savant\nElite line of foot pedals. If you find yourself with wrist or RSI pain, you\nmight consider giving them a look.</p>\n<blockquote>\n<p>Disclaimer: Kinesis Corporation sent me an evaluation model of the SE 2 foot\n  pedal. As a long time fan (and advocate for anyone who helps people overcome\n  RSI problems) I agreed to write a blog about it!</p>\n</blockquote>",
  "content": "<p><a href=\"http://www.kinesis-ergo.com/\">Kinesis Corporation</a> has produced a long-awaited update to their Savant\nElite line of foot pedals. If you find yourself with wrist or RSI pain, you\nmight consider giving them a look.</p>\n<blockquote>\n<p>Disclaimer: Kinesis Corporation sent me an evaluation model of the SE 2 foot\n  pedal. As a long time fan (and advocate for anyone who helps people overcome\n  RSI problems) I agreed to write a blog about it!</p>\n</blockquote>\n\n\n<h2>Being that weird person with the foot pedals</h2>\n<p><em>click</em> <em>click</em> <em>click</em></p>\n<p><strong>\"What is that noise? Are you doing something with your feet?\"</strong></p>\n<p>I step back from my desk and show them. Then I explain how, years ago, I had to\ndecide between capitalizing words and having the ulnar corner of my left wrist\nbe painful to the touch. Luckily, I got my RSI under control, but it's left me\nwith artifacts that have become essential to my hacking environment:</p>\n<ul>\n<li>Kinesis Advantage keyboard</li>\n<li>Kinesis Foot Pedals</li>\n<li>Evoluent Vertical Mouse</li>\n</ul>\n<p><center>\n<img src=\"../../images/kinesis_savant_elite_2.JPG\" alt=\"SE2\" width=\"60%\"/>\n</center></p>\n<p>Admittedly, I mostly use the foot pedal now for pressing shift. As an Emacs\nuser, I considered using them for Control or Meta (as the old saying goes:\n\"Emacs: Escape Meta Alt Control Shift!\"), but never got into the habit of it.</p>\n<h2>Aging technology</h2>\n<p>The biggest problem with the Kinesis SE1 line of foot pedals, which many people\nswear by, is that you can only program them using an extremely old Windows\nprogram, and it's such a finicky process it might as well be a digital rain\ndance. Here's what my SE1's look like:</p>\n<p><center>\n<img src=\"../../images/kinesis_savant_elite_1.JPG\" alt=\"SE1\" width=\"60%\"/>\n</center></p>\n<p>I programmed my pedals in 2010 and haven't changed them since. This is a bummer\nsince you can associate fairly complex macros / character sequences with them,\nand often when faced with a repetitive task I've wished I could quickly program\nsomething in.</p>\n<p>While cosmetically and functionally the SE2 has changed little, the software\nand firmware is completely new. Programming them is now a breeze. <a href=\"http://www.howardism.org/Technical/Emacs/kinesis-footpedal.html\">Howard\nAbrams</a> gives more detail on how the program works. It's even bundled on the\nfoot pedal, so you aren't left digging around the Kinesis website to find\nit. It can't be run on Linux, but once you program the foot pedal it will work\non any computer.</p>\n<p>The biggest issue I have hit (as mostly a Linux user) is that OS X won't allow\nmodifier keys from one USB device to modify another. So while my pedal-as-Shift\nworks fine on Linux, it doesn't work on Mac. So if you want to off-load\nmodifier keys, and you use a Mac, <em>caveat emptor</em>.</p>\n<h2>Summary</h2>\n<p>If you've ever been curious about using foot pedals to improve your computer\nergonomics I recommend giving a 2- or 3-pedal Kinesis set a look. I had stopped\nrecommending them to people because of the programmability issue, but now that\nthe hardware and software has been renovated, now is the time to give them your\nconsideration. Like all Kinesis components, you can expect no problems in any 5\nto 10 year period.</p>"
}