{
  "title": "Advice for students of machine learning",
  "link": "http://mimno.infosci.cornell.edu/b/articles/ml-learn/",
  "pubDate": "Wed, 11 Jun 2014 20:00:00 -0400",
  "guid": "http://mimno.infosci.cornell.edu/b/articles/ml-learn/",
  "author": "",
  "description": "<p>One of my students recently asked me for advice on learning ML. Here’s\nwhat I wrote. It’s biased toward my own experience, but should generalize.</p>\n<p><span class=\"more\"></span></p>\n<p>My current favorite introduction is Kevin Murphy’s book (Machine\nLearning). You might also want to look at books by Chris Bishop\n(Pattern Recognition), Daphne Koller (Probabilistic Graphical Models),\nand David MacKay (Information Theory, Inference and Learning\nAlgorithms).</p>\n<p>Anything you can learn about linear algebra and probability/statistics\nwill be useful. Strang’s Introduction to Linear Algebra, Gelman, Carlin, Stern and Rubin’s Bayesian\nData Analysis, and Gelman and Hill’s Data Analysis using Regression and Multilevel/Hierarchical models are some of my favorite books.</p>\n<p>Don’t expect to get anything the first time. Read descriptions of the\nsame thing from several different sources.</p>\n<p>There’s nothing like trying something yourself. Pick a model and\nimplement it. Work through open source implementations and\ncompare. Are there computational or mathematical tricks that make\nthings work?</p>\n<p>Read a lot of papers. When I was a grad student, I had a 20 minute bus\nride in the morning and the evening. I always tried to have an\ninteresting paper in my bag. The bus isn’t the important part — what\nwas useful was having about half an hour every day devoted to reading.</p>\n<p>Pick a paper you like and “live inside it” for a week. Think about it\nall the time. Memorize the form of each equation. Take long walks and\ntry to figure out how each variable affects the output, and how\ndifferent variables interact. Think about how you get from Eq. 6 to\nEq. 7 — authors often gloss over algebraic details. Fill them in.</p>\n<p>Be patient and persistent. Remember von Neumann: “in mathematics you\ndon’t understand things, you just get used to them.”</p>"
}