{
  "title": "Why Students Switch Majors with Jamin Speer",
  "pubDate": "Thu, 04 Apr 2019 20:26:24 +0000",
  "guid": "8e9d505498e04edb8e47b71c070a4d21",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP119Speer_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href= \"https://www.memphis.edu/economics/faculty/jspeer.php\" target= \"_blank\" rel=\"noopener\">Jamin Speer</a> of the University of Memphis. We discuss his paper, <a href=\"https://t.co/AR3v4bufZY\" target=\"_blank\" rel=\"noopener\">\"Are Changes of Major Major Changes? The Roles of Grades, Gender, and Preferences in College Major Switching\"</a> co-authored with Carmen Astorne-Figari.</p> <blockquote>The choice of college major is a key stage in the career search, and over a third of college students switch majors at least once. We provide the first comprehensive analysis of major switching, looking at the patterns of switching in both academic and non-academic dimensions. Low grades signal academic mismatch and predict switching majors - and the lower the grades, the larger the switch in terms of course content. Surprisingly, these switches do not improve students’ grades. When students switch majors, they switch to majors that \"look like them\": females to female-heavy majors, and so on. Lower-ability women flee competitive majors at high rates, while men and higher-ability women are undeterred. Women are far more likely to leave STEM fields for majors that are less competitive – but still somewhat science-intensive – suggesting that leaving STEM may be more about fleeing the \"culture\" of STEM majors than fleeing science and math.</blockquote> <hr /> <p><strong>Links</strong></p> <p><a href= \"https://twitter.com/JaminSpeer/status/1108393364070772736\" target= \"_blank\" rel=\"noopener\">Jamin's Twitter thread about the paper</a></p> <p><a href= \"https://web.stanford.edu/~niederle/Niederle.Vesterlund.QJE.2007.pdf\" target=\"_blank\" rel=\"noopener\">Niederle and Vesterlund's paper on gender differences in competitiveness</a></p> <p><a href= \"https://www.journals.uchicago.edu/doi/abs/10.1086/209919\" target= \"_blank\" rel=\"noopener\">Neal's paper on job mobility</a> featuring the following quote mentioned in the episode:</p> <blockquote>\"To the extent that college provides an opportunity for premarket search over potential careers, this result [of fewer career changes among college graduates] is to be expected.\" (p. 250)</blockquote>",
  "content:encoded": "<p>Today's guest is <a href= \"https://www.memphis.edu/economics/faculty/jspeer.php\" target= \"_blank\" rel=\"noopener\">Jamin Speer</a> of the University of Memphis. We discuss his paper, <a href=\"https://t.co/AR3v4bufZY\" target=\"_blank\" rel=\"noopener\">\"Are Changes of Major Major Changes? The Roles of Grades, Gender, and Preferences in College Major Switching\"</a> co-authored with Carmen Astorne-Figari.</p> The choice of college major is a key stage in the career search, and over a third of college students switch majors at least once. We provide the first comprehensive analysis of major switching, looking at the patterns of switching in both academic and non-academic dimensions. Low grades signal academic mismatch and predict switching majors - and the lower the grades, the larger the switch in terms of course content. Surprisingly, these switches do not improve students’ grades. When students switch majors, they switch to majors that \"look like them\": females to female-heavy majors, and so on. Lower-ability women flee competitive majors at high rates, while men and higher-ability women are undeterred. Women are far more likely to leave STEM fields for majors that are less competitive – but still somewhat science-intensive – suggesting that leaving STEM may be more about fleeing the \"culture\" of STEM majors than fleeing science and math.  <p>Links</p> <p><a href= \"https://twitter.com/JaminSpeer/status/1108393364070772736\" target= \"_blank\" rel=\"noopener\">Jamin's Twitter thread about the paper</a></p> <p><a href= \"https://web.stanford.edu/~niederle/Niederle.Vesterlund.QJE.2007.pdf\" target=\"_blank\" rel=\"noopener\">Niederle and Vesterlund's paper on gender differences in competitiveness</a></p> <p><a href= \"https://www.journals.uchicago.edu/doi/abs/10.1086/209919\" target= \"_blank\" rel=\"noopener\">Neal's paper on job mobility</a> featuring the following quote mentioned in the episode:</p> \"To the extent that college provides an opportunity for premarket search over potential careers, this result [of fewer career changes among college graduates] is to be expected.\" (p. 250)",
  "enclosure": "",
  "itunes:duration": "50:09",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of the University of Memphis. We discuss his paper,  co-authored with Carmen Astorne-Figari. The choice of college major is a key stage in the career search, and over a third of college students switch majors at least once. We...",
  "itunes:episode": 119,
  "itunes:episodeType": "full"
}