{
  "title": "TU65: Sensorimotor Psychotherapy &#8211; Tuning Into the Wisdom of Your Body With Guest Dr. Pat Ogden",
  "link": "https://therapistuncensored.com/episodes/tu65-sensorimotor-psychotherapy-tuning-into-the-wisdom-of-your-body-with-guest-dr-pat-ogden/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu65-sensorimotor-psychotherapy-tuning-into-the-wisdom-of-your-body-with-guest-dr-pat-ogden",
  "pubDate": "Fri, 25 May 2018 19:34:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6088",
  "description": "Sensorimotor Psychotherapy\nWe have unconscious stories about ourselves and the world held in our mind/body. Learn how becoming curious about your body can have a huge impact on your sense of self.  Body attunement + conscious reflection (left/right, top/bottom integration) are hallmark markers of secure functioning. Tap into your own body as a deep and abiding source of information and means of finding self-understanding and closer connection through sensorimotor psychotherapy.\n\nGuest Dr. Pat Ogden is a pioneer in somatic psychology, co-founder of Hakomi, founder of the Sensorimotor Institute, and author of several book on Sensorimotor Psychotherapy (see show notes for links). She joins co-host Sue Marriott LCSW, CGP in a discussion of the principles of sensorimotor therapy which is informed by the richness of developmental psychology, neuro-affective research, and mindfulness. Very importantly, they also get into a thoughtful discussion of multiculturalism and implicit unconscious majority bias in the mental health field.\nThe natural healing force within each one of us is the greatest force in getting well.  –Hippocrates \nThe body always leads us home . . . if we can simply learn to trust sensation and stay with it long enough for it to reveal appropriate action, movement, insight, or feeling. — Pat Ogden\n \n\n0:00-15:00\n\nIntro, Pat’s initial interest in psychotherapy, somatic therapy and the polyvagal theory\n\nRhythm and attunement through yoga and dance\n\nThe importance of mindfulness in relation to the body, posture as an indicator, philosophical principles\n\n \n\n15:00-30:00\n\nThe body as a source of knowledge and information\n\nInterconnectedness of principles, understanding “unity” across different cultures\n\nGene expression, cortisol levels upon waking and collapsed/immobilized posture\n\nUnderstanding trauma from a white dominant perspective and marginalized perspective\n\n \n\n30:00-45:00\n\n“Window of tolerance”, the modulation model, finding the middle ground between hyper arousal and threshold of any arousal\n\nTrying not to stick with formula when understanding an individual\n\nImplicit bias, identifying racism\n\nKey principles\n\n \n\n45:00-60:00\n\nDecoding humility as therapists\n\nAdvice for non-therapists\n\nIdentifying ailments in your body and actually doing something to correct it rather than just hoping it’ll get better (e.g. posture, breathing, etc.). Keeping mindfulness in the body in the moment. Become curious about your body.\n\nWrap up and outro\n\nLike this and want more? Dive deeper by checking out the resources below:\nResources:\nSensorimotor Psychotherapy, Interventions for Trauma and Attachment by Pat Ogden & Janina Fisher\n\nTrauma and the Body A Sensorimotor Approach to Psychotherapy by Pat Ogden et al\n\nSensorimotor Institute – articles and resources, Pat Ogden Director and Founder\n\nAccessing the Healing Power of the Vagus Nerve Self-Help Excersizes for Anxiety Trauma Depression and Autism by Stanley Rosenberg\nWant to support this work and stay in touch?\nJoin our email list, subscribe to Tunes here or join our Facebook page here to get updated popular articles on these subjects of interest. Biggest help of all is to leave us a review, they are so useful as we go forward fine-tuning what is most helpful for our audience and it literally inspires us to keep going in this hobby of love!\n\nBe sure you’ve checked out our free video, Modern Adult Attachment 101 to learn more and to easily share the basics of this science and what to do with it with others!  \n\n \n\nTweet",
  "enclosure": "",
  "itunes:subtitle": "Sensorimotor Psychotherapy We have unconscious stories about ourselves and the world held in our mind/body. Learn how becoming curious about your body can have a huge impact on your sense of self.  Body attunement + conscious reflection (left/right,",
  "itunes:summary": "Learn how tapping into the depth of wisdom your body holds can have a huge impact on your sense of self.   Body attunement + conscious reflection (left/right, top/bottom integration) are hallmark markers of secure functioning. Tap into your own body as a deep and abiding source of information and means of finding self-understanding and closer connection.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "54:19"
}