{
  "title": "Data Science workshop at data2day",
  "link": "",
  "updated": "2014-12-01T12:15:00+01:00",
  "published": "2014-12-01T12:15:00+01:00",
  "author": {
    "name": "Mikio L. Braun",
    "uri": "http://mikiobraun.de",
    "email": "mikiobraun@gmail.com"
  },
  "id": "http://blog.mikiobraun.de/2014/12/first-data-science-tutorial",
  "content": "<p><div class=\"figure\">\n\t<img src=\"/images/data2day-workshop-smaller.jpg\" />\n</div>\n\n<p>Giving a one day tutorial on data science is something I’ve been considering\nin different contexts from time to time, but for different reasons it never\nreally happened. Finally, last Friday, the tutorial took place as a workshop\nin the <a href=\"http://data2day.de\">data2day</a> conference, and I think it went pretty well. In this post I’d\nlike to talk a bit about our approach and our experiences.</p>\n\n<p>The conference was organized by the heise publisher, well known in Germany for\ntheir print magazines <a href=\"http://www.heise.de/ct/\">c’t</a> and <a href=\"http://www.heise.de/ix/\">iX</a>, which have been household names in IT since\nthe eighties. It was the first conference in the Big Data/Data Science\ncontext organized by them, but already brought together over 150 participants.</p>\n\n<p>For the workshop, I was happy to team up with Jan Müller and Paul Bünau from\n<a href=\"http://idalab.de\">idalab</a>. In fact, Paul and I had developed a similar kind of hands-on\nintroduction to data analysis a few years ago while he was working on his PhD\nat TU Berlin. Designed as a summer long course, the idea was to have students\nimplement a number of machine learning algorithms themselves. Each method\nwould first be presented by focussing on the main ideas, without going into\nthe theory too much. Then, the students would have two to three weeks time to\nimplement the method and play around with them on some toy data. During that\nphase, we would have a weekly office hour where we would go around and talk to\nthe students individually to help them where they got stuck.</p>\n\n<p>This course seemed to be quite popular with the students. We would still\nrandomly get praise for the course years later with students telling us that\nthis was among the courses where they learned most.</p>\n\n<p>So when designing this one day workshop, the idea was from the beginning to\nkeep these two ingredients: Focus on main ideas and context, and a hands-on\napproach.</p>\n\n<p>It was particularly important to us to not just go through a bunch of learning\nalgorithms, but also stress how important is to know what you are doing. As I\nhave <a href=\"http://blog.mikiobraun.de/2014/02/data-analysis-hard-parts.html\">discussed before</a>, it is too easy to put together some data analysis\npipeline and then not properly evaluate. Everything looks great, but in the\nend you have just looked at training error, resulting in really bad\nperformance on future data.</p>\n\n<p>For the hands-on part, we chose to work with <a href=\"http://ipython.org/notebook.html\">IPython notebooks</a>. These are\navailable on all major operating systems, notebooks can saved and loaded\neasily, it integrates with plotting, and so on. Toolwise we chose to work with\n<a href=\"http://www.numpy.org/\">numpy</a>, <a href=\"http://pandas.pydata.org/\">pandas</a>, [scikit-learn], and <a href=\"http://matplotlib.org/\">matplotlib</a>.  Originally the plan was\nto have one session where we go through the basics of the tools and then two\nuse cases, but while putting the material together it became apparent that\nthere wasn’t enough time for two use cases, so we just sticked with a simple\nexample based on MNIST character recognition, and decision trees.</p>\n\n<p>So in the end the course went like this:</p>\n\n<ul>\n  <li>\n    <p>about one hour if introductory course on what is data science/machine learning, and things like supervised vs. unsupervised learning,   evaluation, cross-validation, etc.</p>\n  </li>\n  <li>\n    <p>one hour of going through the basics of numpy and pandas in an interactive IPython session</p>\n  </li>\n  <li>\n    <p>one hour of doing some exercises with numpy and pandas</p>\n  </li>\n  <li>\n    <p>another hour of going through an example with scikit-learn</p>\n  </li>\n  <li>\n    <p>two hours of doing the use case</p>\n  </li>\n</ul>\n\n<p>The notebook from the example sessions were handed out at the beginning of the\nexercises, and the exercises were prepared as IPython notebooks themselves\nwith free cells where you could put down your solutions.</p>\n\n<p>As it is with all such things, you never know whether you thought of\neverything, but all in all, we felt the workshop went very well. With three of\nus,  there was enough time to help each of the participants individually,\nincluding fixing issues like finding out where IPython was keeping it files\nunder Windows, dealing with oddities of Python’s indexing scheme, and so on.</p>\n\n<p>In the end, all participants had a running notebook which loaded the MNIST\ndata, learned a decision tree whose hyperparameter was adjusted by cross-\nvalidation, giving them about 83% accuracy. Of course that is not optimal, but\nalready pretty good for a few lines of code. Most importantly, everyone now\nhas a complete framework from which they can start exploring other approaches,\ntry out new methods, and so on.</p>\n\n<p>Next time, we would probably intersperse the background talk with the\nsolutions, such that there isn’t such a monolithic block at the beginning, and\nbe more careful with Python 3 vs Python 2. But overall I think our approach\nworked out very well (also based on the feedback we got).</p>\n\n<p>The workshop also showed that there is a real need of teaching people the more\nhigh level concepts like proper validation. Unfortunately, even at\nuniversities, the focus is too much on the methods themselves. Students often\nlearn the process and things like proper validation only when they work on\ntheir master thesis. On the hand, for doing robust and reliable data analyses,\nthese things are absolutely essential.</p>\n\n</p>\n   <p><a href=\"http://blog.mikiobraun.de/2014/12/first-data-science-tutorial.html\">Click here for the full article</a>"
}