{
  "id": "yt:video:AYGi-YfZseo",
  "yt:videoId": "AYGi-YfZseo",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "Job Of An Artist Is To See Then Show - Christopher Riley",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-29T00:00:11+00:00",
  "updated": "2022-10-29T02:14:37+00:00",
  "media:group": {
    "media:title": "Job Of An Artist Is To See Then Show - Christopher Riley",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE BOOK - THE DEFINING MOMENT: How Writers and Actors Build Characters (by Christopher and Kathy Riley)\nhttps://amzn.to/3J8klh3\n\nBUY THE BOOK - THE HOLLYWOOD STANDARD: The Complete and Authoritative Guide to Script Format and Style - https://amzn.to/3MNIdbO\n\nChristopher Riley is a professional screenwriter who co-wrote with his wife Kathy Riley the award-winning German language courtroom thriller After the Truth. The Rileys have written scripts for Disney’s Touchstone Pictures, Paramount Pictures, Mandalay Television Pictures, the late Sean Connery’s Fountainbridge Films and Robert Cort Productions. Christopher produced the independent action-thriller Red Line and executive produced the web series Bump+. He is the author of the classic screenplay format guide The Hollywood Standard, now in its third edition, and teaches screenwriting at the undergraduate and graduate levels. The Riley's latest book is The Defining Moment: How Writers and Actors Build Characters (through Michael Wiese Productions).\n\nMORE VIDEOS WITH CHRISTOPHER RILEY\nhttps://bit.ly/3DKjLG6\n\nCONNECT WITH CHRISTOPHER RILEY\nhttps://www.imdb.com/name/nm0727003\nhttps://www.linkedin.com/in/christopherriley\nhttps://courses.story-masters.org\nhttp://thisdefiningmoment.com\n\nMORE MICHAEL WIESE PRODUCTIONS AUTHORS\nhttps://mwp.com\n\nRELATED VIDEOS\nA Story Is A Hero's Struggle Against An Obstacle To Reach A Goal - https://youtu.be/zXhjBR4Exfw\nThis Is What Many Artists Don't Realize Until They Are Older - https://youtu.be/arWQV6f0lJk\nNot Good Enough To Make It As An Artist - https://youtu.be/vLfnrwk-V0Y\nHow To Know You Are An Artist - https://youtu.be/y2Kr6wgdRS0\nThis Is Why The Most Talented Artists Aren't The Most Successful - https://youtu.be/mT0BEGIUXgQ \n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#writing #film #movies",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}