{
  "title": "India’s Top Court Bans Degrading ‘Two-Finger’ Rape Test",
  "link": "https://www.hrw.org/news/2022/11/01/indias-top-court-bans-degrading-two-finger-rape-test",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Activists protest against gender-based violence, in Delhi, India, October 12, 2020. \n                    © 2020 Amarjeet kumar Singh/SOPA Images via AP Photo\n          \n\n  \n<p>On October 31, India’s Supreme Court ruled that anyone who conducts the “regressive and invasive” two-finger test on survivors of sexual assault or rape will be guilty of misconduct. The judgment brings hope that the justice system will finally stop using this unscientific process.</p>\n\n<p>The “two-finger test” involves the examining doctor inserting two fingers inside the vagina of a rape survivor to assess whether the girl or woman is a “virgin” or “habituated to sexual intercourse.”</p>\n\n<p>“Evidence” from this test has been used by defense counsel during trials to assert that the rape survivor had “loose” or “lax” morals. This can lead to both the perversion of justice and deter rape survivors from reporting the crime for fear of being blamed.</p>\n\n<p>Past court rulings found the test has no scientific basis. In the recent ruling, India’s top court again held that a woman’s sexual history is immaterial to whether she was raped, calling the test “patriarchal and sexist.”</p>\n\n<p>In 2014, India’s Ministry of Health and Family Welfare adopted guidelines to standardize the medical examination and treatment of sexual assault survivors, eliminating the finger test and limiting internal vaginal examinations to those “medically indicated,” such as when diagnosing an infection, injury, or the presence of a foreign object.</p>\n\n  \n\n\n\n\n      \n\n\n  \n  \n\n\n\n\n          \n                    \n          Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        “Gayatri’s” Medico-Legal Report of Examination of Sexual Offense.\n                    © Private\n          \n\n  \n<p>However, Human Rights Watch found that doctors still conduct this procedure. For instance, Gayatri (pseudonym), from Madhya Pradesh state was 17 when her brother witnessed their father raping her in 2016. The rapes had been happening for months. After they reported the rapes, the doctor noted Gayatri was likely pregnant, conducted a “two-finger test,” and wrote a professional opinion that her “vagina admits two fingers loose, not enlarged” and that “she is habitual to sexual intercourse.”</p>\n\n<p>The Supreme Court directed the central and state governments to ensure the 2014 guidelines are circulated to all hospitals, to conduct training workshops for healthcare providers, and to review medical school curriculum.</p>\n\n<p>The Indian government has repeatedly said it is committed to ensuring justice for violence against women. Instead of continuing with patriarchal practices that degrade women, authorities should ensure that medical professionals treat sexual assault survivors with dignity, provide a safe environment of trust for treatment and examination, and offer crucial support and therapeutic care services.</p>",
  "pubDate": "Tue, 01 Nov 2022 16:52:29 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/01/indias-top-court-bans-degrading-two-finger-rape-test"
}