{
  "id": "tag:drsimonj.svbtle.com,2014:Post/does-financial-support-in-australia-favour-residents-born-elsewhere-responding-to-racism-with-data",
  "published": "2018-05-30T08:09:45-07:00",
  "updated": "2018-05-30T08:09:45-07:00",
  "link": "",
  "title": "Does financial support in Australia favour residents born elsewhere? Responding to racism with data",
  "content": "<blockquote>\n<p><em>Seeing a racist outburst made me wonder whether the Australian Government unfairly supports people based on their background. Using data from the Australian Government and Bureau of Statistics, I couldn’t find compelling evidence of this being true. Don’t believe me? Read on and see what you make of the data.</em></p>\n</blockquote><h2 id=\"australian-racism-goes-viral-again_2\">Australian racism goes viral, again <a class=\"head_anchor\" href=\"#australian-racism-goes-viral-again_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>Australian racism went viral again this year when a man was filmed abusing staff at <a href=\"https://www.humanservices.gov.au/individuals/centrelink\" rel=\"nofollow\">Centrelink</a>, which delivers social security payments and services to Australians (<a href=\"http://www.news.com.au/national/south-australia/centrelink-to-boost-security-after-racist-rant/news-story/78ed767ca1722691dacaf5257d327cd3\" rel=\"nofollow\">see story here</a>). The man yells that he didn’t vote for multiculturalism and that Centrelink is supporting everyone except “Australians”. It is distressing to watch, especially as someone whose ancestors found a home in Australia having escaped persecution. He can’t take it back, but the man did publically apologise and may be suffering from mental illness (<a href=\"http://www.newshub.co.nz/home/world/2018/03/australian-man-apologises-for-racist-tirade-at-centrelink.html\" rel=\"nofollow\">see story here</a>).</p>\n\n<p>This topic is still polarising. Many of us want to vilify this man while others may applaud him. But hate begets hate, and fighting fire with fire makes things worse. As a data scientist, the best way I know to respond to the assumptions and stereotypes that fuel racism is with evidence. So, without prejudice, let us investigate the data and uncover to whom the Australian government provides support through Centrelink.</p>\n<h2 id=\"centrelink-supports-australians-so-who-are-we_2\">Centrelink supports Australians, so who are we talking about? <a class=\"head_anchor\" href=\"#centrelink-supports-australians-so-who-are-we_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>With rare exceptions, <strong>Centrelink supports Australian Residents living in Australia</strong> (see <a href=\"https://www.humanservices.gov.au/individuals/subjects/payments-visa-holders#a3\" rel=\"nofollow\">here</a> and <a href=\"https://www.humanservices.gov.au/individuals/enablers/residence-descriptions\" rel=\"nofollow\">here</a>). So, the claim that Centrelink supports everyone but Australians in misguided. Perhaps the reference to “<a href=\"https://en.wikipedia.org/wiki/Multiculturalism\" rel=\"nofollow\">multiculturalism</a>” can direct us to a more testable question. Centrelink offers support to Australian <em>residents</em> who can be born anywhere in the world. So in this article, I’ll use publically accessible data to investigate differences in support given to residents born in Australia or elsewhere.</p>\n<h2 id=\"estimated-residential-population_2\">Estimated Residential Population <a class=\"head_anchor\" href=\"#estimated-residential-population_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>The Figure below shows changes in Australia’s <a href=\"http://www.abs.gov.au/websitedbs/censushome.nsf/home/factsheetspm?opendocument&amp;navpos=450\" rel=\"nofollow\">Estimated Residential Population</a>, which is an official value published by the <a href=\"http://www.abs.gov.au/\" rel=\"nofollow\">Australian Bureau of Statistics</a> and used for policy formation and decision making.</p>\n\n<p><a href=\"https://svbtleusercontent.com/xpMF9Qmbwx2hx1xgPKYuMX0xspap.png\" rel=\"nofollow\"><img src=\"https://svbtleusercontent.com/xpMF9Qmbwx2hx1xgPKYuMX0xspap_small.png\" alt=\"erp_over_time-1.png\"></a></p>\n\n<p>The residential population has been increasing from about 17 million in 1992 to over 24 million in 2016. In contrast, the percentage of residents who are Australian-born has decreased from 76.9% to 71.5%. This will guide our sense of whether Centrelink payments are unbiased.</p>\n\n<p>As a side note, <a href=\"http://www.censusdata.abs.gov.au/CensusOutput/copsub2016.nsf/All%20docs%20by%20catNo/Data-in-pictures/%24FILE/australiaER.html\" rel=\"nofollow\">Census statistics</a> reported that the percentage of Australian-born residents in 2016 was 66.7% (4.8% lower than the official estimate above). This discrepancy is the result of the the Australian Bureau of Statistics making adjustments that you can learn about <a href=\"http://www.abs.gov.au/websitedbs/censushome.nsf/home/factsheetspm?opendocument&amp;navpos=450\" rel=\"nofollow\">here</a>.</p>\n<h2 id=\"all-centrelink-payments_2\">All Centrelink Payments <a class=\"head_anchor\" href=\"#all-centrelink-payments_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>Centrelink data is published quarterly and has included country-of-birth breakdowns since December 2016 (which aligns with the last available population data reported above). At this time, Centrelink made 15 million payments to Australian residents.</p>\n<blockquote class=\"short\">\n<p>In December 2016, 71.5% of Australia’s Estimated Residential population was Australian-born. Comparably, 68.8% of all Centrelink payments went to Australian-born residents.</p>\n</blockquote>\n<p>The data shows that Centrelink payments are made to residents born in Australia or elsewhere in approximately the same proportions as these groups are represented in the population. The difference of a couple of percent indicates that slightly fewer payments were going to Australian-born residents than we’d expect. As we’ll see in the following section, this difference can be almost wholly accounted for by the Age Pension. Still, the difference is small enough to negate the claim that Centrelink substantially favours residents born outside Australia.</p>\n<h2 id=\"breakdown-by-type_2\">Breakdown by Type <a class=\"head_anchor\" href=\"#breakdown-by-type_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>It’s also possible to break down these total numbers into the specific payment types shown below (<a href=\"https://www.humanservices.gov.au/organisations/about-us/publications-and-resources/guide-australian-government-payments\" rel=\"nofollow\">detailed list here</a>).</p>\n\n<p><a href=\"https://svbtleusercontent.com/wKaqsBGqFW2bEDHVDeWD8U0xspap.png\" rel=\"nofollow\"><img src=\"https://svbtleusercontent.com/wKaqsBGqFW2bEDHVDeWD8U0xspap_small.png\" alt=\"payment_type_total-1.png\"></a></p>\n\n<p>It’s expected that these payment types, which support specific needs, will show biases in favour of certain groups. For example, <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/abstudy\" rel=\"nofollow\">ABSTUDY</a> supports study costs and housing for Aboriginal or Torres Strait Islander residents. This should mostly go to Australian-born residents. To investigate, we can extend the Figure above to include the number of Australian-born recipients:</p>\n\n<p><a href=\"https://svbtleusercontent.com/chfxRBXwKbRh3EWEvaP4630xspap.png\" rel=\"nofollow\"><img src=\"https://svbtleusercontent.com/chfxRBXwKbRh3EWEvaP4630xspap_small.png\" alt=\"payment_type_total_v_aus-1.png\"></a></p>\n\n<p>Looking at this Figure, most Centrelink payments fall along the dotted line, which is what we’d expect from a fair system (if 71.5% of the recipients were Australian-born).</p>\n\n<p>The outlier is the <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/age-pension\" rel=\"nofollow\">Age Pension</a>, which falls below the line. More recipients of the Age Pension are born outside Australia than is reflected in the total population. I cannot say from this data alone why there is some bias in the Age Pension and perhaps a knowledgeable reader can comment. Nonetheless, this discrepancy is large enough that removing the Age Pension from consideration results in 70.5% of all other Centrelink payments going to Australian-born residents – almost exactly the proportion in the population.</p>\n<h2 id=\"ignoring-total-numbers_2\">Ignoring Total Numbers <a class=\"head_anchor\" href=\"#ignoring-total-numbers_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>The Figure below shows the percentage of Australian-born recipients for each payment type, ignoring totals.</p>\n\n<p><a href=\"https://svbtleusercontent.com/6UKgQsAEeG9zBhbRFCgRJA0xspap.png\" rel=\"nofollow\"><img src=\"https://svbtleusercontent.com/6UKgQsAEeG9zBhbRFCgRJA0xspap_small.png\" alt=\"payment_type_p_aus-1.png\"></a></p>\n\n<p>At the upper end of the scale, we can see Australian-born recipients being over-represented for <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/abstudy\" rel=\"nofollow\">ABSTUDY</a> and <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/youth-allowance\" rel=\"nofollow\">Youth Allowance</a> payments. At the lower end, residents who are born outside Australia are over-represented for <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/wife-pension\" rel=\"nofollow\">Wife</a> and Widow <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/widow-b-pension\" rel=\"nofollow\">pension</a> and <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/widow-allowance\" rel=\"nofollow\">allowance</a>.</p>\n\n<p>These payments with large biases (in either direction) have some common features. They have very specific eligibility criteria and are among the least-awarded services (shown in earlier Figures). Furthermore, the granting of payments to new recipients has been stopped in some cases such as the <a href=\"https://www.humanservices.gov.au/individuals/services/centrelink/wife-pension\" rel=\"nofollow\">Wife Pension</a>.</p>\n\n<p>These findings are consistent with the expectation that specific types of payments <em>should</em> be biased in specific ways. It also shows that substantial biases only arise for specific payments that are awarded to very few individuals.</p>\n<h2 id=\"concluding-remarks_2\">Concluding remarks <a class=\"head_anchor\" href=\"#concluding-remarks_2\" rel=\"nofollow\">#</a>\n</h2>\n<p>In response to a racist outburst, I sought out publically available data to investigate whether there was evidence that the Australian Government unfairly supported residents based on their country of origin. I found that the percentage of residents born outside Australia has increased over time. However, with the minor exception of the Age pension (which the outraged man was not eligible for), residents born in Australia or elsewhere were fairly represented in the total number of Centrelink payments.</p>\n\n<p>I’d like to thank the Australian Government and Australian Bureau of Statistics for publicising this data and making it possible for me to respond to racism with evidence. If you’d like to reproduce this work or dig into the data yourself, everything from explaining where I got the data to create this article is freely available on <a href=\"https://github.com/drsimonj/analysis-responding_to_australian_racism_with_data\" rel=\"nofollow\">GitHub</a>. You can also keep in touch with me on <a href=\"https://www.linkedin.com/in/drsimonj\" rel=\"nofollow\">LinkedIn</a> or by following <a href=\"https://twitter.com/drsimonj\" rel=\"nofollow\">@drsimonj</a> on Twitter.</p>"
}