{
  "id": "yt:video:_WWX-2QoTI0",
  "yt:videoId": "_WWX-2QoTI0",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "The history of taxes (2/2) | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-10-28T19:00:21+00:00",
  "updated": "2022-10-31T17:59:52+00:00",
  "media:group": {
    "media:title": "The history of taxes (2/2) | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Collecting taxes and distributing tax money are core tasks for a modern state. This documentary tells the history of taxation, from the French Revolution to political protest movements like France’s \"Gilets Jaunes”.\n\nPart 1: https://youtu.be/ashglZx5yaU\n\nIs taxation an instrument serving the powerful, or a way to more fairly distribute wealth among the people? Part Two of the documentary looks at the history of citizen protests against \"those at the top\", as well as demands for taxation justice.\n\nAfter the 2008 financial crisis and the austerity policies that followed, voices of protest were heard all over Europe: whether from Brexit supporters in the United Kingdom, the \"Gilets Jaunes” (or \"yellow vests”) in France, or those disadvantaged by German reunification. These protests highlight a growing mistrust on the part of citizens toward their governments, and tax policy is often a bone of contention.\n\nSince the American Revolution with its rallying cry of \"No taxation without representation\", taxation and popular sovereignty have been mutually dependent. Current protests are a reminder to those in power of this basic rule of democracy. Meanwhile, the protests themselves hark back to turbulent moments in history: Since the Middle Ages, taxation has led to repeated conflicts between Europeans and their rulers. This two-part documentary follows the trail of these conflicts.\n\n#documentary #dwdocumentary \n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}