{
  "title": "The Real Dispute at Heart of Affirmative Action Cases Now Before High Court",
  "link": "https://www.heritage.org/courts/commentary/the-real-dispute-heart-affirmative-action-cases-now-high-court",
  "description": "<p>The Supreme Court is again examining whether universities may consider race when trying to build diverse student bodies, reviewing admissions policies at Harvard University and the University of North Carolina.</p>\n\n<p>“Can a court be blind to what must be necessarily known to every intelligent person in the state?”</p>\n\n<p>So wrote Judge Lorenzo Sawyer 136 years ago in a case challenging a San Francisco licensing ordinance regulating laundry businesses.</p>\n\n<p>The ordinance made no mention of race. Instead, it purported to be about safety, but everyone knew that it was enforced only against Asian laundry owners to help their white competitors.</p>\n\n<p>On appeal, the Supreme Court <a href=\"https://supreme.justia.com/cases/federal/us/118/356/\">cut through the obfuscation</a> and saw the racial discrimination behind the law.</p>\n\n<p>Oral arguments in two cases Monday challenging colleges’ racial admissions policies suggested that at least some justices are willing to turn a blind eye to present-day <a href=\"https://www.dailysignal.com/2022/01/31/harvards-method-of-discrimination-is-affront-to-individual-dignity/\">anti-Asian</a> discrimination if that discrimination comports with modern ideas about “racial justice.” </p>\n\n<p><strong>The Background</strong></p>\n\n<p>The two cases were brought by Students for Fair Admissions, a group representing Asian college applicants, challenging the way that Harvard and the University of North Carolina <a href=\"https://www.dailysignal.com/2019/10/03/a-judges-wrongheaded-ruling-saves-harvards-non-colorblind-admission-policy/\">use race</a> to give preferences to black and Hispanic students at the expense of white and Asian applicants.</p>\n\n<p>The Supreme Court has long held that race-based policies are inherently suspicious and contrary to the ideal that all men and woman are created equal. Still, the court has permitted colleges to use race in admissions because it trusts colleges when they say that they create diversity on campus and that diversity yields certain educational benefits.  </p>\n\n<p>Nevertheless, the court’s permission was strictly limited: Colleges may not use racial quotas; race may be only one factor among many; and racial-preference policies must be temporary.</p>\n\n<p>Citing those precedents, the schools say that they consider race as part of a “holistic” review of applications to create broad diversity of races, experiences, and viewpoints, which yields educational benefits.</p>\n\n<p>The challengers contend that the schools secretly do much more than that, putting a significant thumb on the scale in favor of some racial groups and against others.</p>\n\n<p>Both schools give some minorities (primarily blacks and Hispanics) a “plus factor” in admissions. But the schools are careful to argue that these are only given out on an individualized basis.</p>\n\n<p>But the evidence, particularly in the case against Harvard, strongly suggests that the schools racially balance their student bodies. The share of Harvard’s student body that goes to each racial group is remarkably consistent over time. The evidence also shows that black and Hispanic students are admitted at much higher rates than white and Asian students with the same academic credentials.</p>\n\n<p>For example, at Harvard, an Asian applicant with academics in the top 10% has a 12.7% chance of getting in, but with the same grades and test scores, a black student has a 56.1% chance. In fact, race is determinative for at least 45% of black and Hispanic applicants to Harvard.</p>\n\n<p>The reason this is troublesome is that college admissions are a zero-sum game. There are only so many spots. So, a plus factor for one applicant is, necessarily, a minus factor for someone else. And Harvard and UNC, it seems, impose a significant minus on Asians.</p>\n\n<p>Asians do very well academically. If academic achievements were all that mattered, they would be admitted at a rate higher than their percentage of the total population—what some call “overrepresentation.”  That’s a problem for universities that want to balance the racial composition of their student bodies with the racial composition of the population at large.</p>\n\n<p>The challengers argue that the schools respond to this fact by discriminating against Asians. Harvard, for example, consistently marks Asians lower than any other group on its “personal rating,” which measures subjective categories, such as personality, empathy, and social skills.</p>\n\n<p>At oral argument, Justice Samuel Alito asked Harvard’s lawyer what explains this lower rating. Either Asians, as a group, do indeed have worse social skills, or the school is <a href=\"https://www.dailysignal.com/2019/10/08/harvard-says-it-uses-racial-discrimination-to-sculpt-a-diverse-class-this-is-a-dangerous-path/\">discriminating</a> against them. Harvard’s lawyer had no answer to that, simply insisting over and over again that there’s no discrimination against Asians at the elite school.</p>\n\n<p>But many of the justices seemed unwilling to be blind, especially given the history of Harvard’s personal rating system, which it created in the 1920s and 1930s to exclude Jews.</p>\n\n<p>Justice Clarence Thomas drilled right to the heart of the issue by asking one of the lawyers defending the University of North Carolina: If this case had been brought against a school in 1960 that was discriminating against black students on the basis that segregation yielded educational benefits, would we have deferred to that judgment?</p>\n\n<p>The lawyer had to concede that, of course, the court would not.</p>\n\n<p><strong>The Principle</strong></p>\n\n<p>That exchange highlights the real fight at the heart of this case; namely, the struggle between principle and popular notions of “racial justice.”</p>\n\n<p>The principle at stake is the principle that made the civil rights movement so compelling; specifically, that every American is equal in the eyes of the law, <a href=\"https://www.dailysignal.com/2021/08/06/judge-defends-equal-justice-against-tide-of-critical-race-theory-disparate-impact/\">regardless of race</a>. But the colleges and their defenders recognize, rightly, that there are still disparities between racial groups. They argue that the principle of racial equality must yield in the pursuit of “social justice.”</p>\n\n<p>But many of the justices—Thomas in particular—are aware that what is “justice” today is not necessarily “justice” tomorrow. Thomas’ question about a school in 1960 was not hypothetical. Many intellectuals in that day <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4197212\">genuinely believed</a> that segregation yielded many of the same educational benefits that proponents of racial diversity claim today.</p>\n\n<p>To him, history proves that it is too dangerous to trust anyone to implement racial policies in a way that is benign.</p>\n\n<p>Justice Sonia Sotomayor loudly disagreed with him, arguing several times that past race-based policies caused the disparities that persist today and that, accordingly, we must turn those race-based policies around to fix those disparities.</p>\n\n<p>For her part, Justice Ketanji Brown Jackson (who sat for the North Carolina case, but was recused from the Harvard case because of a past affiliation with the university) simply doubted that there was any discrimination against Asians at all. How could we conclude that, she wondered, when the admissions policy is holistic and considers more than 40 factors?</p>\n\n<p>How could the Supreme Court say that San Francisco’s 1880s laundry ordinance discriminated against Asians when it appeared only to be based on safety concerns?</p>\n\n<p>How ironic that in defense of race-conscious preferences, Jackson would blind herself to the fact that racial discrimination in favor of one group necessarily harms another.</p>\n\n<p><strong>The Labels</strong></p>\n\n<p>Jackson seemed also to be unconcerned about the arbitrariness of the race labels. What makes a student Asian or black or Hispanic or white?  </p>\n\n<p>The label “Asian,” as Harvard’s lawyer conceded, applies to 61% of the world’s population. It includes everyone from Afghanistan to Vietnam. “Black” includes African immigrants, the descendants of slaves, wealthy people from the Hamptons, and poor people from Harlem.  “Hispanic” is an ethnic, not racial, group and includes white people from Spain and dark-skinned people from Peru. Lastly, “white” includes Europeans, Middle Easterners, and some Africans.</p>\n\n<p>How do such arbitrary labels, Alito wondered, produce any sort of actual diversity?  The schools’ defenders said that race informs who people are, at least to some extent.</p>\n\n<p>So, it’s their personality and experiences that matter, not race alone, right? No, said the schools’ lawyers, race is also at least a little bit relevant.</p>\n\n<p>Several justices asked how so, and Thomas asked the lawyers to clarify the link between racial diversity and these “educational benefits,” but no clear answer was forthcoming.</p>\n\n<p>Jackson responded by arguing that because no student is required to check a race box on the application, then there’s no problem with the colleges using the race information they have. But it was apparently lost on her that this only makes the use of race more arbitrary, because the colleges’ information is poor.</p>\n\n<p>Alito, in a telling exchange, revealed just how poor the information really is. He asked, when can a student honestly claim to be a member of a minority racial group?</p>\n\n<p>The answer is that they can self-identify. What if a great-grandparent was a member of a certain minority racial group, is that enough? Great-great-grandparent?  What if it’s family lore that an ancestor was an American Indian? Is that enough?</p>\n\n<p>At first, UNC’s lawyer said that the school defers to the student, because what matters is how they identify, but when Alito got to “great-great-grandparent,” the lawyer said that the applicant’s claim would be “less plausible.” And when Alito got to the American Indian example, the lawyer said that the school would no longer think that race was relevant even if the student sincerely identified as an American Indian.</p>\n\n<p>So, what’s the point of checking the box?</p>\n\n<p><strong>The Ending</strong></p>\n\n<p>In its previous cases permitting racial admissions policies, the court said that they must end eventually. So, when do these ones end? The schools had no answer.</p>\n\n<p>Ultimately, they wanted the freedom to continue using race in admissions until they decide that “justice,” however they define it, will be done without race-based policies.</p>\n\n<p>But as Thomas well knows from living through Jim Crow, as Jews well know from being kept out of Harvard in the 1920s, and as Asians well know today from being punished for their devotion to education, “justice” changes with the times.</p>\n\n<p>The only thing that remains constant is the principle that all men and women are created equal.   </p>\n\n<p><em>This piece originally appeared in <a href=\"https://www.dailysignal.com/2022/10/31/the-real-dispute-at-heart-of-affirmative-action-cases-now-before-high-court\">The Daily Signal</a></em></p>",
  "pubDate": "Wed, 02 Nov 2022 11:20:39 -0400",
  "dc:creator": "GianCarlo Canaparo",
  "guid": "https://www.heritage.org/courts/commentary/the-real-dispute-heart-affirmative-action-cases-now-high-court"
}