{
  "title": "S1E9 - How Heartbreak Led to an Historic Victory with Kaillie Humphries- part 1",
  "guid": "https://pinecast.com/guid/f3447c05-7558-43bf-89c9-c078a891e160",
  "pubDate": "Tue, 04 Aug 2020 07:30:00 -0000",
  "itunes:duration": "00:55:58",
  "description": "<p>Laura’s guest on the podcast today is two-time Olympic Women’s Bobsled Champion, Kaillie Humphries. In addition to her two gold medals from the 2010 and 2014 Olympics, Kaillie has won Olympic Bronze in 2018, is the first female bobsledder to defend her Olympic title, and was named the flagbearer for the 2014 closing ceremonies. In 2019, Kaillie left the Canadian team and now represents the United States in competitions.</p>\n<p>After a brief discussion about the adorable similarities in their dogs, Kaillie and Laura go on to delve into Kaillie’s history with sports and the road that led her to bobsledding. Kaillie offers a vivid account of what it’s like to compete in a bobsled, shares the training process for the sport and emphasizes the critical importance of intense focus within it. With great candor, Kaillie then describes her career in bobsledding, especially her Olympic experiences, the disappointments along the way, and the lessons she learned from them. The two continue by exploring the value of overcoming negative advice, focusing on being your best rather than winning, and then finish up with the inspirational tale of Kaillie’s Olympic Gold performance in her home country. Kaillie Humphries’ story is a testament to the power of perseverance, surrounding yourself with people who love you, and believing in yourself. Today’s conversation is one that, while it focuses on the sports world, provides valuable examples and lessons for virtually every aspect of life.</p>\n<p>Episode Highlights:</p>\n<p>Kaillie and Laura’s dogs\nKaillie’s history in sports and how she found bobsledding\nHer description of what it’s like to bobsled\nHow bobsledders train including visualizations\nThe critical importance of focus\nHer career in bobsledding, particularly her Olympic experiences\nLearning from disappointments and mistakes\nOvercoming negative advice and surrounding yourself with people who love and care for you\nFocusing on being your best rather than winning\nWinning Olympic Gold in her home country of Canada</p>\n<p>Quotes:</p>\n<p>“For me, sports was always an outlet, it was where I felt the most comfortable, where I felt the safest…I got to push myself, challenge myself.”</p>\n<p>“Coming last on a consistent basis, it wears you down.”</p>\n<p>“It’s a second hand sport, as they call it.”</p>\n<p>“I feel like if you’ve been in a fighter jet or like a Formula 1 race car, you’re going to have an idea.”</p>\n<p>“Unfortunately, there’s fatalities that can occur, so you need to be 100% focused every single time you step on the ice and you go to push.”</p>\n<p>“I wasn’t doing it to impress anybody, I was doing it because it fulfilled me.”</p>\n<p>“Surround yourself with people who do care about you, more than what you’re doing.”</p>\n<p>“The goal wasn’t on winning, it was about doing my best each and every step that it was going to take in order to ultimately have a great result.”</p>\n<p>Links:</p>\n<p>The Pursuit of Gold homepage:   <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">http://thepursuitofgold.com/</a> </p>\n<p>Laura’s Social Media:</p>\n<p>Instagram: <a href=\"https://www.instagram.com/lala_the_diver/\" rel=\"nofollow\">https://www.instagram.com/lala_the_diver/</a></p>\n<p>Facebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">https://www.facebook.com/TheLauraWilkinson</a></p>\n<p>Kaillie’s Social Media:</p>\n<p>Instagram: <a href=\"https://www.instagram.com/kailliehumphries/\" rel=\"nofollow\">https://www.instagram.com/kailliehumphries/</a> </p>\n<p>Twitter:   <a href=\"https://twitter.com/BobsledKaillie\" rel=\"nofollow\">https://twitter.com/BobsledKaillie</a></p>\n<p>FaceBook:   <a href=\"https://www.facebook.com/bobsledkaillie/\" rel=\"nofollow\">https://www.facebook.com/bobsledkaillie/</a></p>",
  "itunes:title": "How Heartbreak Led to an Historic Victory with Kaillie Humphries- part 1",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 9
}