{
  "title": "53: Zen Cryar DeBrücke on Accessing Your Inner Guidance System",
  "pubDate": "Thu, 26 May 2016 19:11:59 +0000",
  "guid": "bf1e5bf1281e99d6ca71688255b16bc9",
  "link": "https://lifeonpurpose.libsyn.com/53-zen-cryar-debrcke-on-accessing-your-inner-guidance-system",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #53</strong>, my guest is internationally renowned teacher, speaker, and coach <strong>Zen Cryar DeBrücke</strong>.</p> <p><strong>Zen</strong> joined me for a fascinating conversation about her new book <em><strong>Your Inner GPS: Follow Your Internal Guidance to Optimal Health, Happiness, and Satisfaction</strong></em>, what that is, and how to use it.</p> <p><em>“You were born with a factory-installed guidance system. It is like the GPS in a car. This system is called your Internal Guidance System, or IGS,” writes Zen. “The guidance it gives you has many different purposes. The most important one is to get you from one end of your life to the other with as much joy, ease, and fulfillment as possible.”</em></p> <p>We began the interview with a short interactive exercise that listeners can use to better understand what we're talking about. We also discuss the concepts of opening, closing, and some simple, straightforward techniques for accessing this powerful source of inner wisdom on a daily basis.</p> <p>About: <strong>Zen Cryar DeBrücke</strong> is an internationally renowned teacher, speaker, and coach whose programs have helped people all over the world transform their personal and business lives for the better.</p> <p>As a Master intuitive coach and stress expert, she teaches about the physical sensations in your body that are called anxiety, worry and fear. She uncovered their relationship to one's thoughts and how to manage them for optimal health and happiness.</p> <p><strong>Zen</strong> is a member of the Transformational Leadership Council with experts such as Marianne Williamson and Jack Canfield, who said \"Zen Cryar DeBrücke us a master who takes us by the hand and shows us that we all have deep wisdom within.”</p> <p>In her brand new book <em><strong>Your Inner GPS: Follow Your Internal Guidance to Optimal Health, Happiness, and Satisfaction</strong></em> (New World Library), she says that each of us is born with access to a powerful tool called an Internal Guidance System (IGS). Not unlike the GPS system that is built into cars, its purpose is to guide us through our lives by letting us know whether our thoughts and actions are moving us closer to, or further away from, the things we most want to create in our lives.</p> <p>To learn more about <strong>Zen</strong> and her work, visit: <a href= \"http://zeninamoment.com/\">http://zeninamoment.com/</a>.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #53, my guest is internationally renowned teacher, speaker, and coach Zen Cryar DeBrücke.</p> <p>Zen joined me for a fascinating conversation about her new book <em>Your Inner GPS: Follow Your Internal Guidance to Optimal Health, Happiness, and Satisfaction</em>, what that is, and how to use it.</p> <p><em>“You were born with a factory-installed guidance system. It is like the GPS in a car. This system is called your Internal Guidance System, or IGS,” writes Zen. “The guidance it gives you has many different purposes. The most important one is to get you from one end of your life to the other with as much joy, ease, and fulfillment as possible.”</em></p> <p>We began the interview with a short interactive exercise that listeners can use to better understand what we're talking about. We also discuss the concepts of opening, closing, and some simple, straightforward techniques for accessing this powerful source of inner wisdom on a daily basis.</p> <p>About: Zen Cryar DeBrücke is an internationally renowned teacher, speaker, and coach whose programs have helped people all over the world transform their personal and business lives for the better.</p> <p>As a Master intuitive coach and stress expert, she teaches about the physical sensations in your body that are called anxiety, worry and fear. She uncovered their relationship to one's thoughts and how to manage them for optimal health and happiness.</p> <p>Zen is a member of the Transformational Leadership Council with experts such as Marianne Williamson and Jack Canfield, who said \"Zen Cryar DeBrücke us a master who takes us by the hand and shows us that we all have deep wisdom within.”</p> <p>In her brand new book <em>Your Inner GPS: Follow Your Internal Guidance to Optimal Health, Happiness, and Satisfaction</em> (New World Library), she says that each of us is born with access to a powerful tool called an Internal Guidance System (IGS). Not unlike the GPS system that is built into cars, its purpose is to guide us through our lives by letting us know whether our thoughts and actions are moving us closer to, or further away from, the things we most want to create in our lives.</p> <p>To learn more about Zen and her work, visit: <a href= \"http://zeninamoment.com/\">http://zeninamoment.com/</a>.</p>",
  "enclosure": "",
  "itunes:duration": "45:57",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #53, my guest is internationally renowned teacher, speaker, and coach Zen Cryar DeBrücke. Zen joined me for a fascinating conversation about her new book Your Inner GPS: Follow Your Internal Guidance to Optimal Health,..."
}