{
  "title": "Automated Domain Discovery from Multiple Sources to Improve Zero-Shot Generalization. (arXiv:2112.09802v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2112.09802",
  "description": "<p>Domain generalization (DG) methods aim to develop models that generalize to\nsettings where the test distribution is different from the training data. In\nthis paper, we focus on the challenging problem of multi-source zero shot DG\n(MDG), where labeled training data from multiple source domains is available\nbut with no access to data from the target domain. A wide range of solutions\nhave been proposed for this problem, including the state-of-the-art\nmulti-domain ensembling approaches. Despite these advances, the na\\\"ive ERM\nsolution of pooling all source data together and training a single classifier\nis surprisingly effective on standard benchmarks. In this paper, we hypothesize\nthat, it is important to elucidate the link between pre-specified domain labels\nand MDG performance, in order to explain this behavior. More specifically, we\nconsider two popular classes of MDG algorithms -- distributional robust\noptimization (DRO) and multi-domain ensembles, in order to demonstrate how\ninferring custom domain groups can lead to consistent improvements over the\noriginal domain labels that come with the dataset. To this end, we propose (i)\nGroup-DRO++, which incorporates an explicit clustering step to identify custom\ndomains in an existing DRO technique; and (ii) DReaME, which produces effective\nmulti-domain ensembles through implicit domain re-labeling with a novel\nmeta-optimization algorithm. Using empirical studies on multiple standard\nbenchmarks, we show that our variants consistently outperform ERM by\nsignificant margins (1.5% - 9%), and produce state-of-the-art MDG performance.\nOur code can be found at https://github.com/kowshikthopalli/DREAME\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Thopalli_K/0/1/0/all/0/1\">Kowshik Thopalli</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Katoch_S/0/1/0/all/0/1\">Sameeksha Katoch</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Turaga_P/0/1/0/all/0/1\">Pavan Turaga</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Thiagarajan_J/0/1/0/all/0/1\">Jayaraman J. Thiagarajan</a>"
}