{
  "title": "Good password practices",
  "link": "https://rinzewind.org/blog-en/2020/good-password-practices.html",
  "description": "<p>The other day, I posted \n<a href=\"https://www.reddit.com/r/PersonalFinanceCanada/comments/i6lzx3/good_password_hygiene/\">this</a> \non a subreddit I frequent and I thought I might as well publish it here. The \ncontext is some CRA accounts (the Canadian tax agency) being breached using \n<a href=\"https://en.wikipedia.org/wiki/Credential_stuffing\">password stuffing</a>. Password \nreuse is a bad thing; site A gets breached and then someone has a list of our \ncredentials that might work somewhere else. A password manager mitigates this \ngreatly.</p>\n<p>Without further ado, the original text, with small corrections and additions:</p>\n<hr>\n<ol>\n<li>\n<p>Always use a password manager. It can be a paid one, like \n   <a href=\"https://1password.com/\">1Password</a> or <a href=\"https://www.lastpass.com/\">LastPass</a>, \n   or something you keep locally, like <a href=\"https://keepassxc.org/\">KeepassXC</a> and \n   then you sync it with your devices using Dropbox, Drive or similar. I use \n   this second option. Then create a new password for every site you register \n   to. Use the random password generator, never type it yourself. This is one \n   generated just now, as an example: <em>P0QNcP~Z|iw~5Q.H/(m</em>.</p>\n</li>\n<li>\n<p>Just to repeat: never reuse a password. If you use the same password on site \n   A and site B and site A gets breached, they'll also get access to site B.</p>\n</li>\n<li>\n<p>Never, never, NEVER use true answers to the security questions. They're \n   easy-ish to guess, speciall for people with social media accounts. Instead, \n   use your password manager to store the answers and treat them as a second \n   password. They can be easier than the main password just in case you need to \n   spell them on the phone. Just hammer the keyboard. Example:</p>\n<blockquote>\n<p>What's the name of your first pet? aumg345890</p>\n</blockquote>\n</li>\n<li>\n<p>Activate 2FA when possible. Also, don't use SMS for that if given the option; \n   it's better use an app on the phone like Authy, or you can also use your \n   password manager to store these codes, most allow you to do that.</p>\n</li>\n<li>\n<p>Of course, if you go this way never forget the password to your password \n   manager (edit: and make sure to make this password robust; for this you can \n   also use sequences of words as passwords, they're easier to remember. Example \n   <a href=\"http://www.egansoft.com/password/index.php\">here</a>); but it's pretty much the \n   only password you'll have to remember. If you use KeepassXC, make sure to \n   make an offline copy of your DBs from time to time. It's some work, yes, but \n   it's more work to have your bank / CRA account breached.</p>\n</li>\n</ol>\n<hr>",
  "dc:creator": "José María Mateos",
  "pubDate": "Sat, 22 Aug 2020 18:12:00 -0400",
  "guid": "tag:rinzewind.org,2020-08-22:/blog-en/2020/good-password-practices.html",
  "category": "Blog"
}