{
  "title": "Microsoft's GitHub Copilot Sued Over 'Software Piracy on an Unprecedented Scale'",
  "link": "https://developers.slashdot.org/story/22/11/05/1257233/microsofts-github-copilot-sued-over-software-piracy-on-an-unprecedented-scale?utm_source=rss1.0mainlinkanon&utm_medium=feed",
  "description": "\"Microsoft's GitHub Copilot is being sued in a class action lawsuit that claims the AI product is committing software piracy on an unprecedented scale,\" reports IT Pro. \n\nProgrammer/designer Matthew Butterick filed the case Thursday in San Francisco, saying it was on behalf of millions of GitHub users potentially affected by the $10-a-month Copilot service:\n\nThe lawsuit seeks to challenge the legality of GitHub Copilot, as well as OpenAI Codex which powers the AI tool, and has been filed against GitHub, its owner Microsoft, and OpenAI.... \"By training their AI systems on public GitHub repositories (though based on their public statements, possibly much more), we contend that the defendants have violated the legal rights of a vast number of creators who posted code or other work under certain open-source licences on GitHub,\" said Butterick. \n\nThese licences include a set of 11 popular open source licences that all require attribution of the author's name and copyright. This includes the MIT licence, the GNU General Public Licence, and the Apache licence. The case claimed that Copilot violates and removes these licences offered by thousands, possibly millions, of software developers, and is therefore committing software piracy on an unprecedented scale. \n\nCopilot, which is entirely run on Microsoft Azure, often simply reproduces code that can be traced back to open-source repositories or licensees, according to the lawsuit. The code never contains attributions to the underlying authors, which is in violation of the licences. \"It is not fair, permitted, or justified. On the contrary, Copilot's goal is to replace a huge swath of open source by taking it and keeping it inside a GitHub-controlled paywall....\" Moreover, the case stated that the defendants have also violated GitHub's own terms of service and privacy policies, the DMCA code 1202 which forbids the removal of copyright-management information, and the California Consumer Privacy Act. \n\nThe lawsuit also accuses GitHub of monetizing code from open source programmers, \"despite GitHub's pledge never to do so.\" \n\nAnd Butterick argued to IT Pro that \"AI systems are not exempt from the law... If companies like Microsoft, GitHub, and OpenAI choose to disregard the law, they should not expect that we the public will sit still.\" Butterick believes AI can only elevate humanity if it's \"fair and ethical for everyone. If it's not... it will just become another way for the privileged few to profit from the work of the many.\" \n\nReached for comment, GitHub pointed IT Pro to their announcement Monday that next year, suggested code fragments will come with the ability to identify when it matches other publicly-available code &mdash; or code that it's similar to. \n\nThe article adds that this lawsuit \"comes at a time when Microsoft is looking at developing Copilot technology for use in similar programmes for other job categories, like office work, cyber security, or video game design, according to a Bloomberg report.\"<p><div class=\"share_submission\" style=\"position:relative;\">\n<a class=\"slashpop\" href=\"http://twitter.com/home?status=Microsoft's+GitHub+Copilot+Sued+Over+'Software+Piracy+on+an+Unprecedented+Scale'%3A+https%3A%2F%2Fbit.ly%2F3WAqwBo\"><img src=\"https://a.fsdn.com/sd/twitter_icon_large.png\"></a>\n<a class=\"slashpop\" href=\"http://www.facebook.com/sharer.php?u=https%3A%2F%2Fdevelopers.slashdot.org%2Fstory%2F22%2F11%2F05%2F1257233%2Fmicrosofts-github-copilot-sued-over-software-piracy-on-an-unprecedented-scale%3Futm_source%3Dslashdot%26utm_medium%3Dfacebook\"><img src=\"https://a.fsdn.com/sd/facebook_icon_large.png\"></a>\n\n\n\n</div></p><p><a href=\"https://developers.slashdot.org/story/22/11/05/1257233/microsofts-github-copilot-sued-over-software-piracy-on-an-unprecedented-scale?utm_source=rss1.0moreanon&amp;utm_medium=feed\">Read more of this story</a> at Slashdot.</p><iframe src=\"https://slashdot.org/slashdot-it.pl?op=discuss&amp;id=22337227&amp;smallembed=1\" style=\"height: 300px; width: 100%; border: none;\"></iframe>",
  "dc:creator": "EditorDavid",
  "dc:date": "2022-11-05T14:34:00+00:00",
  "dc:subject": "programming",
  "slash:department": "copying-rights",
  "slash:section": "developers",
  "slash:comments": 67,
  "slash:hit_parade": "67,67,59,46,11,2,2"
}