{
  "title": "Tableau Training: Stop Learning Incorrectly (Do This Instead)",
  "link": "https://www.dataquest.io/blog/tableau-training/",
  "comments": "https://www.dataquest.io/blog/tableau-training/#respond",
  "dc:creator": "Ray Harris",
  "pubDate": "Wed, 26 Oct 2022 08:00:00 +0000",
  "category": [
    "Learning and Motivation",
    "learn tableau"
  ],
  "guid": "https://www.dataquest.io/?p=41393",
  "description": "Why Learn Tableau? Tableau is one of the most popular business intelligence tools in the world — it is one of the top 3 leaders in the market, as ranked by Gartner.  In 2022, more than 30,000 organizations use Tableau, and more than 200,000 job vacancies on LinkedIn require at least some knowledge of it. [&#8230;]",
  "content:encoded": "<h2 id=\"h-why-learn-tableau\">Why Learn Tableau?</h2>\n<p>Tableau is one of the most popular business intelligence tools in the world — it is one of the top 3 leaders in the market, <a href=\"https://www.cxtoday.com/data-analytics/gartner-magic-quadrant-for-analytics-and-business-intelligence-platforms-2022/\" target=\"_blank\" rel=\"noreferrer noopener\">as ranked by Gartner</a>. </p>\n<p>In 2022, more than <a href=\"https://www.slintel.com/tech/business-intelligence-bi/tableausoftware-vs-microsoftpowerbi\" target=\"_blank\" rel=\"noreferrer noopener\">30,000 organizations </a>use Tableau, and more than <a href=\"https://www.linkedin.com/jobs/search/?currentJobId=3258348988&geoId=92000000&keywords=tableau\" target=\"_blank\" rel=\"noreferrer noopener\">200,000 job vacancies on LinkedIn</a> require at least some knowledge of it. Tableau is not only regularly used by data professionals, such as business analysts and data analysts, but also by a broad range of others, such as digital marketers, consumer experience specialists, and more.</p>\n<p>By learning Tableau, you can get a valuable skill that will help you grow your career. The best way to prove your skills to employers and stand out from the crowd in interviews is to obtain the <a href=\"https://www.tableau.com/learn/certification/desktop-specialist\" target=\"_blank\" rel=\"noreferrer noopener\">Tableau Specialist Certification</a> and build a portfolio of projects. </p>\n<p>In this article, we’ll provide you with 5 steps to prepare you for certification, give you experience to master Tableau, and, finally, help you build a project portfolio. These 5 steps will grow your career. </p>\n<h2 id=\"h-how-to-learn-tableau\">How to Learn Tableau?</h2>\n<p>With the rise in Tableau’s popularity, the options for training have grown rapidly. Selecting the right way to learn Tableau can be difficult.</p>\n<p>Watching workshops on YouTube or reading specialist blogs on the internet seem like attractive options, but mastering Tableau requires deep knowledge and hands-on experience — the rest can be learned on the job. </p>\n<p>If you want to learn Tableau, get certified, and build your portfolio in just a few months, we’ve created a series of Tableau courses that will teach you everything you need.</p>\n<h3>Step 1: Download Tableau and get used to the interface</h3>\n<p>There are both free and paid versions of Tableau available for download. For students, or people who just want a 14-day trial, Tableau can be downloaded <a href=\"https://www.tableau.com/support/releases/desktop/2022.2.1\" target=\"_blank\" rel=\"noreferrer noopener\">here</a> for PCs and Macs. After the 14-day trial, users can convert to a paid license. For those who want long-term access without paying, there’s <a href=\"https://www.tableau.com/en-gb/products/public/download\" target=\"_blank\" rel=\"noreferrer noopener\">Tableau Public</a>. As long as you aren&#8217;t working with sensitive data and are able to always save to the cloud, Tableau Public is a fantastic choice.</p>\n<p>Once Tableau is installed and ready to go, we can familiarize ourselves with the Tableau interface by following the <a href=\"https://help.tableau.com/current/guides/get-started-tutorial/en-us/get-started-tutorial-home.htm\" target=\"_blank\" rel=\"noreferrer noopener\">starting guide</a>. It’s a good idea to learn the interface before jumping into detailed Tableau online training, like <a href=\"http://placeholder\" target=\"_blank\" rel=\"noreferrer noopener\">Dataquest’s first Tableau Course</a>.</p>\n<h3>Step 2: Start building charts and dashboards</h3>\n<p>Jumping  into data sources and building charts and dashboards is the most fun thing to do with Tableau . But that’s easier said than done! A clean datasource is important when learning how to create visual analytics. Tableau offers great options for data cleansing and manipulation, but that’s probably not the first thing we want to learn. Instead, let&#8217;s find a clean datasource to work with. There are plenty of options on <a href=\"https://kaggle.com\" target=\"_blank\" rel=\"noreferrer noopener\">Kaggle.com</a>, such as <a href=\"https://www.kaggle.com/datasets/andrewmvd/board-games\" target=\"_blank\" rel=\"noreferrer noopener\">this dataset</a> on board game rankings, or this data on <a href=\"https://www.kaggle.com/datasets/jackywang529/toronto-bikeshare-data\" target=\"_blank\" rel=\"noreferrer noopener\">Toronto’s 2017 bike share usage</a>. Dataquest has a great course in the Tableau track about  <a href=\"http://placeholder\" target=\"_blank\" rel=\"noreferrer noopener\">shaping and designing a dashboard</a>.</p>\n<h3>Step 3: Publish and share your dashboards</h3>\n<p>Sharing our insights with others is even more rewarding than building dashboards. There are two ways to share a dashboard: statically or interactively. </p>\n<p>Sharing a static dashboard can be done by exporting it as a PDF, Image, or Powerpoint. When doing this, we lose all interactivity, including filters, click actions and tooltips (hover-overs). Still, this is a good sharing method because it’s simple and software agnostic. All of these options can be found in the top line Dashboard menu. </p>\n<p>If we want our data consumers to have interactivity, we need to publish our workbooks to Tableau Public, Online or Server. Only Tableau Public allows us to publish and share without paying for a membership, so it’s our best option while building a portfolio. Tableau has a <a href=\"https://help.tableau.com/current/guides/get-started-tutorial/en-us/get-started-tutorial-share.htm\" target=\"_blank\" rel=\"noreferrer noopener\">great resource</a> for the best way to share your dashboards, so pick the path that works best for you. </p>\n<h3>Step 4: Build your portfolio</h3>\n<p>Hopefully, the thrill of publishing the first dashboard has been a positive experience. It’s time to think about growing our Tableau portfolio. To make the Tableau learning experience engaging and rewarding,  it’s helpful to work on something enjoyable. Too many online  Tableau classes use the perfect superstore sales dataset, which is neither realistic, nor inspiring. Instead, try  using one of the many dataset aggregators to find data you’re passionate about. We’ve used <a href=\"https://kaggle.com\" target=\"_blank\" rel=\"noreferrer noopener\">Kaggle</a> a few times. There’s also the site <a href=\"https://ourworldindata.org/\" target=\"_blank\" rel=\"noreferrer noopener\">Our World in Data</a> and the Dataquest article <a href=\"https://www.dataquest.io/blog/free-datasets-for-projects/\" target=\"_blank\" rel=\"noreferrer noopener\"><em>24 Free Datasets for Building an Irresistible Portfolio (2022)</em></a>. Whether it be sports, politics, films, or any other passion, there’s a good chance that a free dataset exists on the topic. </p>\n<h3>Step 5: Get certified </h3>\n<p>To complete your learning journey,  consider a <a href=\"https://www.tableau.com/learn/certification\" target=\"_blank\" rel=\"noreferrer noopener\">Tableau professional desktop certification</a>. The two levels of desktop certification are <a href=\"https://www.tableau.com/learn/certification/desktop-specialist\" target=\"_blank\" rel=\"noreferrer noopener\">desktop specialist</a> and <a href=\"https://www.tableau.com/learn/certification/certified-data-analyst\" target=\"_blank\" rel=\"noreferrer noopener\">certified data analyst</a>. The specialist exam is a multiple choice test, while the certified data analyst exam is a combination of multiple choice and problem-solving questions. Both are great resume boosters and offer a learning milestone to build confidence in your Tableau skills. There are options for preparing here:  <a href=\"https://mkt.tableau.com/files/TableauDesktopSpecialist_ExamGuide.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Exam prep doc from Tableau (guide)</a>.</p>\n<hr class=\"wp-block-separator has-alpha-channel-opacity\" />\n<h3>Takeaway</h3>\n<p>Acquiring Tableau skills and getting certified can take anywhere from 1 to 6 months–or more. Some people learn very quickly,  while others may take longer, due to other life commitments. It all depends on your timeline and your dedication to learn Tableau at the pace you want. </p>\n",
  "wfw:commentRss": "https://www.dataquest.io/blog/tableau-training/feed/",
  "slash:comments": 0
}