{
  "title": "(Now that faculty aren&#8217;t coming into the office anymore) Will universities ever recover?",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/06/now-that-faculty-arent-coming-into-the-office-anymore-will-universities-ever-recover/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/06/now-that-faculty-arent-coming-into-the-office-anymore-will-universities-ever-recover/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Thu, 06 Oct 2022 13:19:24 +0000",
  "category": [
    "Sociology",
    "Teaching"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47886",
  "description": "A few years ago I taught a course at Sciences Po in Paris. The classes were fine, the students were fine, but there was almost no academic community. I had an office in some weird building where they stuck visitors. &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/06/now-that-faculty-arent-coming-into-the-office-anymore-will-universities-ever-recover/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>A few years ago I taught a course at Sciences Po in Paris.  The classes were fine, the students were fine, but there was almost no academic community.  I had an office in some weird building where they stuck visitors.  The place was mostly pretty empty.  Sometimes I&#8217;d go over to the department of economics, which was hosting me (but had no office space)&#8212;it was in a fancy building on, I think it was the 4th floor but maybe it was the 2nd floor and they were just very long flights of stairs&#8212;and most of the faculty were never there.  So I didn&#8217;t bother to come by very often:  what&#8217;s the point if there&#8217;s no office for you and no colleagues to talk with.  I don&#8217;t know what it was like for the students who wanted intellectual experiences outside of class:  maybe there were places where the grad students hung out?  I don&#8217;t know.</p>\n<p>Anyway, the American universities that I&#8217;ve attended and taught at have been nothing like that.  Buzzing with faculty and grad students, lots of opportunities for spontaneous conversations.</p>\n<p>Then came covid.  Classes were moved online, then we weren&#8217;t allowed to come into the office or teach in person.  At some point they started allowing in-person teaching but they were still discouraging us from showing up to the office or having in-person meetings outside of class.  Eventually all become allowed, but then there became the new norm of zoom meetings, faculty who didn&#8217;t want to come into work if they didn&#8217;t have to, students who wanted to avoid the commute to school, etc.  And then, as with Sciences Po those many years ago, I was less motivated to show up to work myself, which resulted in fewer spontaneous interactions with students and colleagues.  Online can be convenient&#8212;hey, look at this blog!&#8212;but I still think something is missing.</p>\n<p>So here&#8217;s the question:  Will universities ever recover?</p>\n<p>Sadly, I suspect the answer is no.  It&#8217;s just too easy not so show up, also this is just the continuation of a decades-long trend of fewer weeks in the semester, fewer days of class in the week, much less need for the physical library, etc.  Also, the people at Sciences Po back in 2009 seemed just fine with closed doors and empty corridors.  So that arid academic environment seems like a stable equilibrium.  It makes me sad.  Obv it&#8217;s the least of our problems in the world today, but still.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/06/now-that-faculty-arent-coming-into-the-office-anymore-will-universities-ever-recover/feed/",
  "slash:comments": 31
}