{
  "title": "What Mike Davis' family put into his ofrenda, and what he offered them",
  "dc:creator": "Kinsee Morlan",
  "pubDate": "Fri, 4 Nov 2022 14:00:20 GMT",
  "link": "https://www.latimes.com/entertainment-arts/books/story/2022-11-04/what-mike-davis-family-put-into-his-ofrenda-and-why",
  "guid": "https://www.latimes.com/entertainment-arts/books/story/2022-11-04/what-mike-davis-family-put-into-his-ofrenda-and-why",
  "description": "<p>Only a week after the death of the author Mike Davis, his family made an altar for Dia de los Muertos. His widow, Alessandra Moctezuma, details some of the objects in it. </p>",
  "content:encoded": "<p>Only a week after the death of the author Mike Davis, his family made an altar for Dia de los Muertos. His widow, Alessandra Moctezuma, details some of the objects in it. </p>",
  "media:content": {
    "media:description": "An altar to writer Mike Davis, for Día de los Muertos 2022, by his wife Alessandra Moctezuma. The altar features pictures of Mike, a can of Coke Zero, Abuelita brand hot chocolate, an IWW patch and a small bust of Friedrich Engels.As Moctezuma wrote in a Facebook post that accompanied the image: \"Besides the formal portrait, there are pictures of our travel adventures. Standing by the 'Utopia' sign that we found driving around New Zealand, in the middle of nowhere. With your raised fist by a graffiti sign that says 'Revolt'' in a yard in New York (you always favored red). Capturing your interest for geology, in front of an escarpment in New Foundland. And some of your favorite things: a portrait of FDR, IWW patch, a bust of Engels, the plumerias from our years in Papa'aloa, Hawaii. Your glasses, your Speed Ball pen, which you always left uncapped.\"There's the traditional flowers, some cempasuchil, water and salt. And the drinks and foods you loved. Oatmeal, because you were a good Irish. Mexican hot chocolate, Irish cream (the Costco one was cheaper and better than Bailey's) and Coke Zero with the anarchist red and black.\"",
    "media:credit": "Alessandra Moctezuma"
  }
}