{
  "title": "Interview Special: Graham Cluley",
  "link": "https://malicious.life/interview-special-graham-cluley/",
  "pubDate": "Wed, 05 Sep 2018 14:52:37 +0000",
  "guid": "http://malicious.life/?p=579",
  "comments": "https://malicious.life/interview-special-graham-cluley/#respond",
  "wfw:commentRss": "https://malicious.life/interview-special-graham-cluley/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "As we prepare to release an awesome 2-part story in two weeks, we decided to give you a chance to go back to some old favorites and check out some of the behind-the-scenes interviews of Malicious Life. Graham Cluley tells about his entry into the world of security. There are stories aplenty in this interview- Graham […]",
  "content:encoded": "<p>As we prepare to release&nbsp;an awesome 2-part story in two weeks, we decided to give you a chance to go back to some old favorites and check out some of the behind-the-scenes interviews of Malicious Life.</p>\n<p>Graham Cluley tells about his entry into the world of security. There are stories aplenty in this interview- Graham tells of how he turned from a young student writing video games for donations, to a programmer for one of Europe&#8217;s leading anti-virus solutions in the early 90&#8217;s, and sheds a ton of light on the malware industry in some of its earliest days.</p>\n<p>Pair this interview with Episode 2- The Dark Avenger, for a comprehensive&nbsp;view of the virus (and anti-virus) writing scene of the early 90&#8217;s.</p>\n",
  "enclosure": "",
  "itunes:subtitle": "As we prepare to release an awesome 2-part story in two weeks, we decided to give you a chance to go back to some old favorites and check out some of the behind-the-scenes interviews of Malicious Life. Graham Cluley tells about his entry into the world...",
  "itunes:summary": "As we prepare to release an awesome 2-part story in two weeks, we decided to give you a chance to go back to some old favorites and check out some of the behind-the-scenes interviews of Malicious Life. Graham Cluley tells about his entry into the world of security. There are stories aplenty in this interview- Graham […]",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "53:56"
}