{
  "title": "10 Exciting Ideas of 2018 in NLP",
  "description": "This post gathers 10 ideas that I found exciting and impactful this year—and that we'll likely see more of in the future. For each idea, it highlights 1-2 papers that execute them well.",
  "link": "http://ruder.io/10-exciting-ideas-of-2018-in-nlp/",
  "guid": "5c76ff7c1b9b0d18555b9eb7",
  "category": [
    "transfer learning",
    "multi-task learning",
    "meta-learning",
    "natural language processing",
    "semi-supervised learning",
    "language models",
    "cross-lingual"
  ],
  "dc:creator": "Sebastian Ruder",
  "pubDate": "Wed, 19 Dec 2018 19:28:46 GMT",
  "media:content": "",
  "content:encoded": "<img src=\"http://ruder.io/content/images/2018/12/syntactic_scaffold-1.png\" alt=\"10 Exciting Ideas of 2018 in NLP\"><p>This post gathers 10 ideas that I found exciting and impactful this year—and that we'll likely see more of in the future.</p><p>For each idea, I will highlight 1-2 papers that execute them well. I tried to keep the list succinct, so apologies if I did not cover all relevant work. The list is necessarily subjective and covers ideas mainly related to transfer learning and generalization. Most of these (with some exceptions) are not trends (but I suspect that some might become more 'trendy' in 2019). Finally, I would love to read about your highlights in the comments or see highlights posts about other areas.</p><h2 id=\"1-unsupervised-mt\">1) Unsupervised MT</h2><p>There were <a href=\"https://arxiv.org/abs/1711.00043\">two</a> <a href=\"https://arxiv.org/abs/1710.11041\">unsupervised</a> MT papers at ICLR 2018. They were <em>surprising</em> in that they worked at all, but results were still low compared to supervised systems. At EMNLP 2018, unsupervised MT hit its stride with <a href=\"https://arxiv.org/abs/1804.07755\">two</a> <a href=\"https://arxiv.org/abs/1809.01272\">papers</a> from the same two groups that significantly improve upon their previous methods. My highlight:</p><ul><li><a href=\"https://arxiv.org/abs/1804.07755\"><strong>Phrase-Based & Neural Unsupervised Machine Translation</strong> (EMNLP 2018)</a>:  The paper does a nice job in distilling the three key requirements for unsupervised MT: a good initialization, language modelling, and modelling the inverse task (via back-translation). All three are also beneficial in other unsupervised scenarios, as we will see below. Modelling the inverse task enforces cyclical consistency, which has been employed in different approaches—most prominently in <a href=\"https://arxiv.org/abs/1703.10593\">CycleGAN</a>. The paper performs extensive experiments and evaluates even on two low-resource language pairs, English-Urdu and English-Romanian. We will hopefully see more work on low-resource languages in the future.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/phrase_based_and_neural_unsupervised_mt.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Toy illustration of the three principles of unsupervised MT. A) Two monolingual datasets. B) Initialization. C) Language modelling. D) Back-translation <a href=\"https://arxiv.org/abs/1804.07755\">(Lample et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"2-pretrained-language-models\">2) Pretrained language models</h2><p>Using pretrained language models is probably the <a href=\"http://ruder.io/nlp-imagenet/\">most significant NLP trend</a> this year, so I won't spend much time on it here. There have been a slew of memorable approaches: <a href=\"https://arxiv.org/abs/1802.05365\">ELMo</a>, <a href=\"https://arxiv.org/abs/1801.06146\">ULMFiT</a>, <a href=\"https://s3-us-west-2.amazonaws.com/openai-assets/research-covers/language-unsupervised/language_understanding_paper.pdf\">OpenAI Transformer</a>, and <a href=\"https://arxiv.org/abs/1810.04805\">BERT</a>. My highlight:</p><ul><li><a href=\"https://arxiv.org/abs/1802.05365\"><strong>Deep contextualized word representations</strong> (NAACL-HLT 2018)</a>: The paper that introduced ELMo has been much lauded. Besides the impressive empirical results, where it shines is the careful analysis section that teases out the impact of various factors and analyses the information captured in the representations. The word sense disambiguation (WSD) analysis by itself (below on the left) is well executed. Both demonstrate that a LM on its own provides WSD and POS tagging performance close to the state-of-the-art.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/wsd_and_pos_tagging_results.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Word sense disambiguation (left) and POS tagging (right) results of first and second layer bidirectional language model compared to baselines <a href=\"https://arxiv.org/abs/1802.05365\">(Peters et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"3-common-sense-inference-datasets\">3) Common sense inference datasets</h2><p>Incorporating common sense into our models is one of the most important directions moving forward. However, creating good datasets is not easy and even popular ones <a href=\"http://aclweb.org/anthology/N18-2017\">show</a> <a href=\"http://www.aclweb.org/anthology/S18-2023\">large</a> biases. This year, there have been some well-executed datasets that seek to teach models some common sense such as <a href=\"https://arxiv.org/abs/1805.06939\">Event2Mind</a> and <a href=\"https://arxiv.org/abs/1808.05326\">SWAG</a>, both from the University of Washington. SWAG was solved <a href=\"https://twitter.com/seb_ruder/status/1050727451138150400\">unexpectedly quickly</a>. My highlight:</p><ul><li><strong><a href=\"http://visualcommonsense.com/\">Visual Commonsense Reasoning</a></strong><a href=\"http://visualcommonsense.com/\"> (arXiv 2018)</a>: This is the first visual QA dataset that includes a rationale (an explantation) with each answer. In addition, questions require complex reasoning. The creators go to great lengths to address possible bias by ensuring that every answer's prior probability of being correct is 25% (every answer appears 4 times in the entire dataset, 3 times as an incorrect answer and 1 time as the correct answer); this requires solving a constrained optimization problem using models that compute relevance and similarity. Hopefully preventing possible bias will become a common component when creating datasets. Finally, just look at the gorgeous presentation of the data 👇.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/visual_commonsense_reasoning.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>VCR: Given an image, a list of regions, and a question, a model must answer the question and provide a rationale explaining why its answer is right <a href=\"https://arxiv.org/abs/1811.10830\">(Zellers et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"4-meta-learning\">4) Meta-learning</h2><p>Meta-learning has seen much use in few-shot learning, reinforcement learning, and robotics—the most prominent example: <a href=\"https://arxiv.org/abs/1703.03400\">model-agnostic meta-learning (MAML)</a>—but successful applications in NLP have been rare. Meta-learning is most useful for problems with a limited number of training examples. My highlight:</p><ul><li><a href=\"http://aclweb.org/anthology/D18-1398\"><strong>Meta-Learning for Low-Resource Neural Machine Translation</strong> (EMNLP 2018)</a>: The authors use MAML to learn a good initialization for translation, treating each language pair as a separate meta-task. Adapting to low-resource languages is probably the most useful setting for meta-learning in NLP. In particular, combining multilingual transfer learning (such as <a href=\"https://github.com/google-research/bert/blob/master/multilingual.md\">multilingual BERT</a>), unsupervised learning, and meta-learning is a promising direction.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/meta-learning_vs_transfer_learning.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>The difference between transfer learning multilingual transfer learning, and meta-learning. Solid lines: learning of the initialization. Dashed lines: Path of fine-tuning <a href=\"http://aclweb.org/anthology/D18-1398\">(Gu et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"5-robust-unsupervised-methods\">5) Robust unsupervised methods</h2><p>This year, <a href=\"http://aclweb.org/anthology/P18-1072\">we</a> <a href=\"http://aclweb.org/anthology/D18-1056\">and</a> others have observed that unsupervised cross-lingual word embedding methods break down when languages are dissimilar. This is a common phenomenon in transfer learning where a discrepancy between source and target settings (e.g. domains in <a href=\"https://www.cs.jhu.edu/~mdredze/publications/sentiment_acl07.pdf\">domain adaptation</a>, tasks in <a href=\"https://arxiv.org/abs/1706.08840\">continual learning</a> and <a href=\"http://www.aclweb.org/anthology/E17-1005\">multi-task learning</a>) leads to deterioration or failure of the model. Making models more robust to such changes is thus important. My highlight:</p><ul><li><a href=\"http://www.aclweb.org/anthology/P18-1073\"><strong>A robust self-learning method for fully unsupervised cross-lingual mappings of word embeddings</strong> (ACL 2018)</a>: Instead of meta-learning an initialization, this paper uses their understanding of the problem to craft a better initialization. In particular, they pair words in both languages that have a similar distribution of words they are similar to. This is a great example of using domain expertise and insights from an analysis to make a model more robust.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/similarity_distribution.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>The similarity distributions of three words. Equivalent translations ('two' and 'due') have more similar distributions than non-related words ('two' and 'cane'—meaning 'dog'; <a href=\"http://www.aclweb.org/anthology/P18-1073\">Artexte et al., 2018</a>).</figcaption></figure><!--kg-card-end: image--><h2 id=\"6-understanding-representations\">6) Understanding representations</h2><p>There have been a lot of efforts in better understanding representations. In particular, <a href=\"https://arxiv.org/abs/1608.04207\">'diagnostic classifiers'</a> (tasks that aim to measure if learned representations can predict certain attributes) have become <a href=\"http://arxiv.org/abs/1805.01070\">quite common</a>. My highlight:</p><ul><li><a href=\"http://aclweb.org/anthology/D18-1179\"><strong>Dissecting Contextual Word Embeddings: Architecture and Representation</strong> (EMNLP 2018)</a>: This paper does a great job of better understanding pretrained language model representations. They extensively study learned word and span representations on carefully designed unsupervised and supervised tasks. The resulting finding: Pretrained representations learn tasks related to low-level morphological and syntactic tasks at lower layers and longer range semantics at higher layers. To me this really shows that pretrained language models indeed capture similar properties as <a href=\"https://thegradient.pub/nlp-imagenet/\">computer vision models pretrained on ImageNet</a>.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/bilm_transformer_information.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Per-layer performance of BiLSTM and Transformer pretrained representations on (from left to right) POS tagging, constituency parsing, and unsupervised coreference resolution <a href=\"http://aclweb.org/anthology/D18-1179\">(Peters et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"7-clever-auxiliary-tasks\">7) Clever auxiliary tasks</h2><p>In many settings, we have seen an increasing usage of multi-task learning with carefully chosen auxiliary tasks. For a good auxiliary task, data must be easily accessible. One of the most prominent examples is <a href=\"https://arxiv.org/abs/1810.04805\">BERT</a>, which uses next-sentence prediction (that has been used in <a href=\"https://papers.nips.cc/paper/5950-skip-thought-vectors.pdf\">Skip-thoughts</a> and more recently in <a href=\"https://arxiv.org/pdf/1803.02893.pdf\">Quick-thoughts</a>) to great effect. My highlights: </p><ul><li><a href=\"http://aclweb.org/anthology/D18-1412\"><strong>Syntactic Scaffolds for Semantic Structures</strong> (EMNLP 2018)</a>: This paper proposes an auxiliary task that pretrains span representations by predicting for each span the corresponding syntactic constituent type. Despite being conceptually simple, the auxiliary task leads to large improvements on span-level prediction tasks such as semantic role labelling and coreference resolution. This papers shows that specialised representations learned at the level required by the target task (here: spans) are immensely beneficial.</li><li><strong><a href=\"https://arxiv.org/abs/1810.08854\">pair2vec: Compositional Word-Pair Embeddings for Cross-Sentence Inference</a></strong><a href=\"https://arxiv.org/abs/1810.08854\"> (arXiv 2018)</a>: In a similar vein, this paper pretrains <em>word pair representations</em> by maximizing the pointwise mutual information of pairs of words with their context. This encourages the model to learn more meaningful representations of word pairs than with more general objectives, such as language modelling. The pretrained representations are effective in tasks such as SQuAD and MultiNLI that require cross-sentence inference. We can expect to see more pretraining tasks that capture properties particularly suited to certain downstream tasks and are complementary to more general-purpose tasks like language modelling.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/syntactic_scaffold.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Syntactic, PropBank and coreference annotations from OntoNotes. PropBank SRL arguments and coreference mentions are annotated on top of syntactic constituents. Almost every argument is related to a syntactic constituent <a href=\"http://aclweb.org/anthology/D18-1412\">(Swayamdipta et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"8-combining-semi-supervised-learning-with-transfer-learning\">8) Combining semi-supervised learning with transfer learning</h2><p>With the recent advances in transfer learning, we should not forget more explicit ways of using target task-specific data. In fact, pretrained representations are complementary with many forms of semi-supervised learning. We have explored <a href=\"http://aclweb.org/anthology/P18-1096\">self-labelling approaches</a>, a particular category of semi-supervised learning. My highlight: </p><ul><li><a href=\"http://aclweb.org/anthology/D18-1217\"><strong>Semi-Supervised Sequence Modeling with Cross-View Training</strong> (EMNLP 2018)</a>: This paper shows that a conceptually very simple idea, making sure that the predictions on different views of the input agree with the prediction of the main model, can lead to gains on a diverse set of tasks. The idea is similar to word dropout but allows leveraging unlabelled data to make the model more robust. Compared to other self-ensembling models such as <a href=\"https://papers.nips.cc/paper/6719-mean-teachers-are-better-role-models-weight-averaged-consistency-targets-improve-semi-supervised-deep-learning-results.pdf\">mean teacher</a>, it is specifically designed for particular NLP tasks. With much work on <em>implicit</em> semi-supervised learning, we will hopefully see more work that explicitly tries to model the target predictions going forward.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/cross-view_training-1.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Inputs seen by auxiliary prediction modules: Auxiliary 1: <em>They traveled to</em> __________________. Auxiliary 2: <em>They traveled to</em> <strong>Washington</strong> _______. Auxiliary 3: _____________ <strong>Washington</strong> <em>by plane</em>. Auxiliary 4: ________________________ <em>by plane</em> <a href=\"http://aclweb.org/anthology/D18-1217\">(Clark et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image--><h2 id=\"9-qa-and-reasoning-with-large-documents\">9) QA and reasoning with large documents</h2><p>There have been a lot of developments in question answering (QA), with an <a href=\"https://arxiv.org/abs/1809.09600\">array</a> <a href=\"https://stanfordnlp.github.io/coqa/\">of</a> <a href=\"http://quac.ai/\">new</a> <a href=\"https://arxiv.org/abs/1806.03822\">QA</a> <a href=\"http://qangaroo.cs.ucl.ac.uk/\">datasets</a>. Besides conversational QA and performing multi-step reasoning, the most challenging aspect of QA is to synthesize narratives and large bodies of information. My highlight: </p><ul><li><a href=\"http://aclweb.org/anthology/Q18-1023\"><strong>The NarrativeQA Reading Comprehension Challenge</strong> (TACL 2018)</a>: This paper proposes a challenging new QA dataset based on answering questions about entire movie scripts and books. While this task is still out of reach for current methods, models are provided the option of using a summary (rather than the entire book) as context, of selecting the answer (rather than generate it), and of using the output from an IR model. These variants make the task more feasible and enable models to gradually scale up to the full setting. We need more datasets like this that present ambitious problems, but still manage to make them accessible.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/narrative_qa.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>Comparison of QA datasets <a href=\"http://aclweb.org/anthology/Q18-1023\">(Kočiský et al., 2018)</a>.&nbsp;</figcaption></figure><!--kg-card-end: image--><h2 id=\"10-inductive-bias\">10) Inductive bias</h2><p>Inductive biases such as convolutions in a CNN, regularization, dropout, and other mechanisms are core parts of neural network models that act as a regularizer and make models more sample-efficient. However, coming up with a broadly useful inductive bias and incorporating it into a model is challenging. My highlights:</p><ul><li><a href=\"http://aclweb.org/anthology/K18-1030\"><strong>Sequence classification with human attention</strong> (CoNLL 2018)</a>: This paper proposes to use human attention from eye-tracking corpora to regularize attention in RNNs. Given that many current models such as Transformers use attention, finding ways to train it more efficiently is an important direction. It is also great to see another example that human language learning can help improve our computational models. </li><li><a href=\"http://aclweb.org/anthology/D18-1548\"><strong>Linguistically-Informed Self-Attention for Semantic Role Labeling</strong> (EMNLP 2018)</a>: This paper has a lot to like: a Transformer trained jointly on both syntactic and semantic tasks; the ability to inject high-quality parses at test time; and out-of-domain evaluation. It also regularizes the Transformer's multi-head attention to be more sensitive to syntax by training one attention head to attend to the syntactic parents of each token. We will likely see more examples of Transformer attention heads used as auxiliary predictors focusing on particular aspects of the input.</li></ul><!--kg-card-begin: image--><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"http://ruder.io/content/images/2018/12/out-of-domain_srl_performance.png\" class=\"kg-image\" alt=\"10 Exciting Ideas of 2018 in NLP\"><figcaption>10 years of PropBank semantic role labeling. Comparison of Linguistically-Informed Self-Attention (LISA) with other methods on out-of-domain data <a href=\"https://people.cs.umass.edu/~strubell/\">(Strubell et al., 2018)</a>.</figcaption></figure><!--kg-card-end: image-->"
}