{
  "title": "Back to the office? The future of remote and hybrid work, with Tsedal Neeley, PhD",
  "itunes:title": "Back to the office? The future of remote and hybrid work, with Tsedal Neeley, PhD",
  "pubDate": "Wed, 30 Jun 2021 10:30:00 +0000",
  "guid": "f6a9fc72-43f7-4e93-b230-f30afa109188",
  "link": "http://sopapa.libsyn.com/back-to-the-office-the-future-of-remote-and-hybrid-work-with-tsedal-neeley-phd",
  "itunes:image": "",
  "description": "<p>Many Americans are headed back to the office this summer, but fault lines are emerging between some companies’ expectations for in-person work and their employees’ desire to continue working remotely. Tsedal Neeley, PhD, a professor at Harvard Business School and author of “Remote Work Revolution: Succeeding from Anywhere,” discusses the future of the post-pandemic office, how the pandemic has changed office culture and how employees and companies can both thrive in the new world of remote and hybrid work.<br /> <br /> Listener Survey - <a href= \"https://www.apa.org/podcastsurvey\">https://www.apa.org/podcastsurvey</a></p>",
  "content:encoded": "<p>Many Americans are headed back to the office this summer, but fault lines are emerging between some companies’ expectations for in-person work and their employees’ desire to continue working remotely. Tsedal Neeley, PhD, a professor at Harvard Business School and author of “Remote Work Revolution: Succeeding from Anywhere,” discusses the future of the post-pandemic office, how the pandemic has changed office culture and how employees and companies can both thrive in the new world of remote and hybrid work.  Listener Survey - <a href= \"https://www.apa.org/podcastsurvey\">https://www.apa.org/podcastsurvey</a></p>",
  "enclosure": "",
  "itunes:duration": "34:29",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Many Americans are headed back to the office this summer, but fault lines are emerging between some companies’ expectations for in-person work and their employees’ desire to continue working remotely. Tsedal Neeley, PhD, a professor at Harvard...",
  "itunes:episode": 148,
  "itunes:episodeType": "full"
}