{
  "title": "BONUS: The Passion Economy",
  "pubDate": "Wed, 08 Jul 2020 15:00:00 +0000",
  "guid": "6ba7fa7a-6557-4455-9c6f-6be343cae6d1",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/bonus_passion_economy.mp3",
  "itunes:image": "",
  "description": "<p>This bonus episode features an interview from <a href= \"https://podcasts.apple.com/us/podcast/the-passion-economy/id1459910839\"> The Passion Economy</a>, created by Adam Davidson of NPR's Planet Money. The clip features an interview with Coss Marte, an enterprising entrepreneur in an unorthodox business.</p> <blockquote>The economy is bananas, even scary. But some people are thriving, and we're going to figure out how. Adam Davidson, \"New Yorker\" writer, longtime contributor to This American Life, and the creator of NPR’s \"Planet Money,\" unearths stories from regular people. People who have cracked the code to success in our new economic reality.</blockquote>",
  "content:encoded": "<p>This bonus episode features an interview from <a href= \"https://podcasts.apple.com/us/podcast/the-passion-economy/id1459910839\"> The Passion Economy</a>, created by Adam Davidson of NPR's Planet Money. The clip features an interview with Coss Marte, an enterprising entrepreneur in an unorthodox business.</p> The economy is bananas, even scary. But some people are thriving, and we're going to figure out how. Adam Davidson, \"New Yorker\" writer, longtime contributor to This American Life, and the creator of NPR’s \"Planet Money,\" unearths stories from regular people. People who have cracked the code to success in our new economic reality.",
  "enclosure": "",
  "itunes:duration": "09:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "This bonus episode features an interview from , created by Adam Davidson of NPR's Planet Money. The clip features an interview with Coss Marte, an enterprising entrepreneur in an unorthodox business. The economy is bananas, even scary. But some people...",
  "itunes:episodeType": "bonus"
}