{
  "id": "https://bibleinoneyear.org/en/youth/126",
  "title": "Day 126: Pray God-Sized Prayers",
  "description": "Psalm 57:1, Judges 4:2a–4,6–8,  5:2,31, John 4:47, 50-53, 5:7–8.  It was not the placebo effect  It was a God-sized answer to a God-sized prayer",
  "pubDate": "Thu, 06 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/126/?ignore",
  "itunes:duration": "13:34",
  "guid": "enyouth06052021-126",
  "length": 814.63,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 126: Pray God-Sized Prayers",
  "itunes:subtitle": "Psalm 57:1, Judges 4:2a–4,6–8,  5:2,31, John 4:47, 50-53, 5:7–8.  It was not the placebo effect  It was a God-sized answer to a God-sized prayer",
  "itunes:summary": "I remember so well praying for a baby called Craig. I had been asked to visit a woman in the Brompton Hospital. Vivienne had three children and was pregnant with a fourth. Her third child, who was eighteen months old, had a hole in his heart that had been operated on. The operation had not been a success and, not unnaturally, the medical staff wanted to turn the machines off. Many times they asked Vivienne if they could turn the machines off and let the baby die. She said no, as she wanted to try one last thing. She wanted someone to pray for him. So I went.\nCraig had tubes all over him. His body was bruised and swollen. She said that the doctors had indicated that even if he recovered he would have brain damage because his heart had stopped for such a long time. She told me she didn’t believe in God but she said, ‘Will you pray?’\nI prayed in the name of Jesus for God to heal him. Then I explained to her how she could give her life to Jesus Christ and she did. I left, but returned two days later. Vivienne came running out the moment she saw me. She said, ‘I’ve been trying to get hold of you; something amazing has happened. The night after you prayed he completely turned the corner. He has recovered.’ Within a few days Craig had gone home.\nVivienne went around all her relatives and friends saying, ‘I didn’t believe, but now I do believe.’\nA remarkable healing had occured. This was over thirty years ago and I have kept in touch with the family. This healing was not autosuggestion; he was a baby at the time. It was not positive thinking. It was not the placebo effect. It was a God-sized answer to a God-sized prayer.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 126
}