{
  "title": "When Do Contrastive Learning Signals Help Spatio-Temporal Graph Forecasting?. (arXiv:2108.11873v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2108.11873",
  "description": "<p>Deep learning models are modern tools for spatio-temporal graph (STG)\nforecasting. Though successful, we argue that data scarcity is a key factor\nlimiting their recent improvements. Meanwhile, contrastive learning has been an\neffective method for providing self-supervision signals and addressing data\nscarcity in various domains. In view of this, one may ask: can we leverage the\nadditional signals from contrastive learning to alleviate data scarcity, so as\nto benefit STG forecasting? To answer this question, we present the first\nsystematic exploration on incorporating contrastive learning into STG\nforecasting. Specifically, we first elaborate two potential schemes for\nintegrating contrastive learning. We then propose two feasible and efficient\ndesigns of contrastive tasks that are performed on the node or graph level. The\nempirical study on STG benchmarks demonstrates that integrating graph-level\ncontrast with the joint learning scheme achieves the best performance. In\naddition, we introduce four augmentations for STG data, which perturb the data\nin terms of graph structure, time domain, and frequency domain. Experimental\nresults reveal that the model is not sensitive to the proposed augmentations'\nsemantics. Lastly, we extend the classic contrastive loss via a rule-based\nstrategy that filters out the most semantically similar negatives, yielding\nperformance gains. We also provide explanations and insights based on the above\nexperimental findings. Code is available at https://github.com/liuxu77/STGCL.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Liu_X/0/1/0/all/0/1\">Xu Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liang_Y/0/1/0/all/0/1\">Yuxuan Liang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Huang_C/0/1/0/all/0/1\">Chao Huang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zheng_Y/0/1/0/all/0/1\">Yu Zheng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hooi_B/0/1/0/all/0/1\">Bryan Hooi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zimmermann_R/0/1/0/all/0/1\">Roger Zimmermann</a>"
}