{
  "title": "Twitter’s Head of Safety says election integrity is ‘top priority’ in spite of layoffs",
  "description": "<p>Twitter’s top safety executive says election integrity is a <a href=\"https://twitter.com/yoyoel/status/1588657232279130112\">“top priority”</a> for the company even as the company has shed half of its staff in the last 24 hours. Yoel Roth, Twitter’s head of safety and one of the company leaders to survive mass layoffs, took to Twitter to downplay moderation concerns raised by activists and advertisers in recent days.</p><p>“Yesterday’s reduction in force affected approximately 15% of our Trust & Safety organization (as opposed to approximately 50% cuts company-wide), with our front-line moderation staff experiencing the least impact,” Roth tweeted. “With early voting underway in the US, our efforts on election integrity — including harmful misinformation that can suppress the vote and combatting state-backed information operations  — remain a top priority.”</p><span id=\"end-legacy-contents\"></span><p>Roth’s comments come hours after the NAACP joined a coalition of activists and civil rights organizations to call for advertisers <a href=\"https://www.engadget.com/twitter-losing-advertisers-boycott-193748977.html\"><ins>to suspend</ins></a> spending with Twitter. While Musk met with civil rights leaders earlier this week, those calling for a boycott said the company’s deep staff cuts undermined his promise to maintain Twitter’s election protection policies and its hate speech rules.</p><div id=\"17e2380c788b4f8ba487adc91f37d6cd\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">More than 80% of our incoming content moderation volume was completely unaffected by this access change. The daily volume of moderation actions we take stayed steady through this period. <a href=\"https://t.co/rSGKtq0e3J\">pic.twitter.com/rSGKtq0e3J</a></p>— Yoel Roth (@yoyoel) <a href=\"https://twitter.com/yoyoel/status/1588657230836305920?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote></div><p>Roth, who is so far the only Twitter executive besides Musk to publicly weigh in on the company’s policies following Musk’s takeover, also tried to address reports about the impact staff cuts would have on safety.</p><p>“Last week, for security reasons, we restricted access to our internal tools for some users, including some members of my team,” he said. “Most of the 2,000+ content moderators working on front-line review were not impacted, and access will be fully restored in the coming days.” But while much of Roth’s Trust and Safety team may have been spared, numerous other teams whose work touches on safety issues were not.</p><p>As <em>NBC News </em><a href=\"https://www.nbcnews.com/tech/misinformation/twitter-fires-employees-fight-misinformation-midterm-elections-rcna55750?cid=eml_nbn_20221104&user_email=93b63e285a2e0c05b9991884f74433088a425f0a78cda0ff335bf80c5f5aa9fc&utm_campaign=breakingnews&%243p=e_sailthru&_branch_match_id=1029396346863890897&utm_medium=Email%20Sailthru&_branch_referrer=H4sIAAAAAAAAA1WP3YqEMAyFn8a9Uzv9GevAsCws8xoSa6ph2lraiuzbb73Yi4VAki8nh2QrJeZH34fZBDxzBzF2jsK7F%2FGz4VLEJ04ZyJUtHR8V7IlWCuCmI7nndi034qvhrxrneXZ%2FNmb3lRQ0W02eMgW7Jw%2BF9nDxk0rB1FpKmFv00e0%2FWCtL61ba%2F%2FLaLlXrW3RoLpDbZAIoNSjWiJehpRHf6N0U5jBxxvntxmTD70fGNKGvp9f5KOa7QK4VcGSGqXkcx5vW0g5SCsG0BsmVZTBoswCzVgg1W82MsgpgtObyK34y4CPQGqrjnBDeFNbr21%2FFtaGTRAEAAA%3D%3D\"><ins>reported</ins></a>, Twitter’s curation team, which worked to counter misinformation on the platform, was axed entirely. Many engineering roles that deal with safety issues were also cut, as were numerous workers <a href=\"https://www.theverge.com/2022/11/4/23439790/elon-musk-twitter-layoffs-trust-and-safety-teams-severance\"><ins>in policy</ins></a> and communications.</p><div id=\"e2fefc6f06f4407eae4b5aa416de2c72\"><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Again, to be crystal clear, Twitter’s strong commitment to content moderation remains absolutely unchanged.<br><br>In fact, we have actually seen hateful speech at times this week decline *below* our prior norms, contrary to what you may read in the press.</p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1588666105023041536?ref_src=twsrc%5Etfw\">November 4, 2022</a></blockquote></div><p>On Friday, Musk said that the layoffs were necessary. “Regarding Twitter’s reduction in force, unfortunately there is no choice when the company is losing over $4M/day,” he tweeted, adding that employees were offered three months of severance. “Again, to be crystal clear, Twitter’s strong commitment to content moderation remains absolutely unchanged.”</p>",
  "link": "https://www.engadget.com/twitters-head-of-safety-says-election-integrity-is-top-priority-233145711.html?src=rss",
  "source_id": "engadget_479",
  "guid": "795d3581-610b-4639-a2a4-864ea3f4cbe7",
  "dc:creator": "Karissa Bell",
  "source": "Engadget",
  "dc:publisher": "Engadget",
  "dc:rightsHolder": "Engadget",
  "pubDate": "Fri, 04 Nov 2022 23:31:45 +0000",
  "ingested": 1667604705,
  "modified": "2022-11-04T23:31:48+00:00",
  "category": [
    "Politics & Government",
    "site|engadget",
    "provider_name|Engadget",
    "region|US",
    "language|en-US",
    "author_name|Karissa Bell"
  ],
  "media:content": [
    {
      "media:keywords": "headline",
      "media:media_html": "",
      "dc:identifier": 1,
      "media:credit": "",
      "media:description": "",
      "media:title": ""
    },
    {
      "media:media_html": "",
      "dc:identifier": 2,
      "media:credit": "VIEW press via Getty Images",
      "media:description": "NEW YORK, NEW YORK - OCTOBER 28: The logo of Twitter is displayed at the company Headquarters on October 28, 2022 in New York City. A day after Elon Musk completed Twitter takeover the U.S. Securities and Exchange Commission notified its intention of delisted the company from the New York Stock Exchange according to a new filing with the U.S. Securities and Exchange Commission. (Photo by Leonardo Munoz/VIEWpress)",
      "media:title": "Twitter Will Be Delisted From The New York Stock Exchange"
    }
  ]
}