{
  "title": "Episode 42: &#8220;Ooby Dooby&#8221; by Roy Orbison and the Teen Kings",
  "link": "https://500songs.com/podcast/episode-42-ooby-dooby-by-roy-orbison-and-the-teen-kings/",
  "pubDate": "Mon, 22 Jul 2019 04:26:07 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-42-ooby-dooby-by-roy-orbison-and-the-teen-kings/",
  "description": "Episode forty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Ooby Dooby\" by Roy Orbison and the Teen Kings, and the time when Sam Phillips got things badly wrong.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28554878\">on \"Blue Yodel #9\" by Jimmie Rodgers</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-42-ooby-dooby/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are several books available on Orbison. The one I have used for much of this is <a href=\"https://amzn.to/2JTpdt6\"><em>The Authorised Roy Orbison</em></a> written by Jeff Slate and three of Orbison's children.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2XYeRBR\">This compilation</a> features every track Orbison released up til 1962.\n\nHis early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Orbison's work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're once again going to look at a star who was discovered by Sun Records. But for once, the star we're looking at did not do his most interesting or vital work at Sun, and nor did he do the work that defined his persona there.\n\nIndeed, today we're going to talk about one of the very few times that Sam Phillips and Sun Records took on someone who would become a massive, massive, star, and completely mismanaged him, misjudged his abilities totally, and did everything completely wrong, to the point where he almost destroyed his career before it began.\n\nRoy Orbison was someone who made an unlikely rock and roll star. A quiet, unassuming, man, who rarely used an oath stronger than \"Mercy\", and wore dark glasses in later years to hide as much of his face as possible, he was the last person one would expect to be making music that was regarded as rebellious or exciting. And indeed, in his later years, the music he chose to make was very far from rebellious, though always rooted in rock and roll.\n\nOrbison had grown up knowing he was going to be a singer. When he was six years old, his father had bought him a guitar and taught him the chords to \"You Are My Sunshine\", and by the age of ten he was already winning talent contests. But it was seeing the famous country singer Lefty Frizzell live that really convinced him.\n\n[Excerpt: Lefty Frizzell, \"If You've Got the Money, I've Got the Time\"]\n\nIt wasn't so much that Frizzell was a great performer -- though he was pretty good, and he hugely influenced Orbison's vocal style. What really impressed young Roy Orbison, though, was seeing Frizzell, after the show, getting into a Cadillac. Orbison realised you could make real money just from singing, and started to make plans.\n\nIn his teens, he and a group of his friends formed a country and western band, the Wink Westerners (named after the small town they lived in). That band had various lineups, but it eventually settled into a two-guitar, bass, drums, and electric mandolin lineup of Orbison, Billy Pat Ellis, Jack Kenneally, Johnny Wilson, and James Morrow.\n\nWhile Orbison was still in school, the band got their own radio show, one day a week, and became big enough that when the country star Slim Whitman came to town they were chosen as his backing group:\n\n[Excerpt: Slim Whitman, \"Indian Love Call\"]\n\nThe band were primarily a country band, but like most bands of the time they would play whatever music the customers wanted to hear. In later years, Orbison would be able to pinpoint the exact moment he became a rock and roller -- on New Year's Eve 1954. The band started playing \"Shake, Rattle, and Roll\", expecting it to finish dead on the stroke of midnight, but then Orbison looked at the clock and realised they'd started far too soon. That version of \"Shake, Rattle, and Roll\", which lasted for eight minutes, converted Roy Orbison. When he started playing it, rock and roll was just another form of music, but by the end he knew he wanted to play that kind of music forever. The Wink Westerners were quickly renamed the Teen Kings.\n\nOrbison went off to university, where he heard a song called \"Ooby Dooby\" which was written by two classmates of his, Dick Penner and Wade Moore. They allegedly wrote it in a fifteen minute period, while on the roof of their frat house, and to be honest it sounds like fifteen minutes is about as long as it would take to write. It soon entered the set of the newly-named Teen Kings and became one of their most successful songs.\n\nThe Teen Kings soon got their own local TV series, to go with the local radio shows they already had. When the new country star Johnny Cash passed through town, he appeared on the Teen Kings' TV show, and Orbison asked him how to get signed to Sun Records. Cash gave Orbison the phone number for Sam Phillips, and told him to tell Phillips that Cash had sent him. He also advised Orbison that if he wanted to have any success as a musician, he should probably start singing in a lower register, and maybe change his name. Orbison never took that advice, and in later years he would joke with Cash about how terrible his advice was.\n\nHis advice about getting signed to Sun wasn't much better either -- Orbison did indeed phone Sam Phillips and tell him Johnny Cash had said to call Phillips. Phillips responded by saying \"Tell Johnny Cash he doesn't run Sun Records, I do\" and slamming the phone down. So Sun Records seemed like a dead end. The Teen Kings were going to have to look elsewhere for a record contract.\n\nSo instead the Teen Kings went into the studio to audition for Columbia Records. They recorded two tracks at that initial session. One was \"Ooby Dooby\"; the other was a cover version of a song by the Clovers, \"Hey, Miss Fannie\":\n\n[Excerpt: The Clovers, \"Hey, Miss Fannie\"]\n\nAt the time, the Teen Kings thought that they'd almost certainly get a contract with Columbia, but Columbia ended up turning them down. They did, however, like \"Ooby Dooby\", enough to give it to another group, Sid King and the Five Strings, who released it unsuccessfully as a single.\n\n[Excerpt: Sid King and the Five Strings, \"Ooby Dooby\"]\n\nAs they had been turned down now by both the major label Columbia and the large indie Sun, Roy and the band went into the studio with Norman Petty, a local Texas record producer, to record \"Ooby Dooby\" again, to be released as a single on the tiny indie label Je-Wel. It came out at almost exactly the same time as Sid King's version.\n\n[Excerpt: The Teen Kings, \"Ooby Dooby\", Je-Wel version]\n\nBut then Sam Phillips had a change of heart. Roy still wanted to be on Sun, and pestered a local record shop owner who knew Phillips to play \"Ooby Dooby\" for him. Phillips eventually listened to the single and liked it, but thought that he could do a better job of it. He discovered that Orbison wasn't yet twenty-one, and so the contract he'd signed with Je-Wel was void. Phillips signed Orbison, got an injunction taken out against Je-Wel, preventing them from putting out any more copies of the single -- only a few hundred ever got released -- and quickly went into the studio to record a new version of the song.\n\nAnd this sort of sums up the difference between Orbison's relationship with Sam Phillips and everyone else's. Every other successful musician who recorded for Sun Records recorded for them first, and owed their careers to Phillips. He'd given them the shot that no-one else would, and he'd moulded them into the artists that they would become. Even the ones who later fell out with Phillips always credited him with being the reason they'd had any success in the business.\n\nRoy Orbison, on the other hand, had been discovered before Phillips. Phillips had turned him down, and he'd made a record somewhere else. That record was even with a producer who, in a little while, would be putting out rockabilly hits every bit as big as Phillips was. That meant that Roy Orbison would never feel, as Elvis or Johnny Cash or Carl Perkins did, that he owed his career to Sam Phillips.\n\nThe rerecorded version was, as far as Orbison's performance goes, almost identical to the original. Orbison was not a wild improviser like many of the artists with whom Phillips worked -- he would work out his parts exactly, and stick to them. While Phillips would always claim in later life that his version of \"Ooby Dooby\" was vastly superior to the earlier one, most listeners would struggle to tell the difference:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"Ooby Dooby\", Sun version]\n\nRather oddly, given Orbison's later career, it wasn't primarily his singing that impressed Phillips, but rather his guitar playing. Phillips would talk for the rest of his life about what a great guitarist Orbison was. Phillips would often get Orbison to play on records by other artists, and would later say that the only musician he knew who had a better sense of rhythm was Jerry Lee Lewis.\n\nAnd Orbison *was* a great guitarist. He was similar to Chuck Berry in that he would play both rhythm and lead simultaneously -- if you listen to the records he made where his guitar playing is prominent, you can hear him using the bass strings to keep a riff down, and then playing fills between his vocal lines.\n\nBut still, it would be several years before anyone in the record industry seemed to notice that Roy Orbison was, well, Roy Orbison.\n\nThe B-side was recorded in a single take, and itself became a rockabilly classic. It was co-written by Orbison and the band's drummer, Billy Pat Ellis, but it caused problems:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"Go Go Go\"]\n\nThat would later be recorded by Jerry Lee Lewis, among others, and would be one of the few rockabilly songs that Orbison would keep in his setlists in future years.\n\nWhile Ellis had cowritten the song, he wasn't credited on the label, which understandably caused him to get angry -- it seemed like Roy was cheating him out of his royalties. And while the record had been made by Roy Orbison and the Teen Kings as a group, it seemed that all anyone was talking about was Roy Orbison, not the Teen Kings.\n\nThe group went out on tour, on a package with other Sun artists, and \"Ooby Dooby\" went to number fifty-nine in the pop charts and sold around two hundred thousand copies. This wasn't an amazing, ground-breaking level of success like some other Sun artists had had, but it was perfectly respectable, and was enough to see them go into the studio to record a follow-up, \"Rockhouse\".\n\n[Excerpt: Roy Orbison, \"Rockhouse\"]\n\nThat song was originally written by a young singer called Harold Jenkins, who was making recordings for Sun at the time, though the recordings didn't get released until after Jenkins became a country star under the name Conway Twitty. Orbison took Jenkins' demo and substantially reworked it, earning himself a co-writing credit.\n\nThe B-side was a song that Johnny Cash had written, called \"Little Woolly Booger\":\n\n[Excerpt: Johnny Cash, \"Little Woolly Booger\"]\n\nThat was renamed to the rather more radio-friendly \"You're My Baby\" for Orbison's version:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"You're My Baby\"]\n\n\"Rockhouse\" didn't do very well, and the band were getting disgruntled. They felt that Sam Phillips didn't care about any of them, and they were also getting a bit sick of Roy himself, who they thought was taking too much of the spotlight. So they secretly made an agreement. At the start of a scheduled recording session, Orbison and Phillips went to the cafe next door to take a break. When they got back, they found that the Teen Kings had packed up all their gear and driven away. Roy no longer had a band.\n\nHe was absolutely devastated -- the people he'd come up with as a teenager, the people he'd thought were his friends, had all deserted him. He'd been playing with these people for years, and now, just as they were starting to achieve some success, they'd decided to leave him. The session was cancelled, and Sam Phillips was so worried about Orbison that he invited the young man to stay in his house for what turned into a several-month-long stay. Phillips, who had himself suffered from severe depression, was worried about the young singer, and tried to give him life advice.\n\nThe advice that Phillips was giving Orbison had a profound effect on both Orbison and on Phillips' son Knox, who later said\n\n“It was the first time I actually could see Sam giving someone he really cared about like Roy some hard advice — I mean, I was real young, but I thought, ‘You know what? It’s a different way he’s saying it but it’s the same advice he’s been giving me. It’s the same thing.’ That was the first time I actually knew that Sam was just trying to make people better. I mean, he wasn’t in the studio trying to inspire or record them. He could say the same thing that would teach you the same lesson if you were talking to him about charcoal or motorcycles. It was the same lesson.\"\n\nFor much of the next year, Orbison was essentially homeless. He spent most of his time on tour, but considered Memphis his home base, and stayed with either Sam Phillips, Johnny Cash, or Carl Perkins when he was \"at home\".\n\nBut he was starting to get bigger plans. He had already co-written a handful of songs, but he hadn't put serious thought into his songwriting. That changed when he went on a tour with Eddie Cochran and Gene Vincent. He realised that they -- and the other people on the bill -- had one hit each. Cochran would later have more, but still, Orbison wondered where those people's other hits were going to come from. Where were they going to find their material?\n\nHe didn't want to get into a position where he had to just keep playing the same hit every day for the rest of his life, and realised that the only way to ensure he would have a ready supply of new material was to write it himself, and so he started to take his songwriting seriously as his principal art. Given that the hits on Sun had dried up, in fact, he basically became a songwriter who happened to sing, rather than a singer who wrote some of his own songs.\n\nWhile he continued making recordings for Sun, none of them did anything, and he later referred to some of them as among the worst records ever made. As Orbison was becoming less successful, Phillips increasingly palmed him off on his new assistant, Jack Clement, and Clement insisted on Orbison performing material for which he had no feeling. Orbison was starting to push to record ballads, but Clement knew that Roy Orbison just didn't have the voice for them.\n\nBut his songwriting was another matter. Sun artists started recording his stuff. Jerry Lee Lewis put out \"Go Go Go\" as the B-side to his big hit \"Breathless\", and the minor Sun artist Warren Smith recorded Roy's \"So Long, I'm Gone\":\n\n[Excerpt: Warren Smith, \"So Long, I'm Gone\"]That reached the lower reaches of the Hot 100, and so became the first thing that earned Roy some serious money since \"Ooby Dooby\" a year earlier. Songwriting was clearly the way forward, and he decided to write a song about his new wife, Claudette, which he pitched to the Everly Brothers when they were on a bill together, and which they decided to record.\n\n[Excerpt: The Everly Brothers, \"Claudette\"]\n\nWe'll be talking about the Everly Brothers in future episodes, but the important thing to note right now is that they were a much bigger act than Roy Orbison was. Them performing one of Orbison's songs would be a massive break for him, but there was a catch. They had a deal with the publishing company Acuff-Rose that they would only perform songs that were published by that company, and Orbison had a contract with Sam Phillips that meant that Orbison's songs were all published by Phillips.\n\nOrbison went to Phillips and explained the situation. He didn't want to record for Sun any more anyway -- they weren't releasing most of what he was recording, he wasn't having any hits, and they didn't have the same ideas about what material he should be recording as he did. He wanted to assign the song to Acuff-Rose and give himself a chance at doing better than he had been.\n\nPhillips was not happy about this. This was at almost exactly the same time that both Johnny Cash and Carl Perkins left Sun Records, and he suspected a degree of collusion between the three men -- and he wasn't wrong in his suspicion. The three of them all thought that Phillips was not paying them enough royalties, was not telling them important business information, and was more interested in the latest new thing than in building the careers of people he'd already signed.\n\nSam Phillips eventually made a suggestion which Orbison took up, though he later said that he didn't realise what the consequences would be. The deal he made was that Orbison could quit his contract, and sign with Acuff-Rose, but only by signing all the songwriting royalties for the songs he'd already recorded over to Phillips.\n\nSo Sam Phillips is now the credited songwriter for all the songs Orbison wrote and recorded during his time at Sun, and unsurprisingly Orbison resented this for the rest of his life. Most Sun artists came to believe that they had been treated badly in business dealings by Phillips, and that he hadn't properly recognised their talent. Roy Orbison, more than any of the others, actually had a case to answer here.\n\nSam Phillips never understood what he had in Roy Orbison until much later. With every other artist he had, he took someone raw and unsure of his own direction and moulded him into what Sam saw in him. With Orbison, he took an artist who was already a moderate success, and who had firm ideas, and kept him from doing the material that was good for him. He later said “I really have to take the blame for not bringing Roy to fruition.\"\n\nAs soon as the Everlys' version of \"Claudette\" came out, Orbison saw an immediate upswing in his fortunes. Two weeks after it came out, he called Wesley Rose at Acuff Rose.\n\n\"How's the record doing?\"\n\n\"Oh, it sold half a million already.\"\n\n\"Have I made any money?\"\n\n\"Why, yes you have\".\n\nRoy bought a Cadillac, moved to Nashville, and quickly signed with RCA Records, who saw in him the potential to be the next Elvis. And it seemed he was following the same career path exactly, as his first recordings for RCA were with largely the same group of musicians who played on Elvis' big hits. There was no Scotty, Bill, or DJ, as they were all exclusive to Elvis, but Chet Atkins was on guitar, Floyd Cramer was on piano, and the Jordanaires were on backing vocals. But even though Roy had largely been signed on the basis of his songwriting ability, the songs they chose to record for him were once again not written by him and not his choice of material. This time they were all picked by Wesley Rose:\n\n[Excerpt: Roy Orbison, \"Seems to Me\"]\n\nHe was now being allowed to sing ballads, but they weren't the ballads that he wanted to be singing -- they were the kind of song that anyone in the pop-country market could be singing. And still the producers didn't know how to deal with his voice. His RCA singles did even worse than his records on Sun, despite having the push of a major label behind him. Eventually the money from \"Claudette\" ran out, and he was dropped by RCA.\n\nChet Atkins, like Sam Phillips, just didn't get Roy Orbison. He would later say “We did some pretty good records, but they were typical Nashville at that time, and we didn’t reach out and try to do something different. I blame myself for that. I should have seen the greatness in him and the quality of his voice.”\n\nOrbison sold his Cadillac, and moved out of Nashville, and back to West Texas. It looked like his career was over, and he would spend his life exactly as he'd hoped he wouldn't, as a musician who'd had one minor hit and never did anything else.\n\nBut then he met a couple of people who would change the course of his life forever. But that's a story for a future episode.",
  "itunes:subtitle": "Episode forty-two of A History of Rock Music in Five Hundred Songs looks at Ooby Dooby by Roy Orbison and the Teen Kings, and the time when Sam Phillips got things badly wrong.. Click the full post to read liner notes, links to more information, and a tr",
  "itunes:keywords": "Acuff-Rose publishing,Chet Atkins,country and western,Floyd Cramer,Jack Clement,Johnny Cash,Norman Petty,RCA Records,rockabilly,Roy Orbison,Sam Phillips,Sun Records,The Everly Brothers,The Jordanaires,Wesley Rose",
  "itunes:episodeType": "full",
  "itunes:episode": 42,
  "content:encoded": "Episode forty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Ooby Dooby\" by Roy Orbison and the Teen Kings, and the time when Sam Phillips got things badly wrong.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28554878\">on \"Blue Yodel #9\" by Jimmie Rodgers</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-42-ooby-dooby/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThere are several books available on Orbison. The one I have used for much of this is <a href=\"https://amzn.to/2JTpdt6\"><em>The Authorised Roy Orbison</em></a> written by Jeff Slate and three of Orbison's children.\n\nI'm relying heavily on <a href=\"https://amzn.to/2VDGeeo\"><em>Sam Phillips: the Man Who Invented Rock and Roll</em></a> by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\n<a href=\"https://amzn.to/2XYeRBR\">This compilation</a> features every track Orbison released up til 1962.\n\nHis early Sun singles are also on <a href=\"https://amzn.to/2I6Tx5A\">this ten-disc set,</a> which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Orbison's work, in a way hearing it in isolation wouldn't.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're once again going to look at a star who was discovered by Sun Records. But for once, the star we're looking at did not do his most interesting or vital work at Sun, and nor did he do the work that defined his persona there.\n\nIndeed, today we're going to talk about one of the very few times that Sam Phillips and Sun Records took on someone who would become a massive, massive, star, and completely mismanaged him, misjudged his abilities totally, and did everything completely wrong, to the point where he almost destroyed his career before it began.\n\nRoy Orbison was someone who made an unlikely rock and roll star. A quiet, unassuming, man, who rarely used an oath stronger than \"Mercy\", and wore dark glasses in later years to hide as much of his face as possible, he was the last person one would expect to be making music that was regarded as rebellious or exciting. And indeed, in his later years, the music he chose to make was very far from rebellious, though always rooted in rock and roll.\n\nOrbison had grown up knowing he was going to be a singer. When he was six years old, his father had bought him a guitar and taught him the chords to \"You Are My Sunshine\", and by the age of ten he was already winning talent contests. But it was seeing the famous country singer Lefty Frizzell live that really convinced him.\n\n[Excerpt: Lefty Frizzell, \"If You've Got the Money, I've Got the Time\"]\n\nIt wasn't so much that Frizzell was a great performer -- though he was pretty good, and he hugely influenced Orbison's vocal style. What really impressed young Roy Orbison, though, was seeing Frizzell, after the show, getting into a Cadillac. Orbison realised you could make real money just from singing, and started to make plans.\n\nIn his teens, he and a group of his friends formed a country and western band, the Wink Westerners (named after the small town they lived in). That band had various lineups, but it eventually settled into a two-guitar, bass, drums, and electric mandolin lineup of Orbison, Billy Pat Ellis, Jack Kenneally, Johnny Wilson, and James Morrow.\n\nWhile Orbison was still in school, the band got their own radio show, one day a week, and became big enough that when the country star Slim Whitman came to town they were chosen as his backing group:\n\n[Excerpt: Slim Whitman, \"Indian Love Call\"]\n\nThe band were primarily a country band, but like most bands of the time they would play whatever music the customers wanted to hear. In later years, Orbison would be able to pinpoint the exact moment he became a rock and roller -- on New Year's Eve 1954. The band started playing \"Shake, Rattle, and Roll\", expecting it to finish dead on the stroke of midnight, but then Orbison looked at the clock and realised they'd started far too soon. That version of \"Shake, Rattle, and Roll\", which lasted for eight minutes, converted Roy Orbison. When he started playing it, rock and roll was just another form of music, but by the end he knew he wanted to play that kind of music forever. The Wink Westerners were quickly renamed the Teen Kings.\n\nOrbison went off to university, where he heard a song called \"Ooby Dooby\" which was written by two classmates of his, Dick Penner and Wade Moore. They allegedly wrote it in a fifteen minute period, while on the roof of their frat house, and to be honest it sounds like fifteen minutes is about as long as it would take to write. It soon entered the set of the newly-named Teen Kings and became one of their most successful songs.\n\nThe Teen Kings soon got their own local TV series, to go with the local radio shows they already had. When the new country star Johnny Cash passed through town, he appeared on the Teen Kings' TV show, and Orbison asked him how to get signed to Sun Records. Cash gave Orbison the phone number for Sam Phillips, and told him to tell Phillips that Cash had sent him. He also advised Orbison that if he wanted to have any success as a musician, he should probably start singing in a lower register, and maybe change his name. Orbison never took that advice, and in later years he would joke with Cash about how terrible his advice was.\n\nHis advice about getting signed to Sun wasn't much better either -- Orbison did indeed phone Sam Phillips and tell him Johnny Cash had said to call Phillips. Phillips responded by saying \"Tell Johnny Cash he doesn't run Sun Records, I do\" and slamming the phone down. So Sun Records seemed like a dead end. The Teen Kings were going to have to look elsewhere for a record contract.\n\nSo instead the Teen Kings went into the studio to audition for Columbia Records. They recorded two tracks at that initial session. One was \"Ooby Dooby\"; the other was a cover version of a song by the Clovers, \"Hey, Miss Fannie\":\n\n[Excerpt: The Clovers, \"Hey, Miss Fannie\"]\n\nAt the time, the Teen Kings thought that they'd almost certainly get a contract with Columbia, but Columbia ended up turning them down. They did, however, like \"Ooby Dooby\", enough to give it to another group, Sid King and the Five Strings, who released it unsuccessfully as a single.\n\n[Excerpt: Sid King and the Five Strings, \"Ooby Dooby\"]\n\nAs they had been turned down now by both the major label Columbia and the large indie Sun, Roy and the band went into the studio with Norman Petty, a local Texas record producer, to record \"Ooby Dooby\" again, to be released as a single on the tiny indie label Je-Wel. It came out at almost exactly the same time as Sid King's version.\n\n[Excerpt: The Teen Kings, \"Ooby Dooby\", Je-Wel version]\n\nBut then Sam Phillips had a change of heart. Roy still wanted to be on Sun, and pestered a local record shop owner who knew Phillips to play \"Ooby Dooby\" for him. Phillips eventually listened to the single and liked it, but thought that he could do a better job of it. He discovered that Orbison wasn't yet twenty-one, and so the contract he'd signed with Je-Wel was void. Phillips signed Orbison, got an injunction taken out against Je-Wel, preventing them from putting out any more copies of the single -- only a few hundred ever got released -- and quickly went into the studio to record a new version of the song.\n\nAnd this sort of sums up the difference between Orbison's relationship with Sam Phillips and everyone else's. Every other successful musician who recorded for Sun Records recorded for them first, and owed their careers to Phillips. He'd given them the shot that no-one else would, and he'd moulded them into the artists that they would become. Even the ones who later fell out with Phillips always credited him with being the reason they'd had any success in the business.\n\nRoy Orbison, on the other hand, had been discovered before Phillips. Phillips had turned him down, and he'd made a record somewhere else. That record was even with a producer who, in a little while, would be putting out rockabilly hits every bit as big as Phillips was. That meant that Roy Orbison would never feel, as Elvis or Johnny Cash or Carl Perkins did, that he owed his career to Sam Phillips.\n\nThe rerecorded version was, as far as Orbison's performance goes, almost identical to the original. Orbison was not a wild improviser like many of the artists with whom Phillips worked -- he would work out his parts exactly, and stick to them. While Phillips would always claim in later life that his version of \"Ooby Dooby\" was vastly superior to the earlier one, most listeners would struggle to tell the difference:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"Ooby Dooby\", Sun version]\n\nRather oddly, given Orbison's later career, it wasn't primarily his singing that impressed Phillips, but rather his guitar playing. Phillips would talk for the rest of his life about what a great guitarist Orbison was. Phillips would often get Orbison to play on records by other artists, and would later say that the only musician he knew who had a better sense of rhythm was Jerry Lee Lewis.\n\nAnd Orbison *was* a great guitarist. He was similar to Chuck Berry in that he would play both rhythm and lead simultaneously -- if you listen to the records he made where his guitar playing is prominent, you can hear him using the bass strings to keep a riff down, and then playing fills between his vocal lines.\n\nBut still, it would be several years before anyone in the record industry seemed to notice that Roy Orbison was, well, Roy Orbison.\n\nThe B-side was recorded in a single take, and itself became a rockabilly classic. It was co-written by Orbison and the band's drummer, Billy Pat Ellis, but it caused problems:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"Go Go Go\"]\n\nThat would later be recorded by Jerry Lee Lewis, among others, and would be one of the few rockabilly songs that Orbison would keep in his setlists in future years.\n\nWhile Ellis had cowritten the song, he wasn't credited on the label, which understandably caused him to get angry -- it seemed like Roy was cheating him out of his royalties. And while the record had been made by Roy Orbison and the Teen Kings as a group, it seemed that all anyone was talking about was Roy Orbison, not the Teen Kings.\n\nThe group went out on tour, on a package with other Sun artists, and \"Ooby Dooby\" went to number fifty-nine in the pop charts and sold around two hundred thousand copies. This wasn't an amazing, ground-breaking level of success like some other Sun artists had had, but it was perfectly respectable, and was enough to see them go into the studio to record a follow-up, \"Rockhouse\".\n\n[Excerpt: Roy Orbison, \"Rockhouse\"]\n\nThat song was originally written by a young singer called Harold Jenkins, who was making recordings for Sun at the time, though the recordings didn't get released until after Jenkins became a country star under the name Conway Twitty. Orbison took Jenkins' demo and substantially reworked it, earning himself a co-writing credit.\n\nThe B-side was a song that Johnny Cash had written, called \"Little Woolly Booger\":\n\n[Excerpt: Johnny Cash, \"Little Woolly Booger\"]\n\nThat was renamed to the rather more radio-friendly \"You're My Baby\" for Orbison's version:\n\n[Excerpt: Roy Orbison and the Teen Kings, \"You're My Baby\"]\n\n\"Rockhouse\" didn't do very well, and the band were getting disgruntled. They felt that Sam Phillips didn't care about any of them, and they were also getting a bit sick of Roy himself, who they thought was taking too much of the spotlight. So they secretly made an agreement. At the start of a scheduled recording session, Orbison and Phillips went to the cafe next door to take a break. When they got back, they found that the Teen Kings had packed up all their gear and driven away. Roy no longer had a band.\n\nHe was absolutely devastated -- the people he'd come up with as a teenager, the people he'd thought were his friends, had all deserted him. He'd been playing with these people for years, and now, just as they were starting to achieve some success, they'd decided to leave him. The session was cancelled, and Sam Phillips was so worried about Orbison that he invited the young man to stay in his house for what turned into a several-month-long stay. Phillips, who had himself suffered from severe depression, was worried about the young singer, and tried to give him life advice.\n\nThe advice that Phillips was giving Orbison had a profound effect on both Orbison and on Phillips' son Knox, who later said\n\n“It was the first time I actually could see Sam giving someone he really cared about like Roy some hard advice — I mean, I was real young, but I thought, ‘You know what? It’s a different way he’s saying it but it’s the same advice he’s been giving me. It’s the same thing.’ That was the first time I actually knew that Sam was just trying to make people better. I mean, he wasn’t in the studio trying to inspire or record them. He could say the same thing that would teach you the same lesson if you were talking to him about charcoal or motorcycles. It was the same lesson.\"\n\nFor much of the next year, Orbison was essentially homeless. He spent most of his time on tour, but considered Memphis his home base, and stayed with either Sam Phillips, Johnny Cash, or Carl Perkins when he was \"at home\".\n\nBut he was starting to get bigger plans. He had already co-written a handful of songs, but he hadn't put serious thought into his songwriting. That changed when he went on a tour with Eddie Cochran and Gene Vincent. He realised that they -- and the other people on the bill -- had one hit each. Cochran would later have more, but still, Orbison wondered where those people's other hits were going to come from. Where were they going to find their material?\n\nHe didn't want to get into a position where he had to just keep playing the same hit every day for the rest of his life, and realised that the only way to ensure he would have a ready supply of new material was to write it himself, and so he started to take his songwriting seriously as his principal art. Given that the hits on Sun had dried up, in fact, he basically became a songwriter who happened to sing, rather than a singer who wrote some of his own songs.\n\nWhile he continued making recordings for Sun, none of them did anything, and he later referred to some of them as among the worst records ever made. As Orbison was becoming less successful, Phillips increasingly palmed him off on his new assistant, Jack Clement, and Clement insisted on Orbison performing material for which he had no feeling. Orbison was starting to push to record ballads, but Clement knew that Roy Orbison just didn't have the voice for them.\n\nBut his songwriting was another matter. Sun artists started recording his stuff. Jerry Lee Lewis put out \"Go Go Go\" as the B-side to his big hit \"Breathless\", and the minor Sun artist Warren Smith recorded Roy's \"So Long, I'm Gone\":\n\n[Excerpt: Warren Smith, \"So Long, I'm Gone\"]That reached the lower reaches of the Hot 100, and so became the first thing that earned Roy some serious money since \"Ooby Dooby\" a year earlier. Songwriting was clearly the way forward, and he decided to write a song about his new wife, Claudette, which he pitched to the Everly Brothers when they were on a bill together, and which they decided to record.\n\n[Excerpt: The Everly Brothers, \"Claudette\"]\n\nWe'll be talking about the Everly Brothers in future episodes, but the important thing to note right now is that they were a much bigger act than Roy Orbison was. Them performing one of Orbison's songs would be a massive break for him, but there was a catch. They had a deal with the publishing company Acuff-Rose that they would only perform songs that were published by that company, and Orbison had a contract with Sam Phillips that meant that Orbison's songs were all published by Phillips.\n\nOrbison went to Phillips and explained the situation. He didn't want to record for Sun any more anyway -- they weren't releasing most of what he was recording, he wasn't having any hits, and they didn't have the same ideas about what material he should be recording as he did. He wanted to assign the song to Acuff-Rose and give himself a chance at doing better than he had been.\n\nPhillips was not happy about this. This was at almost exactly the same time that both Johnny Cash and Carl Perkins left Sun Records, and he suspected a degree of collusion between the three men -- and he wasn't wrong in his suspicion. The three of them all thought that Phillips was not paying them enough royalties, was not telling them important business information, and was more interested in the latest new thing than in building the careers of people he'd already signed.\n\nSam Phillips eventually made a suggestion which Orbison took up, though he later said that he didn't realise what the consequences would be. The deal he made was that Orbison could quit his contract, and sign with Acuff-Rose, but only by signing all the songwriting royalties for the songs he'd already recorded over to Phillips.\n\nSo Sam Phillips is now the credited songwriter for all the songs Orbison wrote and recorded during his time at Sun, and unsurprisingly Orbison resented this for the rest of his life. Most Sun artists came to believe that they had been treated badly in business dealings by Phillips, and that he hadn't properly recognised their talent. Roy Orbison, more than any of the others, actually had a case to answer here.\n\nSam Phillips never understood what he had in Roy Orbison until much later. With every other artist he had, he took someone raw and unsure of his own direction and moulded him into what Sam saw in him. With Orbison, he took an artist who was already a moderate success, and who had firm ideas, and kept him from doing the material that was good for him. He later said “I really have to take the blame for not bringing Roy to fruition.\"\n\nAs soon as the Everlys' version of \"Claudette\" came out, Orbison saw an immediate upswing in his fortunes. Two weeks after it came out, he called Wesley Rose at Acuff Rose.\n\n\"How's the record doing?\"\n\n\"Oh, it sold half a million already.\"\n\n\"Have I made any money?\"\n\n\"Why, yes you have\".\n\nRoy bought a Cadillac, moved to Nashville, and quickly signed with RCA Records, who saw in him the potential to be the next Elvis. And it seemed he was following the same career path exactly, as his first recordings for RCA were with largely the same group of musicians who played on Elvis' big hits. There was no Scotty, Bill, or DJ, as they were all exclusive to Elvis, but Chet Atkins was on guitar, Floyd Cramer was on piano, and the Jordanaires were on backing vocals. But even though Roy had largely been signed on the basis of his songwriting ability, the songs they chose to record for him were once again not written by him and not his choice of material. This time they were all picked by Wesley Rose:\n\n[Excerpt: Roy Orbison, \"Seems to Me\"]\n\nHe was now being allowed to sing ballads, but they weren't the ballads that he wanted to be singing -- they were the kind of song that anyone in the pop-country market could be singing. And still the producers didn't know how to deal with his voice. His RCA singles did even worse than his records on Sun, despite having the push of a major label behind him. Eventually the money from \"Claudette\" ran out, and he was dropped by RCA.\n\nChet Atkins, like Sam Phillips, just didn't get Roy Orbison. He would later say “We did some pretty good records, but they were typical Nashville at that time, and we didn’t reach out and try to do something different. I blame myself for that. I should have seen the greatness in him and the quality of his voice.”\n\nOrbison sold his Cadillac, and moved out of Nashville, and back to West Texas. It looked like his career was over, and he would spend his life exactly as he'd hoped he wouldn't, as a musician who'd had one minor hit and never did anything else.\n\nBut then he met a couple of people who would change the course of his life forever. But that's a story for a future episode.",
  "enclosure": "",
  "itunes:summary": "Episode forty-two of A History of Rock Music in Five Hundred Songs looks at \"Ooby Dooby\" by Roy Orbison and the Teen Kings, and the time when Sam Phillips got things badly wrong.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Yodel #9\" by Jimmie Rodgers.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are several books available on Orbison. The one I have used for much of this is The Authorised Roy Orbison written by Jeff Slate and three of Orbison's children.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThis compilation features every track Orbison released up til 1962.\n\nHis early Sun singles are also on this ten-disc set, which charts the history of Sun Records, with the A- and B-sides of ninety of the first Sun singles in chronological order for an absurdly low price. This will help give you the full context for Orbison's work, in a way hearing it in isolation wouldn't.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're once again going to look at a star who was discovered by Sun Records. But for once, the star we're looking at did not do his most interesting or vital work at Sun, and nor did he do the work that defined his persona there.\n\nIndeed, today we're going to talk about one of the very few times that Sam Phillips and Sun Records took on someone who would become a massive, massive, star, and completely mismanaged him, misjudged his abilities totally, and did everything completely wrong, to the point where he almost destroyed his career before it began.\n\nRoy Orbison was someone who made an unlikely rock and roll star. A quiet, unassuming, man, who rarely used an oath stronger than \"Mercy\", and wore dark glasses in later years to hide as much of his face as possible, he was the last person one would expect to be making music that was regarded as rebellious or exciting. And indeed, in his later years, the music he chose to make was very far from rebellious, though always rooted in rock and roll.\n\nOrbison had grown up knowing he was going to be a singer. When he was six years old, his father had bought him a guitar and taught him the chords to \"You Are My Sunshine\", and by the age of ten he was already winning talent contests. But it was seeing the famous country singer Lefty Frizzell live that really convinced him.\n\n[Excerpt: Lefty Frizzell, \"If You've Got the Money, I've Got the Time\"]\n\nIt wasn't so much that Frizzell was a great performer -- though he was pretty good, and he hugely influenced Orbison's vocal style. What really impressed young Roy Orbison, though, was seeing Frizzell, after the show, getting into a Cadillac. Orbison realised you could make real money just from singing, and started to make plans.\n\nIn his teens, he and a group of his friends formed a country and western band, the Wink Westerners (named after the small town they lived in). That band had various lineups, but it eventually settled into a two-guitar, bass, drums, and electric mandolin lineup of Orbison, Billy Pat Ellis, Jack Kenneally, Johnny Wilson, and James Morrow.\n\nWhile Orbison was still in school, the band got their own radio show, one day a week, and became big enough that when the country star Slim Whitman came to town they were chosen as his backing group:\n\n[Excerpt: Slim Whitman, \"Indian Love Call\"]\n\nThe band were primarily a country band, but like most bands of the time they would play whatever music the customers wanted to hear. In later years, Orbison would be able to pinpoint the exact moment he became a rock and roller -- on New Year's Eve 1954. The band started playing \"Shake, Rattle, and Roll\", expecting it to finish dead on the stroke ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-two of A History of Rock Music in Five Hundred Songs looks at \"Ooby Dooby\" by Roy Orbison and the Teen Kings, and the time when Sam Phillips got things badly wrong.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Blue Yodel #9\" by Jimmie Rodgers.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThere are several books available on Orbison. The one I have used for much of this is The Authorised Roy Orbison written by Jeff Slate and three of Orbison's children.\n\nI'm relying heavily on Sam Phillips: the Man Who Invented Rock and Roll by Peter Guralnick for all the episodes dealing with Phillips and Sun Records.\n\nThis compilation features every track Orbison released up til 1962.\n\nHis early Sun singles are also on this ten-disc set, which charts the history of Sun Records, with the A",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}