{
  "title": "BTK: A Killer Among Us",
  "link": "https://audioboom.com/posts/7971769",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3134,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>FAM!! We're doing that thing we do, like, twice a year, and giving ourselves a Tuesday \"off\" (read: not off, ever off, always working, lol), so we're replaying a favorite episode. <strong>BUT DON'T WORRY, YOU'RE GETTING AN ALL NEW DATELINE EPISODE ON THURSDAY!!<br>\n<br>\n</strong>From 1974 – 1991, a serial killer tormented the people of Kansas. He called himself BTK, which stood for BIND, TORTURE, KILL. He wanted to incite fear and panic, and so his killings were especially brutal. He taunted police with postcards, letters, and voice messages, but no matter how many clues the madman gave them, they still couldn’t catch him. But then, in 2005, after 10 murders and more three decades of terrorizing the locals, they got him. And suddenly it was clear how he’d managed to hide in plain sight for so long. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 02 Nov 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-11-02:/posts/7971769",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}