{
  "title": "S17 Ep103: The Last Jewish Gangster: The Middle Years w/ David S. Larson",
  "link": "https://audioboom.com/posts/8148219",
  "itunes:episode": 103,
  "itunes:title": "The Last Jewish Gangster: The Middle Years w/ David S. Larson",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 11392,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents The Last Jewish Gangster: The Middle Years with Author, David S. Larson!<br>\n<br>\nWhen we last left Michael Hardy, he was entering the world’s most dangerous prison in Mexico after taking the rap for his mother’s counterfeiting scheme, trusting she’ll love him this time. He’s set to do twelve years for the crime. To survive, he works for a gay drug lord as his gringo pistolero, and kills three times. <br>\n<br>\nAfter he gets out, Hardy returns to Brooklyn, tries to go straight, but drifts back into a world of crime. He gets Sammy “the Bull” Gravano to join his crew to pull major heists like kidnapping drug lords for million-dollar ransoms, and robbing cop bag men. To evade the law, he goes to Europe and ends up in Israel where he works on a Kibbutz, touching the hem of his Jewish heritage. <br>\n<br>\nHardy devolves further into a gangster’s life when he returns to Brooklyn, running a finger of the Mob’s Five-Fingers International Car Theft Ring, participating in a stolen airline ticket scam, and does fourteen hits for the Mob, hoping his mother will notice. When she gets busted for the car theft ring, she turns him in to reduce her time. He’s taken by marshals across the country twice, and ends up cutting a deal with Rudy Giuliani to nab a very dirty cop to reduce his time. <br>\n<br>\nAnd, THERE IS SO MUCH MORE! David Larson joins us today to talk about this chapter of Michael Hardy's life, which only spans SIX YEARS! You have to hear this show to believe it! <br>\n<br>\nPLUS: an all new Dumb Crimes/Stupid Criminals with Beer City Bruiser!<br>\n<br>\nGet the book, The Last Jewish Gangster, The Middle Years, Here: <a href=\"https://wildbluepress.com/last-jewish-gangster-middle-years-true-crime/\">https://wildbluepress.com/last-jewish-gangster-middle-years-true-crime/</a><br>\n<br>\n#crime #truecrime #truecrimepodcasts #truecrimetuesday #davidslarson #thelastjewishgangster #michaelhardy #Brooklyn #counterfeiting #stolencars #bankrobbery #mob #prison #sammythebullgravano #rudygiuliani  #dumbcrimesstupidcriminals #TimDennis #BeerCityBruiser #ROH #RingofHonorWrestling #floridaman #drugcrimes #foodcrimes #stupidcrimes #funnycrimes <br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 30 Aug 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-30:/posts/8148219",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}