{
  "title": "Bolivia since Morales, with Thomas C. Field Jr. (PODCAST 5-13-2020)",
  "description": "<p><em>This is the web version of Foreign Exchanges, but did you know you can get it delivered right to your inbox? Sign up today:</em></p><p>Latin America scholar Thomas C. Field Jr. joins me to discuss the last six or so months in Bolivia, from the disputed October election to the ouster of President Evo Morales to the machinations of the post-coup government that replaced him. You can find Thomas on Twitter @thomascfield and you can find his books at lots of places, but Powell’s has them <a target=\"_blank\" href=\"https://www.powells.com/book/-9780801452604\">here</a> and <a target=\"_blank\" href=\"https://www.powells.com/book/-9781469655697\">here</a>. Apologies for a few glitchy moments but in my defense this time they were caused by Skype, not me personally. That’s progress, at least.</p><p>I mentioned a couple of relevant interviews during the interview, one with southern Altiplano peasant workers leader Ramiro Huayta that you can find <a target=\"_blank\" href=\"https://www.kawsachuncoca.com/index.php/2012-12-24-07-26-10/agencia-abi/item/1052-the-fight-to-save-bolivia-s-lithium\">here</a> and another with MAS presidential candidate Luis Acre that’s available <a target=\"_blank\" href=\"https://peoplesdispatch.org/2020/04/30/bolivias-socialist-presidential-candidate-luis-arce-speaks-about-elections-covid-19-and-fascist-oppression/\">here</a>.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/bolivia-since-morales-with-thomas",
  "guid": "substack:post:455499",
  "dc:creator": "Derek Davison",
  "pubDate": "Wed, 13 May 2020 19:13:49 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 5124,
  "itunes:image": ""
}