{
  "title": "Space Launch System rocket back at the launch pad ready for Artemis I launch",
  "link": "https://www.digitaltrends.com/space/sls-rocket-returns-to-launch-pad/",
  "pubDate": "Sat, 05 Nov 2022 19:08:31 +0000",
  "dc:creator": "Georgina Torbet",
  "category": [
    "News",
    "Space",
    "artemis I",
    "space",
    "Space Launch System"
  ],
  "guid": "https://www.digitaltrends.com/?p=3221294",
  "description": "NASA's Space Launch System rocket has arrived back on the launch pad ahead of its launch later this month.",
  "content:encoded": "<p>NASA&#8217;s Space Launch System rocket has arrived back on the launch pad ahead of its launch later this month. The rocket, along with the Orion spacecraft, will be launched on the uncrewed Artemis I mission around the moon to test out technology for future crewed moon missions. The rocket had been set for launch last month, but it had to be returned to its building due to <a href=\"https://www.digitaltrends.com/news/artemis-launch-storm/\">Hurricane Ian</a> which hit the Florida coast.</p>\n<p>Having spent several weeks inside the Vehicle Assembly Building (VAB) at the Kennedy Space Center in Florida, the rocket has now returned to Launch Pad 39B, from where it will launch on November 14. It was carried from the VAB to the pad by a <a href=\"https://www.digitaltrends.com/space/nasa-sls-crawler/\">huge crawler</a> over a 4.2-mile journey which took nine hours.</p>\n<figure id=\"attachment_3221295\" aria-describedby=\"caption-attachment-3221295\" class=\"wp-caption alignnone is-caption-text\"><img  class=\"wp-image-3221295 size-large\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/52475783252_6e4f0cbaf5_k-768x5471-1.jpg?fit=720%2C720&p=1\" alt=\"NASA’s Space Launch System (SLS) rocket with the Orion spacecraft aboard is seen atop the mobile launcher as it arrives at Launch Pad 39B.\"   /><figcaption id=\"caption-attachment-3221295\" class=\"wp-caption-text\"><span class=\"text\">NASA’s Space Launch System (SLS) rocket with the Orion spacecraft aboard is seen atop the mobile launcher as it arrives at Launch Pad 39B, Friday, Nov. 4, 2022, at NASA’s Kennedy Space Center in Florida. NASA’s Artemis I mission is the first integrated test of the agency’s deep space exploration systems: the Orion spacecraft, SLS rocket, and supporting ground systems. Launch of the uncrewed flight test is targeted for Nov. 14 at 12:07 a.m.</span> <span class=\"credit\">NASA/Joel Kowsky</span></figcaption></figure>\n<p>According to NASA, the rocket arrived at the pad at 8:30 a.m. on November 4. &#8220;Teams will continue working to configure SLS and Orion for the upcoming Nov. 14. launch attempt,&#8221; the agency wrote in an <a href=\"https://blogs.nasa.gov/artemis/2022/11/04/artemis-i-moon-rocket-arrives-at-launch-pad-ahead-of-historic-mission-2/\" target=\"_blank\" rel=\"nofollow noopener\">update</a>.</p>\n<p>This means things are looking good for the next launch attempt, which seems to be <a href=\"https://www.digitaltrends.com/space/nasa-on-track-sls-launch-november/\">ready to go</a>. The first launch of the SLS system has proven challenging, with problems scuppering two previous launch attempts and issues with liquid hydrogen fuel leaks dogging the process. In an <a href=\"https://blogs.nasa.gov/artemis/2022/10/28/teams-on-track-for-artemis-i-rollout-to-launch-pad/\" target=\"_blank\" rel=\"nofollow noopener\">update</a> at the end of October NASA said it had completed minor repairs to the rocket and that engineers had tested and reinstalled several components.</p>\n<p>&#8220;Teams recharged, replaced and reinstalled several of the radiation instruments and the crew seat accelerometer inside Orion ahead of the crew module closure for roll,&#8221; NASA wrote before the rollout. &#8220;Technicians will refresh the specimens for the space biology payload at the launch pad. The crew module and launch abort system hatches are closed for the roll to the pad, and engineers will perform final closeouts at the pad prior to launch.&#8221;</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/11/52475783252_6e4f0cbaf5_k-768x5471-1.jpg?p=1",
  "enclosure": "",
  "post-id": 3221294
}