{
  "title": "Community members greet MIT’s 18th president",
  "link": "https://news.mit.edu/2022/sally-kornbluth-community-greet-1028",
  "description": "With donuts and cider in hand, students, faculty, and staff gathered on Hockfield Court to speak with President-elect Sally Kornbluth and celebrate her appointment.",
  "pubDate": "Fri, 28 Oct 2022 16:00:00 -0400",
  "guid": "https://news.mit.edu/2022/sally-kornbluth-community-greet-1028",
  "dc:creator": "Zach Winn | MIT News Office",
  "content:encoded": "<p>On a warm, sunny afternoon last Thursday, MIT’s community gathered under a tent on Hockfield Court to meet the Institute’s next president, Sally Kornbluth.</p>\n\n<p>Amid a festive, celebratory atmosphere that included live music and fall treats, Kornbluth soaked in MIT’s culture; chatted with faculty, students, and staff; heard from members of MIT leadership; and took innumerable selfies with community members.</p>\n\n<p>The event featured talks by Kornbluth and MIT Corporation Chair Diane Greene SM ’78, as well as performances by MIT a cappella group the Chorallaries. Following a musical performance including MIT’s school song, Kornbluth traveled through the tent greeting community members, who shared their excitement and ideas with her.</p>\n\n<p>In her remarks, Kornbluth acknowledged she has much to learn about MIT, but Thursday’s event was an early chance to immerse herself in MIT’s community and begin the learning process — what she happily described as “drinking from the firehose.”</p>\n\n<p>“I want to leave you with one standing request,” Kornbluth concluded. “I want to know what you know about MIT. I want to know what you love about MIT, what makes you proud, and where you think that, by working together, we could make MIT even better.”</p>\n\n<p>The lively gathering was accented by upbeat music and aromas from abundant refreshments and snacks, including spreads of apple cider and popular donut walls in every corner of the tent.</p>\n\n<p><strong>“</strong>It’s a wonderfully open community that doesn’t put a lot of emphasis on hierarchy,” said David I. Kaiser, the Germeshausen Professor of the History of Science, professor of physics, and associate dean of Social and Ethical Responsibilities of Computing in the MIT Schwarzman College of Computing. “The undergraduates should be rubbing elbows with the provost and the president-elect and everyone in between. That’s what we get to do today, and not every place is like that. I think Dr. Kornbluth saw that about MIT and I think that resonated deeply with her.”</p>\n\n<p>Greene opened her remarks by thanking current President L. Rafael Reif for his 10 years of service to MIT, prompting a standing ovation. She also recognized the presidential search committee, which for the first time included undergraduate and graduate students as well as members of the MIT Corporation, faculty, and staff.</p>\n\n<p>“This committee made unprecedented efforts to seek input from all members of our community as well as the broader higher ed community,” Greene said.</p>\n\n<p>Kornbluth’s appointment marks a notable time in MIT’s history. When she takes office, MIT’s president, provost, and chancellor will all be women.</p>\n\n<p>Members of the search committee expressed an appreciation for Kornbluth’s desire to get to know every corner of the MIT community as she begins supporting its work.</p>\n\n<p><strong>“</strong>She speaks all the languages of MIT, from the humanities to social sciences, design, as well as basic science and engineering,” said committee member Nicholas de Monchaux, a professor and head of MIT’s Department of Architecture. “That’s a very rare and unique quality, but more than that, it was clear to us [Dr. Kornbluth] has a complete and total curiosity and humility about ideas and knowledge, which is to say she’s coming in wanting to learn from us, and that’s so much the spirit of MIT.”</p>\n\n<p>During Kornbluth’s conversations, some community members offered advice and mementos, while others extended a simple welcome message. The exchanges marked the beginning of a learning process Kornbluth and the community seemed eager to begin.</p>\n\n<p>“It was such a privilege to get to know Dr. Kornbluth even a little bit during the search process and I’m excited the rest of the community now gets that same opportunity,” Kaiser said. “She has so much to learn with and from us, but I think people are really going to enjoy getting to know her as well.”</p>\n\n<p>In describing the event, Kornbluth used an analogy from her favorite type of science fiction, when an intrepid explorer makes contact with a new civilization.</p>\n\n<p>“This is kind of like that, except that all of you have gone out of your way to make sure I don’t feel like an alien, so thank you.”</p>",
  "media:content": {
    "media:description": "Incoming president Sally Kornbluth greeted the MIT community during an event held on Oct. 27.",
    "media:credit": "Image: Bryce Vickmark"
  },
  "category": [
    "Administration",
    "MIT Corporation",
    "President Sally Kornbluth",
    "President L. Rafael Reif",
    "Faculty",
    "Community",
    "Students",
    "Alumni/ae",
    "Staff",
    "Diversity and inclusion",
    "Special events and guest speakers",
    "History of MIT"
  ]
}