{
  "title": "Revisiting the Design Patterns of Composite Visualizations. (arXiv:2203.10476v2 [cs.HC] UPDATED)",
  "link": "http://arxiv.org/abs/2203.10476",
  "description": "<p>Composite visualization is a popular design strategy that represents complex\ndatasets by integrating multiple visualizations in a meaningful and aesthetic\nlayout, such as juxtaposition, overlay, and nesting. With this strategy,\nnumerous novel designs have been proposed in visualization publications to\naccomplish various visual analytic tasks. These well-crafted composite\nvisualizations have formed a valuable collection for designers and researchers\nto address real-world problems and inspire new research topics and designs.\nHowever, there is a lack of understanding of design patterns of composite\nvisualization, thus failing to provide holistic design space and concrete\nexamples for practical use. In this paper, we opted to revisit the composite\nvisualizations in VIS publications and answered what and how visualizations of\ndifferent types are composed together. To achieve this, we first constructed a\ncorpus of composite visualizations from IEEE VIS publications and decomposed\nthem into a series of basic visualization types (e.g., bar chart, map, and\nmatrix). With this corpus, we studied the spatial (e.g., separated or\noverlaying) and semantic relationships (e.g., with same types or shared axis)\nbetween visualizations and proposed a taxonomy consisting of eight different\ndesign patterns (e.g., repeated, stacked, accompanied, and nested).\nFurthermore, we analyzed and discussed common practices of composite\nvisualizations, such as the distribution of different patterns and correlations\nbetween visualization types. From the analysis and examples, we obtained\ninsights into different design patterns on the utilities, advantages, and\ndisadvantages. Finally, we developed an interactive system to help\nvisualization developers and researchers conveniently explore collected\nexamples and design patterns.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Deng_D/0/1/0/all/0/1\">Dazhen Deng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cui_W/0/1/0/all/0/1\">Weiwei Cui</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Meng_X/0/1/0/all/0/1\">Xiyu Meng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xu_M/0/1/0/all/0/1\">Mengye Xu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liao_Y/0/1/0/all/0/1\">Yu Liao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhang_H/0/1/0/all/0/1\">Haidong Zhang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wu_Y/0/1/0/all/0/1\">Yingcai Wu</a>"
}