{
  "title": "Software patents are evil, but BSD+Patents is probably not the solution",
  "link": "",
  "published": "2017-09-05T08:00:00-07:00",
  "updated": "2017-09-05T08:00:00-07:00",
  "author": {
    "name": "Wes McKinney"
  },
  "id": "tag:wesmckinney.com,2017-09-05:/blog/react-bsd-patents/",
  "summary": "<p><strong>TL;DR</strong>: I discuss my perspective in the recent BSD+Patents episode with\n  Facebook Open Source.</p>",
  "content": "<p><strong>TL;DR</strong>: I discuss my perspective in the recent BSD+Patents episode with\n  Facebook Open Source.</p>\n\n\n<h1>Patents and Open Source</h1>\n<p><em>Disclaimer: I am not a lawyer</em></p>\n<p>Many open source software (OSS) projects led by industry giants use the Apache\nLicense 2.0 (henceforth the ASL2.0), compared with the MIT or BSD licenses\nwhich also enjoy popularity amongst many other OSS projects. This is the\nlicense used by projects in the <a href=\"http://www.apache.org\">Apache Software Foundation</a>, but you can\nuse the license without being part of the ASF. <a href=\"http://github.com/tensorflow/tensorflow\">TensorFlow</a> and many other\nimportant non-ASF projects use this license.</p>\n<p>The ASL2.0 has appeal for enterprises for a few reasons. One obvious reason is\nbeing a redistribution-friendly, permissive license (like MIT / BSD), so you\ncan include such code in closed source products that you sell. Another reason\nis that it makes <em>patent grant rights</em> explicit. In other words, the license\ngrants users unrestricted use of any patented IP in the codebase in\nperpetuity. This patent grant applies transitively to any projects that use or\nredistribute the project in question.</p>\n<p>Having code that is both permissively licensed and patented might seem a bit\nstrange. Some companies may seek patents for IP created in OSS projects to try\nto protect themselves in future IP litigation   . They have no intent of selling\nor profiting from the patents, but they want the IP distributed in their OSS\nprojects to stay free and commercial friendly.</p>\n<p>This is where the ASL2.0's patent grant is so important; it protects <strong>both</strong>\nthe OSS authors' and users' redistribution rights. Without this, a patent troll\ncould start a lawsuit and potentially force code in an established OSS project\nto be removed, which would wreak all kinds of havoc on developers and users\nalike.</p>\n<p>In my opinion, software patents are evil because they stifle innovation\nachieved through incrementalism, and software engineering consists of a lot of\nthis.</p>\n<h1>BSD+Patents</h1>\n<p>Here's the rub. Facebook has licensed some of its popular OSS projects under a\nlicense which is almost like the ASL2.0, except that the language around patent\ngrants is different. I present an abbreviated version of the legalese:</p>\n<blockquote>\n<p>The [patent] license granted ... will terminate ... if you ... initiate\ndirectly or indirectly, or take a direct financial interest in, any Patent\nAssertion: (i) against Facebook ... (ii) against any party if such Patent\nAssertion arises ... from any software... of Facebook ... or (iii) against any\nparty relating to the Software.</p>\n</blockquote>\n<p><strong>TL;DR: You can use Facebook's OSS patents as long as you never sue Facebook\nfor patent infringement.</strong> In the ASL2.0 there are no such restrictions.</p>\n<p>The Apache Software Foundation's legal folks took issue with this provision, as\n(and this is only my understanding of things) it creates an \"IP overhang\" in\nany projects that transitively depend on a Facebook BSD+Patents project, like\nReact or RocksDB. It's a form of software non-freedom that makes this license\nonerous for commercial projects.</p>\n<p>Software patents are evil, don't get me wrong. But the Facebook patent\ntermination clause is a nuclear option to fight back against patent\ntrolls. Presumably Facebook has already faced a number of frivolous patent\ninfringement lawsuits over the years, and that may be motivating their stance\non this.</p>\n<p>Facebook has changed the RocksDB license to ASL2.0 in reaction to public\noutcry, but the React license remains unchanged, which is causing problems for\nASF projects which have React-based user interfaces at various stages of\ndevelopment.</p>\n<p>You can see <a href=\"https://medium.com/@raulk/if-youre-a-startup-you-should-not-use-react-reflecting-on-the-bsd-patents-license-b049d4a67dd2\">this blog post</a> for a lengthier discussion of the licensing\nsaga from the perspective of one Apache contributor.</p>\n<p>On August 18, one of Facebook's engineering directors <a href=\"https://code.facebook.com/posts/112130496157735/explaining-react-s-license/\">wrote directly about the\nissue</a>:</p>\n<blockquote>\n<p>We believe that if this license [BSD+Patents] were widely adopted, it could\n  actually reduce meritless litigation for all adopters, and we want to work\n  with others to explore this possibility.</p>\n</blockquote>\n<h1>Perspective</h1>\n<p>People seem to be of two minds about the situation:</p>\n<ul>\n<li>\n<p>Facebook's open source lawyers are being nitwits by using a non-standard\n  license, when Google and most other companies in the world have been doing\n  fine under the protections of the Apache License 2.0.</p>\n</li>\n<li>\n<p>The Apache Software Foundation is creating unnecessary complication for open\n  source developers, for 99% or more of whom these IP concerns will never be a\n  realistic issue.</p>\n</li>\n</ul>\n<p>The situation is justifiably annoying for everyone involved. Accepting\nBSD+Patents projects as a hard dependency into ASF projects is a slippery\nslope, and may lead to more projects adopting this license, which I don't think\nwould be good. It has a viral quality similar to copyleft licenses like the\nGPL.</p>\n<p><strong>The real enemy is software patents.</strong> I feel Facebook's stance on this is\nideological, and it seems unjust to make OSS developers pay the price for\nsoftware patents' continued legality in the United States. BSD+Patents may stop\ncertain kinds of patent trolls, but the only real solution is to bring about an\nend to software patents altogether.</p>\n<p>Bottom line is that I agree with the ASF's stance on the BSD+Patents issue, and\nI hope that React will change its license. Further, I hope that Facebook and\nother highly profitable multinational companies pool their resources to lobby\nfor an end to software patents.</p>"
}