{
  "title": "A “door” into the mitochondrial membrane",
  "link": "https://news.mit.edu/2022/door-mitochondrial-membrane-1025",
  "description": "Study finds the protein MTCH2 is responsible for shuttling various other proteins into the membrane of mitochondria. The finding could have implications for cancer treatments and MTCH2-linked conditions.",
  "pubDate": "Tue, 25 Oct 2022 15:45:00 -0400",
  "guid": "https://news.mit.edu/2022/door-mitochondrial-membrane-1025",
  "dc:creator": "Eva Frederick | Whitehead Institute",
  "content:encoded": "<p>Mitochondria —&nbsp;the organelles responsible for energy production in human cells — were once free-living organisms that found their way into early eukaryotic cells over a billion years ago. Since then, they have merged seamlessly with their hosts in a classic example of symbiotic evolution, and now rely on many proteins made in their host cell’s nucleus to function properly.</p>\n\n<p>Proteins on the outer membrane of mitochondria are especially important; they allow the mitochondria to communicate with the rest of the cell, and play a role in immune functions and a type of programmed cell death called apoptosis. Over the course of evolution, cells evolved a specific mechanism by which to insert these proteins —&nbsp;which are made in the cell’s cytoplasm — into the mitochondrial membrane. But what that mechanism was, and what cellular players were involved, has long been a mystery.&nbsp;</p>\n\n<p>A new paper from the labs of MIT Professor Jonathan Weissman and Caltech Professor Rebecca Voorhees provides a solution to that mystery. The work, published Oct. 21 in the journal <em>Science</em>, reveals that a protein called mitochondrial carrier homolog 2, or MTCH2 for short, which has been linked to many cellular processes and even diseases such as cancer and Alzheimer’s, is responsible for acting as a “door” for a variety of proteins to access the mitochondrial membrane.&nbsp;</p>\n\n<p>“Until now, no one knew what MTCH2 was really doing — they just knew that when you lose it, all these different things happen to the cell,” says Weissman, who is also member of the Whitehead Institute for Biomedical Research and an investigator of the Howard Hughes Medical Institute. “It was sort of a mystery why this one protein affects so many different processes. This study gives a molecular basis for understanding why MTCH2 was implicated in Alzheimer's and lipid biosynthesis and mitochondrial fission and fusion: because it was responsible for inserting all these different types of proteins in the membrane.”</p>\n\n<p>“The collaboration between our labs was essential in understanding the biochemistry of this interaction, and has led to a really exciting new understanding of a fundamental question in cell biology,” Voorhees says.&nbsp;</p>\n\n<p><strong>The search for a door&nbsp;</strong></p>\n\n<p>In order to find out how proteins from the cytoplasm — specifically a class called tail-anchored proteins —&nbsp;were being inserted into the outer membranes of mitochondria, Weismann Lab postdoc and first author of the study Alina Guna, alongside Voorhees Lab graduate student Taylor Stevens and postdoc Alison Inglis, decided to use a technique called used the CRISPR interference (or CRISPRi) screening approach, which was invented by Weissman and collaborators.</p>\n\n<p>“The CRISPR screen let us systematically get rid of every gene, and then look and see what happened [to one specific tail-anchored protein],” says Guna. “We found one gene, MTCH2, where when we got rid of it there was a huge decrease in how much of our protein got to the mitochondrial membrane. So we thought, maybe this is the doorway to get in.”</p>\n\n<p>To confirm that MTCH2 was acting as a doorway into the mitochondrial membrane, the researchers performed additional experiments to observe what happened when MTCH2 was not present in the cell. They found that MTCH2 was both necessary and sufficient to allow tail-anchored membrane proteins to move from the cytoplasm into the mitochondrial membrane.&nbsp;</p>\n\n<p>MTCH2’s ability to shuttle proteins from the cytoplasm into the mitochondrial membrane is likely due to its specialized shape. The researchers ran the protein’s sequence through Alpha Fold, an artificial intelligence system that predicts a protein’s structure through its amino acid sequence, which revealed that it is a hydrophobic protein —&nbsp;perfect for inserting into the oily membrane —&nbsp;but with a single hydrophilic groove where other proteins could enter.</p>\n\n<p>“It's basically like a funnel,” Guna says. “Proteins come from the cytosol, they slip into that hydrophilic groove and then move from the protein into the membrane.”</p>\n\n<p>To confirm that this groove was important in the protein’s function, Guna and her colleagues designed another experiment. “We wanted to play around with the structure to see if we could change its behavior, and we were able to do that,” Guna says. “We went in and made a single point mutation, and that point mutation was enough to really change how the protein behaved and how it interacted with substrates. And then we went on and found mutations that made it less active and mutations that made it super active.”</p>\n\n<p>The new study has applications beyond answering a fundamental question of mitochondria research. “There's a whole lot of things that come out of this,” Guna says.&nbsp;</p>\n\n<p>For one thing, MTCH2 inserts proteins key to a type of programmed cell death called apoptosis, which researchers could potentially harness for cancer treatments. “We can make leukemia cells more sensitive to a cancer treatment by giving them a mutation that changes the activity of MTCH2,” Guna says. “The mutation makes MTCH2 act more ‘greedy’ and insert more things into the membrane, and some of those things that have inserts are like pro-apoptotic factors, so then those cells are more likely to die, which is fantastic in the context of a cancer treatment.”</p>\n\n<p>The work also raises questions about how MTCH2 developed its function over time. MTCH2 evolved from a family of proteins called the solute carriers, which shuttle a variety of substances across cellular membranes. “We're really interested in this evolution question of, how do you evolve a new function from an old, ubiquitous class of proteins?” Weissman says.</p>\n\n<p>And researchers still have much to learn about how mitochondria interact with the rest of the cell, including how they react to stress and changes within the cell, and how proteins find their way to mitochondria in the first place. “I think that [this paper] is just the first step,” Weissman says. “This only applies to one class of membrane proteins — and&nbsp;it doesn't tell you all of the steps that happen after the proteins are made in the cytoplasm. For example, how are they ferried to mitochondria? So stay tuned — I think we'll be learning that we now have a very nice system for opening up this fundamental piece of cell biology.”</p>",
  "media:content": {
    "media:description": "New research finds the protein MTCH2 acts as a doorway for proteins into the outer mitochondrial membrane.",
    "media:credit": "Image: Maria Guna"
  },
  "category": [
    "Research",
    "Cells",
    "Genetics",
    "Proteins",
    "Biology",
    "Evolution",
    "Cancer",
    "CRISPR",
    "Alzheimer's",
    "Collaboration",
    "Whitehead Institute",
    "School of Science",
    "Howard Hughes Medical Institute (HHMI)"
  ]
}