{
  "title": "Implementing Dynamic memory networks",
  "link": "",
  "updated": "2016-02-05T00:00:00+00:00",
  "id": "http://yerevann.github.io//2016/02/05/implementing-dynamic-memory-networks",
  "content": "<p>The Allen Institute for Artificial Intelligence has organized a 4 month <a href=\"https://www.kaggle.com/c/the-allen-ai-science-challenge\">contest</a> in Kaggle on question answering. The aim is to create a system which can correctly answer the questions from the 8th grade science exams of US schools (biology, chemistry, physics etc.). DeepHack Lab organized a <a href=\"http://qa.deephack.me/\">scientific school + hackathon</a> devoted to this contest in Moscow. Our team decided to use this opportunity to explore the deep learning techniques on question answering (although they seem to be far behind traditional systems). We tried to implement Dynamic memory networks described <a href=\"http://arxiv.org/abs/1506.07285\">in a paper by A. Kumar et al</a>. Here we report some preliminary results. In the next blog post we will describe the techniques we used to get to top 5% in the contest.</p>\n\n<!--more-->\n\n<h2 class=\"no_toc\" id=\"contents\">Contents</h2>\n<ul id=\"markdown-toc\">\n  <li><a href=\"#babi-tasks\" id=\"markdown-toc-babi-tasks\">bAbI tasks</a></li>\n  <li><a href=\"#memory-networks\" id=\"markdown-toc-memory-networks\">Memory networks</a></li>\n  <li><a href=\"#dynamic-memory-networks\" id=\"markdown-toc-dynamic-memory-networks\">Dynamic memory networks</a>    <ul>\n      <li><a href=\"#semantic-memory\" id=\"markdown-toc-semantic-memory\">Semantic memory</a></li>\n      <li><a href=\"#input-module\" id=\"markdown-toc-input-module\">Input module</a></li>\n      <li><a href=\"#episodic-memory\" id=\"markdown-toc-episodic-memory\">Episodic memory</a></li>\n    </ul>\n  </li>\n  <li><a href=\"#initial-experiments\" id=\"markdown-toc-initial-experiments\">Initial experiments</a></li>\n  <li><a href=\"#next-steps\" id=\"markdown-toc-next-steps\">Next steps</a></li>\n</ul>\n\n<h2 id=\"babi-tasks\">bAbI tasks</h2>\n\n<p>The questions of this contest are quite hard, they not only require lots of knowledge in natural sciences, but also abilities to make inferences, generalize the concepts, apply the general ideas to the examples and so on. The methods based on deep learning do not seem to be mature enough to handle all of these difficulties. On the other hand these questions have 4 answer candidates. That’s why, as was noted by <a href=\"https://www.youtube.com/watch?v=lM2-Mi-2egM\">Dr. Vorontsov</a>, simple search engine indexed on lots of documents will perform better as a question answering system than any “intelligent” system.</p>\n\n<p>But there is already some work on creating question answering / reasoning systems using neural approaches. As another lecturer of the DeepHack event, <a href=\"https://www.youtube.com/watch?v=gi4Zf59_IcU\">Tomas Mikolov</a>, told us, we should start from easy, even synthetic questions and try to gradually increase the difficulty. This roadmap towards building intelligent question answering systems is described in <a href=\"http://arxiv.org/abs/1502.05698\">a paper</a> by Facebook researchers Weston, Bordes, Chopra, Rush, Merriënboer and Mikolov, where the authors introduce a benchmark of toy questions called <a href=\"http://fb.ai/babi\">bAbI tasks</a> which test several basic reasoning capabilities of a QA system.</p>\n\n<p>Questions in the bAbI dataset are grouped into 20 types, each of them has 1000 samples for training and another 1000 samples for testing. A system is said to have passed a given task, if it correctly answers at least 95% of the questions in the test set. There is also a version with 10K samples, but as Mikolov told during the lecture, deep learning is not necessarily about large datasets, and in this setting it is more interesting to see if the systems can learn answering questions by looking at a few training samples.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/babi1.png\" alt=\"some of the bAbI tasks\" title=\"some of the bAbI tasks\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td><img src=\"/public/2016-02-06/babi2.png\" alt=\"some of the bAbI tasks\" title=\"some of the bAbI tasks\" /></td>\n    </tr>\n  </tbody>\n  <tbody>\n    <tr>\n      <td>Some of the bAbI tasks. More examples can be found in the <a href=\"http://arxiv.org/pdf/1502.05698v10.pdf\">paper</a>.</td>\n    </tr>\n  </tbody>\n</table>\n\n<h2 id=\"memory-networks\">Memory networks</h2>\n\n<p>bAbI tasks were first evaluated on an LSTM-based system, which achieve 50% performance on average and do not pass any task. Then the authors of the paper try <a href=\"http://arxiv.org/abs/1410.3916\">Memory Networks</a> by Weston et al. It is a recurrent network which has a long-term memory component where it can learn to write some data (the input sentences) and read them later.</p>\n\n<p>bAbI tasks include not only the answers to the questions but also the numbers of those sentences which help answer the question. This information is taken into account when training MemNN, they not only get the correct answers but also an information about which input sentences affect the answer. Under this so called <em>strongly supervised</em> setting “plain” Memory networks pass 7 of the 20 tasks. Then the authors apply some modifications to them and pass 16 tasks.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/memn2n.png\" alt=\"End-to-end memory networks\" title=\"End-to-end memory networks\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>The structure of MemN2N from the <a href=\"http://arxiv.org/abs/1410.3916\">paper</a>.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>We are mostly interested in <em>weakly supervised</em> setting, because the additional information on important sentences is not available in many real scenarios. This was investigated in a paper by Sukhbaatar, Szlam, Weston and Fergus (from New York University and Facebook AI Research) where they introduce <a href=\"http://arxiv.org/abs/1503.08895\">End-to-end memory networks</a> (MemN2N). They investigate many different configurations of these systems and the best version passes 9 tasks out of 20. Facebook’s MemN2N repository on GitHub lists <a href=\"https://github.com/facebook/MemNN\">some implementations of MemN2N</a>.</p>\n\n<h2 id=\"dynamic-memory-networks\">Dynamic memory networks</h2>\n\n<p>Another advancement in the direction of memory networks was made by Kumar, Irsoy, Ondruska, Iyyer, Bradbury, Gulrajani and Socher from Metamind. By the way, Richard Socher is the author of <a href=\"http://cs224d.stanford.edu/\">an excellent course on deep learning and NLP</a> at Stanford, which helped us a lot to get into the topic. Their <a href=\"http://arxiv.org/abs/1506.07285\">paper</a> introduces a new system called Dynamic memory networks (DMN) which passes 18 bAbI tasks in the strongly supervised setting. The paper does not talk about weakly supervised setting, so we decided to implement DMN from scratch in <a href=\"http://deeplearning.net/software/theano/\">Theano</a>.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/dmn-high-level.png\" alt=\"High-level structure of DMN\" title=\"High-level structure of DMN\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>High-level structure of DMN from the <a href=\"http://arxiv.org/abs/1506.07285\">paper</a>.</td>\n    </tr>\n  </tbody>\n</table>\n\n<h3 id=\"semantic-memory\">Semantic memory</h3>\n\n<p>The input of the DMN is a sequence of word vectors of input sentences. We followed the paper and used pretrained <a href=\"http://nlp.stanford.edu/projects/glove/\">GloVe vectors</a> and added the dimensionality of word vectors to the list of hyperparamaters (controlled by the command line argument <code class=\"highlighter-rouge\">--word_vector_size</code>). DMN architecture treats these vectors as part of a so called <em>semantic memory</em> (in contrast to the <em>episodic memory</em>) which may contain other knowledge as well. Our implementation uses only word vectors and does <em>not</em> fine tune them during the training, so we don’t consider it as a part of the neural network.</p>\n\n<h3 id=\"input-module\">Input module</h3>\n\n<p>The first module of DMN is an <em>input module</em> that is a <a href=\"http://arxiv.org/abs/1412.3555\">gated recurrent unit</a> (GRU) running on the sequence of word vectors. GRU is a recurrent unit with 2 gates that control when its content is updated and when its content is erased. The hidden state of the input module is meant to represent the input processed so far in a vector. Input module outputs its hidden states either after every word (<code class=\"highlighter-rouge\">--input_mask word</code>) or after every sentence (<code class=\"highlighter-rouge\">--input_mask sentence</code>). These outputs are called <code class=\"highlighter-rouge\">facts</code>.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/gru.png\" alt=\"Formal definition of GRU\" title=\"Formal definition of GRU\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Formal definition of GRU. <code class=\"highlighter-rouge\">z</code> is the <em>update gate</em> and <code class=\"highlighter-rouge\">r</code> is the <em>reset gate</em>. More details and images can be found <a href=\"http://deeplearning4j.org/lstm.html\">here</a>.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Then there is a <em>question module</em> that processes the question word by word and outputs one vector at the end. This is done by using the same GRU as in the input module using the same weights.</p>\n\n<h3 id=\"episodic-memory\">Episodic memory</h3>\n\n<p>The fact and question vectors extracted from the input enter the <em>episodic memory</em> module. Episodic memory is basically a composition of two nested GRUs. The outer GRU generates the final memory vector working over a sequence of so called <em>episodes</em>. This GRU state is initialized by the question vector. The inner GRU generates the episodes.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/dmn-details.png\" alt=\"Details of DMN architecture\" title=\"Details of DMN architecture\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>Details of DMN architecture from the <a href=\"http://arxiv.org/abs/1506.07285\">paper</a>.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>The inner GRU generates the episodes by passing over the facts from the input module. But when updating its inner state, the GRU takes into account the output of some <code class=\"highlighter-rouge\">attention function</code> on the current fact. Attention function gives a score (between 0 and 1) to each of the fact, and GRU (softly) ignores the facts having low scores. Attention function is a simple 2 layer neural network depending on the question vector, current fact, and current state of the memory. After each full pass on all facts the inner GRU outputs an <em>episode</em> which is fed into the outer GRU which on its turn updates the memory. Then because of the updated memory the attention may give different scores to the facts. So new episodes can be created. The number of steps of the outer GRU, that is the number of the episodes, can be determined dynamically, but we fix it to simplify the implementation. It is configured by <code class=\"highlighter-rouge\">--memory_hops</code> setting.</p>\n\n<p>All facts, episodes and memories are in the same n-dimensional space, which is controlled by the command line argument <code class=\"highlighter-rouge\">--dim</code>. Inner and outer GRUs share their weights.</p>\n\n<p>###</p>\n\n<p>The final state of the memory is being fed into the <em>answer module</em>, which produces the answer. We have implemented two kinds of answer modules. First is a simple linear layer on top of the memory vector with softmax activation (<code class=\"highlighter-rouge\">--answer_module feedforward</code>). This is useful if each answer is just one word (like in the bAbI dataset). The second kind of answer module is another GRU that can produce multiple words (<code class=\"highlighter-rouge\">--answer_module recurrent</code>). Its implementation is half baked now, as we didn’t need it for bAbI.</p>\n\n<p>The whole system is end-to-end differentiable and is trained using stochastic gradient descent. We use <a href=\"http://arxiv.org/abs/1212.5701\"><code class=\"highlighter-rouge\">adadelta</code></a> by default. More formulas and details of architecture can be found in the original paper. But the paper does not contain many implementation details, so we may have diverged from the original implementation.</p>\n\n<h2 id=\"initial-experiments\">Initial experiments</h2>\n\n<p>We have tested this system on bAbI tasks with a few randomly selected hyperparameters. We initialized the word vectors by using 50-dimensional GloVe vectors trained on Wikipedia. Answer module is a simple feedforward classifier over the vocabulary (which is <em>very</em> limited in bAbI tasks). Here are the results.</p>\n\n<table>\n  <thead>\n    <tr>\n      <th><img src=\"/public/2016-02-06/results.png\" alt=\"Results\" title=\"Results\" /></th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <td>First two columns are for strongly supervised systems <a href=\"http://arxiv.org/abs/1410.3916\">MemNN</a> and <a href=\"http://arxiv.org/abs/1506.07285\">DMN</a>. Third column is the best results of <a href=\"http://arxiv.org/abs/1410.3916\">MemN2N</a>. The last 3 columns are our results with different dimensions of the memory.</td>\n    </tr>\n  </tbody>\n</table>\n\n<p>First basic observation is that weakly supervised systems are generally worse than the strongly supervised ones. When compared to MemN2N, our system performs much worse on the tasks 2, 3 and 16. As a result we pass only 7 tasks out of 20. On the other hand, our results on tasks 5, 6, 8, 9, 10 and 18 are better than MemN2N. Surprisingly what we got on the 17th task is better than in strongly supervised systems!</p>\n\n<p>Our system converges very fast on some of the tasks (like the first one), overfits on many other tasks and does not converge on tasks 2, 3 and 19.</p>\n\n<p>19th task (path finding) is not solved by any of these systems. Wojciech Zaremba from OpenAI informed us <a href=\"https://www.youtube.com/watch?v=ezE-13X0UoM\">during his lecture</a> about one system which managed to solve it using 10K training samples. This remains a very interesting challenge for us. We need to carefully experiment with various parameters to reach some meaningful conclusions.</p>\n\n<p>We have tried to test on the full shuffled list of 20000 bAbI tasks. We couldn’t reach 60% average accuracy after 50 hours of training on an Amazon instance, while MemN2N authors report 87.6% accuracy.</p>\n\n<p>This implementation of DMN is available on <a href=\"https://github.com/YerevaNN/Dynamic-memory-networks-in-Theano\">Github</a>. We really need lots of feedback on this code.</p>\n\n<h2 id=\"next-steps\">Next steps</h2>\n\n<ul>\n  <li>We need a good way to visualize the attention in the episodic memory. This will help us understand what is exactly going on inside the system. Many papers now include such visualizations on some examples.</li>\n  <li>Our model overfits on many of the tasks even with 25-dimensional memory. We briefly experimented with L2 regularization but it didn’t help much (<code class=\"highlighter-rouge\">--l2</code>).</li>\n  <li>Currently we are working on a slightly modified architecture which will be optimized for multiple choice questions. Basically it will include one more input module which will read the answer choices and will provide another input for the attention mechanism.</li>\n  <li>Then we will be able to evaluate our code on more complex QA datasets like <a href=\"http://research.microsoft.com/en-us/um/redmond/projects/mctest/\">MCTest</a>.</li>\n  <li>Training with batches is not properly implemented yet. There are several technical challenges related to the variable length of input sequences. It becomes much harder to keep in control because of this kind of <a href=\"https://github.com/Theano/Theano/issues/1772\">bugs</a> in Theano.</li>\n</ul>\n\n<p>We would like to thank the organizers of DeepHack.Q&amp;A for the really amazing atmosphere here in <a href=\"https://mipt.ru/\">PhysTech</a>.</p>"
}