{
  "title": "121: Mary Kay Letourneau: Autobiography",
  "link": "https://audioboom.com/posts/7507526",
  "itunes:episode": 121,
  "itunes:title": "Mary Kay Letourneau: Autobiography",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3263,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Mary Kay Letourneau is garbage. What else is there to say? I mean for context, she was a 35 year old teacher who had an affair with her THIRTEEN YEAR OLD student....and had two babies with him. She served (not enough) jail time and then then, after years and years of grooming, convinced him to marry her. AND FOR SOME REASON A&E FELT THAT SHE SHOULD GET TO TELL HER OWN STORY IN HER OWN WORDS! OH! OH! AND SHE HAS A BUNCH OF GARBAGE FRIENDS IN THIS WHO WANT US TO BELIEVE THAT IT'S ALL FINE BECAUSE HER VICTIM HAD A MUSTACHE! Whatever, Gillian is so freaking mad the whole time and we don't want her to suffer, but it's hilarious. <br>\n<br>\n<strong>WE'RE LAUNCHING A NEW PODCAST!</strong> <a href=\"https://www.obsessedwithpod.com/\">(Take a listen to the preview here!) </a>\"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <a href=\"https://www.obsessedwithpod.com/\">LISTEN AND SUBSCRIBE! </a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 18 Feb 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-02-18:/posts/7507526",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}