{
  "title": "Jean Chalaby, “The Format Age: Television’s Entertainment Revolution” (Polity, 2015)",
  "description": "Television had been transformed by the rise of the format. In The Format Age: Television’s Entertainment Revolution Jean Chalaby, Professor of International Communication at City University London, charts the beginnings of the format for TV shows, through the globalization of the trade in TV formats, to conclude with reflections on the future of local and global TV markets. The book uses an eclectic set of theoretical frames, including Global Value Chains, World Systems Theory and work of the Annales School, to chart the political economy of the TV format. Using a wide range of examples, detailed case studies of local markets and local production systems (including the UK), the book shows how the format is now crucial to the modern television industry encompassing everything from the game show to the long form drama. The book will be of interest to all media and communications scholars, as well as anyone keen to know why we have the sorts of television programmes we have on our screens.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/critical-theory",
  "pubDate": "Mon, 29 Aug 2016 14:43:49 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Marshall Poe",
  "itunes:subtitle": "Television had been transformed by the rise of the format. In The Format Age: Television’s Entertainment Revolution Jean Chalaby, Professor of International Communication at City University London, charts the beginnings of the format for TV shows,",
  "itunes:summary": "Television had been transformed by the rise of the format. In The Format Age: Television’s Entertainment Revolution Jean Chalaby, Professor of International Communication at City University London, charts the beginnings of the format for TV shows, through the globalization of the trade in TV formats, to conclude with reflections on the future of local and global TV markets. The book uses an eclectic set of theoretical frames, including Global Value Chains, World Systems Theory and work of the Annales School, to chart the political economy of the TV format. Using a wide range of examples, detailed case studies of local markets and local production systems (including the UK), the book shows how the format is now crucial to the modern television industry encompassing everything from the game show to the long form drama. The book will be of interest to all media and communications scholars, as well as anyone keen to know why we have the sorts of television programmes we have on our screens.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/critical-theory",
  "content:encoded": "<p>Television had been transformed by the rise of the format. In <a href=\"http://www.amazon.com/dp/1509502599/?tag=newbooinhis-20\">The Format Age: Television’s Entertainment Revolution</a> <a href=\"http://www.city.ac.uk/people/academics/jean-chalaby\">Jean Chalaby</a>, Professor of International Communication at City University London, charts the beginnings of the format for TV shows, through the globalization of the trade in TV formats, to conclude with reflections on the future of local and global TV markets. The book uses an eclectic set of theoretical frames, including Global Value Chains, World Systems Theory and work of the Annales School, to chart the political economy of the TV format. Using a wide range of examples, detailed case studies of local markets and local production systems (including the UK), the book shows how the format is now crucial to the modern television industry encompassing everything from the game show to the long form drama. The book will be of interest to all media and communications scholars, as well as anyone keen to know why we have the sorts of television programmes we have on our screens.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/critical-theory\">https://newbooksnetwork.supportingcast.fm/critical-theory</a></p>",
  "itunes:duration": 2506,
  "itunes:explicit": "no",
  "guid": "http://newbooksnetwork.com/?p=59869",
  "enclosure": ""
}