{
  "title": "UK facing potentially colder winter than normal – meteorologists",
  "link": "https://www.rt.com/news/565759-cold-britain-winter-forecast/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565759-cold-britain-winter-forecast/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636165df85f5407a854b0149.jpg\" /> The British Met Office says the likelihood of a colder three-month period is slightly greater than normal <br/><a href=\"https://www.rt.com/news/565759-cold-britain-winter-forecast/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Amid a looming energy crisis, meteorologists say that the chances of lower temperatures are 1.3 times higher than normal</strong></p>\n            \n                        \n            <p>The probability that Britain will face a colder-than-usual winter is slightly higher than normal, the Met Office said on Monday in its three-month <a href=\"https://www.metoffice.gov.uk/binaries/content/assets/metofficegovuk/pdf/business/public-sector/civil-contingency/3moutlook-ndj-v1.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">forecast</a>.</p>\n<p>As the country braces for an energy crisis, exacerbated by anti-Russia sanctions and a sharp decrease in Moscow&rsquo;s energy supplies to Europe, meteorologists say there is a 25% chance the upcoming season will be cold, which is 1.3 times the usual chance.&nbsp;</p>\n<p>At the same time, the Met Office said that the <em>&ldquo;chances of dry conditions are greater than normal</em>,&rdquo; while stormy conditions &ldquo;<em>are less likely than normal.&rdquo;</em></p>\n<p>Overall, however, the most likely scenario is that the upcoming winter will be an average one, according to the outlook.</p>\n<p>October in Britain was unusually warm, with temperatures last weekend going above 20 degrees Celsius (68 degrees Fahrenheit).</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/634e73de85f5403b5e311a89.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/564888-brits-blackouts-winter-crisis/\">Brits told to prepare for blackouts on ‘really cold’ evenings</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The mild weather means there hasn&rsquo;t been as much of a spike in energy demand and gas prices have actually decreased from their summer peaks.</p>\n<p>Nevertheless, Britain is preparing for a challenging winter. Despite not being directly dependent on Russian energy supplies, the UK used to import gas and electricity from continental Europe during the coldest months and extreme weather events. However, this year, European countries are facing severe energy crises of their own amid attempts to rid themselves of dependency on Russian fuel.</p>\n<p><strong></strong>Late last month, Centrica Plc announced that it was reopening North Sea-based Rough &ndash; the country&rsquo;s biggest gas storage facility &ndash; after a five-year suspension. Though it will be operating at only around 20% of its former capacity, it will still add 50% to the UK&rsquo;s reserves.</p>\n<p><strong></strong>Britain&rsquo;s National Grid ESO <a href=\"https://www.nationalgrideso.com/document/268346/download\" target=\"_blank\" rel=\"noopener noreferrer\">said</a> in October that its <em>&ldquo;base case&rdquo;</em> remains unchanged, suggesting there will be enough gas and electricity for Britain this winter. However, it didn&rsquo;t rule out a <em>&ldquo;more extreme scenario&rdquo;</em> involving<em> &ldquo;a hypothetical escalation of the energy crisis in Europe&rdquo;</em> and a deficit in gas, as well as in electricity supplies. In this case, &ldquo;<em>mitigation strategies</em>&rdquo; are expected to be launched, including dispatching<em> &ldquo;the retained coal units.&rdquo;</em></p>\n<p>ESO head John Pettigrew also revealed a worst-case scenario: If the weather turns extremely cold and if gas supplies to feed power stations are insufficient, the company will have to switch off gas and electricity in parts of the country for a few hours at a time.</p>",
  "enclosure": "",
  "pubDate": "Tue, 01 Nov 2022 19:16:51 +0000",
  "dc:creator": "RT"
}