{
  "title": "DHA: End-to-End Joint Optimization of Data Augmentation Policy, Hyper-parameter and Architecture. (arXiv:2109.05765v2 [cs.LG] UPDATED)",
  "link": "http://arxiv.org/abs/2109.05765",
  "description": "<p>Automated machine learning (AutoML) usually involves several crucial\ncomponents, such as Data Augmentation (DA) policy, Hyper-Parameter Optimization\n(HPO), and Neural Architecture Search (NAS). Although many strategies have been\ndeveloped for automating these components in separation, joint optimization of\nthese components remains challenging due to the largely increased search\ndimension and the variant input types of each component. In parallel to this,\nthe common practice of searching for the optimal architecture first and then\nretraining it before deployment in NAS often suffers from low performance\ncorrelation between the searching and retraining stages. An end-to-end solution\nthat integrates the AutoML components and returns a ready-to-use model at the\nend of the search is desirable. In view of these, we propose DHA, which\nachieves joint optimization of Data augmentation policy, Hyper-parameter and\nArchitecture. Specifically, end-to-end NAS is achieved in a differentiable\nmanner by optimizing a compressed lower-dimensional feature space, while DA\npolicy and HPO are regarded as dynamic schedulers, which adapt themselves to\nthe update of network parameters and network architecture at the same time.\nExperiments show that DHA achieves state-of-the-art (SOTA) results on various\ndatasets and search spaces. To the best of our knowledge, we are the first to\nefficiently and jointly optimize DA policy, NAS, and HPO in an end-to-end\nmanner without retraining.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zhou_K/0/1/0/all/0/1\">Kaichen Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hong_L/0/1/0/all/0/1\">Lanqing Hong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hu_S/0/1/0/all/0/1\">Shoukang Hu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_F/0/1/0/all/0/1\">Fengwei Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ru_B/0/1/0/all/0/1\">Binxin Ru</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Feng_J/0/1/0/all/0/1\">Jiashi Feng</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Li_Z/0/1/0/all/0/1\">Zhenguo Li</a>"
}