{
  "title": "Malaysian fleet fuel expense management startup BayaPay raises funding",
  "link": "https://e27.co/malaysian-fleet-fuel-expense-management-startup-bayapay-raises-funding-20221027/",
  "dc:creator": "Sainul",
  "pubDate": "Thu, 27 Oct 2022 08:21:00 +0000",
  "category": [
    "Fintech",
    "Investments",
    "Malaysia",
    "BayaPay",
    "pitchIN",
    "Winacore Capital"
  ],
  "guid": "https://e27.co/?p=475119",
  "description": "<p>Early-stage VC firm Winacore Capital has announced an undisclosed financial investment into BayaPay, a fleet fuel expense management startup in Malaysia. The firm provides BayaFuel, a card that enables businesses to make secure payments within set limits and controls across all fleet-related expense management, such as fuel, travel, lodging, repairs, maintenance, road tax, insurance, tolls, and [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/malaysian-fleet-fuel-expense-management-startup-bayapay-raises-funding-20221027/\">Malaysian fleet fuel expense management startup BayaPay raises funding</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n",
  "content:encoded": "<div id=\"attachment_475167\" style=\"width: 700px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-475167\" loading=\"lazy\" class=\"size-full wp-image-475167\" src=\"https://e27.co/wp-content/uploads/2022/10/Bayapay_funding_news.png\" alt=\"\" width=\"690\" height=\"387\" /><p id=\"caption-attachment-475167\" class=\"wp-caption-text\">Winacore Capital Founder and Investment Director Ashwin Chockalingam with Bayapay Founder and CEO KK Low (R) </p></div>\n<p>Early-stage VC firm Winacore Capital has announced an undisclosed financial investment into BayaPay, a fleet fuel expense management startup in Malaysia.</p>\n<p>The firm provides <a rel=\"follow\" href=\"https://www.bayapay.com/\">BayaFuel</a>, a card that enables businesses to make secure payments within set limits and controls across all fleet-related expense management, such as fuel, travel, lodging, repairs, maintenance, road tax, insurance, tolls, and parking.</p>\n<p>Using BayaFuel, commercial vehicle operators can save at least 20 per cent in fuel costs, the fintech startup claimed.</p>\n<p>The fintech startup will soon launch the next-generation fleet fuel payment and expense management solution BayaFuel cards. It is a programmable SME payment card with credit facilities to pay for fuel and fleet-related expenses.</p>\n<p><strong>Also Read: <a rel=\"follow\" href=\"https://e27.co/how-iprice-navigates-the-seven-seas-20221025/\">How iPrice Group navigates the seven SEAs</a></strong></p>\n<p>BayaPay is currently pre-live on pitchIN to raise funds of up to RM3 million (US$635,000). Within a week of the campaign launch, BayaPay said it has received pledges surpassing its minimum fundraising target of RM500,000.</p>\n<p>BayaPay hopes to close out the funding round by November 2022.</p>\n<p>The company will use the funds to complete and launch the go-to-market fleet fuel payment card, expected by Q1 2023, to build traction in the market and structure credit funding.</p>\n<p>Winacore Capital is a seed and debt fund with the primary goal of investing in and supporting Malaysian startups.</p>\n<p>&#8212;</p>\n<p><a rel=\"follow\" href=\"https://e27.co/echelon/asia/\" target=\"_blank\" rel=\"noopener\">Echelon 2022</a> is happening from 27-28 October at Resorts World Sentosa in Singapore!</p>\n<p>The post <a rel=\"nofollow\" href=\"https://e27.co/malaysian-fleet-fuel-expense-management-startup-bayapay-raises-funding-20221027/\">Malaysian fleet fuel expense management startup BayaPay raises funding</a> appeared first on <a rel=\"nofollow\" href=\"https://e27.co\">e27</a>.</p>\n"
}