{
  "title": "Using Machine Learning to Predict Value of Homes On Airbnb",
  "link": "https://medium.com/airbnb-engineering/using-machine-learning-to-predict-value-of-homes-on-airbnb-9272d3d4739d?source=rss-c00b242128fe------2",
  "guid": "https://medium.com/p/9272d3d4739d",
  "category": [
    "ai",
    "data-science",
    "machine-learning",
    "technology",
    "artificial-intelligence"
  ],
  "dc:creator": "Robert Chang",
  "pubDate": "Mon, 17 Jul 2017 15:01:01 GMT",
  "atom:updated": "2017-07-17T16:07:24.185Z",
  "content:encoded": "<p>by <a href=\"https://twitter.com/_rchang\">Robert Chang</a></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*jdUbWGwyIyJJ4wlr1FaSqA.png\" /><figcaption><strong>Amazing view from a Airbnb Home in Imerovigli, Egeo, Greece</strong></figcaption></figure><h3>Introduction</h3><p>Data products have always been an instrumental part of Airbnb’s service. However, we have long recognized that it’s costly to make data products. For example, personalized search ranking enables guests to more easily discover homes, and smart pricing allows hosts to set more competitive prices according to supply and demand. However, these projects each required a lot of dedicated data science and engineering time and effort.</p><p>Recently, advances in Airbnb’s machine learning infrastructure have lowered the cost significantly to deploy new machine learning models to production. For example, our ML Infra team built a general feature repository that allows users to leverage high quality, vetted, reusable features in their models. Data scientists have started to incorporate several AutoML tools into their workflows to speed up model selection and performance benchmarking. Additionally, ML infra created a new framework that will automatically translate Jupyter notebooks into Airflow pipelines.</p><p>In this post, I will describe how these tools worked together to expedite the modeling process and hence lower the overall development costs for a specific use case of LTV modeling — predicting the value of homes on Airbnb.</p><h3>What Is LTV?</h3><p>Customer Lifetime Value (LTV), a popular concept among e-commerce and marketplace companies, captures the projected value of a user for a fixed time horizon, often measured in dollar terms.</p><p>At e-commerce companies like Spotify or Netflix, LTV is often used to make pricing decisions like setting subscription fees. At marketplace companies like Airbnb, knowing users’ LTVs enable us to allocate budget across different marketing channels more efficiently, calculate more precise bidding prices for online marketing based on keywords, and create better listing segments.</p><p>While one can use past data to <a href=\"https://medium.com/swlh/diligence-at-social-capital-part-3-cohorts-and-revenue-ltv-ab65a07464e1\">calculate the historical value</a> of existing listings, we took one step further to predict LTV of new listings using machine learning.</p><h3>Machine Learning Workflow For LTV Modeling</h3><p>Data scientists are typically accustomed to machine learning related tasks such as feature engineering, prototyping, and model selection. However, taking a model prototype to production often requires an orthogonal set of data engineering skills that data scientists might not be familiar with.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*zT1gNPErRqizxlngxXCtBA.png\" /></figure><p>Luckily, At Airbnb we have machine learning tools that abstract away the engineering work behind productionizing ML models. In fact, we could not have put our model into production without these amazing tools. The remainder of this post is organized into four topics, along with the tools we used to tackle each task:</p><ul><li><strong>Feature Engineering: </strong>Define relevant features</li><li><strong>Prototyping and Training: </strong>Train a model prototype</li><li><strong>Model Selection & Validation: </strong>Perform model selection and tuning</li><li><strong>Productionization: </strong>Take the selected model prototype to production</li></ul><h3>Feature Engineering</h3><blockquote><strong>Tool used: Airbnb’s internal feature repository — Zipline</strong></blockquote><p>One of the first steps of any supervised machine learning project is to define relevant features that are correlated with the chosen outcome variable, a process called feature engineering. For example, in predicting LTV, one might compute the percentage of the next 180 calendar dates that a listing is available or a listing’s price relative to comparable listings in the same market.</p><p>At Airbnb, feature engineering often means writing Hive queries to create features from scratch. However, this work is tedious and time consuming as it requires specific domain knowledge and business logic, which means the feature pipelines are often not easily sharable or even reusable. To make this work more scalable, we developed <strong>Zipline</strong> — a training feature repository that provides features at different levels of granularity, such as at the host, guest, listing, or market level.</p><p>The <strong>crowdsourced </strong>nature of this internal tool allows data scientists to use a wide variety of high quality, vetted features that others have prepared for past projects. If a desired feature is not available, a user can create her own feature with a feature configuration file like the following:</p><iframe src=\"\" width=\"0\" height=\"0\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/1f3554953c0e2a0407f09bedab11809c/href\">https://medium.com/media/1f3554953c0e2a0407f09bedab11809c/href</a></iframe><p>When multiple features are required for the construction of a training set, Zipline will automatically perform intelligent key joins and backfill the training dataset behind the scenes. For the listing LTV model, we used existing Zipline features and also added a handful of our own. In sum, there were over 150 features in our model, including:</p><ul><li><strong>Location</strong>: country, market, neighborhood and various geography features</li><li><strong>Price</strong>: nightly rate, cleaning fees, price point relative to similar listings</li><li><strong>Availability</strong>: Total nights available, % of nights manually blocked</li><li><strong>Bookability</strong>: Number of bookings or nights booked in the past X days</li><li><strong>Quality</strong>: Review scores, number of reviews, and amenities</li></ul><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*KYs7WNNfdwKmKcVbgKGkiw.png\" /><figcaption>A example training dataset</figcaption></figure><p>With our features and outcome variable defined, we can now train a model to learn from our historical data.</p><h3>Prototyping and Training</h3><blockquote><strong>Tool used: Machine learning Library in Python — </strong><a href=\"http://scikit-learn.org/stable/\"><strong>scikit-learn</strong></a></blockquote><p>As in the example training dataset above, we often need to perform additional data processing before we can fit a model:</p><ul><li><strong>Data Imputation:</strong> We need to check if any data is missing, and whether that data is missing at random. If not, we need to investigate why and understand the root cause. If yes, we should impute the missing values.</li><li><strong>Encoding Categorical Variables</strong>: Often we cannot use the raw categories in the model, since the model doesn’t know how to fit on strings. When the number of categories is low, we may consider using <a href=\"http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.OneHotEncoder.html\">one-hot encoding</a>. However, when the cardinality is high, we might consider using <a href=\"https://www.kaggle.com/general/16927\">ordinal encoding</a>, encoding by frequency count of each category.</li></ul><p>In this step, we don’t quite know what is the best set of features to use, so writing code that allows us to rapidly iterate is essential. The pipeline construct, commonly available in open-source tools like <a href=\"http://scikit-learn.org/stable/modules/generated/sklearn.pipeline.Pipeline.html\">Scikit-Learn</a> and <a href=\"https://spark.apache.org/docs/latest/ml-pipeline.html\">Spark</a>, is a very convenient tool for prototyping. Pipelines allow data scientists to specify high-level blueprints that describe how features should be transformed, and which models to train. To make it more concrete, below is a code snippet from our LTV model pipeline:</p><iframe src=\"\" width=\"0\" height=\"0\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/d2b3f53345ad62b5d96a60928da274ab/href\">https://medium.com/media/d2b3f53345ad62b5d96a60928da274ab/href</a></iframe><p>At a high level, we use pipelines to specify data transformations for different types of features, depending on whether those features are of type binary, categorical, or numeric. <a href=\"http://scikit-learn.org/stable/modules/generated/sklearn.pipeline.FeatureUnion.html\">FeatureUnion</a> at the end simply combines the features column-wise to create the final training dataset.</p><p>The advantage of writing prototypes with pipelines is that it abstracts away tedious data transformations using <a href=\"http://scikit-learn.org/stable/data_transforms.html\">data transforms</a>. Collectively, these transforms ensure that data will be transformed consistently across training and scoring, which solves a common problem of data transformation inconsistency when translating a prototype into production.</p><p>Furthermore, pipelines also separates data transformations from model fitting. While not shown in the code above, data scientists can add a final step to specify an <a href=\"http://scikit-learn.org/stable/tutorial/machine_learning_map/index.html\">estimator</a> for model fitting. By exploring different estimators, data scientists can perform model selection to pick the best model to improve the model’s out of sample error.</p><h3>Performing Model Selection</h3><blockquote><strong>Tool used: Various </strong><a href=\"https://medium.com/airbnb-engineering/automated-machine-learning-a-paradigm-shift-that-accelerates-data-scientist-productivity-airbnb-f1f8a10d61f8\"><strong>AutoML</strong></a><strong> frameworks</strong></blockquote><p>As mentioned in the previous section, we need to decide which candidate model is the best to put into production. To make such a decision, we need to weigh the tradeoffs between model interpretability and model complexity. For example, a sparse linear model might be very interpretable but not complex enough to generalize well. A tree based model might be flexible enough to capture non-linear patterns but not very interpretable. This is known as the <a href=\"http://scott.fortmann-roe.com/docs/BiasVariance.html\"><strong>Bias-Variance tradeoff</strong></a>.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*tQbBEq6T8ZJ9lFSCbZKFqw.png\" /><figcaption>Figure referenced from Introduction to Statistical Learning with R by James, Witten, Hastie, and Tibshirani</figcaption></figure><p>In applications such as insurance or credit screening, a model needs to be interpretable because it’s important for the model to avoid inadvertently discriminating against certain customers. In applications such as image classification, however, it is much more important to have a performant classifier than an interpretable model.</p><p>Given that model selection can be quite time consuming, we experimented with using various <a href=\"https://medium.com/airbnb-engineering/automated-machine-learning-a-paradigm-shift-that-accelerates-data-scientist-productivity-airbnb-f1f8a10d61f8\">AutoML</a> tools to speed up the process. By exploring a wide variety of models, we found which types of models tended to perform best. For example, we learned that <a href=\"https://github.com/dmlc/xgboost\">eXtreme gradient boosted trees</a> (XGBoost) significantly outperformed benchmark models such as mean response models, ridge regression models, and single decision trees.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*y1O7nIxCFmgQamCfsrWfjA.png\" /><figcaption>Comparing RMSE allows us to perform model selection</figcaption></figure><p>Given that our primary goal was to predict listing values, we felt comfortable productionizing our final model using XGBoost, which favors flexibility over interpretability.</p><h3>Taking Model Prototypes to Production</h3><blockquote><strong>Tool used: Airbnb’s notebook translation framework — ML Automator</strong></blockquote><p>As we alluded to earlier, building a production pipeline is quite different from building a prototype on a local laptop. For example, how can we perform periodic re-training? How do we score a large number of examples efficiently? How do we build a pipeline to monitor model performance over time?</p><p>At Airbnb, we built a framework called <strong>ML Automator </strong>that automagically translates a Jupyter notebook into an <a href=\"https://medium.com/airbnb-engineering/airflow-a-workflow-management-platform-46318b977fd8\">Airflow</a> machine learning pipeline. This framework is designed specifically for data scientists who are already familiar with writing prototypes in Python, and want to take their model to production with limited experience in data engineering.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*uLCH5Ozfj8mM07bKXIg20Q.png\" /><figcaption>A simplified overview of the ML Automator Framework (photo credit: Aaron Keys)</figcaption></figure><ul><li>First, the framework requires a user to specify a model config in the notebook. The purpose of this model config is to tell the framework where to locate the training table, how many compute resources to allocate for training, and how scores will be computed.</li><li>Additionally, data scientists are required to write specific <em>fit </em>and <em>transform </em>functions. The fit function specifies how training will be done exactly, and the transform function will be wrapped as a Python UDF for distributed scoring (if needed).</li></ul><p>Here is a code snippet demonstrating how the <em>fit</em> and <em>transform</em> functions are defined in our LTV model. The fit function tells the framework that a XGBoost model will be trained, and that data transformations will be carried out according to the pipeline we defined previously.</p><iframe src=\"\" width=\"0\" height=\"0\" frameborder=\"0\" scrolling=\"no\"><a href=\"https://medium.com/media/8b3a79196e49776cf3c4c5f059dba07f/href\">https://medium.com/media/8b3a79196e49776cf3c4c5f059dba07f/href</a></iframe><p>Once the notebook is merged, ML Automator will wrap the trained model inside a <a href=\"http://www.florianwilhelm.info/2016/10/python_udf_in_hive/\">Python UDF</a> and create an <a href=\"https://airflow.incubator.apache.org/\">Airflow</a> pipeline like the one below. Data engineering tasks such as data serialization, scheduling of periodic re-training, and distributed scoring are all encapsulated as a part of this daily batch job. As a result, this framework significantly lowers the cost of model development for data scientists, as if there was a dedicated data engineer working alongside the data scientists to take the model into production!</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*DvPE_V_SoHV3pikOqiZxsg.png\" /><figcaption>A graph view of our LTV Airflow DAG, running in production</figcaption></figure><p><strong>Note:</strong> <em>Beyond productionization, there are other topics, such as tracking model performance over time or leveraging elastic compute environment for modeling, which we will not cover in this post. Rest assured, these are all active areas under development.</em></p><h3>Lessons Learned & Looking Ahead</h3><p>In the past few months, data scientists have partnered very closely with ML Infra, and many great patterns and ideas arose out of this collaboration. In fact, we believe that these tools will unlock a new paradigm for how to develop machine learning models at Airbnb.</p><ul><li><strong>First, the cost of model development is significantly lower</strong>: by combining disparate strengths from individual tools: Zipline for feature engineering, Pipeline for model prototyping, AutoML for model selection and benchmarking, and finally ML Automator for productionization, we have shortened the development cycle tremendously.</li><li><strong>Second, the notebook driven design reduces barrier to entry</strong>: data scientists who are not familiar with the framework have immediate access to a plethora of real life examples. Notebooks used in production are guaranteed to be correct, self-documenting, and up-to-date. This design drives strong adoption from new users.</li><li><strong>As a result, teams are more willing to invest in ML product ideas</strong>: At the time of this post’s writing, we have several other teams exploring ML product ideas by following a similar approach: prioritizing the listing inspection queue, predicting the likelihood that listings will add cohosts, and automating flagging of low quality listings.</li></ul><p>We are very excited about the future of this framework and the new paradigm it brought along. By bridging the gap between prototyping and productionization, we can truly enable data scientists and engineers to pursue end-to-end machine learning projects and make our product better.</p><p><em>Want to use or build these ML tools? We’re always looking for </em><a href=\"https://www.airbnb.com/careers/departments/data-science-analytics\"><em>talented people to join our Data Science and Analytics team</em></a><em>!</em></p><p><em>Special thanks to members of Data Science & ML Infra team who were involved in this work: </em><a href=\"https://www.linkedin.com/in/aaronkeys/\"><em>Aaron Keys</em></a><em>, </em><a href=\"https://www.linkedin.com/in/brad-hunter-497621a/\"><em>Brad Hunter</em></a><em>, </em><a href=\"https://www.linkedin.com/in/hamelhusain/\"><em>Hamel Husain</em></a><em>, </em><a href=\"https://www.linkedin.com/in/jiaying-shi-a2142733/\"><em>Jiaying Shi</em></a><em>, </em><a href=\"https://www.linkedin.com/in/krishnaputtaswamy/\"><em>Krishna Puttaswamy</em></a><em>, </em><a href=\"https://www.linkedin.com/in/michael-m-a37b1932/\"><em>Michael Musson</em></a><em>, </em><a href=\"https://www.linkedin.com/in/nicholashandel/\"><em>Nick Handel</em></a><em>, </em><a href=\"https://www.linkedin.com/in/vzanoyan/\"><em>Varant Zanoyan</em></a><em>, </em><a href=\"https://www.linkedin.com/in/vquoss/\"><em>Vaughn Quoss</em></a><em> et al. Additional thanks to </em><a href=\"https://www.linkedin.com/in/thegarytang/\"><em>Gary Tang</em></a><em>, </em><a href=\"https://medium.com/@jasonkgoodman\"><em>Jason Goodman</em></a><em>, </em><a href=\"https://twitter.com/jtfeng\"><em>Jeff Feng</em></a><em>, </em><a href=\"https://medium.com/@lpettingill\"><em>Lindsay Pettingill</em></a><em> for reviewing this blog post.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=9272d3d4739d\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/airbnb-engineering/using-machine-learning-to-predict-value-of-homes-on-airbnb-9272d3d4739d\">Using Machine Learning to Predict Value of Homes On Airbnb</a> was originally published in <a href=\"https://medium.com/airbnb-engineering\">The Airbnb Tech Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}