{
  "title": "TU125 &#8211; Dan Siegel &#038; Tina Payne-Bryson: Parenting Under Stress",
  "link": "https://therapistuncensored.com/episodes/tu125-parenting-under-stress-dan-siegel-tina-payne-bryson/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu125-parenting-under-stress-dan-siegel-tina-payne-bryson",
  "pubDate": "Fri, 10 Jul 2020 21:44:26 +0000",
  "guid": "https://therapistuncensored.com/?p=10646",
  "description": "We’re all struggling with some uncertainty and fear right now, and as a parent it can often be especially hard to know how to raise a child during the rise of Coronavirus. Learn the cheat code to parenting in a pandemic with Dr. Dan Siegel and Dr. Tina Bryson as they join co-host Sue Marriott to unpack their new book The Power of Showing Up. In this episode they break down the science behind attachment in parenting, and share what it means to show up. Applicable not just with children but in all relationships, their four pillars of attachment can change the way we relate to ourselves, and each other, for the better.",
  "enclosure": "",
  "itunes:subtitle": "Learn the cheat-code to parenting in a pandemic by using the science of attachment and interpersonal neurobiology with expert guests and the father of IPNB Dan Siegell.",
  "itunes:summary": "Learn the cheat code to parenting in a pandemic with Dr. Dan Siegel and Dr. Tina Payne-Bryson.  We’re all struggling with some uncertainty and fear right now, and as a parent it can often be especially hard to know how to raise a child during the rise of Coronavirus. Join co-host Sue Marriott and expert guests Siegel and Payne-Bryson to unpack their new book The Power of Showing Up. In this episode they use interpersonal neurobiology to break down the science of attachment, and share what it means to show up. Applicable not just to those with children but in all relationships, their four legs of promoting secure attachment can change the way we relate to ourselves, and each other, for the better.<br />\n<br />\nLearn more about real-life application of IPNB and the relational sciences in general by visiting us at TherapistUncensored.com",
  "itunes:author": "Sue Marriott, Dan Siegel, Tina Payne-Bryson",
  "itunes:image": "",
  "itunes:season": 4,
  "itunes:episode": 125,
  "itunes:title": "Parenting Under Stress with Dan Siegel and Tina Payne-Bryson",
  "itunes:duration": "1:23:02"
}