{
  "title": "How Scrolla is making news more accessible to South Africans",
  "link": "https://blog.google/outreach-initiatives/google-news-initiative/how-scrolla-is-making-news-more-accessible-to-south-africans/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"3bxjn\"><b><i>Editor’s note from Ludovic Blecher, Head of Google News Initiative Innovation:</i></b><i>The</i> <a href=\"https://newsinitiative.withgoogle.com/innovation-challenges\"><i>GNI Innovation Challenge</i></a><i>program, is designed to stimulate forward-thinking ideas for the news industry. The story below by Mungo Soggot, CEO of Scrolla, is part of an</i> <a href=\"https://blog.google/outreach-initiatives/google-news-initiative/newsroom-stories-gni-innovation-challenge/\"><i>innovator series</i></a><i>sharing inspiring stories and lessons from funded projects.</i><br/><br/> The costs associated with paying for mobile phone data in many African countries are often incredibly high, making it prohibitive for lower income readers to access news. As our mission is to bring high quality news on mobile phones to underserved communities, we set out to create a new product for <a href=\"https://scrolla.africa/\">Scrolla.Africa</a> which is light on data use. The new platform is called <a href=\"https://lite.scrolla.africa/\">Scrolla Data Lite</a>.</p><p data-block-key=\"fb4k4\">Our core readers are pay-as-you-go mobile users, who make up about 75% of the market in South Africa. We found that people on these expensive pay-as-you-go data services were extremely cautious about downloading anything or surfing online. So beyond using data for messaging services, the idea of browsing on mobiles for news is regarded as a privilege.</p><p data-block-key=\"3r7pm\">As a mobile-only investigative and political reporting outlet, we were operating on a shoestring budget when we launched, so the data use issue was not something we had the technical capacity to address. We decided it had to wait until we had evolved the prototype and our editorial colleagues — Everson Luhanga and Phillip van Niekerk — had established Scrolla’s editorial ethos.</p><p data-block-key=\"4nv1r\">Our big break came when we were selected for the Google News Initiative <a href=\"https://newsinitiative.withgoogle.com/innovation-challenges/selected-projects/?region=middle-east-africa-turkey\">Innovation Challenge for the Middle East, Turkey and Africa</a> in 2021. We had a rough outline of how we would design a separate “Data Lite” site, which we used as the basis for our application. The Data Lite site doesn’t contain video or audio, and has stripped back features allowing for faster scrolling. The goals were to compress stories and images as much as possible and to automate the process so that our small team didn’t have to learn a new Content Management System (CMS). As a recipient of funding, we could build a Data Lite site far quicker and better than would have otherwise been possible, and bring in external engineering expertise to design the new platform.</p><p data-block-key=\"1uf54\">The site ended up saving readers 90% on the data costs of our “full fat” site, when we compare the 100 kilobytes on page downloads on Data Lite to our usual 1 megabyte. And this meant the Data Lite site gave us about a sixfold increase in traffic compared with the full data site. We couldn’t use video or audio on the new Data Lite site, which remains its only drawback. When it came to images, we gave the editorial team strict guidelines to minimize data use without compromising user experience. This left room for error, so we then built in additional automated safeguards which ensured that uploaded images didn’t risk leaving readers with a spike in data costs.</p><p data-block-key=\"3qppi\">Alongside data costs, language is an additional barrier in South Africa, so we publish in Zulu as well as English. Crucially, the GNI funding allowed us to design a system where we could include our Zulu content, together with English (a second language in South Africa), on one platform. The site had to be super easy to navigate and allow users to toggle between English and Zulu.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image__is-caption h-c-grid__col-l--6 h-c-grid__col--8 h-c-grid__col-l--offset-3 h-c-grid__col--offset-2\"><a class=\"article-image--link\"><img alt=\"Picture shows a screen grab from the Zulu language mobile phone app.\" class=\"article-image--large\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Scrolla_Data_Lite_Zulu_1.max-500x500.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Scrolla_Data_Lite_Zulu_1.max-1000x1000.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Scrolla_Data_Lite_Zulu_1.max-100x100.jpg \" tabindex=\"0\"/></a></div><figcaption class=\"article-image__caption article-image__is-caption-image h-c-grid__col--8 h-c-grid__col--offset-2 h-c-grid__col-l--6 h-c-grid__col-l--offset-3\"><div class=\"rich-text\"><p data-block-key=\"6bkd7\">A screengrab of the Scrolla app featuring the Zulu language.</p></div></figcaption></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"3bxjn\">The biggest lesson we learned is it’s impossible to underestimate what a big deal these data costs are: to the extent that many readers are wary of downloading apps or touching the sort of advertisements which typically require a lot of data such as those with video. The GNI enabled us to build the site, and we're open to sharing the technology with other like-minded publications in Africa and beyond.</p></div></div></body></html>",
  "pubDate": "Mon, 31 Oct 2022 08:00:00 +0000",
  "guid": "https://blog.google/outreach-initiatives/google-news-initiative/how-scrolla-is-making-news-more-accessible-to-south-africans/",
  "category": [
    "Google News Initiative",
    "Google in Africa"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How Scrolla is making news more accessible to South Africans",
    "description": "News innovator Scrolla built a ‘Data Lite’ site to make it less expensive for people to access news in South Africa.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/scrolla_iGPwS2n.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/outreach-initiatives/google-news-initiative/how-scrolla-is-making-news-more-accessible-to-south-africans/"
  },
  "author": {
    "name": "Mungo Soggot",
    "title": "CEO of Scrolla",
    "department": "",
    "company": ""
  }
}