{
  "title": "Agile Web Mining at Bing",
  "link": "https://datamining.typepad.com/data_mining/2015/10/agile-web-mining-at-bing.html",
  "description": "The web search industry is making great progress in transitioning from building tools for finding pages and sites to building tools that leverage and surface facts and knowledge. The local search space - where I work in Bing - is...",
  "content:encoded": "<p>The web search industry is making great progress in transitioning from&#0160;building tools for finding pages and sites to&#0160;building tools&#0160;that leverage and surface facts and knowledge. The local search space - where I work in Bing - is founded on structured knowledge - the entity data that represents businesses and other things that necessarily have a location, and is a core piece of the knowledge space required for this future.</p>\n<p>Over the past few years, my team has been working on mining the web for information about local entities. This data now&#0160;helps to power&#0160;a significant percentage of&#0160;local search&#0160;interactions in a number of countries around the world.</p>\n<p>As we have been&#0160;working on&#0160;this system, we have come to think deeply about how to build systems for web mining, but&#0160;also how to construct efficient developer workflows and how to&#0160;add&#0160;data management components to these systems to take advantage of human input when appropriate.</p>\n<p>These processes constitute what I term Agile Web Mining, the core principles of which are: optimize for developer productivity, optimize for data management and invest in low latency systems. So much of what we hear about in the industry currently revolves around very large data sets (big data) which often entail long processing times and high latency interactions. In contrast, we tend to think of our data in a different way, where the size of data is relatively small (on the order of the size of a web site), but where there are many examples of these small data sets.</p>\n<p>We are currently growing our team, and so if you are interested in learning more about Agile Web Mining, please get in touch with me.</p>",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2015-10-30T19:35:53-04:00"
}