{
  "title": "#451: Murtlap Milkin' (OOTP 15, The Hogwarts High Inquisitor)",
  "link": "https://audioboom.com/posts/7488741",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4761,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Ember Sirius or Flaming Sirius - our listeners settle the debate!</li>\n<li>Muggle Mail covers Gary Oldman, Hermione, Fred & George's true intentions and more!</li>\n<li>Chapter-by-Chapter continues with Order of the Phoenix - Chapter 15: The Hogwarts High Inquisitor</li>\n<li>7-Word Summary: Umbridge oversees the Hogwarts professors teaching classes</li>\n<li>\n<em>The Daily Prophet</em> announces Umbridge as Hogwarts High Inquisitor! Fair and balanced reporting? YEAH, RIGHT!</li>\n<li>What level of credibility does Percy have to be quoted in <em>The Daily Prophet</em>?</li>\n<li>Are there really THAT MANY concerned parents?</li>\n<li>What were the first 21 Educational Decrees? We offer some our thoughts!</li>\n<li>Umbridge visits each teacher's classroom: Is there not already a system in place to evaluate teachers? Is Umbridge qualified to evaluate these subjects?</li>\n<li>Poor Trelawney!</li>\n<li>Umbridge vs. McGonagall - has Dolores met her match?</li>\n<li>Should Hermione have considered the consequences of her actions in Umbridge's class?</li>\n<li>Harry, Hermione and the birth of Dumbledore’s Army</li>\n<li>The power of self-doubt</li>\n<li>We discuss the importance of Hermione saying Voldemort's name for the first time</li>\n<li>The Umbridge Suck Count climbs to 27!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What does Luna say Fudge’s Army is made of?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n<li>January's Bonus MuggleCast: The hosts sound off on Trelawney's prediction for Professor Umbridge and what would have happened if Harry told McGonagall the truth about his detentions!</li>\n<li>This week's episode is sponsored by Quip, our favorite toothbrush! Get your first refill free by visiting <a href=\"http://www.GetQuip.com/MUGGLE\">GetQuip.com/MUGGLE</a>\n</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 28 Jan 2020 12:00:00 +0000",
  "guid": "tag:audioboom.com,2020-01-27:/posts/7488741",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}