{
  "id": "tag:blogger.com,1999:blog-8698702854482141883.post-4004887547535006338",
  "published": "2022-06-03T09:02:00.001-07:00",
  "updated": "2022-09-06T14:15:45.145-07:00",
  "category": [
    "",
    "",
    "",
    ""
  ],
  "title": "DC-SCM compatible FPGA based open source BMC hardware platform",
  "content": "Open source software is omnipresent in the server and cloud world, and is giving rise to impressive successes in the SaaS space where useful products can be rapidly created from open source components: operating systems, container runtimes, frameworks for device management, monitoring and data pipelining, <a href=\"https://antmicro.com/blog/2021/03/github-actions-self-hosted-runners/\" target=\"_blank\">workload execution</a>, etc.<br /><br />Mirroring this trend in software, cloud providers and users are increasingly looking at building their servers using open source hardware, collaborating in initiatives such as the <a href=\"https://www.opencompute.org/\" target=\"_blank\">Open Compute Project</a> or <a href=\"https://openpowerfoundation.org/\" target=\"_blank\">OpenPOWER</a>.<br /><br />With Google, Antmicro has developed two <a href=\"https://opensource.antmicro.com/projects/artix-dc-scm\" target=\"_blank\">open source hardware FPGA-based Baseboard Management Controller (BMC) platforms</a> compliant with OCP’s DC-SCM ver 1.0 specification to help increase the security, configurability and flexibility of server management and monitoring infrastructure. These have since been adopted by OpenPOWER’s <a href=\"https://openpower.foundation/groups/librebmc/\" target=\"_blank\">LibreBMC workgroup</a> as the base hardware platform.<br /><h2 style=\"text-align: left;\">The DC-SCM spec</h2>The <a href=\"https://www.opencompute.org/documents/ocp-dc-scm-spec-rev-1-0-pdf\" target=\"_blank\">Datacenter-ready Secure Control Module (DC-SCM) specification</a> aims to move common server management, security and control features from a typical motherboard into a module designed in a normalized form factor, which can be used across various datacenter platforms.<br /><br />Currently rolling out in first DC-SCM compliant servers, the spec will help Cloud providers share costs, risks and increase reuse for the critical BMC component. Coupled with a fully open source implementation based on popular, inexpensive FPGA platforms will not only allow for more configurability and a tighter integration between hardware and software, but also tap into the momentum behind the broader open source hardware community via groups like <a href=\"https://chipsalliance.org/\" target=\"_blank\">CHIPS Alliance</a>, <a href=\"https://openpowerfoundation.org/\" target=\"_blank\">OpenPOWER</a> and <a href=\"https://riscv.org/\" target=\"_blank\">RISC-V</a>.<div><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgLiU-C4oM8yw7mWdwLNotlk09COx_4ycHoap77mkDz9UVIGFALcQ0zfMcO289AECEu1UBydVes2FFwG0o9JweMxfxBIQGlTUd2ECLQyGMafi3EguXopcFdPs8_VJVTObFftmEKk9y8AYnsNC1vxFpFSHMsv7nQfkg3VyDfKBd4j-QRTNFfSLIWFRb5/s512/GOS%20BLog%20Asset%201.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"288\" data-original-width=\"512\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgLiU-C4oM8yw7mWdwLNotlk09COx_4ycHoap77mkDz9UVIGFALcQ0zfMcO289AECEu1UBydVes2FFwG0o9JweMxfxBIQGlTUd2ECLQyGMafi3EguXopcFdPs8_VJVTObFftmEKk9y8AYnsNC1vxFpFSHMsv7nQfkg3VyDfKBd4j-QRTNFfSLIWFRb5/s16000/GOS%20BLog%20Asset%201.png\" /></a></div><div><h2 style=\"text-align: left;\">The hardware</h2>Antmicro has developed two implementations of the DC-SCM-compatible BMC. Both designs meet the Open Compute Project specification for a Horizontal Form Factor 90x120 mm DC-SCM ver 1.0.<div><br />The BMCs role is central to the server’s faultless operation, responsible for monitoring the system while preventing and mitigating failures. Essentially, acting as an external watchdog.<br /><br />To be able to provide this functionality, according to the requirements, the module offers a feature-packed Secure Control Interface for communication with the host platform, including:<br /><ul style=\"text-align: left;\"><li>PCI Express</li><li>USB</li><li>QSPI</li><li>SGPIO</li><li>NCSI</li><li>multiple I2C, I3C and UART channels</li></ul>The unique property of Antmicro’s implementation of the standard is merging DC-SCM’s central Baseband Management Controller and the usual programmable SCM CPLD block into one powerful FPGA. This solution was chosen to enable a greater flexibility of the design, allowing remote updates of DC-SCM peripherals, and most notably, placing OpenPOWER or RISC-V IP cores as central processing units of the module.<br /><br />One of our designs is based on <a href=\"https://opensource.antmicro.com/projects/artix-dc-scm\" target=\"_blank\">Xilinx Artix-7</a>, whereas <a href=\"https://opensource.antmicro.com/projects/ecp5-dc-scm\" target=\"_blank\">the other one features a Lattice ECP5</a> - both low-cost and open source friendly FPGAs supported by the open source <a href=\"http://f4pga.org\" target=\"_blank\">F4PGA toolchain project</a>.<br /><br />The FPGA is complemented by 512MB of DDR3 memory, 16GB of eMMC flash, as well as a dedicated Gigabit-Ethernet interface. To ensure the security of the Datacenter Control Module, external cryptographic modules: Root of Trust (RoT) and Trusted Platform Module (TPM) can be connected. This will allow future integration with e.g. open hardware Root of Trust projects such as <a href=\"https://opentitan.org/\" target=\"_blank\">OpenTitan</a> and implementing various boot flow and authentication approaches.<br /><h2 style=\"text-align: left;\">Use in LibreBMC / OpenPOWER</h2>Open source, configurable hardware platforms based on FPGA, open tooling and standards can make BMC more flexible for tomorrow's challenges. Antmicro’s DC-SCM boards have been adopted by the <a href=\"https://openpowerfoundation.org/openpower-foundation-announces-librebmc-a-power-based-fully-open-source-bmc/\" target=\"_blank\">LibreBMC Workgroup</a>, operating under the umbrella of the OpenPOWER Foundation, in a push to build a complete, fully transparent BMC solution. The workgroup, with participation from IBM, Google and Antmicro, among others, will be involved with creating FPGA gateware and software needed to make the hardware fully operational in real-world server solutions.<br /><br />Variants involving both Linux (in its default open source BMC- distribution, <a href=\"https://github.com/openbmc/openbmc\" target=\"_blank\">OpenBMC</a>), and Zephyr RTOS, as well as with both POWER and RISC-V cores are planned and thanks to the flexibility of FPGA all of those options will be just one gateware update away. Of course, both the gateware and software will be open source as well.<br /><br />If you’re looking to develop a secure and transparent DC-SCM spec-compatible BMC solution, reach out to <a href=\"mailto:contact@antmicro.com\" target=\"_blank\">contact@antmicro.com</a>. See how you can collaborate with partners such as Antmicro, Google, and IBM around the open source FPGA-based hardware platform.<br /><br /><i>By Peter Katarzynski – Antmicro</i><div><span id=\"docs-internal-guid-197af61e-7fff-35e8-f1ac-4c315fd0a0fd\"><div><span style=\"font-family: Arial; font-size: 11pt; font-style: italic; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><br /></span></div></span></div></div></div>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Open Source Programs Office",
    "uri": "http://www.blogger.com/profile/11192158996903493674",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}