{
  "title": "Carlos Alberto Sánchez, \"A Sense of Brutality: Philosophy after Narco-culture\" (2020)",
  "description": "La cultura popular contemporánea está repleta de referencias a cárteles mexicanos, narcos y tráfico de drogas. En los Estados Unidos, documentalistas, periodistas, académicos y políticos han tomado nota de las crecientes amenazas a la seguridad provenientes de una subcultura que parece alimentarse de los asesinatos y la brutalidad, al tiempo que se alimenta de la romantización del poder y el dinero. Carlos Alberto Sánchez utiliza la narco-cultura mexicana como punto de partida para pensar la naturaleza y los límites de la violencia, la cultura y el ser. A Sense of Brutality. Philosophy after Narco-culture argumenta que las modalidades culturales violentas, de las que la narco-cultura es sólo una, hace que nos preguntemos sobre nuestro entendimiento de \"violencia\" como concepto. La realidad de la narco-violencia sugiere que el término en sí mismo no es suficiente para capturarla, que necesitamos pensar nuevamente y reconceptualizar, por lo que se propone usar \"brutalidad\" como un concepto que captura esta realidad de forma más adecuada. La brutalidad es más que la violencia, diferente de la crueldad y distinta del horror y el terror --conceptos se usan indistintamente, pero que, como el análisis sugiere, no son iguales. En la narco-cultura, la normalización de la brutalidad en la vida cotidiana es una condición que permite la que la despersonalización y la eliminación absoluta de las personas.\nLibro de acceso abierto. Descarga gratuita en la página de Amherst College Press\nEntrevista por Pamela Fuentes historiadora y editora de New Books Network en español",
  "pubDate": "Fri, 04 Nov 2022 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 1,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "Una entrevista con Carlos Alberto Sánchez",
  "itunes:summary": "La cultura popular contemporánea está repleta de referencias a cárteles mexicanos, narcos y tráfico de drogas. En los Estados Unidos, documentalistas, periodistas, académicos y políticos han tomado nota de las crecientes amenazas a la seguridad provenientes de una subcultura que parece alimentarse de los asesinatos y la brutalidad, al tiempo que se alimenta de la romantización del poder y el dinero. Carlos Alberto Sánchez utiliza la narco-cultura mexicana como punto de partida para pensar la naturaleza y los límites de la violencia, la cultura y el ser. A Sense of Brutality. Philosophy after Narco-culture argumenta que las modalidades culturales violentas, de las que la narco-cultura es sólo una, hace que nos preguntemos sobre nuestro entendimiento de \"violencia\" como concepto. La realidad de la narco-violencia sugiere que el término en sí mismo no es suficiente para capturarla, que necesitamos pensar nuevamente y reconceptualizar, por lo que se propone usar \"brutalidad\" como un concepto que captura esta realidad de forma más adecuada. La brutalidad es más que la violencia, diferente de la crueldad y distinta del horror y el terror --conceptos se usan indistintamente, pero que, como el análisis sugiere, no son iguales. En la narco-cultura, la normalización de la brutalidad en la vida cotidiana es una condición que permite la que la despersonalización y la eliminación absoluta de las personas.\nLibro de acceso abierto. Descarga gratuita en la página de Amherst College Press\nEntrevista por Pamela Fuentes historiadora y editora de New Books Network en español",
  "content:encoded": "<p>La cultura popular contemporánea está repleta de referencias a cárteles mexicanos, narcos y tráfico de drogas. En los Estados Unidos, documentalistas, periodistas, académicos y políticos han tomado nota de las crecientes amenazas a la seguridad provenientes de una subcultura que parece alimentarse de los asesinatos y la brutalidad, al tiempo que se alimenta de la romantización del poder y el dinero. Carlos Alberto Sánchez utiliza la narco-cultura mexicana como punto de partida para pensar la naturaleza y los límites de la violencia, la cultura y el ser. <a href=\"https://www.fulcrum.org/concern/monographs/6h440v48j?locale=en\"><em>A Sense of Brutality. Philosophy after Narco-culture</em></a><em> </em>argumenta que las modalidades culturales violentas, de las que la narco-cultura es sólo una, hace que nos preguntemos sobre nuestro entendimiento de \"violencia\" como concepto. La realidad de la narco-violencia sugiere que el término en sí mismo no es suficiente para capturarla, que necesitamos pensar nuevamente y reconceptualizar, por lo que se propone usar \"brutalidad\" como un concepto que captura esta realidad de forma más adecuada. La brutalidad es más que la violencia, diferente de la crueldad y distinta del horror y el terror --conceptos se usan indistintamente, pero que, como el análisis sugiere, no son iguales. En la narco-cultura, la normalización de la brutalidad en la vida cotidiana es una condición que permite la que la despersonalización y la eliminación absoluta de las personas.</p><p>Libro de acceso abierto. Descarga gratuita en la página de <a href=\"https://acpress.amherst.edu/\">Amherst College Press</a></p><p>Entrevista por Pamela Fuentes historiadora y editora de <a href=\"https://newbooksnetwork.com/es/\">New Books Network en español </a></p>",
  "itunes:duration": 2655,
  "itunes:explicit": "no",
  "guid": "7a433a4a-43e0-11ed-a1a3-0b3a6fd89edc",
  "enclosure": ""
}