{
  "title": "Millionaire Interview 336",
  "link": "https://esimoney.com/millionaire-interview-336/",
  "comments": "https://esimoney.com/millionaire-interview-336/#comments",
  "dc:creator": "ESI",
  "pubDate": "Wed, 19 Oct 2022 09:00:04 +0000",
  "category": [
    "Interviews",
    "Millionaires"
  ],
  "guid": "https://esimoney.com/?p=8743",
  "description": "<p>Here’s our latest interview with a millionaire as we seek to learn from those who have grown their wealth to high heights. If you’d like to be considered for an interview, drop me a note and we can chat about specifics. This interview took place in May. My questions are in bold italics and their [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-336/\">Millionaire Interview 336</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/05/Business-people-at-meeting-new.jpg\"><img class=\"alignleft size-medium wp-image-8744\" src=\"https://esimoney.com/wp-content/uploads/2022/05/Business-people-at-meeting-new-300x240.jpg\" alt=\"\" width=\"300\" height=\"240\" srcset=\"https://esimoney.com/wp-content/uploads/2022/05/Business-people-at-meeting-new-300x240.jpg 300w, https://esimoney.com/wp-content/uploads/2022/05/Business-people-at-meeting-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Here’s our latest <a href=\"https://esimoney.com/category/millionaires/\">interview with a millionaire</a> as we seek to learn from those who have grown their wealth to high heights.</p>\n<p>If you’d like to be considered for an interview, <a href=\"https://esimoney.com/contact/\">drop me a note</a> and we can chat about specifics.</p>\n<p>This interview took place in May.</p>\n<p>My questions are in bold italics and their responses follow in black.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>OVERVIEW</strong></span></h4>\n<p><em><strong>How old are you (and spouse if applicable, plus how long you&#8217;ve been married)?</strong></em></p>\n<p>I am 52 and my wife is 51.</p>\n<p>We have been married for 26 years. (Hard to believe that is half of my life, but it’s definitely been the good half with my better half!)</p>\n<p><em><strong>Do you have kids/family (if so, how old are they)?</strong></em></p>\n<p>We have a daughter that is 22 and a son that is 18.</p>\n<p><em><strong>What area of the country do you live in (and urban or rural)?</strong></em></p>\n<p>We live in the suburbs of a city in the South-Central US.</p>\n<p><em><strong>What is your current net worth?</strong></em></p>\n<p>Our net worth is currently $4.25 million as reported in Personal Capital this morning.</p>\n<p>It’s been a wild ride during the pandemic and with the uncertainty here in 2022 due to global instability and inflation impacts on interest rates and the market.</p>\n<p><em><strong>What are the main assets that make up your net worth (stocks, real estate, business, home, retirement accounts, etc.) and any debt that offsets part of these?</strong></em></p>\n<ul>\n<li>Pre-Tax Retirement Accounts &#8211; value is $1.55M. Most of this is in a traditional 401K. For most of my career, I only focused on building my net worth or saving for retirement through my employer(s) 401K. I’ve been actively working to dramatically increase my tax free and post-tax balances over the past couple of years. Definitely one of my lessons learned later in life that I hope to help others avoid.</li>\n<li>Post-Tax Investment Accounts &#8211; value is $945K. I’m not planning to add as much here for the next 5 years or so as I build up tax friendly cash flow from <a href=\"https://esimoney.com/how-to-get-started-investing-in-real-estate-syndications-part-1/\">Real Estate Syndicate investments</a>.</li>\n<li>Tax free investment accounts &#8211; $52K. I’ve been doing backdoor Roth IRA conversions at the max (now $1,000 higher that my wife and I are both over 50) for 4 years. I do have larger planned mega Roth conversions the first few years I’m retired and living off of cash reserves to improve my mix of assets in the different tax buckets.</li>\n<li><a href=\"https://esimoney.com/how-to-get-started-investing-in-real-estate-syndications-part-1/\">Real Estate Syndicate</a> Deals &#8211; $200K. I’ve done 4 different deals with a couple of different General Partners, in several different markets. I’ve enjoyed analyzing the various investment deals up front (some great tools out there to help with this) and then sitting back and tracking them all with the LP Analyzer excel spreadsheet I purchased. I am planning on adding 2 deals each year for the next 5 years or so as a way to somewhat replicate what a pension would have done had I been fortunate enough to work somewhere that offered one in my career. Two of these deals are very early and I just started receiving distributions, but I’m very happy with the trends and financials for the first two deals. I recognize the risks with these opportunities, but I’m optimistic that this will be an important part of my overall financial landscape well into retirement.</li>\n<li>Property &#8211; $2.1M value with home equity of $1.5M after accounting for my remaining mortgage balance.</li>\n<li>Cash &#8211; $165K after using some to “buy the dip” recently with the market downturn. I will also deploy some in the next few months on my next RE Syndicate deal.</li>\n<li>529 – I will likely have ~$40K left in this account after my daughter graduates. I will transfer some to family for their college expenses and either pay the 10% penalty for the balance or use it for ongoing education expenses at some point for someone in the immediate family.</li>\n</ul>\n<p>I don’t count the value of our vehicles in my net worth, even though they could be sold for cash if needed. (We have several collector vehicles in addition to daily drivers for all drivers in the household.)</p>\n<h4><span style=\"text-decoration: underline;\"><strong>EARN</strong></span></h4>\n<p><em><strong>What is your job?</strong></em></p>\n<p>I work for a Fortune 500 corporation in the C-Suite, reporting to the CEO. I have only recently attained this level, having worked my way up in a variety of departments and roles with long stops at certain levels. I feel very fortunate to enjoy the work I do with the people in the department I directly support, which wasn’t the case when I first got in role.</p>\n<p>Quick tangent – never take the easy path or avoid confrontation with those that aren’t engaged, driven, or all-in to support the people they lead. The difference since I made some aggressive leadership changes is pronounced for the entirety of the team we support/lead, but it’s also made a huge difference with my personal quality of life and how I view work each day.</p>\n<p>I’m learning every single day and I find the work challenging, yet rewarding. If there is improvement in the comradery and teamwork amongst my peers in the coming year or two, I will not be in a huge rush to retire. If not, I am comforted to know I’ll be in a place to move on if I continue to aggressively save and maximize the various variable pieces of my total compensation package.</p>\n<p><em><strong>What is your annual income?</strong></em></p>\n<p>Last year was right at $600K.</p>\n<p>If all elements are somewhat near target, this should move to $900K next year with a result somewhere in between those numbers for this year.</p>\n<p>Salary is in the low $300’s, so roughly two-thirds is tied up in annual bonus, long-term incentives, and various equity elements with my company.</p>\n<p><em><strong>Tell us about your income performance over time. What was the starting salary of your first job, how did it grow from there (and what you did to make it grow), and where are you now?</strong></em></p>\n<p>My starting wage at my first two jobs (both started after graduating college) were $6/hr and $7.75hr.</p>\n<p>I went full-time with the $6/hr job (previously part-time at 25-30 hours a week) when I was moved up and started making more than I made at the full-time $7.75/hr job.</p>\n<p>Here are my earnings by year going back to when I first started working:</p>\n<ul>\n<li>$19,732</li>\n<li>$24,140</li>\n<li>$30,632</li>\n<li>$67,373</li>\n<li>$65,216</li>\n<li>$86,000</li>\n<li>$89,724</li>\n<li>$83,607</li>\n<li>$114,069</li>\n<li>$162,696</li>\n<li>$191,873</li>\n<li>$314,991</li>\n<li>$228,056</li>\n<li>$157,692</li>\n<li>$199,571</li>\n<li>$223,102</li>\n<li>$178,786</li>\n<li>$201,421</li>\n<li>$187,894</li>\n<li>$236,893</li>\n<li>$265,187</li>\n<li>$277,180</li>\n<li>$254,655</li>\n<li>$353,092</li>\n<li>$324,429</li>\n<li>$500,437</li>\n<li>$361,944</li>\n<li>$392,501</li>\n<li>$600,000</li>\n</ul>\n<p><em><strong>What tips do you have for others who want to grow their career-related income?</strong></em></p>\n<p>First, approach all new opportunities from a point of curiosity and interest.</p>\n<p>Secondly, take jobs or roles that others pass on because they look too difficult or too challenging. The worse a department or team is doing, the more opportunity for improvement and the better the turnaround story!</p>\n<p>Thirdly, volunteer for special assignments or projects. I’m constantly amazed that people wait for opportunities to land on them versus aggressively or actively pursuing personal or leadership growth. I recommend targeting growth in learning and thoughtful horizontal moves, without compensation or promotions even being included. These very often lead to amazing stories and crucial differentiators when you do interview for promotions down the line against what your competitors will have done or produced.</p>\n<p><em><strong>What&#8217;s your work-life balance look like?</strong></em></p>\n<p>I would say fair to pretty good most of the time.</p>\n<p>You are never really totally “off”, but I am able to trust the people on my team to handle most of the urgent items that arise. I am only on point when it&#8217;s either dire or extremely high profile.</p>\n<p><em><strong>Do you have any sources of income besides your career? If so, can you list them, give us a feel for how much you earn with each, and offer some insight into how you developed them?</strong></em></p>\n<p>I do not have other income sources, aside from the RE syndicate deals that are now all cash flowing as described earlier.</p>\n<p>I love that these are <a href=\"https://esimoney.com/five-categories-of-passive-income-and-how-to-evaluate-them/\">passive income</a> streams after the initial due diligence period before choosing whether to invest or not.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>SAVE</strong></span></h4>\n<p><em><strong>What is your annual spending?</strong></em></p>\n<p>Our spending has averaged around $220K per year.</p>\n<p><em><strong>What are the main categories (expenses) this spending breaks into?</strong></em></p>\n<p>Aside from taxes, the largest portion of our spending is for food & housing.</p>\n<p>Housing is high because values on our home have got up dramatically and so have the associated taxes. We also have done some form of home improvement nearly every year and we spend a lot of time and money outdoors working on our landscape. We also partially support family aside from our home and kids.</p>\n<p>We spend a great deal more than most on food. Some is due to special diet restrictions, but frankly this is an area where we splurge and dining out is a regular occurrence. Food costs for my daughter at college are outrageous as well, especially since it’s required when living on campus and she only eats about 10% of a what I did when I was in college!</p>\n<p>We are also big into hobbies and mine are not inexpensive hobbies, nor as productive as my wife’s. She designs and sews her own clothes, among many other productive hobbies. I love vehicles and while I work on them myself, it’s still an expensive hobby and not nearly as productive as my wife’s hobbies.</p>\n<p>Here is a rough breakdown of our spending by % of total after taxes:</p>\n<ul>\n<li>Housing – 22%</li>\n<li>Food (Dining Out & Groceries) – 10%</li>\n<li>Vehicles – 12%</li>\n<li>Hobbies – 3%</li>\n<li>Charitable Donations – 12%</li>\n<li>Entertainment – 2%</li>\n<li>Household & Misc – 6%</li>\n<li>Education: Daughter’s School (non food) – 15%</li>\n<li>Insurance/Health Expenses – 9%</li>\n<li>Travel – 7%</li>\n</ul>\n<p><em><strong>Do you have a budget? If so, how do you implement it?</strong></em></p>\n<p>We do not have a set budget per se, but I do track our monthly “P&L” statement against the forecast I setup to start the year. Most of this is to forecast net worth by month, savings rate, and cash flow for our new passive income streams.</p>\n<p>Historically, my wife has been very frugal & not a spender. This has changed somewhat in the past few years, but if I’m honest her spending while more frequent is at a much lower level than the items or hobbies I’ve spent on.</p>\n<p>Although my vehicle assortment has appreciated big-time over the past few years, historically I’ve likely been lucky to break-even all-up as I’ve continued flipping them.</p>\n<p><em><strong>What percentage of your gross income do you save and how has that changed over time?</strong></em></p>\n<p>Somewhere between 25-40%.</p>\n<p>For most of my 30s I maxed out my 401K contribution, but I didn’t contribute anything to after tax investments.</p>\n<p>I paid down extra on my mortgage and we spent more than we should have on trips and other items.</p>\n<p>We also have had much more in healthcare expenses than what is typical as a family due to some health issues that coincide with the special dietary costs I referenced above.</p>\n<p><em><strong>What&#8217;s your best tip for saving (accumulating) money?</strong></em></p>\n<p>Track your progress & set net worth goals both monthly and yearly.</p>\n<p>I do a monthly update on how we are doing against my initial start of year forecast, and this competition with ourselves forces me to make adjustments when the market is underperforming what I expected coming into the year. (Basically, upping our savings rate since that is the only thing I directly control.)</p>\n<p>I also funnel money each month into accounts that are setup to fund our Roth IRA conversions, RE Syndicate investments, and after-tax investment accounts at set intervals.</p>\n<p>The other tip that I’m sure your readers all know is making sure your money is working hard for you, 24 hours a day, 7 days a week, & 365 days a year.</p>\n<p>I’ve taken on more risk than what many would be comfortable with, so knowing your risk tolerance and associated behaviors in down markets or economic circumstances is paramount. I hold true to my core investment strategy and my willingness to double down or “buy the dip” has served me well.</p>\n<p>I’m more cautious at this stage of my career than earlier, but I still have far more money in equities than what is typical at my age. I will keep 3 years’ worth of cash on hand to help prepare for sequence of return risk when I do decide to hang it up, but I am on track to have ~80% of our current living expenses covered in 5 years if I stay the course and get even close to projected returns from the RE syndicate deals & funds I’m investing in.</p>\n<p>We will downsize our home and look at geo arbitrage as well given the relatively high cost of living where we are today. Like ESI, a smaller home in Florida in an active community would be ideal – depending on where our kids end up of course.</p>\n<p><em><strong>What&#8217;s your best tip for spending less money?</strong></em></p>\n<p>I’m not the best person for advice here, it’s definitely the area I’ve done the least well on out of E-S-I.</p>\n<p>However, I’ve always been hyper-focused on getting a good deal. I do my homework and I’m not afraid to walk away if negotiations break down for purchases. My wife tells me she never knew that nearly everything is negotiable until she met me.</p>\n<p>I meet with my insurance agent regularly to make sure we have the best rates, call our cell phone provider and get discounts as opposed to switching, and make sure we get maximum value for each dollar spent with points or cash back. I’m unfailingly polite about it, but I’m also politely relentless and I’ve found that people are very willing to be accommodating if you handle things the right way with an eye towards a win-win.</p>\n<p>One small example is our homebuilder’s sales agent gave us an extra $50K in upgrades for various things during our build because we formed a bond when working with him and we were accommodating on delays that came up or with fixtures that were out of stock. It didn’t seem unreasonable to us, but he indicated it was pretty rare with the folks he usually deals with. Our builder even upgraded our outdoor grill area as a surprise, with extra high-end finishes at no charge since we had shared our sincere appreciation with the top executives in his company over his meticulous work with our home.</p>\n<p>My point here is making every dollar go further is possible with education and intentionality, even if you aren’t a great saver like many I’ve read about throughout this forum and other great interview recaps.</p>\n<p><em><strong>What is your favorite thing to spend money on/your secret splurge?</strong></em></p>\n<p>Vehicles, food, and travel.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>INVEST</strong></span></h4>\n<p><em><strong>What is your investment philosophy/plan?</strong></em></p>\n<p>Like many, I subscribe to the Warren Buffet approach of buy quality and hold into perpetuity.</p>\n<p>Other than rebalancing annually to stay on track with our asset allocation, most of my investments have remained since inception. (A few notable exceptions in my worst investments will come up below.)</p>\n<p><em><strong>What has been your best investment?</strong></em></p>\n<p>This is easy, my decision to marry my wife. I know it’s cliché, but nearly every single thing in your life forks off of this one decision. Other than my faith decision, nothing was more impactful in my life (financial or otherwise) than who I married.</p>\n<p>Otherwise, property has had an outsized contribution to our net worth. Many corporate relocations have helped take out all of the costs of moving and commissions, but this has not been due to any skill on my part – aside from realizing that buying is a far better option than renting from a tax perspective and for building equity based on the tax code.</p>\n<p><em><strong>What has been your worst investment?</strong></em></p>\n<p>Early on I thought I could pick stocks and time the market. I had some initial success, which led to hubris and me thinking I had some sort of skill. A near full loss showed me the error of my ways and I’ve not returned to this way of thinking. If I don’t fully understand it, I don’t invest in it & I don’t expect to beat the market on my own. Low cost funds and ETFs have been my way ever since.</p>\n<p>Also, stay away from any investment that attempts to couple life insurance and investing together. No matter how enticing, both are much better handled separately. Term life insurance for a duration that fits your need & investments where fees are fully transparent.</p>\n<p><em><strong>What&#8217;s been your overall return?</strong></em></p>\n<p>About 14% annually over the past 25 years, though this does include my 401K matches through the years.</p>\n<p>It has accelerated the past 5-7 years, but regression to the mean (or lower) seems very likely moving forward.</p>\n<p>My last 5 years of net worth increases YOY have been: 21.4%, 3.45%, 28.3%, 21.5%, & 39%.</p>\n<p><em><strong>How often do you monitor/review your portfolio?</strong></em></p>\n<p>I use Personal Capital and go into it at least weekly. I download all transactions each month and use it to update my personal P&L statement each month.</p>\n<p>I use a great spreadsheet program that I believe I read about on this forum that was generated from an accountant. It’s taken my rudimentary spreadsheet that tracked and forecasted my income, net worth, expenses, 401k balance, stock options, etc…into a single coordinated & automated file.</p>\n<p>While it’s hard to see the several hundred thousand dollars drop in net worth over the past couple of months, the history chart gives me comfort because I can observe even worse dips historically in our net worth & we recovered in time. I expect to see this cycle several more times in my lifetime, maybe it will get easier – but so far, it’s still unsettling. (Even if it’s “paper losses.”)</p>\n<h4><span style=\"text-decoration: underline;\"><strong>NET WORTH</strong></span></h4>\n<p><em><strong>How did you accumulate your net worth?</strong></em></p>\n<p>I was fascinated with personal finance ever since I studied it in college. I paid for my undergrad myself and it’s when I learned crucial finance principles like: Opportunity Cost, NPV, compounding interest, Rule of 72, etc…</p>\n<p>I grew up in a lower-class household and I was very motivated to live a different life myself than what I saw growing up. Money was a constant stress in our house growing up and I was extremely driven to change that for myself and my family.</p>\n<p>I also am fascinated by business in general. I have read the WSJ daily for years and I spend my discretionary time following financial thought leaders and reading great blogs and websites like ESI!</p>\n<p><em><strong>What would you say is your greatest strength in the ESI wealth-building model (Earn, Save or Invest) and why would you say it&#8217;s tops?</strong></em></p>\n<p>I have been fortunate to become a fairly high earner, which has definitely had an outsized impact on my net worth so far.</p>\n<p>I’ve also had a strong investment track record, which I mostly attribute to living in a great time to be an investor and the earning history more than any real inherent skill in investing. (Other than recognizing early on that fees are absolute killers of portfolio growth given compounding and staying in extremely low cost funds.)</p>\n<p><em><strong>What road bumps did you face along the way to becoming a millionaire and how did you handle them?</strong></em></p>\n<p>I lost my way during a chunk of my 30s and early 40s and my spending was far more than it should have been. In hindsight, I was unhappy with my job at the time and I was compensating by seeking enjoyment in things. Of course, that happiness from a purchase is fleeting and I learned the hard way that I needed to address the root cause versus masking it.</p>\n<p>A lesson I learned that may benefit others is that the best way to deal with personal hardships or struggles is to focus on others. The more I focused on me or my circumstance, the unhappier I was. When I focused on others, specifically volunteering or helping others financially, physically, or emotionally – I gained perspective that generated feelings of appreciation and gratitude that were lacking previously.</p>\n<p>It doesn’t take long to see that no matter what you are dealing with, there are others dealing with far worse. Volunteering on a non-profit board, anonymously helping a neighbor, and serving others created perspective that I was sorely lacking.</p>\n<p><em><strong>What are you currently doing to maintain/grow your net worth?</strong></em></p>\n<p>I have a 5-year roadmap to achieve full financial independence and legacy wealth for my family given some health situations that will require funding after my wife and I are in a better place. The need for this used to keep me up at night, but I’ve learned to trust in God and through the lesson on helping others I’ve realized just how incredibly fortunate I really am.</p>\n<p>Otherwise, the plan calls for 14-16 RE Syndicate deals on a rotating basis by 2027 and continued progress towards a 50% savings rate year in and year out.</p>\n<p><em><strong>Do you have a target net worth you are trying to attain?</strong></em></p>\n<p>$10M. This is in addition to the passive income stream I’ve mentioned throughout.</p>\n<p>It’s great to read about folks that have said that <a href=\"https://esimoney.com/youve-won-game-stop-playing/\">when you win the game, you can stop playing</a>. My situation is a little different with the legacy element, but I am sure I will struggle with the OMY (one more year) syndrome due to inflation or other items that pop up along the way.</p>\n<p>It’s comforting to see so many other folks navigating retirement with dignity and purpose, and I plan to use them as my role models in lieu of focusing on just a continually bigger number.</p>\n<p><em><strong>How old were you when you made your first million and have you had any significant behavior shifts since then?</strong></em></p>\n<p>I was 44 when I officially had a net worth of $1M+.</p>\n<p>We didn’t change anything then and we really haven’t changed anything since from a personal standpoint.</p>\n<p>I did start coaching others on financial principles right around that time though. I had started managing my parent&#8217;s accounts and investments right before this and it shocked me to see how they were being taken advantage of by some unscrupulous people and a lack of knowledge. They never had much money, but they could have had more if they weren’t paying up to 1.6% in fees in several accounts for decades!</p>\n<p>I started helping a couple of people in small ways and the word spread. I shared principles with many, but a core few have applied them and are now in a much different place as a result.</p>\n<p>Frankly, that’s one of the things that gives me the most joy of anything I’ve done as they now are paying it forward with their friends and families. I just can’t figure out why this stuff still isn’t taught in schools…</p>\n<p><em><strong>What money mistakes have you made along the way that others can learn from?</strong></em></p>\n<p>So many mistakes – it’s hard to pick just a few, but here it goes:</p>\n<ul>\n<li>Don’t only save in pre-tax investment accounts.</li>\n<li>Start early! I made excuses early on even though I knew better. Simply no substitute for time in investing and gaining financial independence. I frittered away money in my 20s that would have me already retired today.</li>\n<li>Get your estate in shape, with the appropriate paperwork, early and before anything happens. Living will, last will & testament, trusts if applicable, etc…</li>\n<li>Track your spending and don’t compound the problems in your life by compensating for stress with “stuff”.</li>\n</ul>\n<p><em><strong>What advice do you have for ESI Money readers on how to become wealthy?</strong></em></p>\n<p>Surround yourself with high quality people or friends that follow strong financial principles and discipline. The wrong crowd hurts us as adults, just like it did when we were kids. (So & so is going on another trip or has x new car or appliance, therefore I should too.)</p>\n<p>When you are considering a purchase, evaluate it against the opportunity cost of what you could do with those funds against your financial goals & objectives. It’s a balance, for me it’s not just live on 15% (or whatever) of your income to get to FIRE as quick as possible & then check-out. Whatever your balance point is, find it & stick to it.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>FUTURE</strong></span></h4>\n<p><em><strong>What are your plans for the future regarding lifestyle?</strong></em></p>\n<p>I do not plan to downsize careers, but for sure I’d like to downsize our house and retire early. 60 is not early by any means, but I see that as a reasonable finish line if things continue to go well at work.</p>\n<p>It sounds cliché, but I feel that the work I do makes a real difference and I get to help people. I have other means of doing so outside of work, but the size and scale of what I can do at work is pretty big due to my role. It’s a chance to set a different example than what many people have likely seen or may expect to see from an executive.</p>\n<p><em><strong>What are your retirement plans?</strong></em></p>\n<p>All the great thoughts on the non-financial elements of retirement on this site have reaffirmed for me those great intentions aren’t enough. I have lots of interests, but getting them vetted prior to retiring will require planning and/or trial and error.</p>\n<p>I have always loved sports and I’ve played competitive basketball, tennis, soccer, volleyball, and table tennis. Looking forward to trying pickleball, getting better at golf, and building a car from the ground up as new learning opportunities. Serving on a few boards (non-profit) and potentially as an angel investor with causes I’m passionate about.</p>\n<p><em><strong>Are there any issues in retirement that concern you? If so, how are you planning to address them?</strong></em></p>\n<p>Location is something I only have a theory on. I am planning to test out a few places by living there when I retire for a few months to see how it goes.</p>\n<p>Aligning those with my wife and locations for my kids will also require some faith & trust that I can’t see the path for quite yet.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>MISCELLANEOUS</strong></span></h4>\n<p><em><strong>How did you learn about finances and at what age did it &#8220;click&#8221;?</strong></em></p>\n<p>In college when I took finance classes.</p>\n<p>That inspired me to maximize my finances, but I certainly took awhile to fully apply those principles vs. starting right after college as I should have!</p>\n<p><em><strong>Who inspired you to excel in life? Who are your heroes?</strong></em></p>\n<p>I don’t have a great singular answer to this question.</p>\n<p>I have some teachers that made a big difference during my formative years, an Uncle that I saw achieve executive status and share some visibility into what that enabled – but most of my drive comes from a need to avoid the financial hardships I observed growing up.</p>\n<p>In more recent years, I’m incredibly inspired by Warren Buffet and Bill Gates commitment to sharing their wealth in meaningful ways all across the world in a shared foundation. Eradicating disease in third world countries, funding libraries all across the US, etc…</p>\n<p><em><strong>Do you have any favorite money books you like/recommend? If so, can you share with us your top three and why you like them?</strong></em></p>\n<p>The obligatory “<a href=\"https://esimoney.com/the-best-personal-finance-books-of-all-time-the-millionaire-next-door/\">Millionaire Next Door</a>” answer that most everyone gives was certainly a spring board to finally applying what I’d learned in college and putting it into practice after I got married and our daughter was born.</p>\n<p>I also read the WSJ every day and many financial news feeds from various sources.</p>\n<p>I’ve read “<a href=\"https://esimoney.com/rich-dad-poor-dad-book-review/\">Rich Dad Poor Dad</a>”&nbsp; and several books on investing in Real Estate Syndications as well.</p>\n<p>I’ll round out my three with The Hands-Off Investor: An Insider’s Guide to Investing in Passive Real Estate Syndications by Brian Burke and How Much Money Do I Need to Retire?: Uncommon Financial Planning Wisdom for a Stress-Free Retirement by Todd R. Tresidder.</p>\n<p><em><strong>Do you give to charity? Why or why not? If you do, what percent of time/money do you give?</strong></em></p>\n<p>Yes, we donate to our church and to many other causes that we feel passionate about.</p>\n<p>This was not easy for me and it’s still something I’m working on building onto further.</p>\n<p><em><strong>Do you plan to leave an inheritance for your heirs (how do you plan to distribute your wealth at your death)? What are your reasons behind this plan?</strong></em></p>\n<p>Yes. We have a special circumstance with our kids that will require legacy money after my wife and I are gone. That is a major driver of our financial priorities, in addition to preparation for our own retirement situation.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/millionaire-interview-336/\">Millionaire Interview 336</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/millionaire-interview-336/feed/",
  "slash:comments": 4
}