{
  "title": "Wasserstein Steepest Descent Flows of Discrepancies with Riesz Kernels. (arXiv:2211.01804v1 [math.OC])",
  "link": "http://arxiv.org/abs/2211.01804",
  "description": "<p>The aim of this paper is twofold. Based on the geometric Wasserstein tangent\nspace, we first introduce Wasserstein steepest descent flows. These are locally\nabsolutely continuous curves in the Wasserstein space whose tangent vectors\npoint into a steepest descent direction of a given functional. This allows the\nuse of Euler forward schemes instead of the minimizing movement scheme (MMS)\nintroduced by Jordan, Kinderlehrer, and Otto. The MMS finds Wasserstein\ngradient flows by successively computing Wasserstein proxies. For locally\nLipschitz continuous functionals which are $\\lambda$-convex along generalized\ngeodesics, we show that there exists a unique Wasserstein steepest descent flow\ncoinciding with the Wasserstein gradient flow.\n</p>\n<p>The second aim is to study Wasserstein flows of the (maximum mean)\ndiscrepancy with respect to Riesz kernels. The crucial part is hereby the\ntreatment of the interaction energy. Although it is not $\\lambda$-convex along\ngeneralized geodesics, we give analytic expressions for Wasserstein steepest\ndescent flows of the interaction energy starting at Dirac measures. In contrast\nto smooth kernels, the particle may explode, i.e., the particle goes over to\nnon-Dirac measures. The computation of steepest descent flows amounts to\nfinding equilibrium measures with external fields, which nicely links\nWasserstein flows of interaction energies with potential theory. Furthermore,\nwe prove convergence of MMS to our Wasserstein steepest descent flows. Finally,\nwe provide analytic Wasserstein steepest descent flows of discrepancies in one\ndimension and numerical simulations in two and three dimensions showing\nrelations to interaction energy flows.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/math/1/au:+Hertrich_J/0/1/0/all/0/1\">Johannes Hertrich</a>, <a href=\"http://arxiv.org/find/math/1/au:+Graf_M/0/1/0/all/0/1\">Manuel Gr&#xe4;f</a>, <a href=\"http://arxiv.org/find/math/1/au:+Beinert_R/0/1/0/all/0/1\">Robert Beinert</a>, <a href=\"http://arxiv.org/find/math/1/au:+Steidl_G/0/1/0/all/0/1\">Gabriele Steidl</a>"
}