{
  "title": "Building a budgeting service",
  "description": "<h2>A post-hoc analysis, part 2</h2>\n\n<img src=\"https://dl.dropbox.com/u/10557805/nano/part2_header2.png\" alt=\"image\"/><p>As I wrote in <a href=\"http://auduno.tumblr.com/post/40422171982/building-a-budgeting-service\">my last blog post</a>, around 3 years ago I decided to try to build a budgeting service like <a href=\"https://www.mint.com\">mint.com</a> for the norwegian market. After around a year, having reached the prototype stage, I decided to take a short break from further building, to think about the business details. This quickly turned into an &hellip; extended break.</p> \n\n<p>In this post I&rsquo;ll write out some of the reasons I stopped working on it, and finally, some lessons learned.</p>\n\n<!-- more -->\n<br/><p>During the process of mocking up the prototype, I&rsquo;d already considered some business models:</p>\n\n<ul><li>\n\t<h5>lead generation for loans, savings and credit card accounts</h5>\n    <p>In other words, getting a payment from the banks in return for sending users to one of their banking services. This is the business model that mint.com used, where they would recommend you banking services that might save you money. Of these, lead generation for loans probably is the most profitable, as loans are a large part of the business model for banks, and they&rsquo;re willing to pay quite a bit for leads.</p>\n\t</li>\n\t\n\t<li>\n\t<h5>third-party solution for banks</h5>\n    <p>This would mean selling the service of scraping and categorization to the banks as a plugin service in their own online banks. This didn&rsquo;t seem all that feasible to me, since a majority of banks already used a third-party service (<a href=\"http://evry.com\">EVRY</a>, formerly known as EDB) to run their online banks, and these were likely to want to make it themselves instead of buying it from another third party. As I later discovered, the few banks that actually ran their own online banks, mostly the larger banks (DnB, Gjensidige, etc.), were already building budgeting services themselves.</p>\n    </li>\n\t\n\t<li>\n\t<h5>freemium solution (&ldquo;pay for premium&rdquo;-solution)</h5>\n    <p>This is not a model I gave a lot of thought, since it was unlikely that the amount of users that were willing to pay for this services in Norway was large enough.</p>\n    </li>\n</ul><p>The lead generation business model seemed less risky, so that was my main plan. However, there were a lot of problems with the business model that I never managed to solve.</p>\n\n<h4>Profitability</h4>\n\n<p>My main worry was the economic feasibility. Scraping all the different online banks demanded that we always keep the scraper up to date, which meant a lot of manual maintenance. The big question was whether the costs spent on maintenance would be balanced by profits from lead generation. This was really hard to answer since I didn&rsquo;t know exactly how much maintenance was needed, or how much the banks were willing to pay for leads. In a presentation held by Aaron Patzer of mint.com, he mentioned that they had a revenue of around 30$ per user. The revenue probably would have been higher in Norway, but I was never sure how many users we&rsquo;d get. Norway is after all a considerably smaller market than the US. Even though we managed to get a considerable share of the potential market size, given around 30$ per user we&rsquo;d only be talking about a couple of million NOK in revenue, which is not a lot, considering maintenance costs.</p>\n\n<h4>Marketing costs</h4>\n\n<p>The second big worry was how to get people use this service. Most Norwegians have never heard of budgeting services, which means it would be a problem to get people to try it at the outset. This would be especially hard since the service asked them to log in to their bank account, something that no other service in Norway (as far as I know) asks you to do. We would have to do quite a lot of outreach to ensure that users were certain that the service was safe. The best bet would probably be to market the service through personal economy sites, such as <a href=\"http://www.dinepenger.no\">dinepenger.no</a>, which already had a number of economy calculators and manual budgeting tools, and somehow get them to vouch for the service. Any kind of certification, such as TRUSTe, Verisign, and RSA, would probably also help here.</p>\n\n<h4>Legality</h4>\n\n<p>Though it wasn&rsquo;t strictly illegal to scrape the account statements from online banks, a lot of the banks actually had clauses in their terms of services stating that the user was not allowed to give any third parties access to their online bank accounts. Any scraping done on remote servers would of course be a breach of these terms of services. Though it was deemed unlikely that the banks actually would do any counteractions against users allowing this (it would after all be the users, not us, they would be targeting legally), there was a major risk in that they might make life hard for us (i.e. making it harder to scrape) and that they might claim our services were insecure. On our side, we might claim that the users had a right to own their own information and that the banks were just trying to stop users from finding cheaper banking services. Some people I discussed this with, suggested that the banks were unlikely to say anything publicly, as <em>any</em> kind of discussion around the security of the banks would be negative PR for the banks. It <a href=\"http://www.dagensit.no/article2416340.ece\">turned out later</a> that &ldquo;finanstilsynet&rdquo; (which is Norways&rsquo; higher authority for banks) actually <em>were</em> willing to warn against giving up your information to these kinds of services in very negative tones, so the worry wasn&rsquo;t exactly unwarranted. Given this kind of pushback, it would probably have been an uphill battle.</p>\n\n<br/><br/><p>Altogether, these issues, especially concerns around profitability and legality, made me uncertain whether it really was worthwhile to continue with the project.</p>\n\n<p>The real reason I stopped working on it, though, was that I really, really needed a break. By the time the prototype was done, I&rsquo;d been working on this project in most of my spare time for a year. While the plan was to take a break from building to figure out whether the business was really profitable, I was too fatigued with the whole project, and though I thought about it from time to time, I didn&rsquo;t really make a serious effort. The short break quickly grew into months, and I gradually started thinking about other projects.</p>\n\n<p>So, here&rsquo;s some of my lessons learned:</p>\n\n<h4>Lessons learned</h4>\n\n<ul><li>\n\t<h5>Figure out the business model first</h5>\n\t<p>Though it&rsquo;s fun building stuff and you learn a lot doing it, if you end up building something that never earns money, you&rsquo;re either in the not-for-profit business or you&rsquo;ve wasted your time. Earning money (at least enough to keep day-to-day operations running) is and should be priority number one for any startup, so you should focus on that as early as possible. The issues with legality and maintenance cost vs profit, are actually something that I could have figured out before I started building it.</p>\n\t</li>\n\n\t<li>\n\t<h5>Involve more people at an early stage.</h5>\n\t<p>Having someone to discuss with and share the stress (and victories) with, is worth way more than you might think. Other people might add knowledge or points of view you don&rsquo;t have, and you&rsquo;re probably likely to pick up on problems with your business model earlier, though that depends on how balanced you are as a team. In my case it would have been optimal to work with someone else that had experience with the banking business, as they could tell me more about the profitability aspects around lead generation. Including other people also meant it would have been easier to keep up motivation, or at least spin the project into something else, which partly was the reason I stopped.</p>\n\t</li>\n</ul><h4>Postscript</h4>\n\n<p>In hindsight, an automated personal budgeting service for the Norwegian market is probably unviable. Mint.com had a lot of advantages in that they were buying the transaction feeds from a third party, <a href=\"http://www.yodlee.com\">Yodlee</a>, since they didn&rsquo;t directly have to deal with maintenance costs or legality issues. The only way that I see such a service could be viable in Norway, is if the banks start supporting a common API to get transaction information. This would considerably lower maintenance costs and stop any legality concerns. However, this is unlikely to be initiated by the banks, so it would probably have to be enforced through some sort of regulation. There are other services based on lead generation that are viable though, and since I stopped working on my project some have turned up.</p>\n\n<img src=\"https://dl.dropbox.com/u/10557805/nano/penger.no_front_crop.jpg\" alt=\"image\"/><p>The site <a href=\"http://www.penger.no\">penger.no</a>, which has simplified applying for loans from several banks at once, has abandoned the entire personal budgeting service and gone directly for the lead generation. Instead of getting information about users from their personal budgets, they&rsquo;ve simply asked the users to punch in the details themselves. The only drawback I can think of with this, is that the leads might be less qualified (the banks get less real information about income and spending), and thus banks might pay less for the leads.</p>\n\n<p>Penger.no have also solved a lot of the issues with marketing, since the service is partially owned by <a href=\"http://www.dinepenger.no\">dinepenger.no</a> and <a href=\"http://www.finn.no\">finn.no</a>. Dinepenger.no is able to give it credibility and means it can reach out to exactly those users that are interested in this kind of service, while ownership by finn.no (one of the top ten sites in Norway) means that they can advertise cheaply on pages of finn.no.</p>\n\n<p>Some banks, such as <a href=\"https://www.dnb.no\">DnB</a>, <a href=\"http://www.skandiabanken.no\">Skandiabanken</a> and <a href=\"http://www.storebrand.no\">Storebrand</a>, have also implemented their version of budgeting tools as part of their online banking services. I haven&rsquo;t seen any that I&rsquo;m really satisfied with in terms of user experience and integration, though. These tools are of course also only based on transactions from the accounts the user has in these banks, so they do not give you the complete overview of your economy that I was interested in (unless you have all finance information (stocks, loans, savings, debit account, BSU) in one bank). What would have been really interesting, is an online bank where the budgeting integration was really thought through, like what <a href=\"http://www.simple.com\">Simple</a> seem to be building in the US. I can only hope that some banks over here (or a startup) will try to to copy what they&rsquo;re doing. Meanwhile, it looks like I&rsquo;ll have to resort to spreadsheets for my complete budgeting needs&hellip;</p>\n\n<br/><p>If you liked this article, you should <a href=\"http://www.twitter.com/matsiyatzy\">follow me on twitter</a>.</p>",
  "link": "https://auduno.tumblr.com/post/47357960809",
  "guid": "https://auduno.tumblr.com/post/47357960809",
  "pubDate": "Sun, 07 Apr 2013 13:38:00 +0200"
}