{
  "id": "https://bibleinoneyear.org/en/youth/111",
  "title": "Day 111: Hello God!",
  "description": "Psalm 49:5–17, Deuteronomy 33:12, 27, Luke 20:34–39, 21:1–4. Her certainty about the resurrection was based on the cornerstone of Christianity: the resurrection of Jesus Christ on the first Easter day  The same power that raised Jesus from the dead now lives in you through the Holy Spirit (see Ephesians 1:18–23)",
  "pubDate": "Wed, 21 Apr 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/111/?ignore",
  "itunes:duration": "12:39",
  "guid": "enyouth21042021-111",
  "length": 759.3,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 111: Hello God!",
  "itunes:subtitle": "Psalm 49:5–17, Deuteronomy 33:12, 27, Luke 20:34–39, 21:1–4. Her certainty about the resurrection was based on the cornerstone of Christianity: the resurrection of Jesus Christ on the first Easter day  The same power that raised Jesus from the dead now lives in you through the Holy Spirit (see Ephesians 1:18–23)",
  "itunes:summary": "The Vicar of Dibley, a UK TV sitcom featuring a woman vicar played by Dawn French, is based on the life of one of the first women vicars – Joy Carroll Wallis. A few years ago, Pippa and I met Joy. She told us a story about when she was an Anglican priest in London.\nOne of the congregation members was a very godly eighty-seven-year-old woman, called Flory Shore, who underwent serious surgery. Flory had been told that her prospects of recovery were very slim.\nThankfully, she survived the surgery. As she opened her eyes, one of the first things she saw was the blurred image of her doctor, dressed in his white jacket.\nShe smiled and said, ‘Hello God! I’m Flory Shore.’\nJoy commented that this demonstrated two things. First, it showed Flory’s humility. She did not expect God to know who she was. Second, it showed her absolute certainty about the resurrection and where she was going.\nHer certainty about the resurrection was based on the cornerstone of Christianity: the resurrection of Jesus Christ on the first Easter day. The same power that raised Jesus from the dead now lives in you through the Holy Spirit (see Ephesians 1:18–23). One day, you too will be raised and be able to say, ‘Hello God!’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 111
}