{
  "title": "Minkorrekt Folge 17 „Silvester-Gala der Wissenschaft“",
  "itunes:title": "Minkorrekt Folge 17 „Silvester-Gala der Wissenschaft“",
  "description": "Wir blicken zurück auf ein Jahr 2013 voller Wissenschaften. Was waren die tollsten Entdeckungen. Wo passierte die spannendste Forschung. Experiment der Woche: \"Tischrakete\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 31 Dec 2013 14:06:18 +0000",
  "link": "https://minkorrekt.podigee.io/19-minkorrekt-folge-17-silvester-gala-der-wissenschaft",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=232",
  "content:encoded": "„Silvester-Gala der Wissenschaft“ direkt von der Silvesterparty der Wissenschaften.\n<p>&nbsp;</p>\n<p>Das Jahr neigt sich dem Ende zu und wir werfen noch einmal einen völlig subjektiven Blick auf die herausragenden Wissenschaftsmeldungen des Jahres 2013.</p>\n<p>Bevor wir damit beginnen widmen wir uns allerdings noch kurz der aktuellen Folge unserer <a href=\"http://www.sturm-des-wissens.de/daheim/\">Lieblingssoap</a> und fiebern zusammen mit Nele und dem heimlichen Star (dem Baguette) der neuen Folge entgegen.</p>\n<p><span id=\"more-940\"></span></p>\n<p>Den Rückblick eröffnet Nicolas im Januar mit den Forschern der Duke University die herausgefunden haben, dass man <a href=\"http://www.sciencecodex.com/sickle_cells_show_potential_to_attack_aggressive_cancer_tumors-104880\">Sichelzellen motivieren</a> kann aggressive Tumore auszuhungern. Außerdem hat der Iran noch einen Affen ins All geschossen und Süd Korea seine erste Orbitalrakete mit eigenem Satteliten.</p>\n<p>Der immer unglaublich gut vorbereitete und stets sehr organisierte Reinhard &#8230;*hust* in dessen Aufgabenbereich diesmal ausnahmsweise die Shownotes fallen *hust*&#8230;berichtet uns im Februar vom schlimmsten <a href=\"http://en.wikipedia.org/wiki/2013_Russian_meteor_event\">Kometeneinschlag</a> seit 1908 (<a href=\"http://www.youtube.com/watch?v=duD0b1UMAnA\">VIDEO</a>) und erklärt 2013 zum Jahr des 3D-Druckers.</p>\n<p>Im März geht es wieder in den Weltraum bzw. auf den Mars der vor ca. 3 Milliarden Jahren vielleicht mal ein <a href=\"http://www.jpl.nasa.gov/news/news.php?release=2013-092\">Badeparadies mit trinkbarem Wasser</a> gewesen ist. Hier auf der Erde finden Wissenschaftler am CERN unterdessen das lange gesuchte Higgs-Boson. In Camebridge entsteht mit „<a href=\"http://www.cam.ac.uk/research/news/face-of-the-future-rears-its-head\">Zoe</a>“ so etwas wie die virtuelle kleine Schwester des T1000 und die ESA schaut mit dem Weltraumteleskop Planck fast bis zum Urknall zurück.</p>\n<p>Im April gibt es ein gewisses Gerummle um fast nichts&#8230;.Chinesen stellten einen neuen Rekord für das <a href=\"http://onlinelibrary.wiley.com/doi/10.1002/adma.201204576/abstract;jsessionid=8766154B159977ADE24B2A4D4B524EC0.d04t03?systemMessage=Pay+Per+View+will+be+unavailable+for+upto+3+hours+from+06%3A00+EST+March+23rd+on+Wiley+Online+Library.+We+apologise+for+the+inconvenience\">leichteste Material der Welt </a>auf. Am Massachusetts Gerneral Hospital gab es <a href=\"http://www.nature.com/nm/journal/v19/n5/full/nm.3154.html\">synthetische Rattennieren</a> aus dem Labor.</p>\n<p>Den Mai beginnt Nicolas mit dem wohl <a href=\"http://www.research.ibm.com/articles/madewithatoms.shtml#fbid=rwFKzm8-gXZ\">kleinsten Kurzfilm</a> der Geschichte aus den Forschungslaboren von IBM. Das wichtigste Ereigniss des Jahres <b>am 8. Mai geht die Nullnummer von Methodisch inkorrekt online! </b>Nicolas befürchtet, dass wir bald alle von einer geklonten Mamutarmee überrannt werden&#8230;zurecht?!</p>\n<p>Reinhard teilt diese Angst berichtet beschließt die erste Jahreshälfte mit der Entdeckung des „<a href=\"http://rspb.royalsocietypublishing.org/content/280/1763/20130665\">Lizard King</a>“ und dem Koalitionsversprechen das wir alle dank eines <a href=\"http://www.sciencemag.org/content/340/6140/1545\">neuen Lichtwellenleiters</a> schnelleres Internet bekommen könnten&#8230;sogar am Rande von Gelsenkirchen.</p>\n<p>Zur Halbzeit gibt es <a href=\"http://www.youtube.com/watch?v=I-UYZt9mEV0\">richtig schlimme Musik</a> und endlich was zu trinken.</p>\n<p>Das Abschlussbier des Jahres (<a href=\"http://eschenbraeu.de\">Echenbräu&#8230; unfiltrierter Genuss für Berlin</a>) wurde uns hoch wissenschaftlich als Weihnachtsgeschenk von Kalle,Grete,Wenke und Phillip von der Humbolt-Universität zu Berlin geschickt. Vielen Dank dafür! Endlich erfrischt startet Reinhard im Rahmen des letzten Experiments in diesem Jahr noch eine kleine Rakete auf Nicolas Schreibtisch. Die Bilder dazu findet ihr <a href=\"https://plus.google.com/photos/107341743493109591753/albums/5963555126999215329?authkey=CNjq9fmTiIflWg\">hier</a> und das Video des Starts <a href=\"http://youtu.be/oD73x821Oq8\">hier</a>.</p>\n<p>Die guten Nachrichten reißen für Reinhard einfach nicht ab als Nicolas die zweite Jahreshälfte mit <a href=\"http://informahealthcare.com/doi/abs/10.3109/15622975.2013.795243\">einer Studie</a> beginnt die feststellt, dass regelmäßiger Kaffeekonsum das Selbstmordrisiko um 50% senkt. Das erste komplett mit Solarenergie angetriebene Flugzeug überfliegt die USA. Es wird kurz in Erinnerungen geschwelgt an die genauste Uhr der Welt, den ersten menschengetriebenen Helikopter und die größte <a href=\"http://www.extremetech.com/extreme/162050-earth-and-moon-photographed-from-900-million-miles-away-from-the-shadow-of-saturn\">Photobomb</a> der Welt erinnert.</p>\n<p>Seit August ist das Periodensystem um ein weiteres <a href=\"http://lup.lub.lu.se/luur/download?func=downloadFile&recordOId=4002358&fileOId=4023003\">Element</a> reicher und Nicolas fragt sich &#8230;warum? Forscher der St. Andrews University bauen das <a href=\"http://www.opticsinfobase.org/abstract.cfm?URI=FiO-2013-FW6C.9\">schnellste rotierende, von Menschen gemachte Objekt der Welt </a>und wir überlegen in welcher Statistik wir wohl vorne stehen könnten. Des Weiteren nehmen wir, nach einem kurzen Verweis auf Mini Gehirne, künstliche Burger, noch alle Abschied vom ollen Jupp.</p>\n<p>Im September: „<a href=\"http://www.nasa.gov/mission_pages/voyager/voyager20130912.html#.UryGXZH0WPE\">The King has left the Building</a>“ Voyager verlässt unser Sonnensystem. Curiosity findet <a href=\"http://www.sciencemag.org/content/342/6156/355\">quasi kein Methan</a> in der Marsatmosphäre was zu dem Schluss führt, dass Marsianer nicht pupsen. Nicolas berichtet weiter von der Entdeckung der <a href=\"http://phys.org/news/2013-09-evidence-densest-galaxy-nearby-universe.html\">dichtesten Galaxie</a> und dem ersten Computer auf der Basis von Kohlenstoffnanoröhren. Photonen sind schon witzig neben Welle und Teilchen können sie jetzt sogar Molekül.</p>\n<p>Im Oktober rückt der Traum der quasi <a href=\"http://www.bbc.co.uk/news/science-environment-24429621\">unerschöpflichen Energiequelle</a> ein Stück weit näher&#8230;in den nächsten Jahren&#8230;versprochen&#8230;diesmal wirklich! Außerdem wurden die <a href=\"http://www.nobelprize.org/\">Nobelpreise für 2013</a> bekannt gegeben, nachzuhören in der methodisch inkorrekten Sonderfolge.</p>\n<p>Der November lässt uns, basierend auf Daten vom ollen Jupp, noch einmal vom Leben auf 40 Milliarden <a href=\"http://www.pnas.org/content/early/2013/10/31/1319909110\">anderen Planten</a> träumen. Auch Indien macht sich mit Mangalyaan auf den Weg zum roten Planeten. Neben dem bisher am längsten <a href=\"http://www.bbc.co.uk/news/science-environment-24934786\">stabilen Quantenzustand </a>gab es im November noch ein riesiges Experiment im ewigen Eis. Icecube misst erstmals kosmische Neutrinos und öffnet damit ein vollkommen <a href=\"http://www.umdrightnow.umd.edu/news/era-neutrino-astronomy-has-begun\">neues Feld der Astronomie</a>. Genauere Informationen hierzu liefert Omega Tau in der großartigen <a href=\"http://omegataupodcast.net/2013/11/134-high-energy-neutrinos-and-the-icecube-neutrino-observatory/\">Folge 135</a>.</p>\n<p>Reinhard beendet den wissenschaftlichen Rückblick mit der tiefsten seit Beginn der Wetteraufzeichnungen gemessenen <a href=\"http://www.theguardian.com/world/2013/dec/10/coldest-temperature-recorded-earth-antarctica-guinness-book\">Temperatur</a> und der Landung des &#8220;<a href=\"http://www.nasaspaceflight.com/2013/12/china-jade-rabbit-lunar-arrival/\">Jade Hasen</a>&#8221; auf dem Mond.</p>\n<p>Abschlusslied: „<a href=\"http://www.youtube.com/watch?v=oi7KPDi_yQI\">Bohemian Rapsody: Star Wars Edition</a>“</p>\n<p>Wir wünschen euch allen einen guten Rutsch ins neue Jahr und ein spannendes 2014 mit reichlich Wissenschaft!</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 19,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„Silvester-Gala der Wissenschaft“ direkt von der Silvesterparty der Wissenschaften.",
  "itunes:summary": "Wir blicken zurück auf ein Jahr 2013 voller Wissenschaften. Was waren die tollsten Entdeckungen. Wo passierte die spannendste Forschung. Experiment der Woche: \"Tischrakete\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 8941
}