{
  "id": "yt:video:xKjrnrsiKv4",
  "yt:videoId": "xKjrnrsiKv4",
  "yt:channelId": "UCdZcGRaBV-VRRyU4t6Ur0mw",
  "title": "Interview with Anne Charity Hudley",
  "link": "",
  "author": {
    "name": "The Ling Space",
    "uri": "https://www.youtube.com/channel/UCdZcGRaBV-VRRyU4t6Ur0mw"
  },
  "published": "2017-02-18T21:59:08+00:00",
  "updated": "2022-10-30T21:52:48+00:00",
  "media:group": {
    "media:title": "Interview with Anne Charity Hudley",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "We're really excited to have gotten to interview Anne Charity Hudley at the Linguistic Society of America meeting in January! Dr. Charity Hudley is an associate professor at the College of William and Mary, and the inaugural William and Mary Professor of Community Studies. She's co-authored two books on English language variation in classroom settings, and also wrote the section on language and racialization in the Oxford Handbook of Language and Society. She's a great sociolinguistic researcher who's doing a lot of work on dialectal variation, linguistic justice, and more. You can find out more about her and her work at https://annecharityhudley.com/\n\nIn our interview, we discussed the following topics:\n- the importance of attending to language variation in the classroom\n- what teachers and students have to learn from linguists, and vice versa\n- the role language and linguistics has played in racialization, and how to get away from that\n- how to work to convince people of the importance of interacting with language variation and linguistic justice\n- why we should do more to get younger people involved in linguistics and research\n\n... and more! Thanks again to Dr. Charity Hudley for speaking with us.\n\nOur other interviews:\nSali Tagliamonte: https://youtu.be/tapgQNcKuFo\nLisa Pearl: https://youtu.be/EOfGgqPeeC4\nDaniel Dennett: https://youtu.be/30eOI6pL-lU\nSteven Pinker: https://youtu.be/piJBmPh5jFU\n\nA couple of videos related to this interview:\nLinguistic Pride and Prejudice: Sociolinguistics, Languages, and Dialects - https://youtu.be/uEabSWeO02E\nWord Crimes and Misdemeanors: Linguistic Descriptivism vs. Prescriptivism - https://youtu.be/eFlBwBwL_iU\n\nFind us on all the social media worlds:\nTumblr: http://thelingspace.tumblr.com/\nTwitter: http://twitter.com/TheLingSpace\nFacebook: http://www.facebook.com/thelingspace/\n\nAnd at our website, http://www.thelingspace.com/ !\nYou can also find our store at the website, http://thelingspace.storenvy.com/\n\nWe also have forums to discuss this interview, and linguistics more generally.\n\nLooking forward to next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}