{
  "title": "Characterization of Cs-free negative ion production in the ion source SPIDER by Cavity Ring-Down Spectroscopy. (arXiv:2211.01695v1 [physics.plasm-ph])",
  "link": "http://arxiv.org/abs/2211.01695",
  "description": "<p>The Neutral beam Injectors of the ITER experiment will be based on negative\nion sources for the generation of beams composed by 1 MeV H/D particles. The\nprototype of these sources is currently under testing in the SPIDER experiment,\npart of the Neutral Beam Test Facility of Consorzio RFX, Padua. Among the\ntargets of the experimentation in SPIDER, it is of foremost importance to\nmaximize the beam current density extracted from the source acceleration\nsystem. The SPIDER operating conditions can be optimized thanks to a Cavity\nRing-down Spectroscopy diagnostic, which is able to give line-integrated\nmeasurements of negative ion density in proximity of the acceleration system\napertures. Regarding the diagnostic technique, this work presents a phenomenon\nof drift in ring down time measurements, which develops in a time scale of few\nhours. This issue may significantly affect negative ion density measurements\nfor plasma pulses of 1 h duration, as required by ITER. Causes and solutions\nare discussed. Regarding the source performance, this paper presents how\nnegative ion density is influenced by the RF power used to sustain the plasma,\nand by the magnetic filter field present in SPIDER to limit the amount of\nco-extracted electrons. In this study, SPIDER was operated in hydrogen and\ndeuterium, in Cs-free conditions.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Barbisan_M/0/1/0/all/0/1\">M. Barbisan</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Agnello_R/0/1/0/all/0/1\">R. Agnello</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Casati_G/0/1/0/all/0/1\">G. Casati</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Pasqualotto_R/0/1/0/all/0/1\">R. Pasqualotto</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Sartori_E/0/1/0/all/0/1\">E. Sartori</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Serianni_G/0/1/0/all/0/1\">G. Serianni</a>"
}