{
  "title": "Episode 34: &#8220;Tutti Frutti&#8221; by Little Richard",
  "link": "https://500songs.com/podcast/episode-34-tutti-frutti-by-little-richard/",
  "pubDate": "Tue, 28 May 2019 01:15:27 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-34-tutti-frutti-by-little-richard/",
  "description": "<p>Episode thirty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Tutti Frutti\" by Little Richard, and at the rather more family-unfriendly subject the song was originally about. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Also, a reminder for those who didn't see the previous post -- my patreon backers are now getting ten-minute mini-episodes every week, <a href=\"https://www.patreon.com/posts/27177565\">and the first one is up</a>, and I guested on <a href=\"https://www.mixcloud.com/sitcomclub/jaffa-cake-jukebox-show-30-top-twenty-january-18th-1957/\">Jaffa Cake Jukebox</a> this week, talking about the UK top twenty for January 18 1957.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-34-tutti-frutti/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.</p>\n<p>Most of the information used here comes from <a href=\"https://amzn.to/2EF8WGm\"><em>The Life and Times of Little Richard: The Authorised Biography</em> by Charles White</a>, which is to all intents and purposes Richard's autobiography, as much of the text is in his own words. A warning for those who might be considering buying this though -- it contains descriptions of his abuse as a child, and is also full of internalised homo- bi- and trans-phobia.</p>\n<p><a href=\"https://amzn.to/2VUiC5B\">This collection</a> contains everything Richard recorded before 1962, from his early blues singles through to his gospel albums from after he temporarily gave up rock and roll for the church.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>There are a handful of musicians in the history of rock music who seem like true originals. You can always trace their influences, of course, but when you come across one of them, no matter how clearly you can see who they were copying and who they were inspired by, you still just respond to them as something new under the sun.</p>\n<p>And of all the classic musicians of rock and roll, probably nobody epitomises that more than Little Richard. Nobody before him sounded like he did, and while many later tried -- everyone from Captain Beefheart to Paul McCartney -- nobody ever quite sounded like him later.</p>\n<p>And there are good reasons for that, because Little Richard was -- and still is -- someone who is quite unlike anyone else.</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>This episode will be the first time we see queer culture becoming a major part of the rock and roll story -- we've dealt with possibly-LGBT people before, of course, with Big Mama Thornton and Sister Rosetta Tharpe, and with Johnny Ray in the Patreon-only episode about him, but this is the first time that an expression of sexuality has become part and parcel of the music itself, to the extent that we have to discuss it.</p>\n<p>And here, again, I have to point out that I am going to get things very wrong when I'm talking about Little Richard. I am a cis straight white man in Britain in the twenty-first century. Little Richard is a queer black man from the USA, and we're talking about the middle of the twentieth century. I'm fairly familiar with current British LGBT+ culture, but even that is as an outsider. I am trying, always, to be completely fair and to never say anything that harms a marginalised group, but if I do so inadvertently, I apologise.</p>\n<p>When I say he's queer, I'm using the word not in its sense as a slur, but in the sense of an umbrella term for someone whose sexuality and gender identity are too complex to reduce to a single label, because he has at various times defined himself as gay, but he has also had relationships with women, and because from reading his autobiography there are so many passages where he talks about wishing he had been born a woman that it may well be that had he been born fifty years later he would have defined himself as a bisexual trans woman rather than a gay man. I will still, though, use \"he\" and \"him\" pronouns for him in this and future episodes, because those are the pronouns he uses himself.</p>\n<p>Here we're again going to see something we saw with Rosetta Tharpe, but on a much grander scale -- the pull between the secular and the divine.</p>\n<p>You see, as well as being some variety of queer, Little Richard is also a very, very, religious man, and a believer in a specific variety of fundamentalist Christianity that believes that any kind of sexuality or gender identity other than monogamous cis heterosexual is evil and sinful and the work of the Devil. He believes this very deeply and has at many times tried to live his life by this, and does so now. I, to put it as mildly as possible, disagree. But to understand the man and his music at all, you have to at least understand that this is the case. He has swung wildly between being almost the literal embodiment of the phrase \"sex and drugs and rock and roll\" and being a preacher who claims that homosexuality, bisexuality, and being trans are all works of the literal Devil -- several times he's gone from one to the other. As of 2017, and the last public interview I've seen with him, he has once again renounced rock and roll and same-sex relationships. I hope that he's happy in his current situation.</p>\n<p>But at the time we're talking about, he was a young person, and very much engaged in those things.</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>Richard Penniman was the third of twelve children, born to parents who had met at a Pentecostal holiness meeting when they were thirteen and married when they were fourteen. Of all the children, Richard was the one who was most likely to cause trouble. He had a habit of playing practical jokes involving his own faeces -- wrapping them up and giving them as presents to old ladies, or putting them in jars in the pantry for his mother to find.</p>\n<p>But he was also bullied terribly as a child, because he was disabled. One of his legs was significantly shorter than the other, his head was disproportionately large, and his eyes were different sizes. He was also subjected to homophobic abuse from a very early age, because the gait with which he walked because of his legs was vaguely mincing.</p>\n<p>At the age of fourteen, he decided to leave school and become a performer. He started out by touring with a snake-oil salesman.</p>\n<p>Snake oil is a traditional Chinese medicine, about which there have been claims made for centuries, and those claims might well be true. But snake oil in the US was usually a mixture of turpentine, tallow, camphor, and capsaicin. It wasn't much different to Vicks' VaporRub and similar substances, but it was sold as a cure-all for serious illnesses.</p>\n<p>Snake-oil salesmen would travel from town to town selling their placebo, and they would have entertainers performing with them in order to draw crowds. The young Richard Penniman travelled with \"Doc Hudson\", and would sing the one non-religious song he knew, \"Caldonia\" by Louis Jordan:</p>\n<p>[Excerpt: Louis Jordan, \"Caldonia\"]</p>\n<p>The yelps and hiccups in Jordan's vocals on that song would become a massive part of Richard's own vocal style.</p>\n<p>Richard soon left the medicine show, and started touring with a band, B. Brown and his orchestra, and it was while he was touring with that band that he grew his hair into the huge pompadour that would later become a trademark, and he also got the name \"Little Richard\". However, all the musicians in the band were older than him, so he moved on again to another touring show, and another, and another. In many of these shows, he would perform as a female impersonator, which started when one of the women in one of the shows took sick and Richard had to quickly cover for her by putting on her costume, but soon he was performing in shows that were mostly drag acts, performing to a largely gay crowd.</p>\n<p>It was while he was performing in these shows that he met the first of his two biggest influences. Billy Wright, like Richard, had been a female impersonator for a while too. Like Richard, he had a pompadour haircut, and he was a fairly major blues star in the period from 1949 through 1951, being one of the first blues singers to sing with gospel-inspired mannerisms:</p>\n<p>[Excerpt: Billy Wright, \"Married Woman's Boogie\"]</p>\n<p>Richard became something of a Billy Wright wannabe, and started incorporating parts of Wright's style into his performances. He also learned that Wright was using makeup on stage -- Pancake 31 -- and started applying that same makeup to his own skin, something he would continue to do throughout his performing career.</p>\n<p>Wright introduced Richard to Zenas Sears, who was one of the many white DJs all across America who were starting to become successful by playing black music and speaking in approximations of African-American Vernacular English -- people like Alan Freed and Dewey Phillips.</p>\n<p>Sears had connections with RCA Records, and impressed by Richard's talent, he got them to sign him. Richard's first single was called \"Every Hour\", and was very much a Billy Wright imitation:</p>\n<p>[Excerpt: Little Richard, \"Every Hour\"]</p>\n<p>It was so close to Wright's style, in fact, that Wright soon recorded his own knock-off of Richard's song, \"Every Evening\".</p>\n<p>[Excerpt: Billy Wright, \"Every Evening\"]</p>\n<p>At this point Richard was solely a singer -- he hadn't yet started to play an instrument to accompany himself. That changed when he met Esquerita.</p>\n<p>Esquerita was apparently born Stephen Quincey Reeder, but he was known to everyone as \"Eskew\" Reeder, after his initials, and that then became Esquerita, partly as a pun on the word \"excreta\".</p>\n<p>Esquerita was another gay black R&B singer with a massive pompadour and a moustache. If Little Richard at this stage looked like a caricature of Billy Wright, Esquerita looked like a caricature of Little Richard. His hair was even bigger, he was even more flamboyant, and when he sang, he screamed even louder. And Esquerita also played the piano.</p>\n<p>Richard -- who has never been unwilling to acknowledge the immense debt he owed to his inspirations -- has said for years that Esquerita was the person who taught him how to play the piano, and that not only was his piano-playing style a copy of Esquerita's, Esquerita was better.</p>\n<p>It's hard to tell for sure exactly how much influence Esquerita actually had on Richard's piano playing, because Esquerita himself didn't make any records until after Richard did, at which point he was signed to his own record deal to be basically a Little Richard clone, but the records he did make certainly show a remarkable resemblance to Richard's later style:</p>\n<p>[Excerpt: Esquerita: \"Believe Me When I Say Rock And Roll Is Here To Stay\"]</p>\n<p>Richard soon learned to play piano, and he was seen by Johnny Otis, who was impressed. Otis said: \"I see this outrageous person, good-looking and very effeminate, with a big pompadour. He started singing and he was so good. I loved it. He reminded me of Dinah Washington. He did a few things, then he got on the floor. I think he even did a split, though I could be wrong about that. I remember it as being just beautiful, bizarre, and exotic, and when he got through he remarked, “This is Little Richard, King of the Blues,” and then he added, “And the Queen, too!” I knew I liked him then.\"</p>\n<p>Otis recommended Richard to Don Robey, of Peacock Records, and Robey signed Richard and his band the Tempo Toppers. In early 1953, with none of his recordings for RCA having done anything, Little Richard and the Tempo Toppers went into the studio with another group, the Deuces of Rhythm, to record four tracks, issued as two singles:</p>\n<p>[Excerpt: Little Richard and the Tempo Toppers with the Deuces of Rhythm: \"Ain't That Good News\"]</p>\n<p>None of these singles had any success, and Richard was *not* getting on very well at all with Don Robey. Robey was not the most respectful of people, and Richard let everyone know how badly he thought Robey treated his artists. Robey responded by beating Richard up so badly that he got a hernia which hurt for years and necessitated an operation.</p>\n<p>Richard would record one more session for Peacock, at the end of the year, when Don Robey gave him to Johnny Otis to handle. Otis took his own band into the studio with Richard, and the four songs they recorded at that session went unreleased at the time, but included a version of \"Directly From My Heart To You\", a song Richard would soon rerecord, and another song called \"Little Richard's Boogie\":</p>\n<p>[Excerpt: Little Richard with Johnny Otis and his Orchestra, \"Little Richard's Boogie\"]</p>\n<p>Nobody was very happy with the recordings, and Richard was dropped by Peacock. He was also, around the same time, made to move away from Macon, Georgia, where he lived, after being arrested for \"lewd conduct\" -- what amounted to consensual voyeurism. And the Tempo Toppers had split up. Richard had been dumped by two record labels, his father had died recently, he had no band, and he wasn't allowed to live in his home town any more. Things seemed pretty low.</p>\n<p>But before he'd moved away, Richard had met Lloyd Price, and Price had suggested that Richard send a demo tape in to Specialty Records, Price's label. The tape lay unlistened at Specialty for months, and it was only because of Richard's constant pestering for them to listen to it that Bumps Blackwell, who was then in charge of A&R at Specialty, eventually got round to listening to it.</p>\n<p>This was an enormous piece of good fortune, in a way that neither of them fully realised at the time. Blackwell had been a longtime friend and colleague of Ray Charles. When Charles' gospel-influenced new sound had started making waves on the charts, Art Rupe, Specialty's owner, had asked Blackwell to find him a gospel-sounding R&B singer of his own to compete with Ray Charles.</p>\n<p>Blackwell listened to the tape, which contained two songs, one of which was an early version of \"Wonderin'\", and he could tell this was someone with as much gospel in his voice as Ray Charles had:</p>\n<p>[Excerpt: Little Richard, \"Wonderin'\"]</p>\n<p>Blackwell and Rupe made an agreement with Don Robey to buy out his contract for six hundred dollars -- one gets the impression that Robey would have paid *them* six hundred dollars to get rid of Richard had they asked him.</p>\n<p>They knew that Richard liked the music of Fats Domino, and so they decided to hold their first session at Cosimo Matassa's studio, where Domino recorded, and with the same session musicians that Domino used. Blackwell also brought in two great New Orleans piano players, Huey \"Piano\" Smith and James Booker, both of whom were players in the same style as Domino. You can hear Smith, for example, on his hit \"The Rockin' Pneumonia and the Boogie-Woogie Flu\" from a couple of years later:</p>\n<p>[Excerpt: Huey \"Piano\" Smith, \"The Rockin' Pneumonia and the Boogie-Woogie Flu\"]</p>\n<p>All of these people were veterans of sessions either for Domino or for artists who had worked in Domino's style, like Lloyd Price or Smiley Lewis. The only difference here was that it would be Bumps Blackwell who did the arrangement and production, rather than Dave Bartholomew like on Domino's records.</p>\n<p>However, the session didn't go well at all. Blackwell had heard that Richard was an astounding live act, but he was just doing nothing in the studio. As Blackwell later put it \"If you look like Tarzan and sound like Mickey Mouse it just doesn’t work out.\"</p>\n<p>They did record some usable material -- \"Wonderin'\", which we heard before, came out OK, and they recorded \"I'm Just a Lonely, Lonely, Guy\" by a young songwriter called Dorothy LaBostrie, which seemed to go OK. They also cut a decent version of \"Directly From My Heart to You\", a song which Richard had previously recorded with Johnny Otis:</p>\n<p>[Excerpt: Little RIchard, \"Directly From My Heart to You\"]</p>\n<p>So they had a couple of usable songs, but usable was about all you could say for them. They didn't have anything that would make an impact, nothing that would live up to Richard's potential.</p>\n<p>So Blackwell called a break, and they headed off to get themselves something to eat, at the Dew Drop Inn. And something happened there that would change Little RIchard's career forever.</p>\n<p>The Dew Drop Inn had a piano, and it had an audience that Little Richard could show off in front of. He went over to the piano, started hammering the keys, and screamed out:</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>On hearing Richard sing the song he performed then, Bumps Blackwell knew two things pretty much instantly. The first was that that song would definitely be a hit if he could get it released. And the second was that there was no way on Earth that he could possibly put it out.</p>\n<p>\"Tutti Frutti\" started as a song that Richard sang more or less as a joke. There is a whole undercurrent of R&B in the fifties which has very, very, sexually explicit lyrics, and I wish I was able to play some of those songs on this podcast without getting it dumped into the adult-only section on iTunes, because some of them are wonderful, and others are hilarious.</p>\n<p>\"Tutti Frutti\" in its original form was part of this undercurrent, and had lyrics that were clearly not broadcastable -- \"A wop bop a loo mop, a good goddam/Tutti Frutti, good booty/If it don't fit, don't force it, you can grease it, make it easy\". But Bumps Blackwell thought that there was *something* that could be made into a hit there.</p>\n<p>Handily, they had a songwriter on hand. Dorothy LaBostrie was a young woman he knew who had been trying to write songs, but who didn't understand that songs had to have different melodies -- all her lyrics were written to the melody of the same song, Dinah Washington's \"Blowtop Blues\":</p>\n<p>[Excerpt: Dinah Washington, \"Blowtop Blues\"]</p>\n<p>But her lyrics had showed promise, and so Blackwell had agreed to record one of her songs, \"I'm Just a Lonely Lonely Guy\", with Richard. LaBostrie had been hanging round the studio to see how her song sounded when it was recorded, so Blackwell asked her to do a last-minute rewrite on “Tutti Frutti”, in the hope of getting something salvageable out of what had been a depressing session. But there was still a problem -- Richard, not normally a man overly known for his modesty, became embarrassed at singing his song to the young woman.</p>\n<p>Blackwell explained to him that he really didn't have much choice, and Richard eventually agreed to sing it to her -- but only if he was turned to face the wall, so he couldn't see this innocent-looking young woman's face.</p>\n<p>(I should note here that both Richard and LaBostrie have told different stories about this over the years -- both have claimed on several occasions that they were the sole author of the song and that the other didn't deserve any credit at all. But this is the story as it was told by others who were there.)</p>\n<p>LaBostrie's new lyrics were rudimentary at best. \"I got a girl named Sue, she knows just what to do\". But they fit the metre, they weren't about anal sex, and so they were going to be the new lyrics.</p>\n<p>The session was running late at this point, and when LaBostrie had the lyrics finished there was only fifteen minutes to go. It didn't matter that the lyrics were trite. What mattered was that they got a track cut to salvage the session. Blackwell didn't have time to teach the piano players the song, so he got Richard to play the piano himself. They cut the finished track in three takes, and Blackwell went back to California happy he at last had a hit:</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\"]</p>\n<p>\"Tutti Frutti\" was, indeed, a massive hit. It went to number twenty-one on the pop charts. But... you know what comes next. There was an inept white cover version, this time by Pat Boone.</p>\n<p>[excerpt: Pat Boone, \"Tutti Frutti\"]</p>\n<p>Now, notice that there, Boone changes the lyrics. In Richard's version, after all, he seems interested in both Sue and Daisy. A good Christian boy like Pat Boone couldn't be heard singing about such immorality. That one-line change (and a couple of other spot changes to individual words to make things into full sentences) seems to be why a songwriter called Joe Lubin is also credited for the song. Getting a third of a song like \"Tutti Frutti\" for that little work sounds like a pretty good deal, at least for Lubin, if not for Richard.</p>\n<p>Another way in which Richard got less than he deserved was that the publishing was owned by a company owned by Art Rupe. That company licensed the song to Specialty Records for half the normal mechanical licensing rate -- normally a publishing company would charge two cents per record pressed for their songs, but instead Specialty only had to pay one cent. This sort of cross-collateralisation was common with independent labels at the time, but it still rankled to Richard when he figured it out.</p>\n<p>Not that he was thinking about contracts at all at this point. He was becoming a huge star, and that meant he had to *break* a lot of contracts. He'd got concert bookings for several months ahead, but those bookings were in second-rate clubs, and he had to be in Hollywood to promote his new record and build a new career. But he also didn't want to get a reputation for missing gigs. There was only one thing to do -- hire an impostor to be Little Richard at these low-class gigs. So while Richard went off to promote his record, another young singer from Georgia with a pompadour and a gospel feel was being introduced with the phrase “Ladies and gentlemen—the hardest-working man in showbusiness today—Little Richard!”</p>\n<p>When James Brown went back to performing under his own name, he kept that introduction...</p>\n<p>Meanwhile, Richard was working on his second hit record. He and Blackwell decided that this record should be louder, faster, and more raucous than \"Tutti Frutti\" had been. If Pat Boone wanted to cover this one, he'd have to work a lot harder than he had previously.</p>\n<p>The basis for \"Long Tall Sally\" came from a scrap of lyric written by a teenage girl. Enotris Johnson had written a single verse of lyric on a scrap of paper, and had walked many miles to New Orleans to show the lyric to a DJ named Honey Chile. (Bumps Blackwell describes her as having walked from Opelousas, Mississippi, but there's no such place -- Johnson appears to have lived in Bogalusa, Louisiana). Johnson wanted to make enough money to pay for hospital for her sick aunt -- the \"Aunt Mary\" in the song, and thought that Little Richard might sing the song and get her the money.</p>\n<p>What she had was only a few lines, but Honey Chile had taken Johnson on as a charity project, and Blackwell didn't want to disappoint such an influential figure, so he and Richard hammered something together:</p>\n<p>[Excerpt: Little Richard, \"Long Tall Sally\"]</p>\n<p>The song, about a \"John\" who \"jumps back in the alley\" when he sees his wife coming while he's engaged in activities of an unspecified nature with \"Sally\", who is long, tall, and bald, once again stays just on the broadcastable side of the line, while implying sex of a non-heteronormative variety, possibly with a sex worker. Despite this, and despite the attempts to make the song uncoverably raucous, Pat Boone still sold a million copies with his cover version:</p>\n<p>[Excerpt: Pat Boone, \"Long Tall Sally\"]</p>\n<p>So Little Richard had managed to get that good clean-cut wholesome Christian white boy Pat Boone singing songs which gave him a lot more to worry about than whether he was singing \"Ain't\" rather than \"Isn't\". But he was also becoming a big star himself -- and he was getting an ego to go along with it. And he was starting to worry whether he should be making this devil music at all. When we next look at Little Richard, we'll see just how the combination of self-doubt and ego led to his greatest successes and to the collapse of his career.</p>\n<p> </p>",
  "itunes:subtitle": "Episode thirty-four of A History of Rock Music in Five Hundred Songs looks at Tutti Frutti by Little Richard, and at the rather more family-unfriendly subject the song was originally about. Click the full post to read liner notes, links to more informati",
  "itunes:keywords": "Art Rupe,Billy Wright,Bumps Blackwell,Cosimo Matassa,Don Robey,Esquerita,gospel,James Brown,Johnny Otis,LGBT+ people,Little Richard,Lloyd Price,Louis Jordan,Pat Boone,Peacock Records,RCA Records,Specialty Records,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 34,
  "content:encoded": "<p>Episode thirty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Tutti Frutti\" by Little Richard, and at the rather more family-unfriendly subject the song was originally about. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Also, a reminder for those who didn't see the previous post -- my patreon backers are now getting ten-minute mini-episodes every week, <a href=\"https://www.patreon.com/posts/27177565\">and the first one is up</a>, and I guested on <a href=\"https://www.mixcloud.com/sitcomclub/jaffa-cake-jukebox-show-30-top-twenty-january-18th-1957/\">Jaffa Cake Jukebox</a> this week, talking about the UK top twenty for January 18 1957.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-34-tutti-frutti/\">a Mixcloud streaming playlist </a>with full versions of all the songs in the episode.</p>\n<p>Most of the information used here comes from <a href=\"https://amzn.to/2EF8WGm\"><em>The Life and Times of Little Richard: The Authorised Biography</em> by Charles White</a>, which is to all intents and purposes Richard's autobiography, as much of the text is in his own words. A warning for those who might be considering buying this though -- it contains descriptions of his abuse as a child, and is also full of internalised homo- bi- and trans-phobia.</p>\n<p><a href=\"https://amzn.to/2VUiC5B\">This collection</a> contains everything Richard recorded before 1962, from his early blues singles through to his gospel albums from after he temporarily gave up rock and roll for the church.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>There are a handful of musicians in the history of rock music who seem like true originals. You can always trace their influences, of course, but when you come across one of them, no matter how clearly you can see who they were copying and who they were inspired by, you still just respond to them as something new under the sun.</p>\n<p>And of all the classic musicians of rock and roll, probably nobody epitomises that more than Little Richard. Nobody before him sounded like he did, and while many later tried -- everyone from Captain Beefheart to Paul McCartney -- nobody ever quite sounded like him later.</p>\n<p>And there are good reasons for that, because Little Richard was -- and still is -- someone who is quite unlike anyone else.</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>This episode will be the first time we see queer culture becoming a major part of the rock and roll story -- we've dealt with possibly-LGBT people before, of course, with Big Mama Thornton and Sister Rosetta Tharpe, and with Johnny Ray in the Patreon-only episode about him, but this is the first time that an expression of sexuality has become part and parcel of the music itself, to the extent that we have to discuss it.</p>\n<p>And here, again, I have to point out that I am going to get things very wrong when I'm talking about Little Richard. I am a cis straight white man in Britain in the twenty-first century. Little Richard is a queer black man from the USA, and we're talking about the middle of the twentieth century. I'm fairly familiar with current British LGBT+ culture, but even that is as an outsider. I am trying, always, to be completely fair and to never say anything that harms a marginalised group, but if I do so inadvertently, I apologise.</p>\n<p>When I say he's queer, I'm using the word not in its sense as a slur, but in the sense of an umbrella term for someone whose sexuality and gender identity are too complex to reduce to a single label, because he has at various times defined himself as gay, but he has also had relationships with women, and because from reading his autobiography there are so many passages where he talks about wishing he had been born a woman that it may well be that had he been born fifty years later he would have defined himself as a bisexual trans woman rather than a gay man. I will still, though, use \"he\" and \"him\" pronouns for him in this and future episodes, because those are the pronouns he uses himself.</p>\n<p>Here we're again going to see something we saw with Rosetta Tharpe, but on a much grander scale -- the pull between the secular and the divine.</p>\n<p>You see, as well as being some variety of queer, Little Richard is also a very, very, religious man, and a believer in a specific variety of fundamentalist Christianity that believes that any kind of sexuality or gender identity other than monogamous cis heterosexual is evil and sinful and the work of the Devil. He believes this very deeply and has at many times tried to live his life by this, and does so now. I, to put it as mildly as possible, disagree. But to understand the man and his music at all, you have to at least understand that this is the case. He has swung wildly between being almost the literal embodiment of the phrase \"sex and drugs and rock and roll\" and being a preacher who claims that homosexuality, bisexuality, and being trans are all works of the literal Devil -- several times he's gone from one to the other. As of 2017, and the last public interview I've seen with him, he has once again renounced rock and roll and same-sex relationships. I hope that he's happy in his current situation.</p>\n<p>But at the time we're talking about, he was a young person, and very much engaged in those things.</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>Richard Penniman was the third of twelve children, born to parents who had met at a Pentecostal holiness meeting when they were thirteen and married when they were fourteen. Of all the children, Richard was the one who was most likely to cause trouble. He had a habit of playing practical jokes involving his own faeces -- wrapping them up and giving them as presents to old ladies, or putting them in jars in the pantry for his mother to find.</p>\n<p>But he was also bullied terribly as a child, because he was disabled. One of his legs was significantly shorter than the other, his head was disproportionately large, and his eyes were different sizes. He was also subjected to homophobic abuse from a very early age, because the gait with which he walked because of his legs was vaguely mincing.</p>\n<p>At the age of fourteen, he decided to leave school and become a performer. He started out by touring with a snake-oil salesman.</p>\n<p>Snake oil is a traditional Chinese medicine, about which there have been claims made for centuries, and those claims might well be true. But snake oil in the US was usually a mixture of turpentine, tallow, camphor, and capsaicin. It wasn't much different to Vicks' VaporRub and similar substances, but it was sold as a cure-all for serious illnesses.</p>\n<p>Snake-oil salesmen would travel from town to town selling their placebo, and they would have entertainers performing with them in order to draw crowds. The young Richard Penniman travelled with \"Doc Hudson\", and would sing the one non-religious song he knew, \"Caldonia\" by Louis Jordan:</p>\n<p>[Excerpt: Louis Jordan, \"Caldonia\"]</p>\n<p>The yelps and hiccups in Jordan's vocals on that song would become a massive part of Richard's own vocal style.</p>\n<p>Richard soon left the medicine show, and started touring with a band, B. Brown and his orchestra, and it was while he was touring with that band that he grew his hair into the huge pompadour that would later become a trademark, and he also got the name \"Little Richard\". However, all the musicians in the band were older than him, so he moved on again to another touring show, and another, and another. In many of these shows, he would perform as a female impersonator, which started when one of the women in one of the shows took sick and Richard had to quickly cover for her by putting on her costume, but soon he was performing in shows that were mostly drag acts, performing to a largely gay crowd.</p>\n<p>It was while he was performing in these shows that he met the first of his two biggest influences. Billy Wright, like Richard, had been a female impersonator for a while too. Like Richard, he had a pompadour haircut, and he was a fairly major blues star in the period from 1949 through 1951, being one of the first blues singers to sing with gospel-inspired mannerisms:</p>\n<p>[Excerpt: Billy Wright, \"Married Woman's Boogie\"]</p>\n<p>Richard became something of a Billy Wright wannabe, and started incorporating parts of Wright's style into his performances. He also learned that Wright was using makeup on stage -- Pancake 31 -- and started applying that same makeup to his own skin, something he would continue to do throughout his performing career.</p>\n<p>Wright introduced Richard to Zenas Sears, who was one of the many white DJs all across America who were starting to become successful by playing black music and speaking in approximations of African-American Vernacular English -- people like Alan Freed and Dewey Phillips.</p>\n<p>Sears had connections with RCA Records, and impressed by Richard's talent, he got them to sign him. Richard's first single was called \"Every Hour\", and was very much a Billy Wright imitation:</p>\n<p>[Excerpt: Little Richard, \"Every Hour\"]</p>\n<p>It was so close to Wright's style, in fact, that Wright soon recorded his own knock-off of Richard's song, \"Every Evening\".</p>\n<p>[Excerpt: Billy Wright, \"Every Evening\"]</p>\n<p>At this point Richard was solely a singer -- he hadn't yet started to play an instrument to accompany himself. That changed when he met Esquerita.</p>\n<p>Esquerita was apparently born Stephen Quincey Reeder, but he was known to everyone as \"Eskew\" Reeder, after his initials, and that then became Esquerita, partly as a pun on the word \"excreta\".</p>\n<p>Esquerita was another gay black R&B singer with a massive pompadour and a moustache. If Little Richard at this stage looked like a caricature of Billy Wright, Esquerita looked like a caricature of Little Richard. His hair was even bigger, he was even more flamboyant, and when he sang, he screamed even louder. And Esquerita also played the piano.</p>\n<p>Richard -- who has never been unwilling to acknowledge the immense debt he owed to his inspirations -- has said for years that Esquerita was the person who taught him how to play the piano, and that not only was his piano-playing style a copy of Esquerita's, Esquerita was better.</p>\n<p>It's hard to tell for sure exactly how much influence Esquerita actually had on Richard's piano playing, because Esquerita himself didn't make any records until after Richard did, at which point he was signed to his own record deal to be basically a Little Richard clone, but the records he did make certainly show a remarkable resemblance to Richard's later style:</p>\n<p>[Excerpt: Esquerita: \"Believe Me When I Say Rock And Roll Is Here To Stay\"]</p>\n<p>Richard soon learned to play piano, and he was seen by Johnny Otis, who was impressed. Otis said: \"I see this outrageous person, good-looking and very effeminate, with a big pompadour. He started singing and he was so good. I loved it. He reminded me of Dinah Washington. He did a few things, then he got on the floor. I think he even did a split, though I could be wrong about that. I remember it as being just beautiful, bizarre, and exotic, and when he got through he remarked, “This is Little Richard, King of the Blues,” and then he added, “And the Queen, too!” I knew I liked him then.\"</p>\n<p>Otis recommended Richard to Don Robey, of Peacock Records, and Robey signed Richard and his band the Tempo Toppers. In early 1953, with none of his recordings for RCA having done anything, Little Richard and the Tempo Toppers went into the studio with another group, the Deuces of Rhythm, to record four tracks, issued as two singles:</p>\n<p>[Excerpt: Little Richard and the Tempo Toppers with the Deuces of Rhythm: \"Ain't That Good News\"]</p>\n<p>None of these singles had any success, and Richard was *not* getting on very well at all with Don Robey. Robey was not the most respectful of people, and Richard let everyone know how badly he thought Robey treated his artists. Robey responded by beating Richard up so badly that he got a hernia which hurt for years and necessitated an operation.</p>\n<p>Richard would record one more session for Peacock, at the end of the year, when Don Robey gave him to Johnny Otis to handle. Otis took his own band into the studio with Richard, and the four songs they recorded at that session went unreleased at the time, but included a version of \"Directly From My Heart To You\", a song Richard would soon rerecord, and another song called \"Little Richard's Boogie\":</p>\n<p>[Excerpt: Little Richard with Johnny Otis and his Orchestra, \"Little Richard's Boogie\"]</p>\n<p>Nobody was very happy with the recordings, and Richard was dropped by Peacock. He was also, around the same time, made to move away from Macon, Georgia, where he lived, after being arrested for \"lewd conduct\" -- what amounted to consensual voyeurism. And the Tempo Toppers had split up. Richard had been dumped by two record labels, his father had died recently, he had no band, and he wasn't allowed to live in his home town any more. Things seemed pretty low.</p>\n<p>But before he'd moved away, Richard had met Lloyd Price, and Price had suggested that Richard send a demo tape in to Specialty Records, Price's label. The tape lay unlistened at Specialty for months, and it was only because of Richard's constant pestering for them to listen to it that Bumps Blackwell, who was then in charge of A&R at Specialty, eventually got round to listening to it.</p>\n<p>This was an enormous piece of good fortune, in a way that neither of them fully realised at the time. Blackwell had been a longtime friend and colleague of Ray Charles. When Charles' gospel-influenced new sound had started making waves on the charts, Art Rupe, Specialty's owner, had asked Blackwell to find him a gospel-sounding R&B singer of his own to compete with Ray Charles.</p>\n<p>Blackwell listened to the tape, which contained two songs, one of which was an early version of \"Wonderin'\", and he could tell this was someone with as much gospel in his voice as Ray Charles had:</p>\n<p>[Excerpt: Little Richard, \"Wonderin'\"]</p>\n<p>Blackwell and Rupe made an agreement with Don Robey to buy out his contract for six hundred dollars -- one gets the impression that Robey would have paid *them* six hundred dollars to get rid of Richard had they asked him.</p>\n<p>They knew that Richard liked the music of Fats Domino, and so they decided to hold their first session at Cosimo Matassa's studio, where Domino recorded, and with the same session musicians that Domino used. Blackwell also brought in two great New Orleans piano players, Huey \"Piano\" Smith and James Booker, both of whom were players in the same style as Domino. You can hear Smith, for example, on his hit \"The Rockin' Pneumonia and the Boogie-Woogie Flu\" from a couple of years later:</p>\n<p>[Excerpt: Huey \"Piano\" Smith, \"The Rockin' Pneumonia and the Boogie-Woogie Flu\"]</p>\n<p>All of these people were veterans of sessions either for Domino or for artists who had worked in Domino's style, like Lloyd Price or Smiley Lewis. The only difference here was that it would be Bumps Blackwell who did the arrangement and production, rather than Dave Bartholomew like on Domino's records.</p>\n<p>However, the session didn't go well at all. Blackwell had heard that Richard was an astounding live act, but he was just doing nothing in the studio. As Blackwell later put it \"If you look like Tarzan and sound like Mickey Mouse it just doesn’t work out.\"</p>\n<p>They did record some usable material -- \"Wonderin'\", which we heard before, came out OK, and they recorded \"I'm Just a Lonely, Lonely, Guy\" by a young songwriter called Dorothy LaBostrie, which seemed to go OK. They also cut a decent version of \"Directly From My Heart to You\", a song which Richard had previously recorded with Johnny Otis:</p>\n<p>[Excerpt: Little RIchard, \"Directly From My Heart to You\"]</p>\n<p>So they had a couple of usable songs, but usable was about all you could say for them. They didn't have anything that would make an impact, nothing that would live up to Richard's potential.</p>\n<p>So Blackwell called a break, and they headed off to get themselves something to eat, at the Dew Drop Inn. And something happened there that would change Little RIchard's career forever.</p>\n<p>The Dew Drop Inn had a piano, and it had an audience that Little Richard could show off in front of. He went over to the piano, started hammering the keys, and screamed out:</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]</p>\n<p>On hearing Richard sing the song he performed then, Bumps Blackwell knew two things pretty much instantly. The first was that that song would definitely be a hit if he could get it released. And the second was that there was no way on Earth that he could possibly put it out.</p>\n<p>\"Tutti Frutti\" started as a song that Richard sang more or less as a joke. There is a whole undercurrent of R&B in the fifties which has very, very, sexually explicit lyrics, and I wish I was able to play some of those songs on this podcast without getting it dumped into the adult-only section on iTunes, because some of them are wonderful, and others are hilarious.</p>\n<p>\"Tutti Frutti\" in its original form was part of this undercurrent, and had lyrics that were clearly not broadcastable -- \"A wop bop a loo mop, a good goddam/Tutti Frutti, good booty/If it don't fit, don't force it, you can grease it, make it easy\". But Bumps Blackwell thought that there was *something* that could be made into a hit there.</p>\n<p>Handily, they had a songwriter on hand. Dorothy LaBostrie was a young woman he knew who had been trying to write songs, but who didn't understand that songs had to have different melodies -- all her lyrics were written to the melody of the same song, Dinah Washington's \"Blowtop Blues\":</p>\n<p>[Excerpt: Dinah Washington, \"Blowtop Blues\"]</p>\n<p>But her lyrics had showed promise, and so Blackwell had agreed to record one of her songs, \"I'm Just a Lonely Lonely Guy\", with Richard. LaBostrie had been hanging round the studio to see how her song sounded when it was recorded, so Blackwell asked her to do a last-minute rewrite on “Tutti Frutti”, in the hope of getting something salvageable out of what had been a depressing session. But there was still a problem -- Richard, not normally a man overly known for his modesty, became embarrassed at singing his song to the young woman.</p>\n<p>Blackwell explained to him that he really didn't have much choice, and Richard eventually agreed to sing it to her -- but only if he was turned to face the wall, so he couldn't see this innocent-looking young woman's face.</p>\n<p>(I should note here that both Richard and LaBostrie have told different stories about this over the years -- both have claimed on several occasions that they were the sole author of the song and that the other didn't deserve any credit at all. But this is the story as it was told by others who were there.)</p>\n<p>LaBostrie's new lyrics were rudimentary at best. \"I got a girl named Sue, she knows just what to do\". But they fit the metre, they weren't about anal sex, and so they were going to be the new lyrics.</p>\n<p>The session was running late at this point, and when LaBostrie had the lyrics finished there was only fifteen minutes to go. It didn't matter that the lyrics were trite. What mattered was that they got a track cut to salvage the session. Blackwell didn't have time to teach the piano players the song, so he got Richard to play the piano himself. They cut the finished track in three takes, and Blackwell went back to California happy he at last had a hit:</p>\n<p>[Excerpt: Little Richard, \"Tutti Frutti\"]</p>\n<p>\"Tutti Frutti\" was, indeed, a massive hit. It went to number twenty-one on the pop charts. But... you know what comes next. There was an inept white cover version, this time by Pat Boone.</p>\n<p>[excerpt: Pat Boone, \"Tutti Frutti\"]</p>\n<p>Now, notice that there, Boone changes the lyrics. In Richard's version, after all, he seems interested in both Sue and Daisy. A good Christian boy like Pat Boone couldn't be heard singing about such immorality. That one-line change (and a couple of other spot changes to individual words to make things into full sentences) seems to be why a songwriter called Joe Lubin is also credited for the song. Getting a third of a song like \"Tutti Frutti\" for that little work sounds like a pretty good deal, at least for Lubin, if not for Richard.</p>\n<p>Another way in which Richard got less than he deserved was that the publishing was owned by a company owned by Art Rupe. That company licensed the song to Specialty Records for half the normal mechanical licensing rate -- normally a publishing company would charge two cents per record pressed for their songs, but instead Specialty only had to pay one cent. This sort of cross-collateralisation was common with independent labels at the time, but it still rankled to Richard when he figured it out.</p>\n<p>Not that he was thinking about contracts at all at this point. He was becoming a huge star, and that meant he had to *break* a lot of contracts. He'd got concert bookings for several months ahead, but those bookings were in second-rate clubs, and he had to be in Hollywood to promote his new record and build a new career. But he also didn't want to get a reputation for missing gigs. There was only one thing to do -- hire an impostor to be Little Richard at these low-class gigs. So while Richard went off to promote his record, another young singer from Georgia with a pompadour and a gospel feel was being introduced with the phrase “Ladies and gentlemen—the hardest-working man in showbusiness today—Little Richard!”</p>\n<p>When James Brown went back to performing under his own name, he kept that introduction...</p>\n<p>Meanwhile, Richard was working on his second hit record. He and Blackwell decided that this record should be louder, faster, and more raucous than \"Tutti Frutti\" had been. If Pat Boone wanted to cover this one, he'd have to work a lot harder than he had previously.</p>\n<p>The basis for \"Long Tall Sally\" came from a scrap of lyric written by a teenage girl. Enotris Johnson had written a single verse of lyric on a scrap of paper, and had walked many miles to New Orleans to show the lyric to a DJ named Honey Chile. (Bumps Blackwell describes her as having walked from Opelousas, Mississippi, but there's no such place -- Johnson appears to have lived in Bogalusa, Louisiana). Johnson wanted to make enough money to pay for hospital for her sick aunt -- the \"Aunt Mary\" in the song, and thought that Little Richard might sing the song and get her the money.</p>\n<p>What she had was only a few lines, but Honey Chile had taken Johnson on as a charity project, and Blackwell didn't want to disappoint such an influential figure, so he and Richard hammered something together:</p>\n<p>[Excerpt: Little Richard, \"Long Tall Sally\"]</p>\n<p>The song, about a \"John\" who \"jumps back in the alley\" when he sees his wife coming while he's engaged in activities of an unspecified nature with \"Sally\", who is long, tall, and bald, once again stays just on the broadcastable side of the line, while implying sex of a non-heteronormative variety, possibly with a sex worker. Despite this, and despite the attempts to make the song uncoverably raucous, Pat Boone still sold a million copies with his cover version:</p>\n<p>[Excerpt: Pat Boone, \"Long Tall Sally\"]</p>\n<p>So Little Richard had managed to get that good clean-cut wholesome Christian white boy Pat Boone singing songs which gave him a lot more to worry about than whether he was singing \"Ain't\" rather than \"Isn't\". But he was also becoming a big star himself -- and he was getting an ego to go along with it. And he was starting to worry whether he should be making this devil music at all. When we next look at Little Richard, we'll see just how the combination of self-doubt and ego led to his greatest successes and to the collapse of his career.</p>\n<p> </p>",
  "enclosure": "",
  "itunes:summary": "Episode thirty-four of A History of Rock Music in Five Hundred Songs looks at \"Tutti Frutti\" by Little Richard, and at the rather more family-unfriendly subject the song was originally about. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nAlso, a reminder for those who didn't see the previous post -- my patreon backers are now getting ten-minute mini-episodes every week, and the first one is up, and I guested on Jaffa Cake Jukebox this week, talking about the UK top twenty for January 18 1957.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nMost of the information used here comes from The Life and Times of Little Richard: The Authorised Biography by Charles White, which is to all intents and purposes Richard's autobiography, as much of the text is in his own words. A warning for those who might be considering buying this though -- it contains descriptions of his abuse as a child, and is also full of internalised homo- bi- and trans-phobia.\nThis collection contains everything Richard recorded before 1962, from his early blues singles through to his gospel albums from after he temporarily gave up rock and roll for the church.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nThere are a handful of musicians in the history of rock music who seem like true originals. You can always trace their influences, of course, but when you come across one of them, no matter how clearly you can see who they were copying and who they were inspired by, you still just respond to them as something new under the sun.\nAnd of all the classic musicians of rock and roll, probably nobody epitomises that more than Little Richard. Nobody before him sounded like he did, and while many later tried -- everyone from Captain Beefheart to Paul McCartney -- nobody ever quite sounded like him later.\nAnd there are good reasons for that, because Little Richard was -- and still is -- someone who is quite unlike anyone else.\n[Excerpt: Little Richard, \"Tutti Frutti\", just the opening phrase]\nThis episode will be the first time we see queer culture becoming a major part of the rock and roll story -- we've dealt with possibly-LGBT people before, of course, with Big Mama Thornton and Sister Rosetta Tharpe, and with Johnny Ray in the Patreon-only episode about him, but this is the first time that an expression of sexuality has become part and parcel of the music itself, to the extent that we have to discuss it.\nAnd here, again, I have to point out that I am going to get things very wrong when I'm talking about Little Richard. I am a cis straight white man in Britain in the twenty-first century. Little Richard is a queer black man from the USA, and we're talking about the middle of the twentieth century. I'm fairly familiar with current British LGBT+ culture, but even that is as an outsider. I am trying, always, to be completely fair and to never say anything that harms a marginalised group, but if I do so inadvertently, I apologise.\nWhen I say he's queer, I'm using the word not in its sense as a slur, but in the sense of an umbrella term for someone whose sexuality and gender identity are too complex to reduce to a single label, because he has at various times defined himself as gay, but he has also had relationships with women, and because from reading his autobiography there are so many passages where he talks about wishing he had been born a woman that it may well be that had he been born fifty years later he would have defined himself as a bisexual trans woman rather than a gay man. I will still, though, use \"he\" and \"him\" pronouns for him in this and future episodes, because those are the pronouns he uses himself.\nHere we're again going to see something we saw with Rosetta Tharpe, but on a much grander scale -- the pull between the secular and the divine.\nYou see, as well as being s",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode thirty-four of A History of Rock Music in Five Hundred Songs looks at \"Tutti Frutti\" by Little Richard, and at the rather more family-unfriendly subject the song was originally about. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nAlso, a reminder for those who didn't see the previous post -- my patreon backers are now getting ten-minute mini-episodes every week, and the first one is up, and I guested on Jaffa Cake Jukebox this week, talking about the UK top twenty for January 18 1957.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nMost of the information used here comes from The Life and Times of Little Richard: The Authorised Biography by Charles White, which is to all intents and purposes Richard's autobiography, as much of the text is in his own words. A warning for those who might be considering buying this though -- it contains descriptions of his a",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}