{
  "title": "Iran: Thousands of Detained Protesters and Activists in Peril",
  "link": "https://www.hrw.org/news/2022/11/03/iran-thousands-detained-protesters-and-activists-peril",
  "description": "Click to expand Image\n          \n\n\n\n\n  \n        \n                      \n      \n        Iranians protesting in Tehran, Iran, on October 1, 2022. \n                    © 2022 AP Photo/Middle East Images\n          \n\n  \n<p>(Beirut) – Iranian authorities have escalated their assault against widespread dissent and protests through dubious national security charges against detained activists and grossly unfair trials, Human Rights Watch said today. On October 31, 2022, the head of Tehran Province’s judiciary said that it had issued around 1,000 indictments against those arrested related to protests.</p>\n\n<p>On October 29, Iran’s Intelligence Ministry and the Islamic Revolutionary Guard Corps’ Intelligence Organization accused two detained women jourvnalists of participating in a training course from US intelligence-backed entities. The journalists, Niloufar Hamedi and Elaheh Mohamadi, had reported on the death of Mahsa (Jina) Amini in morality police custody, which sparked widespread protests. The authorities did not publish any evidence to support their allegation.</p>\n\n<p>“Iran’s vicious security apparatus is using every tactic in its book, including lethal force against protesters, arresting and slandering human rights defenders and journalists, and sham trials to crush widespread dissent,” said Tara Sepehri Far, senior Iran researcher at Human Rights Watch. “Yet every new atrocity only reinforces why Iranians are demanding fundamental changes to a corrupt autocracy.”</p>\n\n<p>Iran has a long history of using vaguely defined national security charges against protesters and dissidents in trials that fall grossly short of international standards. Iran’s intelligence agencies and state media outlets regularly publish and promote false claims against activists and dissidents.</p>\n\n<p>An informal network of activists inside Iran, known as the Volunteer Committee to Follow-Up on the Situation of Detainees, said that as of October 30, in addition to mass arrests of protesters, intelligence agencies have arrested 130 human rights defenders, 38 women rights defenders, 36 political activists, 19 lawyers, and 38 journalists, the majority of whom remained in detention.</p>\n\n<p>These include, according to the network: Alireza Khoshbakht, Zahra Tohidi, Hoda Tohidi, Hossein Ronaghi, Majid Tavakoli, Bahareh Hedayat, Milad Fadai Asl, Saba Sherdoost, Hossein Masoumi, Yalda Moaeri, Vida Rabbani, Roulolah Nakhaei, Mohammadreza Jalaeipour, Amiremad (Jadi) Mirmirani, Fatemeh Sepehri, Toumaj Salehi, Mojgan Inanlou, Neda Naji, Marzieh Amiri, Majid Dori, and Arash Ramezani.</p>\n\n<p>According to the group, authorities have also arrested 308 university students and 44 children. Over the past three weeks, security forces have repeatedly attacked university campuses with excessive use of force, including teargas, and arrested students. University authorities have barred dozens of students from entering university campuses for participating in the protests.</p>\n\n<p>The authorities have also reportedly summoned, interrogated, or confiscated the passports of dozens of public figures who supported the protests, including directors, actors, singers, and football players.</p>\n\n<p>Since September 16, the protests have spread to at least 133 cities and 129 universities as well as several secondary schools, according to the Human Rights Activists News Agency (HRANA).</p>\n\n<p>Human rights groups are investigating the reported deaths of at least 284 people, including 45 children. Dozens of security forces have also reportedly been killed, according to state media. Human Rights Watch has documented security forces’ unlawful use of excessive or lethal force including shotguns, assault rifles, and handguns against protesters in largely peaceful and often crowded settings in 13 cities across the country.</p>\n\n<p>On October 24, Masoud Setayeshi, the judiciary spokesperson, told media that trials have started across the country. He said the authorities have charged 315 defendants in Tehran with “assembly and collusion to act against national security,” “propaganda against the state,” and “disrupting public order.” He said they have also charged four people with “corruption on earth,” a charge that can carry the death penalty, through “use of weapons to scare the people,” “injuring security officers,” “destruction of public and government property to disrupt national security,” and “combating the Islamic Republic of Iran.”</p>\n\n<p>According to Hamshahri newspaper, 25 indictments have been issued in Kerman province, 89 in Semnan, 118 in Zanjan, 105 in Khuzestan, 55 in Qazvin, 110 in Kurdistan, and 201 in Alborz province. According to the head of the judiciary in Sistan and Baluchistan province, 45 indictments have been issued there as well.</p>\n\n<p>The Iranian authorities have subjected detainees to various forms of physical and psychological torture and other ill-treatment. Two female detainees arrested during protests in Kurdistan province told Human Rights Watch that authorities tortured them, including beating them with batons, electric shocks, sexual assault, verbal assault, and threats.</p>\n\n<p>Mohammad Ghobadlou, 22, and the three other people were charged with “corruption on earth” on October 29 in a court headed by Judge Abolghasem Salavati. Ghobadlou’s lawyer, Amir Raeesian, posted on Twitter that the judge did not allow him or Ghobadlou’s family to be present during the trial. Based on the indictment, Ghobadlou is accused of killing a security officer and injuring five others in a car accident, but Raeesian pointed to inconsistencies in the indictment and legal examiner’s report.</p>\n\n<p>“The international community should be particularly vigilant about the situation of those who are detained and those at risk of being sentenced to death,” Sepehri Far said. “Demanding the unconditional release and ending the sham trials of all those who have been arrested for peaceful dissent should be a key priority.”</p>",
  "pubDate": "Thu, 03 Nov 2022 00:00:00 -0400",
  "dc:creator": "Human Rights Watch",
  "guid": "https://www.hrw.org/news/2022/11/03/iran-thousands-detained-protesters-and-activists-peril"
}