{
  "published": "2022-11-05T14:51:40-04:00",
  "updated": "2022-11-05T14:51:40-04:00",
  "title": "An atmosphere of violence: stochastic terror in American politics",
  "content": "<figure>\n      <img alt=\"FBI Warns of Broad Threat to New Jersey Synagogues, Urges Caution\" src=\"https://cdn.vox-cdn.com/thumbor/oCKvP_s0Q2tvsqcu4CLrnLYGAVc=/440x0:7512x5304/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71589279/1244474329.0.jpg\" />\n        <figcaption>Lokman Vural Elibol/Anadolu Agency via Getty Images</figcaption>\n    </figure>\n\n  <p>Q&amp;A with Kurt Braddock about how rhetorical strategies can lead to violence.</p> <p id=\"oQHmiA\">The political environment less than a week before the <a href=\"https://time.com/6227754/political-violence-us-states-midterms-2022/\">midterm elections</a> has a broad swathe of the American public on edge, particularly after high-profile incidents of <a href=\"https://www.vox.com/policy-and-politics/2022/10/29/23428956/political-attacks-increasing-far-right-congress-pelosi\">political violence</a> — both foiled and perpetrated.</p>\n<p id=\"w8yusn\">According to <a href=\"https://www.washingtonpost.com/politics/2022/11/04/poll-americans-concern-political-violence/\">a new poll by the Washington Post and ABC News</a>, about 88 percent of US adults from across the political spectrum are concerned about political violence around the midterm elections. Of the 1,005 people surveyed, 63 percent said they were very concerned about politically-motivated violence — not a surprising statistic given the rise in public antisemitic speech, <a href=\"https://www.washingtonpost.com/national-security/2022/11/04/new-jersey-synagogue-threats-fbi/\">a foiled plot to attack synagogues in New Jersey</a>, and a physical attack on Speaker of the House Nancy Pelosi’s husband Paul last week. </p>\n<p id=\"u06OE9\">Pelosi’s alleged attacker apparently wrote hundreds of blog posts with far-right messages and memes containing conspiracy theories about Jewish people, Black people, and Democrats, <a href=\"https://www.washingtonpost.com/investigations/2022/10/29/david-depape-blog-pelosi-fairies/\">the Post reported last week</a>. <a href=\"https://www.nytimes.com/2022/11/04/nyregion/new-jersey-synagogue-security-threat-suspect.html\">Threats against New Jersey synagogues</a>, made in the wake of celebrities <a href=\"https://www.rollingstone.com/music/music-news/kanye-west-twitter-kyrie-irving-1234623761/\">Kanye West (now known as Ye) and basketball player Kyrie Irving </a>espousing antisemitic conspiracy theories and hate speech added to a general atmosphere of fear and unease. </p>\n<p id=\"UilUca\">Though incidents of direct, specific violence are rare, the risk feels heightened. But another critical element that creates an environment of fear and paranoia is oblique, veiled threats or acceptance of violence that public figures, including former President Donald Trump, make about their adversaries. </p>\n<p id=\"j9i2bx\"><a href=\"https://www.nytimes.com/2022/10/05/us/politics/civil-war-social-media-trump.html\">Stochastic terror</a> <strong>—  </strong>the idea that even if people in power don’t specifically call their followers to violence, by entertaining it as a legitimate tactic or by demonizing a political enemy on a platform capable of reaching millions of people, one of those millions will be inspired to violent action — provides a framework for understanding the current moment. But it’s impossible to know who’s going to perpetrate that violent act, where and how they’ll strike, or even<strong> </strong>who or what the target could be.</p>\n<p id=\"jwq75i\">To explain the concept of stochastic terror, Vox spoke to <a href=\"https://twitter.com/KurtBraddock\">Kurt Braddock</a>, an assistant professor at American University’s school of communication. <a href=\"https://www.kurtbraddock.com/\">Braddock’s research</a> focuses on how communication techniques influence social behavior, particularly in relation to violence. His book <a href=\"https://www.start.umd.edu/publication/weaponized-words-strategic-role-persuasion-violent-radicalization-and-counter\"><em>Weaponized Words: The Strategic Role of Persuasion in Violent Radicalization and Counter-Radicalization</em></a><em>, </em>explores the communications methods that contribute to radicalization, as well as techniques to combat radicalization and stochastic terror. Our conversation below is edited for length and clarity. </p>\n<h4 id=\"SjamHB\">Ellen Ioanes: </h4>\n<p id=\"6yuxkG\">Can you define political violence? </p>\n<h4 id=\"pl6TKi\">Kurt Braddock: </h4>\n<p id=\"23O4BM\">Political violence is a large category — researchers define it as any violence that’s politically motivated, but doesn’t include things like large-scale war. Oftentimes, when we talk about political violence, we use it as a catch-all term, usually to mean terrorism — violence against noncombatants, for the purposes of furthering a political goal or an ideological goal. So that can be something religious, it can be something purely political, it can be something related to a conspiracy theory, but we’re typically talking about violence or the threat of violence against noncombatants to achieve some sort of ideological goal.</p>\n<h4 id=\"Zfxeht\">Ellen Ioanes:</h4>\n<p id=\"uabFG2\">Is stochastic terror a uniquely American phenomenon?</p>\n<h4 id=\"MC5YjV\">Kurt Braddock:</h4>\n<p id=\"H2QuE0\">Stochastic terrorism is not uniquely American. There have been cases abroad where similar situations have occurred. In one example, Brenton Tarrant, the Christchurch attacker, seems to have been motivated (in part) by fringe media figures who espoused ideas consistent with the “Great Replacement.”</p>\n<h4 id=\"rClvFT\">Ellen Ioanes: </h4>\n<p id=\"HnxYMs\">Part of this phenomenon is the atmosphere of violence — the feeling that we don’t know what could happen at any given moment. What’s the theory behind stochastic terror, why is it effective, and why does it need its own designation?</p>\n<h4 id=\"f2k04G\">Kurt Braddock: </h4>\n<p id=\"C5Xvw5\">Stochastic terrorism or stochastic terror is a unique kind of phenomenon that we’ve only really seen emerge in recent years. Stochastic is a term related to statistics that’s meant to define processes that, individually, they’re absolutely impossible to predict when and where something happens. </p>\n<p id=\"JcEWXa\">The example that I always give is, if you’re sitting on your front porch, and you see dark storm clouds rolling in toward your neighborhood, you can be pretty confident that lightning is going to strike at some time in the next half hour, but you can never really predict when and where that’s going to happen. Stochastic terrorism is the same kind of idea, whereby an individual who you designate a stochastic terrorist, makes statements that seem to implicitly advocate the use of violence without actually directing it. It’s the kind of rhetoric that justifies or advocates the use of violence without directing it. The speaker gets this level of plausible deniability, where if somebody does carry out an attack, then they can say, “Well, I never actually directed them to do something.”</p>\n<p id=\"Do9e2q\">The stochastic element relates to the use of a mass mediated channel to broadcast these kinds of messages. Terrorism is a very low base rate phenomenon — typically a person’s likelihood of engaging in terrorism is a fraction of a fraction of one percent. But when you’re reaching millions and millions of people, you start to approach complete likelihood that at least one person will interpret what that person said as a call to violence. </p>\n<p id=\"UdYfta\">We’re getting people acting on behalf of some of these ideas, although they’re not directly incited per actual legal standards for incitement, they are motivated by the language. There have been several cases where individuals have cited some of the statements that have been made by people like former President Donald Trump. </p>\n<p id=\"UWGo9r\">It’s important to note that stochastic terrorism, this indirect incitement, is not illegal. It’s protected by the First Amendment because the legal threshold for incitement to violence is so high. There’s a case, <em>Brandenburg v. Ohio</em>, where the Supreme Court ruled that for something to be incitement, there needs to be direction, and the incident needs to happen immediately after the direction. And stochastic terrorism doesn’t achieve either of those. So although the language does not meet the legal threshold for incitement, it nonetheless motivates people to actually engage in violence. </p>\n<h4 id=\"Y9BFKY\">Ellen Ioanes: </h4>\n<p id=\"INuo1Y\">To what extent does disinformation also play into it, in addition to having a large platform?</p>\n<h4 id=\"z0zvto\">Kurt Braddock: </h4>\n<p id=\"M6qDYq\">I think most of what we call stochastic terrorism has been initiated or has been motivated by deliberately spread disinformation — that demonizes others, that tags other individuals, usually political opponents, as mortal threats. And if you look at most models for violent radicalization or radicalization to terrorism, one of the steps in those processes usually involves perceiving the intended target as being a direct mortal threat to an individual’s survival. So the kinds of disinformation that are being spun about certain targets as being these threats to the United States, to election processes, to political parties, by spinning them as mortal threats, the individual who’s exposed to the message is much more likely to perceive that person as a threat and deserving of violence against them.</p>\n<h4 id=\"kKubi5\">Ellen Ioanes: </h4>\n<p id=\"SdZBHA\">This is an environment that also enables threats against election workers and others, where people are picking up the phone or getting on their Twitter account and making vile, upsetting threats and disrupting people’s lives. So how does that action play into stochastic terror?</p>\n<h4 id=\"OUyouW\">Kurt Braddock: </h4>\n<p id=\"cai41K\">Definitions for mobilized terrorism, that kinetic terrorism, include not just the performance of violence — it’s also the threat of violence against certain targets for political reasons. So when an individual has political enemies, who they peg as demons and as viable targets of aggression, that’s going to cause fear in those populations. So if we look at the standard definitions for terrorism, we can consider that to be almost a form of terrorism. </p>\n<p id=\"gP8cm2\">Now, the part that people have a tough time reconciling, and I think rightfully so because I consider the First Amendment to be sacrosanct, is that the language is actually protected. But just because the language is protected by the First Amendment doesn’t mean that it doesn’t have negative implications and doesn’t cause actual harm to people. It’s important not to conflate something being legal, with being not harmful.</p>\n<h4 id=\"nyZax6\">Ellen Ioanes: </h4>\n<p id=\"p50FGl\">This phenomenon has had, I think, a demonstrable chilling effect on our political environment.</p>\n<h4 id=\"xCU8r5\">Kurt Braddock: </h4>\n<p id=\"DmwBYR\">I think that a lot of times, that’s the goal — that by inciting people, even indirectly, against the kinds of ideas stochastic terrorists see as being divergent from their own, they’re trying to keep people quiet, because if they speak up too much, then the individual who has the platform of millions and millions of people just needs to say some indirect word or blow some dog whistle, and then they’ll have people at their doorstep.</p>\n<h4 id=\"7YMZwJ\">Ellen Ioanes: </h4>\n<p id=\"rj1qN7\">Are there any effective interventions, or is this just how the world is now?</p>\n<h4 id=\"2fjvTv\">Kurt Braddock: </h4>\n<p id=\"EXM4H0\">It’s how the world is, but I think we do have tools to fight back against it. Something that I’ve studied, even outside the domain of stochastic terrorism is something called attitudinal inoculation — providing individuals with information about a persuasive attempt they’re going to face. So in the event of stochastic terrorism, what I might do is go to somebody and tell them, “Listen, I know you’re not violent, I know you have no intention of becoming violent. But there are these actors out there who are going to make certain statements that will justify violence against others, and they’re trying to get you to consider maybe engaging in violence.” Then you provide the target with different counter arguments against that particular idea or that particular course of action. There’s 60 years of research on this strategy, typically in health communication and more standard political communication. </p>\n<p id=\"2vE7x7\">If I provide someone with an inoculation message that undermines the strategy of this implicit incitement — if I get to those people and tell them about this particular strategy before they’re exposed to it, they’re much less likely to be influenced by it. I think this goes part and parcel with just a larger emphasis on media literacy in the United States. We are so media illiterate, not just kids who are kind of engaging with online content, disinformation, and conspiracy theories with nothing to defend themselves against it. But adults too, we need to help people do a better job of parsing apart ideas that they see online and recognizing when they’re being manipulated.</p>\n<h4 id=\"nao2CM\">Ellen Ioanes: </h4>\n<p id=\"FlcAZc\">It’s my sense that this is much more of a right wing phenomenon than it is a left wing phenomenon. Democratic political leaders are swift to denounce violence most of the time, whereas leaders on the right do not always do that explicitly.</p>\n<h4 id=\"kmmJxQ\">Kurt Braddock: </h4>\n<p id=\"mrJEeR\">If we just look at the data at the number of attacks that have occurred, the number of people who’ve been arrested for plots, the number of individuals who have actually cited things that have been said by elected leaders, the right wing violence far outpaces left wing violence. That’s not to say that it hasn’t happened on the left. But if we look at raw numbers of how much it occurs, and even scarier, how often it seems that right wing public officials seem to be perfectly happy to use [it] as a persuasive communication strategy, it’s not even close.</p>\n<p id=\"PMUs1l\">I think that a lot of times these attacks are sanitized, and that allows for room for interpretation. If you look at the Pelosi attack, it took less than 12 hours for conspiracy theories to come out. If individuals look at what the attackers themselves say, which is often very indicative of their motivations, we’ll see an overlap between their reasons for the attack and the language used by some of their elected leaders and other political leaders that they admire. It’s almost verbatim. Once we see the A to B connection, I do think that the public would at least demand greater responsibility from their elected officials. And I think that’s the key — to recognize that this is being used as a political communication tool, and that we should demand federal responsibility from our elected leaders, right wing and left wing, especially right wing right now. Because what these things they’re saying — although we have every freedom to say whatever we want — these things have implications, and we need to see those implications.</p>",
  "link": "",
  "id": "https://www.vox.com/2022/11/5/23441858/violence-stochastic-terror-american-politics-trump-pelosi",
  "author": {
    "name": "Ellen Ioanes"
  }
}