{
  "title": "TU98: Dive Deeper into a Model of Attachment Science (the DMM) by Ann Kelley &#038; Sue Marriott",
  "link": "https://therapistuncensored.com/episodes/tu98-dive-deeper-into-a-model-of-attachment-science-the-dmm-by-ann-kelley-sue-marriott/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu98-dive-deeper-into-a-model-of-attachment-science-the-dmm-by-ann-kelley-sue-marriott",
  "pubDate": "Thu, 13 Jun 2019 17:25:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7215",
  "description": "Dive deeper into this new (to us) model of interpreting attachment science and discover how to apply it into your daily life. Sue Marriott LCSW, CGP and Ann Kelley PhD have fun breaking down the last two episodes where Dr. Patricia Crittenden so generously shared her model called the Dynamic Maturational Model (DMM). Focus is on personal and clinical importance in this last of a 3-part series on the DMM.\nBefore we begin:\n\n \tA’s (Red in the DMM)=Historically referred to as Blue on TU\n \tB’s (Blue in the DMM)=Historically referred to as Green on TU\n \tC’s (Green in the DMM)=Historically referred to as Red on TU\n \tAC’s = Historically referred to Tie Dye on TU\n\n**Note: We know the colors may be a bit confusing, but it is important to us that you receive information as Dr Crittenden has published it. It is by happenstance that our colors are the same (with the exception of tie dye), but they represent different thinking and behavioral patterns. When we refer to color in the episodes and in the show notes, we are referring to the colors we have historically used on the TU podcast and the letters and self-protective strategies of the DMM. This is only in order to maintain consistency and make the information more easily understood by our listeners. However, the colors as shown in the slides and as listed above, are the way Dr Crittenden uses them in her fantastic work!\nBrief Hierarchy of Attachment Theory:\nThere’s a lot of similarity between the more familiar Mary Main et al ABC-D model of attachment and the Patricia Crittenden’s DMM interpretation of attachment, but there are also some very important differences.\nWhat’s in A Name?\nDynamic Maturational Model (DMM) – potentially intimidating mouthful, BUT let’s break it down\nWhat it means:\nSue and Ann share their take on Dr Crittenden’s walk through the developmental process that happens in attachment from infancy to adulthood. (Listen to Episode 96 and Episode 97). As we mature into different stages of our life, our needs and self-protective strategies (what the DMM helps us learn) we use change accordingly. The beautiful thing about the DMM is the way it incorporates culture, sexuality, key relationships, and danger/safety into the attachment mix.\nSpeaking of safety….\nOne key difference between the DMM and traditional attachment models is the emphasis on SAFETY rather than SECURITY.\n\nAccording to the DMM:\n\n-attachment is about the dyadic relationship in danger, it does not just live in the person\n\n-we take in information from the environment (parent in infancy) and shift this into “behaviors” or self-protective strategies.\n\n-these strategies develop to protect us. They are our brain’s way of helping us reduce danger and increase connectedness by creating closeness, proximity, and safety.\nInformation Processing\n-It’s physiological.\n\nThere are 3 systems:\n\nSomatic: what does our body feel…our heart, our stomach feel\n\nCognitive: how we process the information, how do we make meaning\n\nEmotional: what’s coming up\n\nBottom line, we can learn from our body. They are connected but not hierarchical.\n\nSecurity = Integration of all 3 of these info systems (Therapist Uncensored’s model ie. getting to the green)\nThe Attachment Spectrum\nAs you move out on the spectrum, (in the DMM, it’s a circle, which is also really cool) we begin to inhibit or exaggerate information based on the response in our environment/the response of our caregivers.\n\nWe will tend to lean Blue or Red or Tie Dye (check out episodes 59, 60, 61 for more detailed info on each color).\n\nNOTE: These colors are Ann and Sue’s Attachment & Regulation Spectrum, not colors from the DMM.\n\nIt is NOT conscious and forms in the first 2 years via Neuroception.\n\nNeuroception (listen to our episode on Polyvagal Theory for more info) tells us, as infants, that if we cry, our caregiver will react a certain way. We inhibit information according to what will keep us safe and bring us closer to our ca...",
  "enclosure": "",
  "itunes:subtitle": "Dive deeper into this new (to us) model of interpreting attachment science and discover how to apply it into your daily life. Sue Marriott LCSW, CGP and Ann Kelley PhD have fun breaking down the last two episodes where Dr.",
  "itunes:summary": "Dive deeper into this new (to us) model of interpreting attachment science and discover how to apply it in your daily life.  Sue Marriott LCSW, CGP and Ann Kelley PhD have fun breaking down the last two episodes where Dr. Patricia Crittenden so generously shared her strategies of adaptation model known as the Dynamic Maturational Model (DMM).  Focus is on personal and clinical importance in this last of a 3-part series on the DMM.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "26:55"
}