{
  "id": "yt:video:DRg6lzA_Eoc",
  "yt:videoId": "DRg6lzA_Eoc",
  "yt:channelId": "UCEnl2ZDocvt4aoIyT3fl8SQ",
  "title": "German Army tanks are seen with gun turrets HD Stock Footage",
  "link": "",
  "author": {
    "name": "CriticalPast",
    "uri": "https://www.youtube.com/channel/UCEnl2ZDocvt4aoIyT3fl8SQ"
  },
  "published": "2014-07-16T12:05:38+00:00",
  "updated": "2022-05-22T21:23:04+00:00",
  "media:group": {
    "media:title": "German Army tanks are seen with gun turrets HD Stock Footage",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CriticalPast is an archive of historic footage. The vintage footage in this video has been uploaded for research purposes, and is presented in unedited form. Some viewers may find some scenes or audio in this archival material to be unsettling or distressing. CriticalPast makes this media available for researchers and documentarians, and does not endorse or condone any behavior or message, implied or explicit, that is seen or heard in this video.\nLink to order this clip:\nhttp://www.criticalpast.com/video/65675041025_German-plane_bomb-explosion_gun-turrets_fire-and-smoke\nHistoric Stock Footage Archival and Vintage Video Clips in HD.\n\nGerman Army tanks are seen with gun turrets\n\nVariety of German artillery firing including battery of railway guns. Firing done. Smoke seen rising due to firing. German Pz.II and Pz.IV tanks are seen. Huge explosion. Dust rising along with smoke. German aircraft in flight, including JU-87 Stuka dive bombers and Messerschmitt bf 110. Location: Germany. Date:  1940.\n\nVisit us at www.CriticalPast.com:\n57,000+ broadcast-quality historic clips for immediate download.\nFully digitized and searchable, the CriticalPast collection is one of the largest archival footage collections in the world. All clips are licensed royalty-free, worldwide, in perpetuity. CriticalPast offers immediate downloads of full-resolution HD and SD masters and full-resolution time-coded screeners, 24 hours a day, to serve the needs of broadcast news, TV, film, and publishing professionals worldwide. Still photo images extracted from the vintage footage are also available for immediate download.  CriticalPast is your source for imagery of worldwide events, people, and B-roll spanning the 20th century.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}