{
  "id": "yt:video:pMrNgqS9GBs",
  "yt:videoId": "pMrNgqS9GBs",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "1940s COLOR HOME MOVIE   TRIP TO LOS ANGELES, SAN FRANCISCO, OAKLAND CALIFORNIA XD51094",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-05T19:29:46+00:00",
  "updated": "2022-11-05T19:29:46+00:00",
  "media:group": {
    "media:title": "1940s COLOR HOME MOVIE   TRIP TO LOS ANGELES, SAN FRANCISCO, OAKLAND CALIFORNIA XD51094",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nShot by an unknown amateur filmmaker, this silent home movie contains images of Los Angeles and San Francisco circa the 1940s. The film features shots of popular destinations within the two California cities.\n\n(0:06) Looking down from a high point in downtown Los Angeles (probably City Hall), shots of early freeways and a brief shot of City Hall from the ground (1:06) Echo Park Lake (1:54) Women lounging around on a rooftop eating, smoking, and playing cards (3:42) The Brown Derby, a chain of restaurants in Los Angeles. The first and best known, featured here, was shaped like a derby hat, an iconic image that was synonymous with the Golden Age of Hollywood. It was opened by Wilson Mizner in 1926 (4:03) Front seat view from a car as it drives down a street (4:25) Park La Brea apartment buildings and street (4:52) Driving down a street. Features Orbach’s, Ralphs, and Bank of America sights on top of the buildings (5:42) NBC Studios building at Sunset and Vine (5:46) Exterior of Grauman’s Chinese Theater (6:05) View outside of an unidentified mansion (6:30) Exterior of the Pickfair Mansion in Beverly Hills with its gate and driveway (6:40) Unidentified bungalow home and shots of flowers on hills (7:21) Cargo ships, sailboats, the Golden Gate Bridge, and a view of the Bridge from a moving car (8:54) Golden Gate Bridge toll plaza and driving through the Bridge (9:21) Pilot charting and a shot of a pilot on an airplane talking (9:52) Pier 39: sailboats docked at a harbor, a vendor sells crabs and shows them to a customer, and shot of a sign for Fishermen’s Grotto No. 9 (10:31) Muir Woods: shots of children looking at redwood trees, tree branches, and a diagram indicating tree age (11:09) Shots of rocks and otters resting in the ocean (11:39) Japanese Tea Garden of Golden Gate Park, the oldest public Japanese garden in the United States founded as part the 1894 World's Fair (11:53) The Ferry Building and view from a car as it drives along the Embarcadero (12:09) Driving through the Yerba Buena Island Tunnel, a highway tunnel part of the Bay Bridge complex that crosses the Island and connects San Francisco and Oakland. View of the water surrounding Yerba Buena Island with San Francisco in the distance (12:03) Driving through the Golden Gate Bridge (13:15) Driving through San Francisco (13:44) View of Alcatraz Island from a hill San Francisco. A cable car moves through the street (14:09) View of Coit Tower in the distance. The tower, in Pioneer Park, was built between 1932 and 1933 under Lillie Hitchcock Coit's bequest to beautify the city (12:29) The Bay Bridge with a boat moving under it (14:50) Long shots of buildings of San Francisco from a high point (15:43) People in a cafe smoking, kids drink sodas (16:01) Looking up a street in San Francisco with a steep hill. Cars drive up the hill with neon signs on the surrounding buildings. A cable car moves along the street and people get on as the car turns around (17:15) View of Chinatown’s streets: San Francisco’s is one of the oldest and most established Chinatowns in the U.S. (17:39) A boy looks at traditional Chinese garments a woman hands to him (18:00) View of San Francisco from Twin Peaks (18:37) A boy walks in a garden. Long shots of the garden and close-ups of flowers. Flower displays text that says “WELCOME METHODISTS CONFERENCE” (19:34) View of the San Francisco peninsula, Oakland, and mountains from thousands of feet in the air through an airplane window.\n\nWe encourage viewers to add comments and, especially, to provide additional information about our videos by adding a comment!  See something interesting?  Tell people what it is and what they can see by writing something for example: \"01:00:12:00 -- President Roosevelt is seen meeting with Winston Churchill at the Quebec Conference.\"\n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}