{
  "title": "Build the Stylist Relationship of Your Dreams | Cory Couts",
  "pubDate": "Mon, 20 Jun 2022 12:00:00 +0000",
  "guid": "8c664da7-5a4a-4f6d-9e4d-2963f9cd03c1",
  "link": "https://beautyuncovered.libsyn.com/build-the-stylist-relationship-of-your-dreams-cory-couts",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Olaplex is celebrating it’s 8</span><span style=\"font-weight: 400;\">th</span> <span style= \"font-weight: 400;\">birthday this week! In celebration, we have a very special guest. Cory Couts joins us to talk about how to truly benefit from your relationship with your stylist, your hairdresser. We delve into the ins and outs of communication with them, what to tell them, and how to build the relationship to benefit both of you.</span></p> <p><span style=\"font-weight: 400;\">Cory Couts is the Senior VP of Global Professional Sales at Olaplex currently but has had a long career in the salon industry. By a beautiful accident, he helped a friend with their salon business by managing the salon, retailing product and servicing clients and has built an amazing career built on a passion for helping both salonists and their clients.</span></p>",
  "content:encoded": "<p>Olaplex is celebrating it’s 8th birthday this week! In celebration, we have a very special guest. Cory Couts joins us to talk about how to truly benefit from your relationship with your stylist, your hairdresser. We delve into the ins and outs of communication with them, what to tell them, and how to build the relationship to benefit both of you.</p> <p>Cory Couts is the Senior VP of Global Professional Sales at Olaplex currently but has had a long career in the salon industry. By a beautiful accident, he helped a friend with their salon business by managing the salon, retailing product and servicing clients and has built an amazing career built on a passion for helping both salonists and their clients.</p>",
  "enclosure": "",
  "itunes:duration": "24:29",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Olaplex is celebrating it’s 8th birthday this week! In celebration, we have a very special guest. Cory Couts joins us to talk about how to truly benefit from your relationship with your stylist, your hairdresser. We delve into the ins and outs of...",
  "itunes:episodeType": "full"
}