{
  "title": "#456: A Giant Waste Of Time (OOTP 20, Hagrid's Tale)",
  "link": "https://audioboom.com/posts/7526338",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4225,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Muggle Mail covers angry librarians and Harry-Draco shippers</li>\n<li>We're at the midway point of Order of the Phoenix! How has this recent read changed our feelings about the book? What are our biggest takeaways?</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 20: Hagrid's Tale</li>\n<li>7-Word Summary: Hagrid returns and fails to reveal lies</li>\n<li>The Trio take a massive risk in going to see Hagrid given recent punishments!</li>\n<li>Can Harry, Ron and Hermione really fit under the Invisibility Cloak?</li>\n<li>Why doesn't the snow wipe away their footprints?</li>\n<li>What is Hagrid's true level of trust in Harry, Ron and Hermione?</li>\n<li>What do we know about Vampires in the Wizarding World?</li>\n<li>We discuss real world parallels to the Giants being an ostracized community</li>\n<li>What’s the value of aligning with the Giants? </li>\n<li>Is Hagrid the best envoy? The best negotiator?</li>\n<li>Could the Ministry be inadvertently tipping off the Death Eaters?</li>\n<li>Does Hagrid blow his load on the first gift to the Gurg?</li>\n<li>Name Origins: Karkus, Golgomath and Grawp</li>\n<li>What could the Death Eaters have told Golgomath to convince them to join their side?</li>\n<li>Who is that at the door? It's Dolores!</li>\n<li>Why didn't Umbridge use Homenum Revelio to find Harry, Ron and Hermione? Why does she give up so easily?</li>\n<li>The Top 7 Reasons Hagrid Was Really Missing In Action</li>\n<li>The Umbridge Suck Count climbs to 43!</li>\n<li>Connecting The Threads include Macnair, Buckbeak and Hermione</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: Whose death allows Neville to see thestrals?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 10 Mar 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-09:/posts/7526338",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}