{
  "title": "FEniCS implementation of the Virtual Fields Method (VFM) for nonhomogeneous hyperelastic identification. (arXiv:2211.01626v1 [physics.med-ph])",
  "link": "http://arxiv.org/abs/2211.01626",
  "description": "<p>It is of great significance to identify the nonhomogeneous distribution of\nmaterial properties in human tissues for different clinical and medical\napplications. This leads to the requirement of solving an inverse problem in\nelasticity. The virtual fields method (VFM) is a rather recent inverse method\nwith remarkable computational efficiency compared with the optimization-based\nmethods. In this study, we aim to identify nonhomogeneous hyperelastic material\nproperties using the VFM. We propose two novel algorithms, RE-VFM and NO-VFM.\nIn RE-VFM, the solid is partitioned in different regions and the elastic\nproperties of each region are determined. In NO-VFM, 2 the distribution of\nelastic properties is completely reconstructed through the inverse problem\nwithout partitioning the solid. As the VFM requires to use virtual fields, we\nproposed an efficient way to construct them and implemented the approach in the\nFEniCS package. We validated the proposed methods on several examples,\nincluding a bilayer structure, a lamina cribosa (LC) model and a cube model\nembedded with a spherical inclusion. The numerical examples illustrate the\nfeasibility of both RE-VFM and NO-VFM. Notably, the spatial variations of the\nYoung's modulus distribution can be recovered accurately within only 5\niterations. The obtained results reveal the potential of the proposed methods\nfor future clinical applications such as estimating the risk of vision loss\nrelated to glaucoma and detecting tumors.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Deng_J/0/1/0/all/0/1\">Jianwei Deng</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Guo_X/0/1/0/all/0/1\">Xu Guo</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Mei_Y/0/1/0/all/0/1\">Yue Mei</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Avril_S/0/1/0/all/0/1\">Stephane Avril</a> (SAINBIOSE-ENSMSE)"
}