{
  "title": "#474: There's Something About Harry (OOTP 37, The Lost Prophecy)",
  "link": "https://audioboom.com/posts/7636854",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5324,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Our next Quizzitch Live is Tuesday, July 21 - The topic is <em>Deathly Hallows</em>!</li>\n<li>\n<a href=\"https://www.wizardingworld.com/collections/harry-potter-at-home\">Harry Potter at Home</a> has wrapped up their chapter readings for Book One.</li>\n<li>In Muggle Mail, the hosts are asked how Harry Potter led them to branch out into being a fan of other things.</li>\n<li>We debut a brand new listener-inspired segment, Wizard Court! Bellatrix is on trial for killing Sirius.</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix – Chapter 37: The Lost (?) Prophecy</li>\n<li>7-Word Summary: Dumbledore tells Harry some of the truth </li>\n<li>A portrait tells Harry that Dumbledore thinks highly of him. What do we think?</li>\n<li>Dumbledore says, \"I know how you're feeling, Harry.\" But does he?</li>\n<li>At multiple times, Dumbledore refers to his own age while seeking forgiveness from Harry. Is this fair?</li>\n<li>Do we blame Kreacher, or do we blame wizards, including Sirius, for Kreacher's betrayal?</li>\n<li>Snape has shows his heroic side, but Dumbledore is keeping his secret from Harry still. Why?</li>\n<li>The hosts discuss the blood magic that keeps Harry save on Privet Drive, and if Dumbledore had to withhold this information for so long.</li>\n<li>We dig into the Prophecy, the part that was overheard, and Laura makes a Bible connection.</li>\n<li>The significance of Dumbledore counting Harry's escapes from Voldemort.</li>\n<li>MVP of the Week and Rename The Chapter</li>\n<li>Quizzitch: What is the last word of Book 5?</li>\n<li>This week's episode is brought to you by Quip. Get your first refill FREE by visiting <a href=\"http://www.GetQuip.com/muggle\">GetQuip.com/muggle</a>. Support MuggleCast by supporting our sponsors!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n",
  "pubDate": "Tue, 21 Jul 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-07-20:/posts/7636854",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}