{
  "title": "Liability regimes in the age of AI: a use-case driven analysis of the burden of proof. (arXiv:2211.01817v1 [cs.AI])",
  "link": "http://arxiv.org/abs/2211.01817",
  "description": "<p>New emerging technologies powered by Artificial Intelligence (AI) have the\npotential to disruptively transform our societies for the better. In\nparticular, data-driven learning approaches (i.e., Machine Learning (ML)) have\nbeen a true revolution in the advancement of multiple technologies in various\napplication domains. But at the same time there is growing concerns about\ncertain intrinsic characteristics of these methodologies that carry potential\nrisks to both safety and fundamental rights. Although there are mechanisms in\nthe adoption process to minimize these risks (e.g., safety regulations), these\ndo not exclude the possibility of harm occurring, and if this happens, victims\nshould be able to seek compensation. Liability regimes will therefore play a\nkey role in ensuring basic protection for victims using or interacting with\nthese systems. However, the same characteristics that make AI systems\ninherently risky, such as lack of causality, opacity, unpredictability or their\nself and continuous learning capabilities, lead to considerable difficulties\nwhen it comes to proving causation. This paper presents three case studies, as\nwell as the methodology to reach them, that illustrate these difficulties.\nSpecifically, we address the cases of cleaning robots, delivery drones and\nrobots in education. The outcome of the proposed analysis suggests the need to\nrevise liability regimes to alleviate the burden of proof on victims in cases\ninvolving AI technologies.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Llorca_D/0/1/0/all/0/1\">David Fern&#xe1;ndez Llorca</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Charisi_V/0/1/0/all/0/1\">Vicky Charisi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Hamon_R/0/1/0/all/0/1\">Ronan Hamon</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sanchez_I/0/1/0/all/0/1\">Ignacio S&#xe1;nchez</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gomez_E/0/1/0/all/0/1\">Emilia G&#xf3;mez</a>"
}