{
  "id": "tag:blogger.com,1999:blog-6894866515532737257.post-1052099581134627177",
  "published": "2017-03-08T07:11:00.001-08:00",
  "updated": "2017-03-08T07:11:32.320-08:00",
  "title": "Money, Murder, the Midwest, and More",
  "content": "In my Data Science class this semester, students are working on a series of reports where they explore a freely-available dataset, use data to answer questions, and present their findings. &nbsp;After each batch of reports, I will publish the abstracts here; you can follow the links below to see what they found.<br /><br /><br /><h2 id=\"how-do-europeans-feel-about-jewish-muslim-and-gypsy-immigration\">How do Europeans feel about Jewish, Muslim, and Gypsy immigration?</h2>Apurva Raman and Celina Bekins<br /><br />As tensions over immigration increase with Europe dealing with a huge influx of refugees, some countries are more ready to accept immigrants while others close their borders to them. To understand the opinions of Europeans on immigration of particular groups, we investigated if respondents from different countries in Europe have consistent opinions toward Jews, Muslims, and Gypsies. We found that countries with a strong preference against Jews or Gypsies will also not prefer the other group. This does not hold true for Jews; countries that are willing to allow Jews are not necessarily willing to allow Muslims or Gypsies. Countries that are not accepting of Jews are not accepting of any of these three groups. However, they all preferred Jews to Muslims and Muslims to Gypsies.<br /><a href=\"https://github.com/apurvaraman/DataScienceReport1/blob/master/ESS_immigration.md\">Report</a><br /><h2 id=\"do-midwestern-colleges-have-better-act-scores\">Do Midwestern colleges have better ACT scores?</h2>David Papp  <br /><br />It is often rumored that colleges in the Midwest prefer ACT scores while colleges in other regions prefer SAT Scores. The goal of this article is to explore the relationship between SAT and ACT scores in the Midwest and other regions. The data used was collected from the US Department of Education for the years 2014-15. Comparing just the means of ACT scores shows that the Midwest scores slightly higher on average: 23.48 vs 23.17. However, a better statistic might be to compare the ratio of ACT/SAT scores. The Midwest has a slightly higher ratio (0.969) than other regions (0.960). Although we cannot deduce any causation, we can draw inferences as to what causes these differences. One explanation might be the fact that students applying to Midwestern colleges spend more time studying for the ACT.<br /> <a href=\"https://github.com/davpapp/ThinkStats2/blob/master/Reports/report1.md\">Report</a>   <h2 id=\"rich-or-poor-to-whom-does-it-matter-more\">Rich or Poor: To Whom does it Matter More?</h2>Kaitlyn Keil  <br /><br />With issues like a growing wage gap, racism, and feminism at the front of our nation's attention, it can seem that the wealthy only care about getting more wealth, while equality only matters to those who are disadvantaged. However, the results of the European Social Survey of 2014 suggests that those with money do not value wealth a significant amount more than those of lower income brackets, and equality is not only valued at the same level across income brackets, but is consistently rated as more important than wealth.<br /><a href=\"https://github.com/KaitlynKeil/ThinkStats2/blob/master/code/reports/report1.md\">Report</a><br />  <h2 id=\"do-more-politically-informed-people-identify-as-liberal\">Do More Politically Informed People Identify as Liberal?</h2>Kevin Zhang  <br /><br />In the political arena, liberals often call their conservative counterparts \"ignorant\" because they believe that the other party doesn't know the facts, that they just don't know what's going on in the world. This would suggest that being more informed on political news and current events would make one more liberal. But does it really matter though? Does being more informed about politics make a person more liberal? Does it matter at all on how people end up voting? This article will decide whether being an informed individual truly results in believing a more liberal platform, or whether this notion is just a mislead stereotype meant as a mudsling tactic. Data analytics show that apparently a person has a high chance of holding the same opinion regardless of whether they are informed individuals or not. However, it seems that rather than leaning towards liberals, being more informed has the potential to make people more polarized towards either side and have stronger opinions on various political topics in general. While being more informed might not lead an increase in liberal thoughts, it might very well make people better able to cast a more thoughtful and representative vote. <br /><a href=\"https://github.com/kzhang8850/ThinkStats2/blob/master/reports/report1blog.md\">Report</a><br />  <h2 id=\"money-might-buy-you-some-happiness\">Money <i>might</i> buy you some happiness</h2>Sungwoo Park  <br /><br />Does money buy you happiness? It's a decades old question that people have been wondering about. Data from the General Social Survey on the respondent's income and happiness level seem to suggest that people with high income tend to be happier than people with low income. Also, the data show that people with high income value the feeling of accomplishment and the importance of the job in their work more than people with low income do.<br /> <a href=\"https://github.com/SungwooPark/ThinkStats2/blob/master/reports/report1.md\">Report</a><br />   <h2 id=\"higher-paid-nba-players-are-probably-deserving\">Higher paid NBA players are (probably) deserving</h2><div>Willem Thorbecke</div><div><br /></div>The motivating question was to find out whether or not there existed a connection between the salary of an NBA player and his performance in the league. Using the statistic Player Efficiency Rating (PER), an NBA statistic commonly used to measure a player's overall performance in the league, I compared player salaries and performances. With a correlation of 0.5 between salaries and PERs across the leauge, as well as a Spearman Correlation of 0.4, I came to the conclusion that there was a slight correlation between the two variables, and thus higher paid NBA players may be deserving of their paychecks.<br /> <a href=\"https://github.com/willythor/ThinkStats2/blob/master/reports/report1.md\">Report</a>  <h2>Murder, Ink — A statistical analysis of tattoos in the Florida prison system</h2>Joey Maalouf, Matthew Ruehle, Sean Carter<br /><br />&nbsp;We examine the claims made in an Economist article on prison tattoos. Examining a publicly-available inmate database, we found that there are several noticeable trends between tattoos and types of criminal conviction. Our results are not necessarily causative, and may reflect either societal biases or demographic trends. Nonetheless, the data demonstrates a strong correlation between different categories of \"ink\" and criminal classifications.<br /><a href=\"https://github.com/matthewruehle/DataScienceFLPrisons/blob/master/reports/report1.md\">Report</a>   <br /><h2 id=\"are-more-selective-or-expensive-colleges-worth-it\">Are more selective or expensive colleges worth it?</h2>William Lu<br /><br />  As costs to attend college increase, an increasing number of high school seniors are left wondering if they should or must select a more affordable college. Many Americans go to college not just to gain a higher education, but also to increase their earning potential later in life. Using US Department of Education College Scorecard data, I found that going to a more expensive college could potentially make you more money in the future, that more selective colleges don't necessarily cost more, and that more selective colleges don't necessarily make you more money in the future.<br /><a href=\"https://github.com/williamalu/ThinkStats2/blob/master/code/reports/report1.md\">Report</a><br />   <h2>Are Diseases of the Heart Seasonal?</h2>Radmer van der Heyde  <br /><br />In this report, I sought to answer the question: does heart disease have seasonality like that of Influenza? To answer this, I explored the CDC's Wonder database on the underlying causes of death on the monthly data for the state of California. Based on my results, the majority of heart diseases show some seasonality as the dominant frequency component is at the frequency corresponding to a period of 1 year.<br /><a href=\"https://github.com/rvanderheyde/ThinkStats2/blob/master/reports/report1.md\">Report</a><br />  <br /><br /><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Allen Downey",
    "uri": "http://www.blogger.com/profile/01633071333405221858",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}