{
  "title": "When it comes to historical distortion, we cannot fight fire with fire",
  "link": "https://www.newmandala.org/when-it-comes-to-historical-distortion-we-cannot-fight-fire-with-fire/",
  "dc:creator": "Nicole Curato",
  "pubDate": "Wed, 02 Nov 2022 02:24:17 +0000",
  "category": "Philippines",
  "guid": "https://www.newmandala.org/?p=60205",
  "description": "<p>Brigading, cancelling, and piling on the Marcos family’s supporters have served a critical in defending historical truths.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/when-it-comes-to-historical-distortion-we-cannot-fight-fire-with-fire/\">When it comes to historical distortion, we cannot fight fire with fire</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>“Where was her closet full of shoes?” asked a celebrity vlogger to Philippine President Ferdinand (Bongbong) Marcos Jr. She was referring to the shoe collection of his mother, former first lady Imelda Marcos, in a tour of the Malacañang Palace for a popular YouTube channel.</p>\n<p>“Oh, they were not here,” the President responded. “That was only for display.”</p>\n<p>“The three thousand shoes?” the vlogger asked.</p>\n<p>“Those were not her shoes. They were gifts,” Marcos Jr explained. Others, the President continued, were samples from local shoe factories in Marikina City.</p>\n<p>“That’s why the shoes had different sizes,” the vlogger said, as if she had solved a mystery.</p>\n<p><strong>The power of mundanity </strong></p>\n<p>From 1965 to 1986, the Marcoses lived in the Malacañang Palace, during the regime of Ferdinand Marcos Sr. In 2022, Marcos Jr returned to his “childhood home,” after winning the presidential election by a landslide.</p>\n<p>The “<a href=\"https://www.youtube.com/watch?v=meQKs7Wzzfk\">palace tour</a>” garnered more than three million views. For twenty minutes, Marcos Jr reminisced where he learned how to ride a bike, pointed at the staircase where his parents caught him sneaking back home from a night out, and showed the hall where he witnessed his father give orders to the Commanding Officer of the Armed Forces not to shoot at protesters during the popular uprising that forced the Marcoses out of power.</p>\n<p>This vlog may seem mundane, but its mundanity is where its power rests.</p>\n<p>As the vlogger oohed and aahed throughout the tour, she signalled to her subscribers that they, together, are uncovering stories buried by journalists, historians, and politicians who have an axe to grind against the Marcoses after democracy was restored in 1986.</p>\n<p>Devious claims casually dropped in conversation—like Imelda Marcos did not <a href=\"https://www.abc.net.au/news/2016-10-02/imelda-marcos-shoe-museum:-the-excess-of-a-regime/7877098\">own three thousand pairs of shoes</a>—served to undermine evidence about the <a href=\"https://link.springer.com/chapter/10.1057/9780230622456_7\">corruption</a> and frivolity that marked Marcos Sr’s dictatorship.</p>\n<p>That the vlog featured a “house tour” —a form of digital content associated with influencers giving their subscribers a direct and authentic access to their everyday lives—portrays the Marcoses as a hospitable family kind enough to invite the people to their home as “virtual guests” because they have nothing to hide.</p>\n<p>Indeed, on digital media, the narrative that the Marcoses were victims of a liberal conspiracy has been settled. That they were and remain to be the rightful occupants of the Palace, that the nation owes them respect and reparation after years of humiliation by their political opponents, are claims that are no longer limited to conspiracy theory sites but are now very much part of mainstream cultural production.</p>\n<p>After thirty-six years, many believe that the time for the Marcos family’s story to be told has come.</p>\n<p><strong>Fighting fire with fire</strong></p>\n<p>The political opposition are at a loss as to how to fight such historical distortions.</p>\n<p>Feel-good vlogs like the palace tour cannot be taken down because they do not violate community standards. Content creators with questionable truth-telling credentials are rewarded with YouTube’s Gold Play Button—a plaque given to vloggers that have reached a million subscribers.</p>\n<p>With few options available, critics of the Marcos administration have chosen to fight fire with fire.</p>\n<p>Grassroots digital communities organise “<a href=\"https://institute.global/policy/social-media-futures-what-brigading\">brigading</a>” operations or coordinated efforts to screenshot problematic accounts and report these accounts en masse for Meta to take down.</p>\n<p>Others organise campaigns to “cancel” celebrities, influencers, and businesses that directly or indirectly promote historical distortion. Recently, campaigners called to <a href=\"https://www.bworldonline.com/corporate/2022/09/30/477758/shopee-faces-boycott-calls-over-brand-ambassador/\">boycott</a> a shopping website that hired a pro-Marcos celebrity as endorser. Campaigners called shoppers to “empty cart” while some online sellers pulled out their products from the site.<em class=\"help-text\"> \n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/stay-angry-organise-build-solidarity-democracy-in-post-disaster-philippines/\">\n\t\t\t\t\t<img width=\"245\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2022/05/cover/2158194703.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/stay-angry-organise-build-solidarity-democracy-in-post-disaster-philippines/\">Stay angry. Organise. Build solidarity. Democracy in post-disaster Philippines</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>Everyday political action shows democracy can work amidst constraints, in the aftermath of a tragedy.</p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/nicolecurato/\">Nicole Curato</a>\n\t\t\t\t\n\t\t\t\t\t06 May, 2022\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t </em></p>\n<p>Meanwhile, historians and journalists “piled on” celebrities who came across as nonchalant about the Marcoses’ brutal legacy. A few months ago, there was a young celebrity who made an off-the-cuff comment that “<a href=\"https://philstarlife.com/news-and-views/351940-history-is-like-tsismis-historians-weigh-in\">history is like gossip</a>” in a press conference about a Marcos biopic where she played the role of one of the Marcos children. She was met with a series of takedowns not only on social media but in op-eds, talk shows, and even academic webinars.</p>\n<p>Brigading, cancelling, and piling on the Marcos family’s supporters have served a critical role in the Philippine public sphere. They protect whatever spaces are left to defend historical truths. They assert the presence of a political opposition who continue to hold the Marcos family and their enablers accountable.</p>\n<p>But these practices have also backfired. For Marcos supporters, these tactics only reinforce what they already know. The so-called defenders of truth and human rights are bullies and spiteful losers who cannot accept that they have been fooled by liberal elites.</p>\n<p><strong>Influence operations</strong></p>\n<p>In a <a href=\"https://www.youtube.com/watch?v=B8ZJo50tjRA\">tell-all interview</a>, the young celebrity confessed how she felt after she was widely criticised for her “history is like gossip” faux pax.</p>\n<p>She recalled her encounter with Senator Imee Marcos, the President’s sister, whom she met on the set of the film. “I asked her if I could hug her,” the celebrity recalled. “You’ve been bashed for thirty-six years,” she remembered telling the Senator. “I’ve only been bashed for a week, and I couldn’t take it.”</p>\n<p>For the young celebrity as well as many Filipinos, the Marcoses are an inspiration to keep going, while others kept pulling them down.</p>\n<p>“Just let them be,” was the Senator’s advice to her.</p>\n<p>This is the brilliance behind the Marcoses’ influence operations. The family is portrayed as both special and relatable. They are confident enough to let their critics be. They know the emotive power of suffering and redemption, such that any critique against the Marcos family and their supporters only serves to strengthen their narrative of persecution by what they construe as a loud liberal minority.</p>\n<p>Fighting fire with fire may be the only tactics critics of the Marcos family have left. But, if there is anything that can be learned from decades of Marcos restoration, it is that changing people’s minds is a slow burn.</p>\n<p><em>Nicole Curato is the co-author of Par</em><a href=\"https://mediamanipulation.org/research/parallel-public-spheres-influence-operations-2022-philippine-elections\"><em>allel Public Spheres: Influence Operations of the 2022 Philippine Elections</em></a><em>, published by the Shorenstein Centre on Media, Politics, and Public Policy at the Harvard Kennedy School. She is a Professor of Political Sociology at the Centre for Deliberative Democracy and Global Governance at the University of Canberra.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/when-it-comes-to-historical-distortion-we-cannot-fight-fire-with-fire/\">When it comes to historical distortion, we cannot fight fire with fire</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}