{
  "title": "So you want to be a data scientist? (Part 1)",
  "link": "",
  "updated": "2014-10-11T00:00:00+00:00",
  "id": "http://daoudclarke.github.com/machine%20learning%20in%20practice/2014/10/11/data-science-skills",
  "content": "<p>“Data Scientist” is definitely the hot new job\ndescription. It is such a new title that the roles and\nresponsibilities associated with it are still not clearly\ndefined. What skills do you need to be a data scientist? Well, not\neveryone agrees. In this article we will try to be objective by\nlooking at statistics on what skills employers recruiting data\nscientists are looking for. We will use data from\n<a href=\"http://www.itjobswatch.co.uk/jobs/uk/data%20scientist.do\">IT Jobswatch</a>,\nwhich is a fantastic resource for those looking to upskill themselves:\nit provides comprehensive statistics on the keywords that recruiters\nmention in job advertisements. I will also give my own opinions based\non my experience recruiting data scientists and working as one at\n<a href=\"http://lumi.do\">Lumi</a>.</p>\n\n<p>Some caveats:</p>\n\n<ul>\n  <li>The data is from jobs advertised in the UK, so your mileage may\nvary.</li>\n  <li>Recruiters might not necessarily know what the employer really\n<em>needs</em></li>\n  <li><em>Employers</em> might not know what they really need</li>\n</ul>\n\n<p>The last point is important because it is easy to fall prey to the\nbandwagon phenomenon: “Everyone is doing <em>big data</em> so we need\nto do it too”. The company may not actually have enough data to\nbenefit from big data technology, and may benefit more from a careful\nstatistical analysis of the data that they do have.</p>\n\n<p>So, what do you need to know to be a data scientist? Here’s what\nrecruiters are asking for, broken down into the following sections:</p>\n\n<ul>\n  <li>Qualifications</li>\n  <li>Applied skills</li>\n  <li>Knowledge-based skills</li>\n  <li>Programming languages</li>\n  <li>Technologies</li>\n</ul>\n\n<h2 id=\"qualifications\">Qualifications</h2>\n\n<p>If you know you want to be a data scientist, and you’re trying to\ndecide whether to go to university, or what course you might do, then\nthe answer is quite clear. 37% of data science jobs advertised mention\nthe word “degree”, and 34% mention “PhD”. A PhD\ninvolving experimentation, numerical analysis or computer programming\nmay well be beneficial to getting a data scientist position, but\nanyone who can demonstrate analytical ability and knowledge of how to\nrun experiments is in a good position.</p>\n\n<p>Keywords mentioned relating to degrees are (predictably) Mathematics\n(50%), Computer Science (37%) and Physics (25%), and any of these\nwould provide a good foundation for a career in data science. However,\nit is not enough to know just Mathematics or Computer Science - as a\ndata scientist you will need to combine many skills. As someone who\nstudied physics myself, I am biased, but a typical physics course will\ncover many of the things you need to know: how to run experiments, how\nto analyse results and how to program - a very good starting point.</p>\n\n<p>Some universities are now offering courses in data science - these\ncould be a good choice, but are certainly not necessary if this is\nwhat you want to do.</p>\n\n<h2 id=\"skills\">Skills</h2>\n\n<p>Just as for any other type of scientist, data scientists need to be\ninquisitive and enjoy solving hard problems. You need to be able to\ntruly understand and characterise a problem, perhaps describe it\nmathematically, break it down, and come up with a plan for a\nsolution. 48% of job adverts cite “Analytical Skills” - a\ncatch-all phrase for this type of ability.</p>\n\n<p>Other skills mentioned in data science job adverts are:</p>\n\n<ul>\n  <li>Data Mining (38%) - a very general area relating to the use of\nstatistics and machine learning techniques to extract information\nfrom typically unstructured sources of content such as web pages or\nlog files.</li>\n  <li>Statistics (37%) - undoubtedly, every data scientist needs to have\na basic grasp of statistics and know best practices for statistical\nanalysis of data.</li>\n  <li>Machine Learning (28%) - the science of analysing data to find\npatterns and make predictions. This is a very broad area that is\nlong established in the academic research community; its usage is\nonly just starting to become widespread in industry.</li>\n  <li>Visualisation (23%) - in general, communication skills are very\nimportant for a data scientist, and being able to visualise data\nin ways that draw out the patterns of interest is a very useful\nskill to help communicate ideas.</li>\n  <li>Finance (19%) - many jobs in data science are in finance - if you\nare interested in working in this area, then any knowledge you have\nwill be beneficial.</li>\n  <li>Information Retrieval (10%) - the science of search, typically text\ndocuments (think Google search), but also images and sound.</li>\n  <li>Natural Language Processing (5%) - technologies related to natural\nlanguage such as part of speech tagging, parsing, named entity\nrecognition, machine translation and question answering.</li>\n</ul>\n\n<p>I would add to this that it is generally important for all data\nscientists to have some general business acumen, so that they can\nfocus their efforts on tasks that are strategically beneficial to the\ncompany.</p>\n\n<p>Other skills mentioned are: Analytics, Predictive Modelling, Data\nModelling and Data Analysis (66%, 24%, 23% and 19%\nrespectively). These are either synonyms for, or applications of the\nabove skills to specific areas, each with a different emphasis.</p>\n\n<h2 id=\"technologies\">Technologies</h2>\n\n<p>56% of jobs mention “Big Data” a term which basically\nmeans the ability to analyse and work efficiently with very large\ndatasets. Practically this means experience with Hadoop (49%) and\nMapReduce (26%) and perhaps Mahout for machine learning (17%). Other\nbig data technologies include NoSQL databases (9%) such as MongoDB\n(7%), Cassandra (3%) and search technologies such as Elasticsearch\n(0.25%) and Solr (0.25%).</p>\n\n<p>Not all data is big however. It is also important to know how to work\nwith relational databases (16%) such as Oracle (5%), Postgres (3%) and\nMySQL (3%), and you will need to have at least a basic knowledge of\nSQL (43%).</p>\n\n<p>Other technologies mentioned are more business oriented, such as the\nstatistics packages SAS (25%) and SPSS (20%), however the overall\ndemand trend for both these technologies seems to be downward.</p>\n\n<h2 id=\"programming-languages\">Programming Languages</h2>\n\n<p>If you want to be a data scientist, you will have to be able to\nprogram, which means you will need to know at least one language. Here\nare your options:</p>\n\n<ul>\n  <li>By far the most popular is R (55%) because of its very comprehensive\nset of libraries for scientific computing;</li>\n  <li>This is followed by Java (45%), because it’s so darned popular\n(personally I’m not a fan);</li>\n  <li>Python (43%) is my favourite because of its resources for machine\nlearning\n(<a href=\"http://daoudclarke.github.io/machine%20learning%20in%20practice/2013/09/18/why-i-love-scikit-learn/\">I wrote a whole article about it</a>),\nit’s really fast to write code, the code is generally very readable\nand runs quickly because it uses C libraries internally, and can be\nused for production code as well as quick scripts for analysis;</li>\n  <li>MATLAB (33%) is an old favourite for scientific computing; whilst\nit is powerful, unlike other options it is not freely available.</li>\n  <li>Other popular languages for data scientists are C++\n(21%), Scala (17%), C# (7%), Visual Basic (7%), Clojure (7%) and Ruby\n(6%).</li>\n</ul>"
}