{
  "title": "Episode 44: &#8220;Train Kept A-Rollin&#039;&#8221;, by Johnny Burnette and the Rock &#8216;n&#8217; Roll Trio",
  "link": "https://500songs.com/podcast/episode-44-train-kept-a-rollin-by-johnny-burnette-and-the-rock-n-roll-trio/",
  "pubDate": "Mon, 05 Aug 2019 01:32:45 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-44-train-kept-a-rollin-by-johnny-burnette-and-the-rock-n-roll-trio/",
  "description": "Episode forty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Train Kept A-Rollin'\" by Johnny Burnette and the Rock 'n' Roll Trio, and how a rockabilly trio from Memphis connect a novelty cowboy song by Ella Fitzgerald to Motorhead and Aerosmith. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28921921\">on \"Jump, Jive, an' Wail\", by Louis Prima</a>.\n\n\n\n<strong>Resources</strong>\n\nFor biographical information on the Burnettes, I've mostly used Billy Burnette's self-published autobiography, <a href=\"https://amzn.to/2M1iT6e\">Craxy Like Me</a>. It's a flawed source, but the only other book on Johnny Burnette I've been able to find is in Spanish, and while I go to great lengths to make this podcast accurate I do have limits, and learning Spanish for a single episode is one of them.\n\nThe details about the Burnettes' relationship with Elvis Presley come from <a href=\"https://amzn.to/2I6pg78\">Last Train To Memphi</a>s by Peter Guralnick.\n\n<a href=\"https://amzn.to/2OS4iaN\">Before Elvis by Larry Birnbaum</a> has a chapter on \"Train Kept A-Rollin'\", and its antecedents in earlier blues material, that goes into far more detail than I could here, but which was an invaluable reference.\n\nAnd <a href=\"https://amzn.to/31oNNct\">this three-CD set</a> contains almost everything Johnny Burnette released up to 1962.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere are some records that have had such an effect on the history of rock music that the record itself becomes almost divorced from its context. Who made it, and how, doesn't seem to matter as much as that it did exist, and that it reverberated down the generations. Today, we're going to look at one of those records, and at how a novelty song about cowboys written for an Abbot and Costello film became a heavy metal anthem performed by every group that ever played a distorted riff.\n\nThere's a tradition in rock and roll music of brothers who fight constantly making great music together, and we'll see plenty of them as we go through the next few decades -- the Everly Brothers, Ray and Dave Davies, the Beach Boys... rock and roll would be very different without sibling rivalry. But few pairs of brothers have fought as violently and as often as Johnny and Dorsey Burnette. The first time Roy Orbison met them, he was standing in a Memphis radio station, chatting with Elvis Presley, and waiting for a lift. When the lift doors opened, inside the lift were the Burnette brothers, in the middle of a fist-fight.\n\nWhen Dorsey was about eight years old and Johnny six, their mother bought them both guitars. By the end of the day, both guitars had been broken -- over each other's heads.\n\nAnd their fights were not just the minor fights one might expect from young men, but serious business. Both of them were trained boxers, and in Dorsey Burnette's case he was a professional who became Golden Gloves champion of the South in 1950, and had once fought Sonny Liston. A fight between the Burnette brothers was a real fight.\n\nThey'd grown up around Lauderdale Court, the same apartment block where Elvis Presley spent his teenage years, and they used to hang around together and sing with a gang of teenage boys that included Bill Black's brother Johnny. Elvis would, as a teenager, hang around on the outskirts of their little group, singing along with them, but not really part of the group -- the Burnette brothers were as likely to bully him as they were to encourage him to be part of the gang, and while they became friendly later on, Elvis was always more of a friend-of-friends than he was an actual friend of theirs, even when he was a colleague of Dorsey's at Crown Electric. He was a little bit younger than them, and not the most sociable of people, and more importantly he didn't like their aggression – Elvis would jokingly refer to them as the Daltons, after the outlaw gang,\nAnother colleague at Crown Electric was a man named Paul Burlison, who also boxed, and had been introduced to Dorsey by Lee Denson, who had taught both Dorsey and Elvis their first guitar chords. Burlison also played the guitar, and had played in many small bands over the late forties and early fifties. In particular, one of the bands he was in had had its own regular fifteen-minute show on a local radio station, and their show was on next to a show presented by the blues singer Howlin' Wolf. Burlison's guitar playing would later show many signs of being influenced by Wolf's electric blues, just as much as by the country and western music his early groups were playing. Some sources even say that Burlison played on some of Wolf's early recordings at the Sun studios, though most of the sessionographies I've seen for Wolf say otherwise.\n\nThe three of them formed a group in 1952, the Rhythm Rangers, with Burlison on lead guitar, Dorsey Burnette on double bass, and Johnny Burnette on rhythm guitar and lead vocals. A year later, they changed their name to the Rock & Roll Trio.\n\nWhile they were called the Rock & Roll Trio, they were still basically a country band, and their early setlists included songs like Hank Snow's \"I'm Moving On\":\n\n[Excerpt: Hank Snow, \"I'm Moving On\"]\n\nThat one got dropped from their setlist after an ill-fated trip to Nashville. They wanted to get on the Grand Ole Opry, and so they drove up, found Snow, who was going to be on that night's show, and asked him if he could get them on to the show. Snow explained to them that it had taken him twenty years in the business to work his way up to being on the Grand Ole Opry, and he couldn't just get three random people he'd never met before on to the show.\n\nJohnny Burnette replied with two words, the first of which would get this podcast bumped into the adult section in Apple Podcasts, and the second of which was \"you\", and then they turned round and drove back to Memphis. They never played a Hank Snow song live again.\n\nIt wasn't long after that, in 1953, that they recorded their first single, \"You're Undecided\", for a tiny label called Von Records in Boonville, Mississippi;\n\n[Excerpt: The Rock and Roll Trio, \"You're Undecided\", Von Records version]\n\nAround this time they also wrote a song called \"Rockabilly Boogie\", which they didn't get to record until 1957:\n[Excerpt: Johnny Burnette and the Rock and Roll Trio, \"Rockabilly Boogie\"]\n\nThat has been claimed as the first use of the word \"rockabilly\", and Billy Burnette, Dorsey's son, says they coined the word based on his name and that of Johnny's son Rocky.\n\nNow, it seems much more likely to me that the origin of the word is the obvious one -- that it's a portmanteau of the words \"rock\" and \"hillbilly\", to describe rocking hillbilly music -- but those were the names of their kids, so I suppose it's just about possible.\n\nTheir 1953 single was not a success, and they spent the next few years playing in honky-tonks. They also regularly played the Saturday Night Jamboree at the Goodwyn Institute Auditorium, a regular country music show that was occasionally broadcast on the same station that Burlison's old bands had performed on, KWEM. Most of the musicians in Memphis who went on to make important early rockabilly records would play at the Jamboree, but more important than the show itself was the backstage area, where musicians would jam, show each other new riffs they'd come up with, and pass ideas back and forth. Those backstage jam sessions were the making of the Rock 'n' Roll Trio, as they were for many of the other rockabilly acts in the area.\n\nTheir big break came in early 1956, when they appeared on the Ted Mack Amateur Hour and won three times in a row. The Ted Mack Amateur Hour was a TV series that was in many ways the X Factor or American Idol of the 1950s. The show launched the careers of Pat Boone, Ann-Margret, and Gladys Knight among others, and when the Rock and Roll Trio won for the third time (at the same time their old neighbour Elvis was on the Ed Sullivan show on another channel) they got signed to Coral Records, a subsidiary of Decca Records, one of the biggest major labels in the USA at the time.\n\nTheir first attempt at recording didn't go particularly well. Their initial session for Coral was in New York, and when they got there they were surprised to find a thirty-two piece orchestra waiting for them, none of whom had any more clue about playing rock and roll music than the Rock And Roll Trio had about playing orchestral pieces.\n\nThey did record one track with the orchestra, \"Shattered Dreams\", although that song didn't get released until many years later:\n\n[Excerpt: Johnny Burnette, \"Shattered Dreams\"]\n\nBut after recording that song they sent all the musicians home except the drummer, who played on the rest of the session. They'd simply not got the rock and roll sound they wanted when working with all those musicians. They didn't need them.\n\nThey didn't have quite enough songs for the session, and needed another uptempo number, and so Dorsey went out into the hallway and quickly wrote a song called \"Tear It Up\", which became the A-side of their first Coral single, with the B-side being a new version of \"You're Undecided\":\n\n[Excerpt: The Rock and Roll Trio, \"Tear It Up\"]\n\nWhile Dorsey wrote that song, he decided to split the credit, as they always did, four ways between the three members of the band and their manager. This kind of credit-splitting is normal in a band-as-gang, and right then that's what they were -- a gang, all on the same side. That was soon going to change, and credit was going to be one of the main reasons.\n\nBut that was all to come. For now, the Rock 'n' Roll Trio weren't happy at all about their recordings. They didn't want to make any more records in New York with a bunch of orchestral musicians who didn't know anything about their music. They wanted to make records in Nashville, and so they were booked into Owen Bradley's studio, the same one where Gene Vincent made his first records, and where Wanda Jackson recorded when she was in Nashville rather than LA. Bradley knew how to get a good rockabilly sound, and they were sure they were going to get the sound they'd been getting live when they recorded there.\n\nIn fact, they got something altogether different, and better than that sound, and it happened entirely by accident.\nOn their way down to Nashville from New York they played a few shows, and one of the first they played was in Philadelphia. At that show, Paul Burlison dropped his amplifier, loosening one of the vacuum tubes inside. The distorted sound it gave was like nothing he'd ever heard, and while he replaced the tube, he started loosening it every time he wanted to get that sound.\n\nSo when they got to Nashville, they went into Owen Bradley's studio and, for possibly the first time ever, deliberately recorded a distorted guitar.\n\nI say possibly because, as so often happens with these things, a lot of people seem to have had the same idea around the same time, but the Rock 'n' Roll Trio's recordings do seem to be the first ones where the distortion was deliberately chosen. Obviously we've already looked at \"Rocket 88\", which did have a distorted guitar, and again that was caused by an accident, but the difference there was that the accident happened on the day of the recording with no time to fix it. This was Burlison choosing to use the result of the accident at a point where he could have easily had the amplifier in perfect working order, had he wanted to.\n\nAt these sessions, the trio were augmented by a few studio musicians from the Nashville \"A-Team\", the musicians who made most of the country hits of the time. While Dorsey Burnette played bass live, he preferred playing guitar, so in the studio he was on an additional rhythm guitar while Bob Moore played the bass. Buddy Harmon was on drums, while session guitarist Grady Martin added another electric guitar to complement Burlison's.\n\nThe presence of these musicians has led some to assume that they played everything on the records, and that the Rock 'n' Roll Trio only added their voices, but that seems to be very far from the case. Certainly Burlison's guitar style is absolutely distinctive, and the effect he puts on his guitar is absolutely unlike anything else that you hear from Grady Martin at this point. Martin did, later, introduce the fuzztone to country music, with his playing on records like Marty Robbins' \"Don't Worry\":\n\n[Excerpt: Marty Robbins, \"Don't Worry\"]\n\nBut that was a good five years after the Rock 'n' Roll Trio sessions, and the most likely explanation is that Martin was inspired to add fuzz to his guitar by Paul Burlison, rather than deciding to add it on one session and then not using it again for several years.\n\nThe single they recorded at that Nashville session was one that would echo down the decades, influencing everyone from the Beatles to Aerosmith to Screaming Lord Sutch and the Savages.\n\nThe A-side, \"Honey Hush\", was originally written and recorded by Big Joe Turner three years earlier:\n\n[Excerpt: Big Joe Turner, \"Honey Hush\"]\n\nIt's not one of Turner's best, to be honest -- leaning too heavily on the misogyny that characterised too much of his work -- but over the years it has been covered by everyone from Chuck Berry to Paul McCartney, Elvis Costello to Jerry Lee Lewis. The Rock 'n' Roll Trio's cover version is probably the best of these, and certainly the most exciting:\n\n[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Honey Hush\"]\n\nThis is the version of the song that inspired most of those covers, but the song that really mattered to people was the B-side, a track called \"Train Kept A-Rollin'\".\n\n\"Train Kept A-Rollin'\", like many R&B songs, has a long history, and is made up of elements that one can trace back to the 1920s, or earlier in some cases. But the biggest inspiration for the track is a song called \"Cow Cow Boogie\", which was originally recorded by Ella Mae Morse in 1942, but which was written for Ella Fitzgerald to sing in an Abbot and Costello film, but cut from her appearance.\n\nFitzgerald eventually recorded her own hit version of the song in 1943, backed by the Ink Spots, with the pianist Bill Doggett accompanying them:\n\n[Excerpt: Ella Fitzgerald and the Ink Spots, \"Cow Cow Boogie\"]\n\nThat was in turn adapted by the jump band singer Tiny Bradshaw, under the title \"Train Kept A-Rollin'\":\n\n[Excerpt: Tiny Bradshaw, \"The Train Kept A-Rollin'\"]\n\nAnd that in turn was the basis for the Rock 'n' Roll Trio's version of the song, which they radically rearranged to feature an octave-doubled guitar riff, apparently invented by Dorsey Burnette, but played simultaneously by Burlison and Martin, with Burlison's guitar fuzzed up and distorted. This version of the song would become a classic:\n\n[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Train Kept A-Rollin'\"]\n\nThe single wasn't a success, but its B-side got picked up by the generation of British guitar players that came after, and from then it became a standard of rock music. It was covered by Screaming Lord Sutch and the Savages:\n\n[Excerpt: Screaming Lord Sutch and the Savages, \"Train Kept A-Rollin'\"]\n\nThe Yardbirds:\n\n[Excerpt: The Yardbirds, \"Train Kept A-Rollin'\"]\n\nShakin' Stevens and the Sunsets:\n\n[Excerpt: Shakin' Stevens and the Sunsets, \"Train Kept A-Rollin'\"]\n\nAerosmith:\n\n[Excerpt: Aerosmith, \"Train Kept A-Rollin'\"]\n\nMotorhead:\n\n[Excerpt: Motorhead: \"Train Kept A-Rollin'\"]\n\nYou get the idea. By adding a distorted guitar riff, the Rock 'n' Roll Trio had performed a kind of alchemy, which turned a simple novelty cowboy song into something that would make the repertoire of every band that ever wanted to play as loud as possible and to scream at the top of their voices the words \"the train kept rolling all night long\".\n\nSadly, the Rock 'n' Roll Trio didn't last much longer. While they had always performed as the Rock 'n' Roll Trio, Coral Records decided to release their recordings as by \"Johnny Burnette and the Rock 'n' Roll Trio\", and the other two members were understandably furious. They were a band, not just Johnny Burnette's backing musicians.\n\nDorsey was the first to quit -- he left the band a few days before they were due to appear in Rock! Rock! Rock!, a cheap exploitation film starring Alan Freed. They got Johnny Black in to replace him for the film shoot, and Dorsey rejoined shortly afterwards, but the cracks had already appeared.\n\nThey recorded one further session, but the tracks from that weren't even released as by Johnny Burnette and the Rock 'n' Roll Trio, just by Johnny Burnette, and that was the final straw. The group split up, and went their separate ways.\n\nJohnny remained signed to Coral Records as a solo artist, but when he and Dorsey both moved, separately, to LA, they ended up working together as songwriters.\n\nDorsey was contracted as a solo artist to Imperial Records, who had a new teen idol star who needed material -- Ricky Nelson had had an unexpected hit after singing on his parents' TV show, and as a result he was suddenly being promoted as a rock and roll star. Dorsey and Johnny wrote a whole string of top ten hits for Nelson, songs like \"Believe What You Say\", \"Waiting In School\", \"It's Late\", and \"Just A Little Too Much\":\n\n[Excerpt: Ricky Nelson, \"Just a Little Too Much\"]\n\nThey also started recording for Imperial as a duo, under the name \"the Burnette Brothers\":\n\n[Excerpt: The Burnette Brothers, \"Warm Love\"]\n\nBut that was soon stopped by Coral, who wanted to continue marketing Johnny as a solo artist, and they both started pursuing separate solo careers. Dorsey eventually had a minor hit of his own, \"There Was a Tall Oak Tree\", which made the top thirty in 1960. He made a few more solo records in the early sixties, and after becoming a born-again Christian in the early seventies he started a new, successful, career as a country singer, eventually receiving a \"most promising newcomer\" award from the Academy of Country Music in 1973, twenty years after his career started. He died in 1979 of a heart attack.\n\nJohnny Burnette eventually signed to Liberty Records, and had a string of hits that, like Dorsey's, were in a very different style from the Rock 'n' Roll Trio records. His biggest hit, and the one that most people associate with him to this day, was \"You're Sixteen, You're Beautiful, And You're Mine\":\n\n[Excerpt: Johnny Burnette, \"You're Sixteen\"]\n\nThat song is, of course, a perennial hit that most people still know almost sixty years later, but none of Johnny's solo records had anything like the power and passion of the Rock 'n' Roll Trio recordings. And sadly we'll never know if he would regain that passion, as in 1964 he died in a boating accident.\n\nPaul Burlison, the last member of the trio, gave up music once the trio split up, and became an electrician again. He briefly joined Johnny on one tour in 1963, but otherwise stayed out of the music business until the 1980s. He then got back into performing, and started a new lineup of the Rock 'n' Roll Trio, featuring Johnny Black, who had briefly replaced Dorsey in the group, and Tony Austin, the drummer who had joined with them on many tour dates after they got a recording contract.\n\nHe later joined \"the Sun Rhythm Section\", a band made up of many of the musicians who had played on classic rockabilly records, including Stan Kessler, Jimmy Van Eaton, Sonny Burgess, and DJ Fontana.\nBurlison released his only solo album in 1997. That album was called Train Kept A-Rollin', and featured a remake of that classic song, with Rocky and Billy Burnette -- Johnny and Dorsey's sons -- on vocals:\n\n[Excerpt: Paul Burlison, \"Train Kept A-Rollin'\"]\n\nHe kept playing rockabilly until he died in 2003, aged seventy-four.",
  "itunes:subtitle": "Episode forty-four of A History of Rock Music in Five Hundred Songs looks at Train Kept A-Rollin by Johnny Burnette and the Rock n Roll Trio, and how a rockabilly trio from Memphis connect a novelty cowboy song by Ella Fitzgerald to Motorhead and Aerosmi",
  "itunes:keywords": "Alan Freed,Big Joe turner,Bill Doggett,Bob Moore,Coral Records,distorted guitar,Dorsey Burnette,Ella Fitzgerald,Elvis Presley,Grady Martin,Grand Ole Opry,Hank Snow,Howlin&#039; Wolf,Imperial Records,Ink Spots,Johnny Burnette,Liberty Records,Nashville A Team,Owen Bradley,Paul Burlison,Ricky Nelson,rockabilly,Ted Mack",
  "itunes:episodeType": "full",
  "itunes:episode": 44,
  "content:encoded": "Episode forty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Train Kept A-Rollin'\" by Johnny Burnette and the Rock 'n' Roll Trio, and how a rockabilly trio from Memphis connect a novelty cowboy song by Ella Fitzgerald to Motorhead and Aerosmith. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/28921921\">on \"Jump, Jive, an' Wail\", by Louis Prima</a>.\n\n\n\n<strong>Resources</strong>\n\nFor biographical information on the Burnettes, I've mostly used Billy Burnette's self-published autobiography, <a href=\"https://amzn.to/2M1iT6e\">Craxy Like Me</a>. It's a flawed source, but the only other book on Johnny Burnette I've been able to find is in Spanish, and while I go to great lengths to make this podcast accurate I do have limits, and learning Spanish for a single episode is one of them.\n\nThe details about the Burnettes' relationship with Elvis Presley come from <a href=\"https://amzn.to/2I6pg78\">Last Train To Memphi</a>s by Peter Guralnick.\n\n<a href=\"https://amzn.to/2OS4iaN\">Before Elvis by Larry Birnbaum</a> has a chapter on \"Train Kept A-Rollin'\", and its antecedents in earlier blues material, that goes into far more detail than I could here, but which was an invaluable reference.\n\nAnd <a href=\"https://amzn.to/31oNNct\">this three-CD set</a> contains almost everything Johnny Burnette released up to 1962.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nThere are some records that have had such an effect on the history of rock music that the record itself becomes almost divorced from its context. Who made it, and how, doesn't seem to matter as much as that it did exist, and that it reverberated down the generations. Today, we're going to look at one of those records, and at how a novelty song about cowboys written for an Abbot and Costello film became a heavy metal anthem performed by every group that ever played a distorted riff.\n\nThere's a tradition in rock and roll music of brothers who fight constantly making great music together, and we'll see plenty of them as we go through the next few decades -- the Everly Brothers, Ray and Dave Davies, the Beach Boys... rock and roll would be very different without sibling rivalry. But few pairs of brothers have fought as violently and as often as Johnny and Dorsey Burnette. The first time Roy Orbison met them, he was standing in a Memphis radio station, chatting with Elvis Presley, and waiting for a lift. When the lift doors opened, inside the lift were the Burnette brothers, in the middle of a fist-fight.\n\nWhen Dorsey was about eight years old and Johnny six, their mother bought them both guitars. By the end of the day, both guitars had been broken -- over each other's heads.\n\nAnd their fights were not just the minor fights one might expect from young men, but serious business. Both of them were trained boxers, and in Dorsey Burnette's case he was a professional who became Golden Gloves champion of the South in 1950, and had once fought Sonny Liston. A fight between the Burnette brothers was a real fight.\n\nThey'd grown up around Lauderdale Court, the same apartment block where Elvis Presley spent his teenage years, and they used to hang around together and sing with a gang of teenage boys that included Bill Black's brother Johnny. Elvis would, as a teenager, hang around on the outskirts of their little group, singing along with them, but not really part of the group -- the Burnette brothers were as likely to bully him as they were to encourage him to be part of the gang, and while they became friendly later on, Elvis was always more of a friend-of-friends than he was an actual friend of theirs, even when he was a colleague of Dorsey's at Crown Electric. He was a little bit younger than them, and not the most sociable of people, and more importantly he didn't like their aggression – Elvis would jokingly refer to them as the Daltons, after the outlaw gang,\nAnother colleague at Crown Electric was a man named Paul Burlison, who also boxed, and had been introduced to Dorsey by Lee Denson, who had taught both Dorsey and Elvis their first guitar chords. Burlison also played the guitar, and had played in many small bands over the late forties and early fifties. In particular, one of the bands he was in had had its own regular fifteen-minute show on a local radio station, and their show was on next to a show presented by the blues singer Howlin' Wolf. Burlison's guitar playing would later show many signs of being influenced by Wolf's electric blues, just as much as by the country and western music his early groups were playing. Some sources even say that Burlison played on some of Wolf's early recordings at the Sun studios, though most of the sessionographies I've seen for Wolf say otherwise.\n\nThe three of them formed a group in 1952, the Rhythm Rangers, with Burlison on lead guitar, Dorsey Burnette on double bass, and Johnny Burnette on rhythm guitar and lead vocals. A year later, they changed their name to the Rock & Roll Trio.\n\nWhile they were called the Rock & Roll Trio, they were still basically a country band, and their early setlists included songs like Hank Snow's \"I'm Moving On\":\n\n[Excerpt: Hank Snow, \"I'm Moving On\"]\n\nThat one got dropped from their setlist after an ill-fated trip to Nashville. They wanted to get on the Grand Ole Opry, and so they drove up, found Snow, who was going to be on that night's show, and asked him if he could get them on to the show. Snow explained to them that it had taken him twenty years in the business to work his way up to being on the Grand Ole Opry, and he couldn't just get three random people he'd never met before on to the show.\n\nJohnny Burnette replied with two words, the first of which would get this podcast bumped into the adult section in Apple Podcasts, and the second of which was \"you\", and then they turned round and drove back to Memphis. They never played a Hank Snow song live again.\n\nIt wasn't long after that, in 1953, that they recorded their first single, \"You're Undecided\", for a tiny label called Von Records in Boonville, Mississippi;\n\n[Excerpt: The Rock and Roll Trio, \"You're Undecided\", Von Records version]\n\nAround this time they also wrote a song called \"Rockabilly Boogie\", which they didn't get to record until 1957:\n[Excerpt: Johnny Burnette and the Rock and Roll Trio, \"Rockabilly Boogie\"]\n\nThat has been claimed as the first use of the word \"rockabilly\", and Billy Burnette, Dorsey's son, says they coined the word based on his name and that of Johnny's son Rocky.\n\nNow, it seems much more likely to me that the origin of the word is the obvious one -- that it's a portmanteau of the words \"rock\" and \"hillbilly\", to describe rocking hillbilly music -- but those were the names of their kids, so I suppose it's just about possible.\n\nTheir 1953 single was not a success, and they spent the next few years playing in honky-tonks. They also regularly played the Saturday Night Jamboree at the Goodwyn Institute Auditorium, a regular country music show that was occasionally broadcast on the same station that Burlison's old bands had performed on, KWEM. Most of the musicians in Memphis who went on to make important early rockabilly records would play at the Jamboree, but more important than the show itself was the backstage area, where musicians would jam, show each other new riffs they'd come up with, and pass ideas back and forth. Those backstage jam sessions were the making of the Rock 'n' Roll Trio, as they were for many of the other rockabilly acts in the area.\n\nTheir big break came in early 1956, when they appeared on the Ted Mack Amateur Hour and won three times in a row. The Ted Mack Amateur Hour was a TV series that was in many ways the X Factor or American Idol of the 1950s. The show launched the careers of Pat Boone, Ann-Margret, and Gladys Knight among others, and when the Rock and Roll Trio won for the third time (at the same time their old neighbour Elvis was on the Ed Sullivan show on another channel) they got signed to Coral Records, a subsidiary of Decca Records, one of the biggest major labels in the USA at the time.\n\nTheir first attempt at recording didn't go particularly well. Their initial session for Coral was in New York, and when they got there they were surprised to find a thirty-two piece orchestra waiting for them, none of whom had any more clue about playing rock and roll music than the Rock And Roll Trio had about playing orchestral pieces.\n\nThey did record one track with the orchestra, \"Shattered Dreams\", although that song didn't get released until many years later:\n\n[Excerpt: Johnny Burnette, \"Shattered Dreams\"]\n\nBut after recording that song they sent all the musicians home except the drummer, who played on the rest of the session. They'd simply not got the rock and roll sound they wanted when working with all those musicians. They didn't need them.\n\nThey didn't have quite enough songs for the session, and needed another uptempo number, and so Dorsey went out into the hallway and quickly wrote a song called \"Tear It Up\", which became the A-side of their first Coral single, with the B-side being a new version of \"You're Undecided\":\n\n[Excerpt: The Rock and Roll Trio, \"Tear It Up\"]\n\nWhile Dorsey wrote that song, he decided to split the credit, as they always did, four ways between the three members of the band and their manager. This kind of credit-splitting is normal in a band-as-gang, and right then that's what they were -- a gang, all on the same side. That was soon going to change, and credit was going to be one of the main reasons.\n\nBut that was all to come. For now, the Rock 'n' Roll Trio weren't happy at all about their recordings. They didn't want to make any more records in New York with a bunch of orchestral musicians who didn't know anything about their music. They wanted to make records in Nashville, and so they were booked into Owen Bradley's studio, the same one where Gene Vincent made his first records, and where Wanda Jackson recorded when she was in Nashville rather than LA. Bradley knew how to get a good rockabilly sound, and they were sure they were going to get the sound they'd been getting live when they recorded there.\n\nIn fact, they got something altogether different, and better than that sound, and it happened entirely by accident.\nOn their way down to Nashville from New York they played a few shows, and one of the first they played was in Philadelphia. At that show, Paul Burlison dropped his amplifier, loosening one of the vacuum tubes inside. The distorted sound it gave was like nothing he'd ever heard, and while he replaced the tube, he started loosening it every time he wanted to get that sound.\n\nSo when they got to Nashville, they went into Owen Bradley's studio and, for possibly the first time ever, deliberately recorded a distorted guitar.\n\nI say possibly because, as so often happens with these things, a lot of people seem to have had the same idea around the same time, but the Rock 'n' Roll Trio's recordings do seem to be the first ones where the distortion was deliberately chosen. Obviously we've already looked at \"Rocket 88\", which did have a distorted guitar, and again that was caused by an accident, but the difference there was that the accident happened on the day of the recording with no time to fix it. This was Burlison choosing to use the result of the accident at a point where he could have easily had the amplifier in perfect working order, had he wanted to.\n\nAt these sessions, the trio were augmented by a few studio musicians from the Nashville \"A-Team\", the musicians who made most of the country hits of the time. While Dorsey Burnette played bass live, he preferred playing guitar, so in the studio he was on an additional rhythm guitar while Bob Moore played the bass. Buddy Harmon was on drums, while session guitarist Grady Martin added another electric guitar to complement Burlison's.\n\nThe presence of these musicians has led some to assume that they played everything on the records, and that the Rock 'n' Roll Trio only added their voices, but that seems to be very far from the case. Certainly Burlison's guitar style is absolutely distinctive, and the effect he puts on his guitar is absolutely unlike anything else that you hear from Grady Martin at this point. Martin did, later, introduce the fuzztone to country music, with his playing on records like Marty Robbins' \"Don't Worry\":\n\n[Excerpt: Marty Robbins, \"Don't Worry\"]\n\nBut that was a good five years after the Rock 'n' Roll Trio sessions, and the most likely explanation is that Martin was inspired to add fuzz to his guitar by Paul Burlison, rather than deciding to add it on one session and then not using it again for several years.\n\nThe single they recorded at that Nashville session was one that would echo down the decades, influencing everyone from the Beatles to Aerosmith to Screaming Lord Sutch and the Savages.\n\nThe A-side, \"Honey Hush\", was originally written and recorded by Big Joe Turner three years earlier:\n\n[Excerpt: Big Joe Turner, \"Honey Hush\"]\n\nIt's not one of Turner's best, to be honest -- leaning too heavily on the misogyny that characterised too much of his work -- but over the years it has been covered by everyone from Chuck Berry to Paul McCartney, Elvis Costello to Jerry Lee Lewis. The Rock 'n' Roll Trio's cover version is probably the best of these, and certainly the most exciting:\n\n[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Honey Hush\"]\n\nThis is the version of the song that inspired most of those covers, but the song that really mattered to people was the B-side, a track called \"Train Kept A-Rollin'\".\n\n\"Train Kept A-Rollin'\", like many R&B songs, has a long history, and is made up of elements that one can trace back to the 1920s, or earlier in some cases. But the biggest inspiration for the track is a song called \"Cow Cow Boogie\", which was originally recorded by Ella Mae Morse in 1942, but which was written for Ella Fitzgerald to sing in an Abbot and Costello film, but cut from her appearance.\n\nFitzgerald eventually recorded her own hit version of the song in 1943, backed by the Ink Spots, with the pianist Bill Doggett accompanying them:\n\n[Excerpt: Ella Fitzgerald and the Ink Spots, \"Cow Cow Boogie\"]\n\nThat was in turn adapted by the jump band singer Tiny Bradshaw, under the title \"Train Kept A-Rollin'\":\n\n[Excerpt: Tiny Bradshaw, \"The Train Kept A-Rollin'\"]\n\nAnd that in turn was the basis for the Rock 'n' Roll Trio's version of the song, which they radically rearranged to feature an octave-doubled guitar riff, apparently invented by Dorsey Burnette, but played simultaneously by Burlison and Martin, with Burlison's guitar fuzzed up and distorted. This version of the song would become a classic:\n\n[Excerpt: Johnny Burnette and the Rock 'n' Roll Trio, \"Train Kept A-Rollin'\"]\n\nThe single wasn't a success, but its B-side got picked up by the generation of British guitar players that came after, and from then it became a standard of rock music. It was covered by Screaming Lord Sutch and the Savages:\n\n[Excerpt: Screaming Lord Sutch and the Savages, \"Train Kept A-Rollin'\"]\n\nThe Yardbirds:\n\n[Excerpt: The Yardbirds, \"Train Kept A-Rollin'\"]\n\nShakin' Stevens and the Sunsets:\n\n[Excerpt: Shakin' Stevens and the Sunsets, \"Train Kept A-Rollin'\"]\n\nAerosmith:\n\n[Excerpt: Aerosmith, \"Train Kept A-Rollin'\"]\n\nMotorhead:\n\n[Excerpt: Motorhead: \"Train Kept A-Rollin'\"]\n\nYou get the idea. By adding a distorted guitar riff, the Rock 'n' Roll Trio had performed a kind of alchemy, which turned a simple novelty cowboy song into something that would make the repertoire of every band that ever wanted to play as loud as possible and to scream at the top of their voices the words \"the train kept rolling all night long\".\n\nSadly, the Rock 'n' Roll Trio didn't last much longer. While they had always performed as the Rock 'n' Roll Trio, Coral Records decided to release their recordings as by \"Johnny Burnette and the Rock 'n' Roll Trio\", and the other two members were understandably furious. They were a band, not just Johnny Burnette's backing musicians.\n\nDorsey was the first to quit -- he left the band a few days before they were due to appear in Rock! Rock! Rock!, a cheap exploitation film starring Alan Freed. They got Johnny Black in to replace him for the film shoot, and Dorsey rejoined shortly afterwards, but the cracks had already appeared.\n\nThey recorded one further session, but the tracks from that weren't even released as by Johnny Burnette and the Rock 'n' Roll Trio, just by Johnny Burnette, and that was the final straw. The group split up, and went their separate ways.\n\nJohnny remained signed to Coral Records as a solo artist, but when he and Dorsey both moved, separately, to LA, they ended up working together as songwriters.\n\nDorsey was contracted as a solo artist to Imperial Records, who had a new teen idol star who needed material -- Ricky Nelson had had an unexpected hit after singing on his parents' TV show, and as a result he was suddenly being promoted as a rock and roll star. Dorsey and Johnny wrote a whole string of top ten hits for Nelson, songs like \"Believe What You Say\", \"Waiting In School\", \"It's Late\", and \"Just A Little Too Much\":\n\n[Excerpt: Ricky Nelson, \"Just a Little Too Much\"]\n\nThey also started recording for Imperial as a duo, under the name \"the Burnette Brothers\":\n\n[Excerpt: The Burnette Brothers, \"Warm Love\"]\n\nBut that was soon stopped by Coral, who wanted to continue marketing Johnny as a solo artist, and they both started pursuing separate solo careers. Dorsey eventually had a minor hit of his own, \"There Was a Tall Oak Tree\", which made the top thirty in 1960. He made a few more solo records in the early sixties, and after becoming a born-again Christian in the early seventies he started a new, successful, career as a country singer, eventually receiving a \"most promising newcomer\" award from the Academy of Country Music in 1973, twenty years after his career started. He died in 1979 of a heart attack.\n\nJohnny Burnette eventually signed to Liberty Records, and had a string of hits that, like Dorsey's, were in a very different style from the Rock 'n' Roll Trio records. His biggest hit, and the one that most people associate with him to this day, was \"You're Sixteen, You're Beautiful, And You're Mine\":\n\n[Excerpt: Johnny Burnette, \"You're Sixteen\"]\n\nThat song is, of course, a perennial hit that most people still know almost sixty years later, but none of Johnny's solo records had anything like the power and passion of the Rock 'n' Roll Trio recordings. And sadly we'll never know if he would regain that passion, as in 1964 he died in a boating accident.\n\nPaul Burlison, the last member of the trio, gave up music once the trio split up, and became an electrician again. He briefly joined Johnny on one tour in 1963, but otherwise stayed out of the music business until the 1980s. He then got back into performing, and started a new lineup of the Rock 'n' Roll Trio, featuring Johnny Black, who had briefly replaced Dorsey in the group, and Tony Austin, the drummer who had joined with them on many tour dates after they got a recording contract.\n\nHe later joined \"the Sun Rhythm Section\", a band made up of many of the musicians who had played on classic rockabilly records, including Stan Kessler, Jimmy Van Eaton, Sonny Burgess, and DJ Fontana.\nBurlison released his only solo album in 1997. That album was called Train Kept A-Rollin', and featured a remake of that classic song, with Rocky and Billy Burnette -- Johnny and Dorsey's sons -- on vocals:\n\n[Excerpt: Paul Burlison, \"Train Kept A-Rollin'\"]\n\nHe kept playing rockabilly until he died in 2003, aged seventy-four.",
  "enclosure": "",
  "itunes:summary": "Episode forty-four of A History of Rock Music in Five Hundred Songs looks at \"Train Kept A-Rollin'\" by Johnny Burnette and the Rock 'n' Roll Trio, and how a rockabilly trio from Memphis connect a novelty cowboy song by Ella Fitzgerald to Motorhead and Aerosmith. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Jump, Jive, an' Wail\", by Louis Prima.\n\n\n\nResources\n\nFor biographical information on the Burnettes, I've mostly used Billy Burnette's self-published autobiography, Craxy Like Me. It's a flawed source, but the only other book on Johnny Burnette I've been able to find is in Spanish, and while I go to great lengths to make this podcast accurate I do have limits, and learning Spanish for a single episode is one of them.\n\nThe details about the Burnettes' relationship with Elvis Presley come from Last Train To Memphis by Peter Guralnick.\n\nBefore Elvis by Larry Birnbaum has a chapter on \"Train Kept A-Rollin'\", and its antecedents in earlier blues material, that goes into far more detail than I could here, but which was an invaluable reference.\n\nAnd this three-CD set contains almost everything Johnny Burnette released up to 1962.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nThere are some records that have had such an effect on the history of rock music that the record itself becomes almost divorced from its context. Who made it, and how, doesn't seem to matter as much as that it did exist, and that it reverberated down the generations. Today, we're going to look at one of those records, and at how a novelty song about cowboys written for an Abbot and Costello film became a heavy metal anthem performed by every group that ever played a distorted riff.\n\nThere's a tradition in rock and roll music of brothers who fight constantly making great music together, and we'll see plenty of them as we go through the next few decades -- the Everly Brothers, Ray and Dave Davies, the Beach Boys... rock and roll would be very different without sibling rivalry. But few pairs of brothers have fought as violently and as often as Johnny and Dorsey Burnette. The first time Roy Orbison met them, he was standing in a Memphis radio station, chatting with Elvis Presley, and waiting for a lift. When the lift doors opened, inside the lift were the Burnette brothers, in the middle of a fist-fight.\n\nWhen Dorsey was about eight years old and Johnny six, their mother bought them both guitars. By the end of the day, both guitars had been broken -- over each other's heads.\n\nAnd their fights were not just the minor fights one might expect from young men, but serious business. Both of them were trained boxers, and in Dorsey Burnette's case he was a professional who became Golden Gloves champion of the South in 1950, and had once fought Sonny Liston. A fight between the Burnette brothers was a real fight.\n\nThey'd grown up around Lauderdale Court, the same apartment block where Elvis Presley spent his teenage years, and they used to hang around together and sing with a gang of teenage boys that included Bill Black's brother Johnny. Elvis would, as a teenager, hang around on the outskirts of their little group, singing along with them, but not really part of the group -- the Burnette brothers were as likely to bully him as they were to encourage him to be part of the gang, and while they became friendly later on, Elvis was always more of a friend-of-friends than he was an actual friend of theirs, even when he was a colleague of Dorsey's at Crown Electric. He was a little bit younger than them, and not the most sociable of people, and more importantly he didn't like their aggression – Elvis would jokingly refer to them as the Daltons, after the outlaw gang,\nAnother colleague at Crown Electric was a man named Paul Burlison, who also boxed, and had been introduced to Dorsey by L",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-four of A History of Rock Music in Five Hundred Songs looks at \"Train Kept A-Rollin'\" by Johnny Burnette and the Rock 'n' Roll Trio, and how a rockabilly trio from Memphis connect a novelty cowboy song by Ella Fitzgerald to Motorhead and Aerosmith. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Jump, Jive, an' Wail\", by Louis Prima.\n\n\n\nResources\n\nFor biographical information on the Burnettes, I've mostly used Billy Burnette's self-published autobiography, Craxy Like Me. It's a flawed source, but the only other book on Johnny Burnette I've been able to find is in Spanish, and while I go to great lengths to make this podcast accurate I do have limits, and learning Spanish for a single episode is one of them.\n\nThe details about the Burnettes' relationship with Elvis Presley come from Last Train To Memphis by Peter Guralnick.\n\nBefore Elvis by Larry Birnb",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}