{
  "title": "Key learnings from Strata Barcelona 2014",
  "dc:creator": "Louis Dorard",
  "pubDate": "Wed, 03 Dec 2014 15:04:57 +0000",
  "link": "https://www.ownml.co/blog/strata-barcelona-2014",
  "guid": "5206b718e4b0bdc26006bae2:5206b959e4b0bdc26006be4a:547ed463e4b0d77d6ee07f9f",
  "description": "Immediately after PAPIs.io '14 I spent a couple of days at Strata in \nBarcelona. Strata has several tracks and I ended up going mostly to \n“business” sessions, but this synthesis of things I heard at the conference \nwill be of interest to technical people as well. Actually there was one \nbusiness session that had more code in it than another data science session \nI went to!\n\nHere is my selection of key take-away messages, from sessions I attended \n(Strata is a huge conference so this is just a very partial view of it):\n\n    * Make predictions that you can act on\n    * When hitting a performance plateau, use new data — not fancier\n      algorithms\n    * Ensuring your work is reproducible has never been easier — now make\n      it your habit\n    * Getting a business edge with data requires automating decisions",
  "content:encoded": "<p>Immediately after <a href=\"http://www.papis.io/2014\">PAPIs.io '14</a> — write-up coming soon! — I spent a couple of days at <a href=\"http://strataconf.com/strataeu2014/\">Strata</a> in Barcelona.\nStrata has several tracks and I ended up going mostly to “business” sessions, but this synthesis of things I heard at the conference will be of interest to technical people as well. Actually there was one business session that had more code in it than another data science session I went to!</p>\n\n<p>Here is my selection of key take-away messages, from sessions I attended (Strata is a huge conference so this is just a <em>very</em> partial view of it). Click the links to go directly to the ones you're interested in:</p>\n\n<ul>\n<li><a href=\"#vince-darley\">Make predictions that you can act on</a></li>\n<li><a href=\"#foster-provost\">When hitting a performance plateau, use new data — not fancier algorithms</a></li>\n<li><a href=\"#jeroen-janssens\">Ensuring your work is reproducible has never been easier — now make it your habit</a></li>\n<li><a href=\"#uwe-weiss\">Getting a business edge with data requires automating decisions</a></li>\n</ul>\n\n<p><a data-preserve-html-node=\"true\" name=\"vince-darley\"></a></p>\n\n<h2 id=\"makepredictionsthatyoucanacton\">Make predictions that you can act on</h2>\n\n<h4 id=\"vincedarleybigdataatkinghttpstrataconfcomstrataeu2014publicscheduledetail39232\"><em>Vince Darley: <a href=\"http://strataconf.com/strataeu2014/public/schedule/detail/39232\">Big Data at King</a></em></h4>\n\n<p>Making predictions about customers (e.g. engagement, churn) is useful, but keep in mind that an action has to follow from this prediction… </p>\n\n<ul>\n<li>You could use a descriptive model that tells you why this prediction was made, i.e. which combination of factors results in predicted churn, etc., which will help you choose the right action (e.g. \"the customer might churn because of <em>this</em> so we should address this particular point\").</li>\n<li>You could directly predict an action to take, based on data you’ve collected about the success of different actions in different contexts.</li>\n</ul>\n\n<p><a data-preserve-html-node=\"true\" name=\"foster-provost\"></a></p>\n\n<h2 id=\"whenhittingaperformanceplateauusenewdatanotfancieralgorithms\">When hitting a performance plateau, use new data — not fancier algorithms</h2>\n\n<h4 id=\"fosterprovostdiggingintopredictiveanalyticswithfinegrainedbehaviordatahttpstrataconfcomstrataeu2014publicscheduledetail38069\"><em>Foster Provost: <a href=\"http://strataconf.com/strataeu2014/public/schedule/detail/38069\">Digging into Predictive Analytics with Fine-grained Behavior Data</a></em></h4>\n\n<p>When you’re hitting a performance plateau with your predictive model, it probably means that you’ve extracted all the information there was to extract from the (limited) data you had. There’s no need to try ever fancier algorithms, but what you should do is work on the data itself. Foster Provost talks of looking for “massive fine-grained data”. I didn't know this terminology. I would just say to make a new pass on feature engineering (i.e. finding all the things we could measure that could have an impact on the outcome we want to predict). Here are some examples he gave of data to take into account:</p>\n\n<ul>\n<li>locations frequented</li>\n<li>things liked on facebook</li>\n<li>people connected to</li>\n<li>words, phrases in text</li>\n<li>mobile analytics</li>\n<li>inferred personal traits</li>\n<li>document classes</li>\n</ul>\n\n<p><a data-preserve-html-node=\"true\" name=\"jeroen-janssens\"></a></p>\n\n<h2 id=\"ensuringyourworkisreproduciblehasneverbeeneasiernowmakeityourhabit\">Ensuring your work is reproducible has never been easier — Now make it your habit</h2>\n\n<h4 id=\"jeroenjanssensjeroenhjanssenshttpstwittercomjeroenhjanssensdatasciencetoolboxandtheimportanceofreproducibleresearchhttpstrataconfcomstrataeu2014publicscheduledetail37320\"><em>Jeroen Janssens (<a href=\"https://twitter.com/jeroenhjanssens\">@jeroenhjanssens</a>): <a href=\"http://strataconf.com/strataeu2014/public/schedule/detail/37320\">Data Science Toolbox and the Importance of Reproducible Research</a></em></h4>\n\n<h3 id=\"virtualmachine\">Virtual Machine</h3>\n\n<p>The take-away message here is that you should always work off of a Virtual Machine which is created from a common base (e.g. Ubuntu 14.04) and a set of instructions that is contained in a configuration file (this can be through <a href=\"http://vagrantup.com\">Vagrant</a> or <a href=\"https://www.docker.com\">Docker</a> coupled with a provisioning tool such as <a href=\"http://www.ansible.com/home\">Ansible</a>). This config file should be added to your version control system and should be “in sync” with your code: if you make changes to the VM config, it should recreate the VM from scratch and you should make sure your code still runs.</p>\n\n<p>Jeroen created a base VM called the <a href=\"http://datasciencetoolbox.org\">Data Science Toolbox</a>, which contains most of what you'll need for Data Science (<a href=\"http://datascienceatthecommandline.com\">at the command line</a>). If you need extra things to install, it’s just a change in the config file. The provisioning instructions of the DST are <a href=\"http://github.com/DataScienceToolbox/data-science-toolbox\">open source</a>.</p>\n\n<h3 id=\"drakemakefordata\">Drake: Make for data</h3>\n\n<p>For Data Science, you also want to be careful when using spreadsheet programs for data transformation. While I personally recommend using Excel (up to a certain point — <a href=\"http://randyzwitch.com/excel-destroys-data/\">open but don't save</a>), if you need to transform your data you should do it with scripts and keep a copy of the original data file. You’ll probably need to reproduce your data transformations when you get more data or fresher data. Have a look at <a href=\"https://github.com/Factual/drake\">Drake</a> to make it easier to do so.</p>\n\n<h3 id=\"notebooks\">Notebooks</h3>\n\n<p>Notebooks are a great way to document how to reproduce your analyses as you’re able to explain in a web page all the steps you’ve taken to go from pre-requirements to final result, with embedded, runnable blocks of code for each step. This is popular in the Python community with <a href=\"http://ipython.org/notebook.html\">IPython notebooks</a> but the <a href=\"http://jupyter.org\">Jupyter project</a> extends it to other languages.</p>\n\n<p><a data-preserve-html-node=\"true\" name=\"uwe-weiss\"></a></p>\n\n<h2 id=\"gettingabusinessedgewithdatarequiresautomatingdecisions\">Getting a business edge with data requires automating decisions</h2>\n\n<h4 id=\"uweweissweissuhttpstwittercomweissuwhydecisionautomationiskeyinbigdataanalysishttpstrataconfcomstrataeu2014publicscheduledetail37468\"><em>Uwe Weiss (<a href=\"https://twitter.com/WeissU\">@WeissU</a>): <a href=\"http://strataconf.com/strataeu2014/public/schedule/detail/37468\">Why decision automation is key in big data analysis</a></em></h4>\n\n<p>Decision making is very challenging for humans, for several reasons:</p>\n\n<ul>\n<li>situations are complex (many things to take into account)</li>\n<li>decisions must be made frequently</li>\n<li>we humans have natural biases which make us take irrational/bad decisions (see Daniel Kahneman's <a href=\"http://www.amazon.com/Thinking-Fast-Slow-Daniel-Kahneman/dp/0374533555\">Thinking Fast and Slow</a>)</li>\n</ul>\n\n<p>Using data can help us make more informed decisions and remove some of the bias. But Uwe’s practical experience points out to communication issues:</p>\n\n<ul>\n<li>metrics dashboards are contradictory and confusing</li>\n<li>monthly reports are ignored after two iterations</li>\n<li>in-house analyst teams are overworked and powerless</li>\n</ul>\n\n<p>Another part of the solution to improve decision making process is to write business rules. But they’re still going to be followed by a human — with the limitations it implies. Business rules are like computer programs, written by non programmers. So how about having them written by a programmer? Better yet: how about having the rules figured out (and written) by a machine, after an analysis of all the data that’s available (i.e. with machine learning)? This data is always much more than a human can process, and often times a small change in one of the things we measure about a given situation can have an important impact on the outcome we observe.</p>\n\n<p>Predictive modelling can be used to extract relationships between situations and outcomes, from historical data. In businesses that sell perishable goods, it is of interest to predict demand based on the current context. You can then decide how much to have in stock accordingly. If you don’t have enough then you’re losing business; if you have too much then you’ve wasted money. The ideal decision-making process is as follows (completely automated): the machine collects and stores data, it analyzes it to create a predictive model, it uses the model to make predictions, and it makes a decision based on predictions.</p>\n\n<h2 id=\"others\">Others</h2>\n\n<h3 id=\"googledocscanworkasafrontendtoyourdatawarehouse\">Google Docs can work as a front-end to your data warehouse</h3>\n\n<p>Seeking Alpha have done it and they've <a href=\"http://strataconf.com/strataeu2014/public/schedule/detail/37121\">showed us how</a>. Google Docs are easily accessible (web, tablet, smartphone), shareable, and they can be used by everyone up to C-level execs. They take care of a lot of the IT and front-end work in making it possible to show your company’s latest data internally to as many people as possible.</p>\n\n<h3 id=\"abtestingdoesnotworkinsocial\">A/B testing does not work in social</h3>\n\n<p>In many cases where you need to test in the real world how good your predictive models are doing, A/B testing does the job, but not when you’re testing features with social components (e.g. for games): what if 2 friends are in different segments? I’d never come across that problem and I’m not sure what to do in that situation but it’s worth mentioning and thinking about… </p>\n\n<h2 id=\"wouldirecommendstrata\">Would I recommend Strata?</h2>\n\n<p>This was my first Strata conference and it's certainly what I'd call a commercial conference (in my own \"commercial\" vs \"industry community\" vs \"academic\" conference classification). For $1000 it’s not exactly small business-friendly… (I was very lucky to get a free pass) It also feels like you get sold a lot of things and some talks are thinly-veiled sales pitches for the technology they're presenting. But you still get to hear very interesting things and stories (as shown in this post I hope!) and it's a place where <em>many</em> people in the data community come and meet (I was told the audience is around 1500 people).</p>\n\n<p>If you're a big company, Strata will surely be something you'll want to attend. I wish there were a similar event that would be more suited to small businesses...</p>\n<iframe scrolling=\"yes\" src=\"https://dl.dropboxusercontent.com/u/685335/optin.html\" allowtransparency=\"true\" width=\"100%\" frameborder=\"0\" id=\"mailchimp\" height=\"400px\"></iframe>\n\n<p>Enjoyed this article? <a href=\"http://www.twitter.com/louisdorard\">Follow me!</a></p>",
  "media:content": {
    "media:title": "Key learnings from Strata Barcelona 2014"
  }
}