{
  "title": "Using Data Science to Advance Educational Tools for Young Children: Fifth Annual Data Science Bowl Announces Winners; Thousands Participated in Worldwide Competition",
  "link": "https://datasciencebowl.com/using-data-science-to-advance-educational-tools-for-young-children-fifth-annual-data-science-bowl-announces-winners-thousands-participated-in-worldwide-competition/",
  "dc:creator": "admin",
  "pubDate": "Thu, 09 Apr 2020 19:52:47 +0000",
  "category": "Press Releases",
  "guid": "https://datasciencebowl.com/?p=5917",
  "description": "<p>COMPETITION HOSTED BY BOOZ ALLEN HAMILTON AND KAGGLE, WITH PARTNER PBS KIDS, YIELDS 75,000 MODELS DESIGNED TO HELP BUILD BETTER DIGITAL EDUCATIONAL GAMES AND LEARNING TECHNOLOGIES April 09, 2020 McLean, Va. – Booz Allen Hamilton (NYSE: BAH) and Kaggle, in partnership with PBS KIDS, today announced the winners of the 2019 Data Science Bowl® which [...]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/using-data-science-to-advance-educational-tools-for-young-children-fifth-annual-data-science-bowl-announces-winners-thousands-participated-in-worldwide-competition/\">Using Data Science to Advance Educational Tools for Young Children: Fifth Annual Data Science Bowl Announces Winners; Thousands Participated in Worldwide Competition</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n",
  "content:encoded": "<p style=\"text-align: center;\">COMPETITION HOSTED BY BOOZ ALLEN HAMILTON AND KAGGLE, WITH PARTNER PBS KIDS, YIELDS 75,000 MODELS DESIGNED TO HELP BUILD BETTER DIGITAL EDUCATIONAL GAMES AND LEARNING TECHNOLOGIES</p>\n<p>April 09, 2020</p>\n<p><b>McLean, Va.</b> – <a href=\"http://www.boozallen.com/\">Booz Allen Hamilton</a> (NYSE: BAH) and <a href=\"http://www.kaggle.com/\">Kaggle</a>, in partnership with <a href=\"https://pbskids.org/\">PBS KIDS</a>, today announced the winners of the 2019 Data Science Bowl<sup>®</sup> which challenged participants to use artificial intelligence (AI) to advance innovation in educational media for young children. Over the course of 90 days, thousands of data scientists used AI to create algorithms to analyze anonymous game-play data from <a href=\"https://pbskids.org/apps/pbs-kids-measure-up.html\" target=\"_blank\" rel=\"noopener noreferrer\">PBS KIDS Measure Up!</a>, a free game-based learning app. The winners’ algorithms most effectively analyzed data about how children use the app to predict users’ performance on in-game math assessments. The submissions will help to improve the technology behind these educational games, as measuring performance is a key step towards providing experiences that are tailored to the needs of individual users.</p>\n<p>Research shows much of the most critical brain development in children takes place <a href=\"http://www.aft.org/sites/default/files/periodicals/TheEarlyCatastrophe.pdf\">before they reach kindergarten</a>. Access to effective early learning resources is critical, and research demonstrates that high-quality educational media can help support young learners. The learnings from the fifth annual Data Science Bowl will chart a path for the greater application of AI to digital education tools and help PBS KIDS and others to create new content and solutions that ensure every child is learning the important skills these tools aim to teach. Insights gleaned from these algorithms also have implications that will help improve digital media and technology to support young children’s learning. From future adaptive and personalized educational games, to potential classroom applications, these approaches are stepping stones that can lead to innovation in early childhood learning.</p>\n<p>“Since launching the Data Science Bowl in 2014, our mission has always been to enable and inspire people to use data science for good,” said <a href=\"https://www.boozallen.com/e/bio/leadership/joshua-sullivan.html\">Dr. Josh Sullivan</a>, executive vice president and leader of Booz Allen Hamilton’s Analytics and AI business. “We believe that, with the right talent, tools, and knowledge, collective ingenuity can change the world for the better. This year’s competition demonstrates the power and profound impact data science and AI can have on early childhood education. Algorithms developed in this competition can help design new technologies and tools to provide the best learning experience that will ultimately help young kids thrive in school and life.”</p>\n<p>The Data Science Bowl brings together data scientists, technologists, and domain experts across industries to take on the world’s challenges with data and technology. It’s a platform through which individuals can harness their passion for social good, unleash their curiosity, and amplify their impact to effect change on a global scale. The 2019 competition brought together over 4,400 participants who submitted more than 75,000 entries—the highest number of submissions since the inaugural Data Science Bowl launched in 2014. Participants this year collectively dedicated an estimated 280,000 hours developing the algorithms.</p>\n<p>“PBS KIDS provides free access to media content that is proven to help children learn. A key piece of information when trying to measure learning gains from technology is being able to identify what players are and are not yet capable of,” said Jeremy Roberts, Senior Director of Learning Technologies, PBS KIDS Digital. “The approaches from this year’s Data Science Bowl will help us build more effective educational games to make available to all kids, so that they can learn important skills. We couldn’t be more thrilled with the exciting world of possibilities that have opened up to us though the collaboration with Booz Allen Hamilton, Kaggle and this year’s participants.”</p>\n<p><a href=\"https://pbskids.org/apps/pbs-kids-measure-up.html\" target=\"_blank\" rel=\"noopener noreferrer\">PBS KIDS Measure Up!</a> was developed as a part of the Ready To Learn Initiative, funded by the U.S. Department of Education, which supports the development of innovative early childhood learning efforts of the Corporation for Public Broadcasting (CPB) and PBS KIDS.</p>\n<p>The top teams from the 2019 Data Science Bowl winners all tackled the Data Science Bowl for the first time this year with impressive results:</p>\n<p>&nbsp;</p>\n<ul>\n<li><b>1</b><sup><b>st</b></sup><b> Place: Team zr & oyx<br />\n</b>The first place team, Zhuoran Ma and Xuan Ouyang, began competing in data science competitions three years ago. This is their first time winning a competition and their first year participating in the Data Science Bowl. The team said of the competition, “We believe that data science can make meaningful contributions to help improve children’s learning through educational gameplay and we wanted to use our skills to help.”</li>\n<li><b>2</b><sup><b>nd</b></sup><b> Place: Team Fuson<br />\n</b><b> </b>Team Fuson—Yuki Abe, Kosuke Shingyouchi, and Toshiki Ishikawa—includes two university students and a software engineer, each with varying degrees of familiarity with data science. This diversity was key to their success: “We learned from each other and by studying the public kernels and discussion boards during the competition,” Team Fuson said.</li>\n<li><b>3</b><sup><b>rd</b></sup><b> Place: Team Limerobot<br />\n</b>Sanghoon Kim, a data scientist working for an online retailer, started competing in Kaggle competitions last year. Also a newcomer to the Data Science Bowl, Kim joined the competition with about a month before closing, using deep neural networks to help solve this year’s challenge.</li>\n</ul>\n<p>The top five winning teams will split $160,000 in cash prizes. The three teams with the best score comprised entirely of actively registered university students (Fall/Winter 2019/2020 enrollees) was awarded a separate $8,500 University prize by Booz Allen. Over 150 students participated in the 2019 Data Science Bowl.</p>\n<p>“Over five years, the Data Science Bowl has drawn tens of thousands of data scientists, technologists, and other experts, which is simply astounding,” said <a href=\"https://www.kaggle.com/antgoldbloom\">Anthony Goldbloom</a>, CEO, Kaggle. “We continue to be inspired by the wealth of knowledge and diverse backgrounds of participants from around the world, who donate their spare time and skills to affect positive change in areas from early cancer detection to childhood education.”</p>\n<p>Over the last five competitions, more than 54,000 Data Science Bowl teams have developed and submitted over 189,000 AI models aimed at improving everything from the detection of <a href=\"https://www.boozallen.com/e/media/press-release/nearly-10-000-global-problem-solvers-yield-winning-formulas-to-i.html\">lung cancer</a> and <a href=\"https://www.businesswire.com/news/home/20151214005646/en/Annual-Data-Science-Bowl-Crowd-Sources-Solutions-Transform\">heart disease</a> to monitoring <a href=\"https://www.boozallen.com/e/media/press-release/booz-allen-kaggle-announce-winner-of-the-data-science-bowl.html\">ocean health</a> and <a href=\"https://www.boozallen.com/e/media/press-release/2018-data-science-bowl-results.html\" target=\"_blank\" rel=\"noopener noreferrer\">helping accelerate life-saving medical research</a>.</p>\n<p>For more information about past Data Science Bowl competitions, visit <a href=\"https://datasciencebowl.com/about/competitions/\" target=\"_blank\" rel=\"noopener noreferrer\">DataScienceBowl.com/Competitions</a>.</p>\n<p><i>The contents of the PBS KIDS Measure Up! app were developed under a grant from the Department of Education. However, those contents do not necessarily represent the policy of the Department of Education, and you should not assume endorsement by the Federal Government. The app is funded by a Ready To Learn grant (PR/AWARD No. U295A150003, CFDA No. 84.295A) provided by the Department of Education to the Corporation for Public Broadcasting.</i></p>\n<p style=\"text-align: center;\">###</p>\n<p><b>About Booz Allen Hamilton</b><b> </b></p>\n<p>For more than 100 years, business, government, and military leaders have turned to Booz Allen Hamilton to solve their most complex problems. As a consulting firm with experts in analytics, digital, engineering and cyber, we help organizations transform. We are a key partner on some of the most innovative programs for governments worldwide and trusted by the most sensitive agencies. We work shoulder to shoulder with clients, using a mission-first approach to choose the right strategy and technology to help them realize their vision. With global headquarters in McLean, Virginia, our firm employs nearly 27,000 people globally, and had revenue of $6.70 billion for the 12 months ended March 31, 2019. To learn more, visit <a href=\"http://www.boozallen.com/\">www.boozallen.com</a>. (NYSE: BAH)</p>\n<p><b>About Kaggle </b></p>\n<p>Kaggle is the world’s largest online data science competition community. With more than 4 million+ members across 194 countries, the Kaggle community uses its diverse set of academic backgrounds to solve complex data science problems. Working as individuals or in teams, the winning competitors are awarded prizes and industry recognition for their accomplishments.</p>\n<p><b>About PBS KIDS</b></p>\n<p>PBS KIDS, the number one educational media brand for kids, offers children ages 2-8 the opportunity to explore new ideas and new worlds through television, digital media, and community-based programs. PBS KIDS and local stations across the country support the entire ecosystem in which children learn, including their teachers, parents and community. Provided by stations, the free PBS KIDS 24/7 channel and live stream is available to more than 95% of U.S. TV households. Kidscreen- and Webby Award-winning <a href=\"http://www.pbskids.org/\">pbskids.org</a> provides engaging interactive content, including digital games and streaming video. PBS KIDS offers mobile apps to help support young children’s learning, including the PBS KIDS Video app, which is available on a variety of mobile devices and on platforms such as Roku, Apple TV, Amazon Fire TV, Android TV, Samsung TV and Chromecast. PBS KIDS also offers parent and teacher resources to support children’s learning anytime and anywhere. For more information on PBS KIDS content and initiatives supporting school readiness and more, visit <a href=\"http://pbs.org/pressroom\">pbs.org/pressroom</a>, or follow PBS KIDS on <a href=\"http://twitter.com/pbskids\">Twitter</a>, <a href=\"https://www.facebook.com/CorporationForPublicBroadcasting\">Facebook</a> , and <a href=\"https://www.instagram.com/pbskids\">Instagram</a>.</p>\n<p><b>About the Corporation for Public Broadcasting</b></p>\n<p>The Corporation for Public Broadcasting (CPB), a private, nonprofit corporation created by Congress in 1967, is the steward of the federal government’s investment in public broadcasting. It helps support the operations of nearly 1,500 locally owned and operated public television and radio stations nationwide. CPB is also the largest single source of funding for research, technology and program development for public radio, television and related online services. For more information, visit <a href=\"http://www.cpb.org/\">www.cpb.org</a> and follow us on Twitter<a href=\"https://twitter.com/CPBmedia\">@CPBmedia</a>, <a href=\"https://www.linkedin.com/company/corporation-for-public-broadcasting\">LinkedIn</a>, and <a href=\"https://www.facebook.com/CorporationForPublicBroadcasting\">Facebook</a>, and <a href=\"http://www.cpb.org/subscribe\">subscribe</a> for email updates.</p>\n<p><b>About The Ready To Learn Initiative</b></p>\n<p>The Ready To Learn Initiative is a cooperative agreement funded and managed by the U.S. Department of Education’s Office of Elementary and Secondary Education (OESE). It supports the development of innovative educational television and digital media targeted to preschool and early elementary school children and their families. Its general goal is to promote early learning and school readiness, with a particular interest in reaching low-income children. In addition to creating television and other media products, the program supports activities intended to promote national distribution of the programming, effective educational uses of the programming, community-based outreach and research on educational effectiveness.</p>\n<p>BAHPR-CO</p>\n<p><b>Contacts</b></p>\n<p>Media Relations – Joseph Campbell, <a href=\"mailto:campbell_joseph@bah.com\">campbell_joseph@bah.com</a>, 703-377-4422</p>\n<p><i>The contents of the PBS KIDS Measure Up! app were developed under a grant from the Department of Education. However, those contents do not necessarily represent the policy of the Department of Education, and you should not assume endorsement by the Federal Government. The app is funded by a Ready To Learn grant (PR/AWARD No. U295A150003, CFDA No. 84.295A) provided by the Department of Education to the Corporation for Public Broadcasting.</i></p>\n<p>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencebowl.com/using-data-science-to-advance-educational-tools-for-young-children-fifth-annual-data-science-bowl-announces-winners-thousands-participated-in-worldwide-competition/\">Using Data Science to Advance Educational Tools for Young Children: Fifth Annual Data Science Bowl Announces Winners; Thousands Participated in Worldwide Competition</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencebowl.com\">The Data Science Bowl</a>.</p>\n"
}