{
  "title": "Semantic Segmentation for Point Cloud Scenes via Dilated Graph Feature Aggregation and Pyramid Decoders. (arXiv:2204.04944v3 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2204.04944",
  "description": "<p>Semantic segmentation of point clouds generates comprehensive understanding\nof scenes through densely predicting the category for each point. Due to the\nunicity of receptive field, semantic segmentation of point clouds remains\nchallenging for the expression of multi-receptive field features, which brings\nabout the misclassification of instances with similar spatial structures. In\nthis paper, we propose a graph convolutional network DGFA-Net rooted in dilated\ngraph feature aggregation (DGFA), guided by multi-basis aggregation loss\n(MALoss) calculated through Pyramid Decoders. To configure multi-receptive\nfield features, DGFA which takes the proposed dilated graph convolution\n(DGConv) as its basic building block, is designed to aggregate multi-scale\nfeature representation by capturing dilated graphs with various receptive\nregions. By simultaneously considering penalizing the receptive field\ninformation with point sets of different resolutions as calculation bases, we\nintroduce Pyramid Decoders driven by MALoss for the diversity of receptive\nfield bases. Combining these two aspects, DGFA-Net significantly improves the\nsegmentation performance of instances with similar spatial structures.\nExperiments on S3DIS, ShapeNetPart and Toronto-3D show that DGFA-Net\noutperforms the baseline approach, achieving a new state-of-the-art\nsegmentation performance.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Mao_Y/0/1/0/all/0/1\">Yongqiang Mao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sun_X/0/1/0/all/0/1\">Xian Sun</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chen_K/0/1/0/all/0/1\">Kaiqiang Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Diao_W/0/1/0/all/0/1\">Wenhui Diao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Guo_Z/0/1/0/all/0/1\">Zonghao Guo</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lu_X/0/1/0/all/0/1\">Xiaonan Lu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Fu_K/0/1/0/all/0/1\">Kun Fu</a>"
}