{
  "title": "Open-Endedness 2: Bitwise Chemicals",
  "description": "<p>When algae is in the pond, a fish will come to eat it. When fish are in the pond, birds will come to catch them. This is an example of <strong>peer dependency</strong>: a species’ survival depends greatly on the presence of other species.</p><p>Peer dependency is one of the key</p>",
  "link": "https://kvfrans.com/open-endedness-2-bitwise-chemicals/",
  "guid": "60225e9617e26d47c77e8ecd",
  "category": "research",
  "dc:creator": "Kevin Frans",
  "pubDate": "Thu, 22 Oct 2020 06:01:00 GMT",
  "content:encoded": "<p>When algae is in the pond, a fish will come to eat it. When fish are in the pond, birds will come to catch them. This is an example of <strong>peer dependency</strong>: a species’ survival depends greatly on the presence of other species.</p><p>Peer dependency is one of the key principles of open-endedness, which asks, <em>How we can build a world where innovation never ends?</em> Open-ended worlds follow three core principles.</p><ul><li><strong>Possibility Space:</strong> A world consists of a set of organisms. The space of possible organisms must be arbitrarily large.</li><li><strong>Peer Dependency:</strong> When new organisms appear, an environment must develop new niches.</li><li><strong>Search Algorithm:</strong> A procedure must find new organisms to fit new niches.</li></ul><p>Out of these three, peer dependency is the trickiest. In living ecosystems, animals may create byproducts or serve as food, allowing new species to emerge. For example, tall trees created a niche for long-neck giraffes. Due to the complexity of physical interactions, however, it’s hard to model this cleanly.</p><p>Instead, a clean example of peer dependency is found in the realm of chemistry. In chemical systems, some reactions may create byproducts, which will be used by other reactions. By treating each reaction as a species, let’s get a look at how peer dependency affects how new species will emerge.</p><h2 id=\"bitwise-chemicals\">Bitwise Chemicals</h2><hr><p>In chemistry, simple elements form a complex dependency tree. Reactions take in inputs, but they also create outputs. These outputs can then become inputs to other reactions, leading to a large chain.</p><p>Let’s create a simplified chemical world, and examine the dependency tree that forms.</p><p>First, let’s define a chemical as a series of four bits. This gives us a world with a total of 2^4 = 16 chemicals.</p><pre><code class=\"language-python\">Chemical_00: 0000\nChemical_01: 0001\n...\nChemical_15: 1111</code></pre><p>Now, let’s define a reaction function that will combine two chemicals.</p><pre><code class=\"language-python\">def React(ChemA, ChemB): # 2:0010, 3:0011\n  ChemNew = BitwiseXOR(ChemA, ChemB) # 0010^0011 = 0001\n  ChemNewA = Swap(ChemNew, ChemA) # Swap(0001, 2) = 0010\n  ChemNewB = Swap(ChemNew, ChemB) # Swap(0001, 3) = 0100\n  return ChemNewA, ChemNewB # 2:0010, 4:0100</code></pre><p>This is a simple deterministic function that determines the output of a two-chemical reaction. For example, reacting chemicals 00+01 will always make 05+06.</p><p>You may see where this is going – our world now forms a self-contained reaction system. As chemicals react, they will form new chemicals. These new chemicals can then react with each other, and the process will continue.</p><p>We can view our system as an open-ended world where chemical reactions are the organisms.</p><ul><li><strong>Possibility Space:</strong> The space of all possible chemical reactions.</li><li><strong>Peer Dependency:</strong> As new reactions make byproducts, they create an oppurtunity for new reactions.</li><li><strong>Search Algorithm:</strong> Reactions will randomly occur if their input chemicals are present.</li></ul><p>Let’s take a look at what a typical progression looks like.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/1.mp4\"></video>\n                <figcaption>\n                    We provide chemicals 01 and 04 for free at every timestep.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/2.mp4\"></video>\n                <figcaption>\n                    A reaction appears, combining 01+04 to make 05+06.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/3.mp4\"></video>\n                <figcaption>\n                    Due to the new chemicals, a reaction appears combining 05+06 = 05+09.\n                </figcaption>\n            </div>\n        </div>\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/4.mp4\"></video>\n                <figcaption>\n                    As the chemical count in the world increases, more varieties of reactions appear.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/5.mp4\"></video>\n                <figcaption>\n                    A combination of reactions forms a self-sustaining loop of outputs and inputs.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/6.mp4\"></video>\n                <figcaption>\n                    We reach an stable state, where all outputs are imemdiately consumed as new inputs.\n                </figcaption>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>Starting from only two chemicals, a series of reactions popped up, each building on the outputs of the previous. Eventually, the world reached a stable state, where a set of reactions formed a self-sustaining loop.</p><p>One thing to note is the branching factor of our peer depencency tree. When a new reaction occurs, it will create two new outputs. This creates a niche for only a <em>single</em> new reaction. And if one of the chemicals was already present, we might not get any new niche at all.</p><p>Ideally, a new reaction would create opportunities for many new reactions. One change we can make is to allow reactions to compete for chemicals. Let's define a fixed energy output for every reaction.</p><pre><code class=\"language-python\">def ReactEnergy(ChemA, ChemB):\n  Energy = Hash(ChemA+ChemB)\n  return Energy</code></pre><p>In this setup, reactions can acccess chemicals in order of their energy output. For example, let's say Reaction A and Reaction B both need Chemical 01. Reaction A has an energy output of 0.5, and Reaction B has an energy output of 0.9. Reaction B will get priority over Reaction A, even if Reaction A was around longer.</p><p>If Reaction B stays around long enough, it may use up all of Chemical 01, and Reaction A will die out.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/9.mp4\"></video>\n                <figcaption>\n                    We start with the same first reaction, 01+04 = 05+06. But a reaction with higher energy output also uses chemical 04, so the first reaction dies.\n\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/10.mp4\"></video>\n                <figcaption>\n                    When a reaction dies, other reactions dependent on its output will follow suit. Blue squares represent dead reactions.\n\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/11.mp4\"></video>\n                <figcaption>\n                    Over time, we widely explore the possibility space of reactions.\n\n                </figcaption>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>In the energy-based system, we can see a much wider area of the possibilty space is explored. Once again, the key is in the branching factor of our peer dependency. Now, when a new chemical is added, it allows for a new potential reaction with every other chemical present in the world.</p><p>One theme so far has been self-sustaining circuits. Our first system stopped progressing when it encountered a encountered a loop in the reaction tree, and the outputs matched the inputs.</p><p>In our second system, it became a lot harder to form a stable circuit, because new reactions could undermine older reactions. Once a reaction died, all other dependent reactions would also die, triggering an extinction wave.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 2 1 0%;\">\n                <img class=\"gridimg\" src=\"https://kvfrans.com/static/open/2/7i.png\">\n                <figcaption>\n                    Chemical reactions over time. When key reaction cycles are interrupted, many reactions can run out of inputs and die.\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/10.mp4\"></video>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>Given any system of reactions, there is almost always some kind of reaction that will undermine the system by using up a key chemical. When a system breaks, however, it creates room for new systems to emerge. This cycle allows the world to explore a large portion of the possibile reactions.</p><p>In theory, there should still be a system of reactions that is self-sustaining and unbreakable. For example, a closed loop of high-energy reactions cannot be interrupted. But in practice, it takes a long time to discover such a system.</p><p>Or will it? Let's try a simple change -- increase the mutate rate at which we introduce new reactions.</p><!--kg-card-begin: html--><hr class=\"gridhr\">\n<figure class=\"kg-card kg-gallery-card\">\n    <div class=\"kg-gallery-container\">\n        <div class=\"kg-gallery-row\">\n            <div class=\"kg-gallery-image\" style=\"flex: 2 1 0%;\">\n                <img class=\"gridimg\" src=\"https://kvfrans.com/static/open/2/8i.png\">\n                <figcaption>\n                    Chemical reactions over time, with a high mutation rate. When a certain number of reactions is passed, a self-sustaining network of reactions can form.\n\n                </figcaption>\n            </div>\n            <div class=\"kg-gallery-image\" style=\"flex: 1 1 0%;\">\n                <video class=\"b-lazy b-loaded gridvideo\" type=\"video/mp4\" autoplay muted playsinline loop src=\"https://kvfrans.com/static/open/2/8s.mp4\"></video>\n            </div>\n        </div>\n    </div>\n</figure>\n<hr class=\"gridhr\"><!--kg-card-end: html--><p>Interestingly, when we increase the mutation rate, almost every trial results in a self-sustaining system!</p><p>The crucial component to this system is its redudancy. Instead of simply being a reaction loop, it's a reaction web -- many reactions are all feeding into one another. Even if a few of the reactions were to die out, there are still other sources of chemicals to keep the system going.</p><p>The key cause of these intertwined self-sustaining circuits is the reaction count. It's a simple cycle: the more reactions that are present, the more likely it is that a reaction has a source for its inputs. This makes the reaction more likely to survive, therefore making every other dependent reaction more stable.</p><p>This Bitwise Chemical project was an easy way to create a peer-dependent world. With a simple search algorithm, we follow the chain of dependencies as new reactions appear. The population of species sometimes resembled a wave, where some species would go extinct while new species would rise, or would resemble a stable web, where many species supported each other.</p><p>The major limitation to open-endedness here is the possiblity space of reactions, which is very small (256). In real chemical systems, open-endedness arises because elements can form complex molecules, which can do a whole bunch of functions and interact with one another.</p><p>Further work can involve:</p><ul><li>How can peer dependency increase in complexity while still being interesting? E.g. if we increase chemical count to 100, we would have way more reactions, but they would all qualitatively look the same.</li><li>What types of peer-dependency lead to stable systems? What kinds lead to unstable oscillations?</li></ul><!--kg-card-begin: html--><hr class=\"gridhr\">\n<br>\n<div class=\"float-outside\">\n<div class=\"appendix\">\n    <div class=\"float-label\">\n        Things to Read\n    </div><!--kg-card-end: html--><p><br><strong><a href=\"https://www.amazon.com/At-Home-Universe-Self-Organization-Complexity/dp/0195111303\">\"At Home in the Universe\"</a>, by Stuart Kauffman</strong>. This book argues that life on Earth was inevitable, since every sufficiently complex system will self-organize. One argument he makes is that any complex chemical system will eventually develop a self-replicating compound. Our third experiment draws parallels to this, since we easily discover a self-sustaining circuit that grows indefinitely.</p><p><strong><a href=\"https://medium.com/@SeloSlav/what-is-the-adjacent-possible-17680e4d1198\">\"What is the Adjacent Possible\"</a>, by Martin Erlic</strong>. This term, adjacent possible, provides a nice framework for looking at emergent design. Ideas don't just form out of nowhere -- they are made possible because of current ideas. By following a path of adjacent possibilities, we can see the development of a world. For a design to exist, not only does it need to fulfill a minimum criteria for survival, it also needs to be discoverable by being on a branch of the \"possibility tree\".</p><!--kg-card-begin: html--></div><!--kg-card-end: html--></div>"
}