{
  "title": "173: The Beatrice Six: Keith Morrison Investigates",
  "link": "https://audioboom.com/posts/7823113",
  "itunes:episode": 173,
  "itunes:title": "The Beatrice Six: Keith Morrison Investigates",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4052,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>1 murder. 6 convictions. But did any of them do it?</div>\n<div> </div>\n<div>Sometime after midnight on February 6, 1985, 68-year-old Helen Wilson was raped and brutally murdered in her small apartment in downtown Beatrice, Nebraska. In an era before DNA testing, all investigators had to go on was the fact that the killer had a very rare genetic marker in his blood type. But there were no other viable clues. But four years after the crime, arrests started being made, one after another—six in total. And though they all claimed to have had nothing to do with the crime—and none of them had the rare genetic marker—they were all convicted. But when DNA evidence eventually exonerates them, the real killer is found out. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 16 Mar 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-03-15:/posts/7823113",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}