{
  "title": "EPISODE 59: Fear and Loathing in Mongolia (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sun, 05 Apr 2020 21:02:52 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2020/4/5/episode-59-fear-and-loathing-in-mongolia-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5e8a45403d751119c537f94a",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1586120119914-QGSNUVO45SV1A7V474B2/HOF-59-FearAndLoathingInMongolio-Pt01+%281%29.JPG\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-59-FearAndLoathingInMongolio-Pt01 (1).JPG\" data-load=\"false\" data-image-id=\"5e8a45b6bdeecc11b781b6f2\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1586120119914-QGSNUVO45SV1A7V474B2/HOF-59-FearAndLoathingInMongolio-Pt01+%281%29.JPG?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“My name is surrounded with such hate and fear that no one can judge what is the truth and what is false, what is history, and what is myth.”</em> — Roman von Ungern-Sternberg</p><p class=\"\"><em>“Ungern had fused with the war, and equally, the war, in turn, had fused with him.”</em> — Willard Sunderland</p><p class=\"\">A recurring thread in History on Fire episodes is my soft spot for individuals who are mildly mentally deranged, but have something lovable about them. Today, thaqt thread doesn’t quite apply. The subject of our story gets an A+ in mental derangement (nothing mild about that), but is severely lacking in the lovable department. The man is a fascinating character—no doubt. But fascinating in the way Vlad the Impaler or Darth Vader or Walter White are. This series is a tale of insanity and bloodshed. It’s the story of a monster consumed by his love of warfare, a defender of monarchy in an age of revolutions, a bloodthirsty killer who took delight in persecuting Russian Jews, a soldier in both WW I and the Russian Civil War, an independent warlord who ended up riding at the head a multi-ethnic horde and conquered Mongolia. He is Baron Roman Nikolaus Maximillian Freiherr von Ungern-Sternberg, better known as the Bloody White Baron. In this episode, we will follow his life from his troubled childhood until the early days of the Russian Civil War.&nbsp;</p>",
  "media:content": {
    "media:title": "EPISODE 59: Fear and Loathing in Mongolia (Part 1)"
  }
}