{
  "title": "580: Sorting Too Soon (Sorcerer's Stone, Chapters 7 - 8)",
  "link": "https://audioboom.com/posts/8163918",
  "itunes:episode": 580,
  "itunes:title": "Sorting Too Soon (Sorcerer's Stone, Chapters 7 - 8)",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5590,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode, we are joined by <em>Potter</em> film actor and director Rohan Gotobed! He joins Andrew, Eric, Laura, and Micah as they continue their Chapter-by-Chapter readthrough of Sorcerer's Stone, covering Chapters 7 and 8! Harry is sorted into Gryffindor House, and learns that Snape really hates him!<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome to the show, film and theater actor Rohan Gotobed, who you might recognize from playing Young Sirius Black in DH2!</li>\n<li>Main Discussion #1: Sorcerer's Stone, Chapter 7: The Sorting Hat</li>\n<li>7-Word Summary: Students arrive into the Great Hall nervously</li>\n<li>Is the Sorting Ceremony too much pressure for First Years? Should there be something easier or a private ceremony?</li>\n<li>Why is the hat kept a secret from all students and possibly not even mentioned in <em>Hogwarts, a History</em>? We know Hermione checked...</li>\n<li>Americans struggle with British terms example 4,723, as McGonagall tells the students to 'smarten themselves up.'</li>\n<li>New Segment Alert: The hosts play \"MAX That!\" bringing an element from the chapter to life as a new <em>Harry Potter</em> streaming series</li>\n<li>Harry has a dream that the hosts find to be VERY illuminating.</li>\n<li>Was it right for Seamus' mom to keep her magical secret from his dad?</li>\n<li>Rohan pays tribute to all of Harry's peers who made it to the Sorting Ceremony but were never seen again...</li>\n<li>Main Discussion #2: Sorcerer's Stone, Chapter 8: The Potions Master</li>\n<li>7-Word Summary: Eagerly Harry begins classes with angry teacher </li>\n<li>What were our first impressions of McGonagall, Sprout, Flitwick and Snape?</li>\n<li>New Segment: Mini Origin, where we dive into the name Quirinus and Quirrell in an effort to understand him better.</li>\n<li>Snape speaks of potions very romantically, but is he overcompensating for the lost romance of Harry's mom?</li>\n<li>The ability to spot exactly where a potion went wrong is impressive, but Snape should not be teaching students.</li>\n<li>Harry seeks refuge at Hagrid's hut, and the hosts describe their in-school hideout locations.</li>\n<li>The hosts reveal their coveted 'Most Valuable Character/Chapter of the Week' award nominees.</li>\n<li>Next Week: it's our first Muggle Mailbag episode since starting our Chapter-By-Chapter!</li>\n<li>Quizzitch: According to Book 1, if you’re in the Great Hall facing the staff table, from LEFT to RIGHT what is the order in which the houses are seated?</li>\n<li>This week's episode is brought to by <a href=\"https://www.pushkin.fm/podcasts/the-happiness-lab-with-dr-laurie-santos/nerd-out-the-happiness-of-being-a-fan\">The Happiness Lab Project, </a><a href=\"http://Stamps.com\">Stamps.com</a> (<br>\nGet a 4-week trial, free postage, and a digital scale at <a href=\"https://www.stamps.com/MUGGLECAST\">https://www.stamps.com/MUGGLECAST</a>. Thanks to <a href=\"http://Stamps.com\">Stamps.com</a> for sponsoring the show!), and BetterHelp (Get 10% off your first month at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n",
  "pubDate": "Tue, 27 Sep 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-09-26:/posts/8163918",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}