{
  "title": "Facing reality, however painful it may be",
  "link": "https://news.mit.edu/2022/life-hard-setiya-1104",
  "description": "In his new book, “Life Is Hard,” MIT philosopher Kieran Setiya offers guidance for tackling the (many) problems we face.",
  "pubDate": "Fri, 04 Nov 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/life-hard-setiya-1104",
  "dc:creator": "Peter Dizikes | MIT News Office",
  "content:encoded": "<p>Let’s acknowledge it: Life is tough. Most people struggle to make a secure living, stay healthy, and care for family members. On a larger scale, climate change keeps unfolding, Ukraine is under attack, authoritarianism is gaining ground around the world, and a pandemic has disrupted society. How are we supposed to feel good amid all this?</p>\n\n<p></p>\n\n<p>Well, you might not feel good. But you can still live a good life. That is a central message of “Life Is Hard,” a new book by MIT Professor Kieran Setiya, recently published by Riverhead Books. In it, Setiya does not promise solutions for life’s problems themselves. Instead, he works out an approach to grappling with them: Recognizing our problems, reflecting upon them, and committing to help others &nbsp;can make matters seem more manageable.</p>\n\n<p></p>\n\n<p>“A certain kind of realism about the ways life is hard can be grounding and empowering, rather than despairing, and that’s what I would like readers to take from the book,” says Setiya, a professor and philosophy section head in MIT’s Department of Linguistics and Philosophy.</p>\n\n<p></p>\n\n<p>Today, when even a Twitter session can make us feel overwhelmed, Setiya aims to give readers a sense of buoyancy, and, perhaps, a renewed determination to make the world a better place.</p>\n\n<p></p>\n\n<p>“However depressing the weight of doomsurfing and sensing the injustice of the world around us is,” Setiya says, “we are forced to find a balance between trying to do something to combat injustice, while not rejecting as self-pity our own difficulties in life.”</p>\n\n<p></p>\n\n<p><strong>A certain acknowledgement of reality</strong></p>\n\n<p></p>\n\n<p>Setiya’s book is composed of seven main chapters, each dealing with a different issue: pain, loneliness, grief, failure, injustice, absurdity, and hope. (Setiya does not regard hope as a problem per se but suggests we apply it discerningly.) These chapters form a moral arc, bending from the personal to the social: One way to take better care of yourself is to have concern for others.</p>\n\n<p></p>\n\n<p>“Life Is Hard” also emphasizes three overarching ideas. The first is that we should accept that adversity exists. As Setiya puts it, this is a “rejection of the aspiration to an ideal life, and skepticism about the power of positive thinking, of trying to live your best life.” Seeking the perfect will usually prove counterproductive.</p>\n\n<p></p>\n\n<p>“It’s not just that those are pop-culture slogans,” Setiya says. “They have a long history, and go back to Aristotle and ancient Greek philosophy, suggesting that to guide our lives we should begin with a template of the best life you can imagine. I think that’s a problematic way to approach life because we’re almost always in circumstances where we can’t achieve that. A certain acknowledgment of reality is an essential first step to living our lives well.”</p>\n\n<p></p>\n\n<p>A second idea is that being in a state of happiness is not the same thing as living well. We should not seek permanent bliss, but rather stay grounded as happiness comes and goes. As Setiya says, “How you feel is one thing. Whether you’re actually living a good life is another.”</p>\n\n<p></p>\n\n<p>Setiya’s third guiding principle is that focusing too much on our own feelings will undercut our attempts to live well; we should have concern for others.</p>\n\n<p></p>\n\n<p>“Living in the world as it is means not just treating yourself well, but thinking about what you owe to other people,” Setiya says. He adds, “One of the problems with self-help is that it is — not to put too fine point on it — kind of selfish. It’s a focus on just your own life.”</p>\n\n<p></p>\n\n<p><strong>Pain without end — and how to manage it</strong></p>\n\n<p></p>\n\n<p>In “Life Is Hard,” Setiya grapples with texts in philosophy and literature, finds life lessons from baseball, and delves into his own well-being. Setiya has experienced chronic pelvic pain for 18 years, something no doctor has been able to treat. This has led to major sleep problems, among other things.</p>\n\n<p></p>\n\n<p>So: How to live when every day is a litany of pain? For one thing, philosophical reflection has helped Setiya understand the psychological burden of chronic pain, including the feeling it will never end.</p>\n\n<p></p>\n\n<p>“When you think about why chronic pain is bad, a huge part of the difficulty is its temporal shape, the fact that it projects into the future and the past,” Setiya suggests. “If one were just experiencing a series of moments of self-contained pain, it would not be so bad. What makes it so difficult is the way in which the future seems occluded by pain, and you don’t have any sense of your body being pain-free.”</p>\n\n<p></p>\n\n<p>To cope, Setiya says, try breaking down that expanse of time into smaller units.</p>\n\n<p></p>\n\n<p>“You can have a pretty great day while experiencing some degree of pain,” Setiya observes. “And it’s all just one day after another. So, if you can parcel your life out into one-day units, you can diminish the power of pain, and the shadow its casts over the future.”</p>\n\n<p></p>\n\n<p>Beyond that, Setiya writes in the book while discussing “moral theory” in philosophy, pain teaches us “about our relation to others and their relation to us. If anything of value has come from my experience with chronic pain, it’s a presumptive compassion for everyone else.” In essence, don’t make the mistake of thinking other people are pain-free themselves.</p>\n\n<p></p>\n\n<p>“They may have it much worse,” Setiya says. “They can’t tell what’s going on with me, I can’t tell what’s going on with them. Realizing the invisibility of various kinds of suffering can open you to the possibility that other people can be experiencing all kinds of difficulty, maybe not chronic pain, but loneliness or grief or injustice. That is part of the power of reflecting on the hardships of life, to change us ethically. There’s a lot more to living well than how my body feels right now.”</p>\n\n<p></p>\n\n<p><strong>From the personal to the political</strong></p>\n\n<p></p>\n\n<p>Beyond pain, Setiya chips away at conventional wisdom across topics such as personal failure. Too often, Setiya believes, we judge ourselves as a success or failure, and by a single yardstick, such as wealth or career status. This often occurs when we regard our lives as a coherent narrative — something Setiya is very dubious about.</p>\n\n<p></p>\n\n<p>“The idea is that we should narrate our lives to ourselves as a story in which we’re the hero, often of a quest narrative in which one central project defines your life,” Setiya says. “I don’t think we have to live that way, and I don’t think we should. If you allow your life to be defined by one central project, it’s not just that you can succeed or fail, or think of yourself as a winner or loser. You lose touch with the great diverse abundance of things in your life, the little things you do, the attachments and connections to other people.” Our lives are too varied, hopefully, to be contained in a narrative.</p>\n\n<p></p>\n\n<p>“That idea is really important to resist,” Setiya says.</p>\n\n<p></p>\n\n<p>Meanwhile, Setiya advocates for dealing with injustice of all kinds by getting involved in society and making an effort on behalf of others. Take climate change, Setiya’s main issue for civic involvement.</p>\n\n<p></p>\n\n<p>“The causes are collective, and the solutions will be collective action, including at the local level,” Setiya says. “The thing to do is to find a group, if like me you’re not really a leader.” Several years ago Setiya found Fossil Free MIT, a student group working to change the Institute’s climate plans, and participated in its activities while a faculty member.</p>\n\n<p></p>\n\n<p>“A few hundred students were able to make a real difference on an institution that has real impact in the world,” Setiya says. “Engaging in action collectively with other people decreases anxiety, it’s actually reassuring to be working with other people on these problems. So I think it’s a win-win to engage. You may feel like you’re not doing enough, but that comes with the territory. No one feels like they’re doing enough, not even activists who devote their lives to this.”</p>\n\n<p></p>\n\n<p>Similarly, he adds, each session doomsurfing about political trends such as the threat to democracy means you are spending more time being inactive, in a sense.</p>\n\n<p></p>\n\n<p>“You’re just cementing your own sense of powerlessness,” Setiya says. “It’s not that we should be under any illusions about how much power any one of us has. It’s just that we don’t have none, and what power we do have, we’re not using it when we stare in a daze at the screen in horror. The horror is on to something. It’s not a mistake to react with anger and deep concern and grief when you look at the news, but getting lost in that particular rabbit hole is not the way to respond.”</p>\n\n<p></p>\n\n<p>“Life Is Hard,” which is written for a general audience, has earned praise from many publications. “Attentive readers of this humane, intelligent book will come away with a firmer grasp and better descriptions of whatever it is that ails them or those they cherish,” stated a recent review in <em>The Economist</em>.</p>\n\n<p></p>\n\n<p>For his part, Setiya adds one more thing for readers. Trying to live a realistic, grounded, socially generous life is an ongoing effort, and no more likely to be perfect than anything else we attempt.</p>\n\n<p></p>\n\n<p>“There are ways to connect those kinds of concerns and try to find a coherent way in which you’re finding a place in your life for all of them, with a kind of acceptance,” Setiya says. “You’re probably never going to do it exactly right, and that’s okay, too.”</p>",
  "media:content": {
    "media:description": "MIT philosophy professor Kieran Setiya’s book “Life Is Hard” offers guidance for living an ethical life in hard times.",
    "media:credit": "Photo: Bryce Vickmark"
  },
  "category": [
    "Philosophy",
    "Books and authors",
    "Wellbeing",
    "Behavior",
    "Research",
    "Faculty",
    "School of Humanities Arts and Social Sciences"
  ]
}