{
  "title": "S1E62 - Praying for Rain with Two-Time Olympic Medalist Michael Hixon",
  "guid": "https://pinecast.com/guid/42caa1e5-ae42-49e8-a5e1-ec54205cb91e",
  "pubDate": "Thu, 05 May 2022 06:30:00 -0000",
  "itunes:duration": "01:05:56",
  "description": "<p>Today, Laura is joined by Michael Hixon, an American diver and two-time Olympic medalist.  The pair open up the episode to talk about Hixon’s abnormally young introduction to sports.  Growing up with two parents that were collegiate coaches, he was practically raised on the basketball court and in the pool, but it wasn’t until his eighth grade year that he decided to pursue diving full time.  It would soon be a career full of seemingly unachievable goals, Olympic success, and unusual circumstances.  Michael, however, remains humble and expresses his gratitude for his parents, especially his mother, in that they never pressured him to play the sport for the wrong reasons.</p>\n<p>He raves about the importance of purpose based performance, and how his parents taught him that true success is hardly ever achieved when you compete for the wrong reasons. These lessons helped guide him on his Olympic journey and during his initial introduction to synchro, which, afterall, was fairly different compared to his experience previously competing alone. It was during this time period that Michael feels he honed his skills the most, perhaps due to the help of his coaches, his teammate, Andrew, or the ‘Pray for Rain’ speech from a former Olympian.  Laura and Mike draw this episode to a close as they talk about embracing hiccups and mishaps - if you welcome adversity into your life, you transform your mindset.  </p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Hixon’s young introduction to sports</li>\n<li>Growing up with parents who coach for a living</li>\n<li>Feeling behind during his junior career</li>\n<li>Why unrealistic goal setting is a strong suit for Hixon</li>\n<li>The importance of having someone believe in you</li>\n<li>Proving others wrong</li>\n<li>Purpose based performance</li>\n<li>Grounds for transferring universities</li>\n<li>The redshirt process going into the Olympics</li>\n<li>Hixon’s experience with synchro</li>\n<li>Olympics in Rio</li>\n<li>Praying for Rain</li>\n<li>The Olympics during Covid</li>\n</ul>\n<p>Quotes: </p>\n<ul>\n<li>“I grew up in a gym and a pool. I actually refused to go to kindergarten my first year, because I was having so much fun, and there was no way that anyone was going to ever get me to sit in a classroom when, prior to that, all I had done was play all day.”</li>\n<li>“Eighth grade was when I wanted to quit playing basketball. I wanted to go fully into diving, but when you stopped growing at five foot eight, your decision’s kind of made for you.”</li>\n<li>“I was diving alone in a pool with my mom and that was very isolated, absolutely. Then the other side of that is I got to go play basketball with my friends, and that was a social outlet as well - it was a ton of fun to be a part of a team.”</li>\n<li>“I thought you know, ‘If I'm going to chase this guy and have the success that he's had, and get onto that international level the way he has at a young age, I've got a lot of work to do.’ To be honest, chasing him was one of the easiest ways to get better. When you have a really high standard and you hold yourself to that, that's going to push you forward quickly.”</li>\n<li>“There is a difference between fear based performance and purpose based performance, and you are talking about a purpose. You had meaning to this, not pressure, not expectation.  You had a purpose doing it for somebody else– something bigger than yourself.”</li>\n<li>“I think maybe the wrong reason to transfer is maybe if you think everything's supposed to be just 100% perfect, and exactly what you envision. It's just not, and understanding that going into that is important.”</li>\n<li>“Whether it was this crazy wind that's blowing over, you know, the backdrop at Rio, the green pool, the food, or all these crazy little wrenches thrown into what would have been a perfect plan, we were excited for that. We weren't just okay with it. We were like, ‘This is great’.”</li>\n<li>“I got off the airplane from Rio…I was listening to pump up music on the flight back. I was just so excited for what was next, and I ended up really burning myself out that next year a little bit for that reason; not taking time to maybe allow that whole situation to sink in and give respect to what had happened.”</li>\n<li>“I might wake up tomorrow, and I'm going to find out at the same time as everybody else. I'm going to wake up tomorrow, and the Olympics are going to be canceled, you know. All this work, what was it for?”</li>\n<li><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></li>\n</ul>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"http://laurawilkinson.com/shop\" rel=\"nofollow\">Laura Wilkinson Designs- Shop</a>\n<a href=\"http://laurawilkinson.com/coffee\" rel=\"nofollow\">Buy Laura a Coffee</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Connect with Michael:\n<a href=\"https://www.instagram.com/hixon4/\" rel=\"nofollow\">Michael Hixon's Instagram</a></p>",
  "itunes:title": "Praying for Rain with Two-Time Olympic Medalist Michael Hixon",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 62
}