{
  "title": "SC EP:442 Sasquatch saves child",
  "itunes:title": "SC EP:442 Sasquatch saves child",
  "pubDate": "Sun, 10 Jun 2018 20:07:05 +0000",
  "guid": "gid://art19-episode-locator/V0/h9CWCO0aJz0_MmRV_orjauxItOoBA_3DqdnFHvf8rVM",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/44220FINAL.mp3",
  "itunes:image": "",
  "description": "<p>“I was born and raised in White Bear Lake, Minnesota. When I was growing up as a troubled youth about 11 years old I was sent away to a group home (that’s what they did in the 70’s when I was a kid. if you were deemed a ‘problem child’ or were in trouble with the law, or you were a runaway (that was me) your parents signed ‘incorrigible’ papers on you and let the County juvenile authorities place you where they decide, which may be in a home with someone who would take care of you for a period of time instead of a jail cell. They called it a ‘group home’ or foster care. So, I come from a large catholic family of 12 other siblings (I was #6) and because I kept running away from being sexually abused by my older brother. He threatened me to never tell and I didn’t,(I never told anyone about the abuse, I just kept acting out in other ways, like running away, staying out late, and skipping school etc.) my parents too busy to figure out what was up with me, turned me over to Ramsey Counties Juvenile justice system and they placed me in a ‘Group Home’ which was a man who owned a farm in northern Minnesota who would care for and hopefully turn troubled teens around before they got into real legal problems with the law and ended up in prison. This man took in 4 teens at a time and basically used us as free labor to run his farm. He had about 80 milking cows, some pigs, sheep, a couple hundred steers, etc. you know the deal.On the outside, and to everyone else, like the county authorities, our parents, this guy looked like he was offering a service to help boys, what he REALLY was, was a 60 yr old ex military CO, child abuser who beat and tortured kids for fun. (can you frikkin believe that shit!?) and for whatever reason, he had a bad attitude about me and he physically beat me, tortured me and emotionally tormented me for 10 months. He did not beat any of they other boys, just ME. His name was Don, and he had a farm on if I remember correctly ‘Choke cherry road’. Its approx. 8 ½ miles west of Willow River, Minnesota, I believe in Finlayson township. Now this Don character was a real piece of work, He was so physically abusive to me, I actually thought I was going to die by his hands before my time was up there. I was to be there for 1 year. I lasted 10 months before the county got some report from a local constable and they pulled me from there and shut his place down. (that is another long story that I won’t go into) He did everything from poking me with pitchforks while he had me tied to a post, to whipping me with milking straps til I bled from the brass grommets. He would make me stand naked in the field from dawn til dusk and sunburn the shit out of me, and then in the frigid winter, he made me stand out in the driveway naked til I was frostbit. I have plenty of scars and afflictions to prove what I’m saying.</p> <p>He would keep me out of school until my obvious bruises and cuts were healed, and then I was allowed to return to school. (I missed A LOT OF SCHOOL THAT YEAR) He beat me and He beat his cows and horses , sheep and pigs the same way, so at 12 yrs old I felt like another of his animals. OK, so I bet your wondering, “what the hell does all this have to do with bigfoot or you? and Why am I telling you my childhood abuse stories? well this is why. His farm was located down this gravel road, about 8 miles from the highway. One other farm about ½ mile down the road, otherwise no other homes, farms, nothing for 10 miles in any direction.</p> <p>After many beatings, I started running away, and when I started to run away from him, he would always catch me because I didn’t know where I was, or how to get away, so I always just ran down the road until he would find I was missing and he would come after me with his old 67 Ford LTD that smelled like a cow pie inside. I would hear his car coming down the gravel road after me and I would go off road into the ditch, and hide. But he always found me and the beatings would begin again. I would have ran off the road and into the woods but I was afraid of the swamp that was on both sides of the road between the road and the woods. I would guess there was about 100 yds of swamp, then thick woods. When I did try to go off the road I would get cold and wet, and didn’t know why but I was so afraid of the swamp, I had heard howls and strange noises that I can’t explain whenever I was walking on the road and I was always afraid. but I shrugged the noises off to the local wildlife.</p> <p>On one of my ‘escapes’ I ran away and the only way ‘out’ was 8 miles down the dirt road that was the only way in or out of his farm. I would run for miles and then I would hear his car coming from a long way away but with nothing but swamps on both sides of the road I didn’t know where to go and every time he would catch me he would Tie my hands together and tie the other end of the 20 foot rope to his bumper and he would make me run behind the car as he headed back to the farm. He did this several times, and every time I would get tired and couldn’t run fast enough to keep up with the car and I would always fall sooner or later and he would not stop, he would just drag me the rest of the way back to the farm. I have many scars to this day to prove what I’m explaining to you.</p> <p>Again Wes, I know your thinking “what the hell does this have to do with Bigfoot??” well it will all be understood soon:</p> <p>One time (the last time) I ran away and ran down the road, (BTW, NO other farms or houses on this stretch of road. very desolate, open pastures and wooded forests and a strip of swamp on both sides of the long 8 mile gravel road. I don’t know, but I believe now that this Sasquatch had watched what was happening to me, maybe only once, maybe it saw every time I was abused on that road. (I’m sure that he drug me behind the car at least 8 times over that summer) I somehow feel it (the bigfoot) understood my plight, or if it just noticed I was in trouble, or if it saw me running before and saw Don (the asshole abuser) stop and grab me smack me around and then tie me to the car and take me on another drag. Maybe it was watching the farm all summer, as my abuse was a daily thing around the farm, easy to see happening if you were watching the farm. I Don’t know. it was in approximately the same location on the same dirt road that I heard noises before in one of my escapes that this guy don would come and find me at. So it goes like this; I was running down the side of the road, I hear Don’s car coming off in the distance, so I jump off the road and down into the swamp along the road and I start heading across this swampy area, hoping to cross it to the tree line and into the forest that is beyond the swamp.</p> <p>It’s getting deeper and muckier every step I take and I am panicking and struggling to get through the swamp before don’s car gets to where I was. My feet are sinking, I’m struggling every step and I’m quickly realizing that it’s too deep and I am not going to be able to cross this swamp to the tree line beyond it. Don’s car comes, I duck, Don’s car goes by, but he doesn’t notice me about 75 yds out in this swampy area. So I have avoided him for the moment but I know he will turn around and come back, as always. but now I’m stuck in the swamp and struggling to keep my head afloat and to get out. (sorry, I’m not good with distances, don’t know 50 yards from 50 feet but I think my numbers are close approximations)</p> <p>I’m panicking, I’m sinking, my feet are stuck in the muck up to my waist, and the water above the muck to my chest. The more I struggle, the more I sink into the swamp muck! I’m pulling at cattails and reeds, I’m screaming and crying and wishing Don had seen me, cuz a beating is better then a drowning! All of a sudden, from the tree line, I hear this big CRASH/SPLASH about 50 feet away from me on the edge of the woods/swamp. I look up expecting to see a bear or something because it sounded like a herd of buffalo was coming out of the tree line. What do I see? It’s a MONSTER!! 8 feet tall, and massive! it’s a HUGE BIGFOOT! (back then I thought it was a MONSTER, but now I know it was a bigfoot, so I’ll just call it that) I notice right away it’s a female because of the large hairy breasts. Weird how a 12 year old in puberty will notice tits, even on a bigfoot (LOL) anyways, tits or not it’s a monster and I am screaming and struggling in this swamp and I think I’m going to drown, I stop struggling in the direction going away from the road and start struggling back towards the road but can’t get my feet loose of the muck.</p> <p>I was finally able to pull my feet out of my shoes and get a few more steps, as this at least 8 feet tall brown hairy monster is coming straight towards me. I am dizzy from struggling and screaming and panicking and I have swamp water in my mouth and I’m coughing, and this Bigfoot is almost on top of me now, it never made a noise, no growling, roaring, nothing, and seemed to glide effortlessly through the swamp to me. The water seemed to only come to it’s knees and as it got to within about 10 feet of me I thought for sure it was going to just beat me or kill me and eat me or something bad. it did not. I cowered down with my hands and arms over my head as I saw the shadow of this beast surround me and then I notice this terrible stench! Like a thousand skunks and rotten meat at the same time. Worst thing I have ever smelled, ever! Then everything got silent. She/it was over the top of me and I was face down in the swamp with my hands over my head and my eyes closed tightly crying. Next I hear this beast sigh, like it changed its mind and gave up scaring me or something, hard to explain the emotion, but we both just froze for what seemed like an hour but was in reality about 10 seconds. It was like this beast woman was trying to figure out what to do with me. It had the look of intelligence, not a wild animal.</p> <p>I feel this wet cold mucky hairy hand grab the back of my jacket and my neck and pull me up out of the swamp. I start flaying my feet and twisting around to get loose but it had me tight and effortlessly held me out in front of it. I started screaming and crying as it held me out in front of her and started moving swiftly towards the road. It seemed to take about 10 seconds and we were back at the edge of the ditch next to the road. It took me 10 minutes to get out there struggling all the way, but it moved smoothly and quickly back the way I came into the swamp from the gravel road in a matter of seconds. From where she picked me up to the gravel road was about 75 feet. She dropped me in the ditch, and just looked at me for what seemed like an hour but was a few seconds, the look was of sadness, of confusion, but firm too. It looked up the road towards the sound of Don’s car coming back about a ½ mile away and turned looked at me again and walked away quickly straight back the way we came from following the same path through the swamp. It was into the tree line and gone in about 20 seconds.</p> <p>What I remember the most is the look on her face when she dropped me. she stood and looked at me for a couple seconds, she looked up the road where we both heard don’s car coming in the far distance, (you know the sound a car makes on gravel when there is no other noise? You can hear it break the silence from a mile away) as I said, She looks back to me and I saw this look, one of understanding, of motherly caring almost, and of concern and of ANGER all at the same time. Then she turned and moved swiftly back through the swamp to the woods on the other side of the swamp and disappeared.</p> <p>What I can tell you about the face is that it reminded me of a carnival ‘bearded lady’. I know how that sounds, but she did not look like a woman, she had long wet, dark brown hair, not fur draped in her face, a long dirty beard that seemed to start at her eyes and flow all the way off the chin. And the hair was full of pine needles and twigs and clumps of mud. Oh, and the skin, was dark gray, and her hands huge with brownish long nails that looked like an eagles claw, but dirty and chipped. Huge eyes, dark deep set and angry looking, but not angry at me. And the nose was wide and flat like a boxer or something, but not human. If I had to pick a bigfoot type that she most resembled it would be a cross between ‘Patty’ but with long messy dirty hair. Maybe Like the Florida swamp creature you have seen on the internet.</p> <p>I never told Don about the Bigfoot, he pulled up and saw me lying in a puddle in the ditch “your all fu**ing’ wet! Where are your fu**ing shoes? And you STINK! You’re not sitting in MY car stinkin’ like that! Get in the fu**ing trunk” He snarled, as he got out of his car and opened the trunk and pointed towards it. I was cold and wet and stinkin like a skunk and probably in shock, I was still sobbing. So I climbed in the trunk and he slammed the lid down and drove me back to the farm as he had done many times before. I was just happy he didn’t drag me this time. He made me throw the jacket away, we couldn’t get the smell out of it, and he blew it off that I somehow got tangled with a skunk. A dead skunk.</p> <p>I never told anyone about the Bigfoot, who would believe me? I also believe that there was a bigfoot near me while I was picking raspberries out in Don’s back forty a couple months earlier. I was in the woods. I heard a grunt in the bushes near the wild berry patch we always went to and I had a sudden fear come over me and I ran back to the house about a mile through the woods down the tractor trail. There seemed to be something moving through the woods on the side of me, but I could never see it, I was just scared shitless of something, and I ran. I Never heard the grunting sound again until I was walking on the road near the swamp months later.</p> <p>Until I started listening to your show, I figured I would take it to my grave. But you Wes, with your friendly voice and the way you make it sound ok and believable that someone saw a bigfoot and that the story should be told that I decided to at least put my encounter to paper.”</p>",
  "content:encoded": "<p>“I was born and raised in White Bear Lake, Minnesota. When I was growing up as a troubled youth about 11 years old I was sent away to a group home (that’s what they did in the 70’s when I was a kid. if you were deemed a ‘problem child’ or were in trouble with the law, or you were a runaway (that was me) your parents signed ‘incorrigible’ papers on you and let the County juvenile authorities place you where they decide, which may be in a home with someone who would take care of you for a period of time instead of a jail cell. They called it a ‘group home’ or foster care. So, I come from a large catholic family of 12 other siblings (I was #6) and because I kept running away from being sexually abused by my older brother. He threatened me to never tell and I didn’t,(I never told anyone about the abuse, I just kept acting out in other ways, like running away, staying out late, and skipping school etc.) my parents too busy to figure out what was up with me, turned me over to Ramsey Counties Juvenile justice system and they placed me in a ‘Group Home’ which was a man who owned a farm in northern Minnesota who would care for and hopefully turn troubled teens around before they got into real legal problems with the law and ended up in prison. This man took in 4 teens at a time and basically used us as free labor to run his farm. He had about 80 milking cows, some pigs, sheep, a couple hundred steers, etc. you know the deal.On the outside, and to everyone else, like the county authorities, our parents, this guy looked like he was offering a service to help boys, what he REALLY was, was a 60 yr old ex military CO, child abuser who beat and tortured kids for fun. (can you frikkin believe that shit!?) and for whatever reason, he had a bad attitude about me and he physically beat me, tortured me and emotionally tormented me for 10 months. He did not beat any of they other boys, just ME. His name was Don, and he had a farm on if I remember correctly ‘Choke cherry road’. Its approx. 8 ½ miles west of Willow River, Minnesota, I believe in Finlayson township. Now this Don character was a real piece of work, He was so physically abusive to me, I actually thought I was going to die by his hands before my time was up there. I was to be there for 1 year. I lasted 10 months before the county got some report from a local constable and they pulled me from there and shut his place down. (that is another long story that I won’t go into) He did everything from poking me with pitchforks while he had me tied to a post, to whipping me with milking straps til I bled from the brass grommets. He would make me stand naked in the field from dawn til dusk and sunburn the shit out of me, and then in the frigid winter, he made me stand out in the driveway naked til I was frostbit. I have plenty of scars and afflictions to prove what I’m saying.</p> <p>He would keep me out of school until my obvious bruises and cuts were healed, and then I was allowed to return to school. (I missed A LOT OF SCHOOL THAT YEAR) He beat me and He beat his cows and horses , sheep and pigs the same way, so at 12 yrs old I felt like another of his animals. OK, so I bet your wondering, “what the hell does all this have to do with bigfoot or you? and Why am I telling you my childhood abuse stories? well this is why. His farm was located down this gravel road, about 8 miles from the highway. One other farm about ½ mile down the road, otherwise no other homes, farms, nothing for 10 miles in any direction.</p> <p>After many beatings, I started running away, and when I started to run away from him, he would always catch me because I didn’t know where I was, or how to get away, so I always just ran down the road until he would find I was missing and he would come after me with his old 67 Ford LTD that smelled like a cow pie inside. I would hear his car coming down the gravel road after me and I would go off road into the ditch, and hide. But he always found me and the beatings would begin again. I would have ran off the road and into the woods but I was afraid of the swamp that was on both sides of the road between the road and the woods. I would guess there was about 100 yds of swamp, then thick woods. When I did try to go off the road I would get cold and wet, and didn’t know why but I was so afraid of the swamp, I had heard howls and strange noises that I can’t explain whenever I was walking on the road and I was always afraid. but I shrugged the noises off to the local wildlife.</p> <p>On one of my ‘escapes’ I ran away and the only way ‘out’ was 8 miles down the dirt road that was the only way in or out of his farm. I would run for miles and then I would hear his car coming from a long way away but with nothing but swamps on both sides of the road I didn’t know where to go and every time he would catch me he would Tie my hands together and tie the other end of the 20 foot rope to his bumper and he would make me run behind the car as he headed back to the farm. He did this several times, and every time I would get tired and couldn’t run fast enough to keep up with the car and I would always fall sooner or later and he would not stop, he would just drag me the rest of the way back to the farm. I have many scars to this day to prove what I’m explaining to you.</p> <p>Again Wes, I know your thinking “what the hell does this have to do with Bigfoot??” well it will all be understood soon:</p> <p>One time (the last time) I ran away and ran down the road, (BTW, NO other farms or houses on this stretch of road. very desolate, open pastures and wooded forests and a strip of swamp on both sides of the long 8 mile gravel road. I don’t know, but I believe now that this Sasquatch had watched what was happening to me, maybe only once, maybe it saw every time I was abused on that road. (I’m sure that he drug me behind the car at least 8 times over that summer) I somehow feel it (the bigfoot) understood my plight, or if it just noticed I was in trouble, or if it saw me running before and saw Don (the asshole abuser) stop and grab me smack me around and then tie me to the car and take me on another drag. Maybe it was watching the farm all summer, as my abuse was a daily thing around the farm, easy to see happening if you were watching the farm. I Don’t know. it was in approximately the same location on the same dirt road that I heard noises before in one of my escapes that this guy don would come and find me at. So it goes like this; I was running down the side of the road, I hear Don’s car coming off in the distance, so I jump off the road and down into the swamp along the road and I start heading across this swampy area, hoping to cross it to the tree line and into the forest that is beyond the swamp.</p> <p>It’s getting deeper and muckier every step I take and I am panicking and struggling to get through the swamp before don’s car gets to where I was. My feet are sinking, I’m struggling every step and I’m quickly realizing that it’s too deep and I am not going to be able to cross this swamp to the tree line beyond it. Don’s car comes, I duck, Don’s car goes by, but he doesn’t notice me about 75 yds out in this swampy area. So I have avoided him for the moment but I know he will turn around and come back, as always. but now I’m stuck in the swamp and struggling to keep my head afloat and to get out. (sorry, I’m not good with distances, don’t know 50 yards from 50 feet but I think my numbers are close approximations)</p> <p>I’m panicking, I’m sinking, my feet are stuck in the muck up to my waist, and the water above the muck to my chest. The more I struggle, the more I sink into the swamp muck! I’m pulling at cattails and reeds, I’m screaming and crying and wishing Don had seen me, cuz a beating is better then a drowning! All of a sudden, from the tree line, I hear this big CRASH/SPLASH about 50 feet away from me on the edge of the woods/swamp. I look up expecting to see a bear or something because it sounded like a herd of buffalo was coming out of the tree line. What do I see? It’s a MONSTER!! 8 feet tall, and massive! it’s a HUGE BIGFOOT! (back then I thought it was a MONSTER, but now I know it was a bigfoot, so I’ll just call it that) I notice right away it’s a female because of the large hairy breasts. Weird how a 12 year old in puberty will notice tits, even on a bigfoot (LOL) anyways, tits or not it’s a monster and I am screaming and struggling in this swamp and I think I’m going to drown, I stop struggling in the direction going away from the road and start struggling back towards the road but can’t get my feet loose of the muck.</p> <p>I was finally able to pull my feet out of my shoes and get a few more steps, as this at least 8 feet tall brown hairy monster is coming straight towards me. I am dizzy from struggling and screaming and panicking and I have swamp water in my mouth and I’m coughing, and this Bigfoot is almost on top of me now, it never made a noise, no growling, roaring, nothing, and seemed to glide effortlessly through the swamp to me. The water seemed to only come to it’s knees and as it got to within about 10 feet of me I thought for sure it was going to just beat me or kill me and eat me or something bad. it did not. I cowered down with my hands and arms over my head as I saw the shadow of this beast surround me and then I notice this terrible stench! Like a thousand skunks and rotten meat at the same time. Worst thing I have ever smelled, ever! Then everything got silent. She/it was over the top of me and I was face down in the swamp with my hands over my head and my eyes closed tightly crying. Next I hear this beast sigh, like it changed its mind and gave up scaring me or something, hard to explain the emotion, but we both just froze for what seemed like an hour but was in reality about 10 seconds. It was like this beast woman was trying to figure out what to do with me. It had the look of intelligence, not a wild animal.</p> <p>I feel this wet cold mucky hairy hand grab the back of my jacket and my neck and pull me up out of the swamp. I start flaying my feet and twisting around to get loose but it had me tight and effortlessly held me out in front of it. I started screaming and crying as it held me out in front of her and started moving swiftly towards the road. It seemed to take about 10 seconds and we were back at the edge of the ditch next to the road. It took me 10 minutes to get out there struggling all the way, but it moved smoothly and quickly back the way I came into the swamp from the gravel road in a matter of seconds. From where she picked me up to the gravel road was about 75 feet. She dropped me in the ditch, and just looked at me for what seemed like an hour but was a few seconds, the look was of sadness, of confusion, but firm too. It looked up the road towards the sound of Don’s car coming back about a ½ mile away and turned looked at me again and walked away quickly straight back the way we came from following the same path through the swamp. It was into the tree line and gone in about 20 seconds.</p> <p>What I remember the most is the look on her face when she dropped me. she stood and looked at me for a couple seconds, she looked up the road where we both heard don’s car coming in the far distance, (you know the sound a car makes on gravel when there is no other noise? You can hear it break the silence from a mile away) as I said, She looks back to me and I saw this look, one of understanding, of motherly caring almost, and of concern and of ANGER all at the same time. Then she turned and moved swiftly back through the swamp to the woods on the other side of the swamp and disappeared.</p> <p>What I can tell you about the face is that it reminded me of a carnival ‘bearded lady’. I know how that sounds, but she did not look like a woman, she had long wet, dark brown hair, not fur draped in her face, a long dirty beard that seemed to start at her eyes and flow all the way off the chin. And the hair was full of pine needles and twigs and clumps of mud. Oh, and the skin, was dark gray, and her hands huge with brownish long nails that looked like an eagles claw, but dirty and chipped. Huge eyes, dark deep set and angry looking, but not angry at me. And the nose was wide and flat like a boxer or something, but not human. If I had to pick a bigfoot type that she most resembled it would be a cross between ‘Patty’ but with long messy dirty hair. Maybe Like the Florida swamp creature you have seen on the internet.</p> <p>I never told Don about the Bigfoot, he pulled up and saw me lying in a puddle in the ditch “your all fu**ing’ wet! Where are your fu**ing shoes? And you STINK! You’re not sitting in MY car stinkin’ like that! Get in the fu**ing trunk” He snarled, as he got out of his car and opened the trunk and pointed towards it. I was cold and wet and stinkin like a skunk and probably in shock, I was still sobbing. So I climbed in the trunk and he slammed the lid down and drove me back to the farm as he had done many times before. I was just happy he didn’t drag me this time. He made me throw the jacket away, we couldn’t get the smell out of it, and he blew it off that I somehow got tangled with a skunk. A dead skunk.</p> <p>I never told anyone about the Bigfoot, who would believe me? I also believe that there was a bigfoot near me while I was picking raspberries out in Don’s back forty a couple months earlier. I was in the woods. I heard a grunt in the bushes near the wild berry patch we always went to and I had a sudden fear come over me and I ran back to the house about a mile through the woods down the tractor trail. There seemed to be something moving through the woods on the side of me, but I could never see it, I was just scared shitless of something, and I ran. I Never heard the grunting sound again until I was walking on the road near the swamp months later.</p> <p>Until I started listening to your show, I figured I would take it to my grave. But you Wes, with your friendly voice and the way you make it sound ok and believable that someone saw a bigfoot and that the story should be told that I decided to at least put my encounter to paper.”</p>",
  "enclosure": "",
  "itunes:duration": "01:08:52",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "“I was born and raised in White Bear Lake, Minnesota. When I was growing up as a troubled youth about 11 years old I was sent away to a group home (that’s what they did in the 70’s when I was a kid. if you were deemed a ‘problem child’ or...",
  "itunes:episode": 442,
  "itunes:episodeType": "full"
}