{
  "title": "Episode 106: &#8220;Louie Louie&#8221; by the Kingsmen",
  "link": "https://500songs.com/podcast/episode-106-louie-louie-by-the-kingsmen/",
  "pubDate": "Wed, 02 Dec 2020 20:02:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=340",
  "description": "Episode 106 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Louie Louie\" by the Kingsmen, and the story of how a band that had already split up accidentally had one of the biggest hits of the sixties and sparked a two-year FBI investigation.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/44596550\">\"It's My Party\" by Lesley Gore</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-106-louie-louie/\">Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nThe single biggest resource I used in this episode was <a href=\"https://amzn.to/2VvBzhe\">Dave Marsh's book on Louie Louie</a>.\n\nInformation on Richard Berry also came from <a href=\"http://uncamarvy.com\">Marv Goldberg's page,</a> specifically his articles on the Flairs and Arthur Lee Maye and the Crowns.\n\n<a href=\"http://www.academia.edu/2137366/A_Tale_of_Two_Louies_Interpreting_an_Archetypal_American_Musical_Icon_\">This academic paper on the song </a>is where I learned what the chord Richard Berry uses instead of the V is.\n\n<a href=\"https://amzn.to/39gyJBF\">The Coasters by Bill Millar</a> also had some information about Berry.\n\n<a href=\"https://amzn.to/3olsq7l\"><em>Love That Louie: The Louie Louie Files</em> </a>has the versions of the song by the Kingsmen, Berry, Rockin' Robin Roberts, and Paul Revere and the Raiders, plus many more, and also has the pre-\"Louie\" \"Havana Moon\" and \"El Loco Cha Cha Cha\"\n\n<a href=\"https://amzn.to/3g1IyHV\"><em>The Ultimate Flairs</em> </a>has twenty-nine tracks by the Flairs under various names.\n\n<a href=\"https://amzn.to/3lu5v81\"><em>Yama Yama! The Modern Recordings 1954-56</em> </a>contains twenty-eight tracks Richard Berry recorded for Modern Records in the mid-fifties, including the Etta James duets.\n\nAnd&nbsp;<a href=\"https://amzn.to/33DJY6v\"><em>Have \"Louie\" Will Travel</em> </a>collects Berry's post-Modern recordings, including \"Louie Louie\" itself.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at what is arguably the most important three-chord rock and roll record ever made, a song written by someone who's been a bit-part player in many episodes so far, but who never had any success with it himself, and performed by a band that had split up before the record started to chart. We're going to look at how a minor LA R&B hit was picked up by garage rock bands in the Pacific Northwest and sparked a two-and-a-half-year FBI investigation, and was recorded by everyone from Barry White to Iggy Pop, from Motorhead to the Beach Boys, from Julie London to Frank Zappa. We're going to look at \"Louie Louie\" by the Kingsmen:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThe story of \"Louie Louie\" begins with Richard Berry. We've seen Berry pop up here and there in several episodes -- most recently in the episode on the Crystals, where we looked at how he'd been involved in the early career of the Blossoms, but the only time he's been a signficant part of the story was in the episode on \"The Wallflower\", back in March 2019, and even there he wasn't the focus of the episode, so I should start by talking about his career. Some of this will be familiar from other episodes from a year or two ago, but here we're looking at Berry specifically.\n\nRichard Berry was one of the many, many, great musicians of the fifties to go to Jefferson High School in Los Angeles, and was very involved in music at that school. When he arrived in the school, he had an aggressive attitude, formed by a need to defend himself -- he walked with a limp, and had first started playing music at a camp for disabled kids, and he didn't want people to think he was soft because of his disability. But as soon as he found out that you had to behave well in order to join the school a capella choir he became a changed character -- he needed to be involved in music.\n\nAnd he soon was. He joined a group named The Flamingos, who were all students at Jefferson and proteges of Jesse Belvin, who was a couple of years older than them. That group consisted of Cornell Gunter on lead vocals, Gaynel Hodge on first tenor, Joe Jefferson on second tenor, Curtis Williams on baritone, and Berry on bass -- though Berry was one of those rare vocalists who could sing equally well in the bass and tenor ranges, and in every style from gritty blues to Jesse Belvin style crooning.\n\nBut as we've seen before, the membership of these groups was ever changing, and soon Curtis Williams left, first to join the Hollywood Flames, and then to join the Penguins. He was replaced, but Gunter and Berry left soon afterwards, and the remaining members of the band renamed themselves to The Platters.\n\nBerry and Gunter joined another group, the Debonairs, which was originally led by Arthur Lee Maye, with whom Berry would make many records over the years in the off-season -- Maye was a major-league baseball player, and couldn't record in the months his main career was taking up his time. Maye soon left the group, and in 1952 The Debonairs, with a lineup of Berry, Gunter, Young Jessie, Thomas Fox and Beverly Thompson, visited John Dolphin and made their first record, for Dolphins of Hollywood. The A-side featured Gunter on lead:\n\n[Excerpt: The Hollywood Blue Jays, \"I Had a Love\"]\n\nWhile the B-side featured Berry:\n\n[Excerpt: The Hollywood Blue Jays, \"Tell Me You Love Me\"]\n\nThe group were disappointed when the record came out to discover that it wasn't credited to the Debonairs, but instead to the Hollywood Blue Jays, a name Dolphin had also used for other groups.\n\nThe record didn't have any success, and so the group started looking for other labels that might record them. Cornell Gunter sat down with a pile of records and looked for ones with a label in LA. They decided to go with Modern Records, and ended up signed to Flair records, one of Modern's subsidiaries. The label suggested they change their name to The Flairs, and they eagerly agreed, thinking that if their band had the same name as the label, the label would be more likely to promote them.\n\nTheir first single for their new label was produced by Leiber and Stoller. One side was a remake of their first single, in better quality, with Gunter again singing lead, while the B-side was another Richard Berry song, \"She Wants to Rock\":\n\n[Excerpt: The Flairs, \"She Wants to Rock\"]\n\nApparently in 1953, when that came out, the title was still considered racy enough that the DJ Hunter Hancock insisted on them going on his radio show and explaining that by \"rock\" they merely meant to dance, and not anything more suggestive.\n\nOver the next couple of years, the Flairs would record and release tracks under all sorts of names -- as well as many Flairs records they also released tracks as by The Hunters:\n\n[Excerpt: The Hunters, \"Rabbit on a Log\"]\n\nas Young Jessie solo records:\n\n[Excerpt: Young Jessie, \"Lonesome Desert\"]\n\nAnd as the Chimes. Several of these records were produced by Ike Turner, who by this point had moved on from working with Sam Phillips and was now working for the Bihari brothers, who owned Modern Records.\n\nBerry also released solo recordings, and recorded with a group led by Arthur Lee Maye, first as the Five Hearts (though there were only three of them at the time), then as the Rams, before the group settled down to become Arthur Lee Maye and the Crowns:\n\n[Excerpt: Arthur Lee Maye and the Crowns, \"Set My Heart Free\"]\n\nAt one point in 1954, Berry was in three groups at the same time. He was in the Flairs, the Crowns, and the Dreamers -- the group who became the Blossoms, who we talked about two weeks ago. And on top of that he was also recording a lot of sessions both as a solo singer, and as a duo with Jenell Hawkins, who also sometimes sang with the Dreamers:\n\n[Excerpt: Rickey and Jenelle, \"Each Step\"]\n\nThe reason Berry was working on so many records wasn't just that he loved singing, though he did, but because he'd learned from Jesse Belvin that it didn't matter what the contract said, you were never going to get any royalties when you made records. So he sang on as many sessions as he could, pocketed his fifty-dollar fee, and then tried to get on another session.\n\nThe Flairs eventually got sick of Berry working on so many other people's records and singing with so many groups, and so he was out of the group -- but he just formed his own new group, the Pharaohs, and carried on. The Flairs continued for years, though one at a time they left for other groups -- Thomas Fox joined the Cadets, who had a hit with \"Stranded in the Jungle\", and most famously, Cornell Gunter went on to join the classic lineup of the Coasters.\n\nBut Berry actually sang on a Coasters record even before Gunter. As we saw, the first Coasters album was padded out with several singles by the Robins, credited to the Coasters, and one of the sessions that Berry had sung on was the Robins' \"Riot in Cell Block #9\", where Leiber and Stoller had asked him to sing lead, subbing for the Robins' normal bass singer Bobby Nunn:\n\n[Excerpt: The Robins, \"Riot in Cell Block #9\"]\n\nThe Bihari brothers were annoyed when they recognised Berry's voice on that record -- he was meant to be under contract to them, and even though he protested that it wasn't him, they knew better. But they got Berry to start a solo career with a sequel to \"Riot\", \"The Big Break\", which he wrote himself:\n\n[Excerpt: Richard Berry, \"The Big Break\"]\n\nAnd for the next few years, Berry was promoted as a solo artist, recording songs like the Little Richard knockoff \"Yama Yama Pretty Mama\":\n\n[Excerpt: Richard Berry, \"Yama Yama Pretty Mama\"]\n\nBut of course that didn't stop him from working with everyone else he could. Most famously, he was Henry on Etta James' \"The Wallflower\", which we looked at eighteen months ago:\n\n[Excerpt: Etta James and the Peaches, \"The Wallflower\"]\n\nBerry collaborated with James on the sequel, \"Hey! Henry\", which was less successful:\n\n[Excerpt: Etta James, \"Hey! Henry\"]\n\nAnd he wrote \"Good Rockin' Daddy\" for her, which made the R&B top ten:\n\n[Excerpt: Etta James, \"Good Rockin' Daddy\"]\n\nThis is all just scratching the surface. Between 1952 and the early sixties, Berry was on literally hundreds of records, under many names, and it's likely we will never accurately know all of them. A fair number of them were classics of the genre, many more were derivative hackwork -- quick knockoffs of the latest hit by Chuck Berry or Fats Domino, with the serial numbers not filed off all that well -- and more than a few managed to be derivative hackwork *and* classics of the genre.\n\nBerry's most famous song, \"Louie Louie\", was both. There is nothing original about \"Louie Louie\", yet it had an incalculable effect on popular music history, and Berry's original version is a genuinely great record.\n\nThe song had its genesis in a piece that Berry heard played as an instrumental by a group he was singing with at a gig one night, the Rhythm Rockers. When he asked them what the song was, he found out it was \"El Loco Cha Cha Cha\", originally recorded by Rene Touzet. Berry loved the intro for the song, and immediately decided to rip it off:\n\n[Excerpt: Rene Touzet, \"El Loco Cha Cha Cha\"]\n\nThat song is based around the same three-chord Latin groove as \"La Bamba\", \"Twist and Shout\", and roughly a million other songs, and so in keeping with the Latin feel of the song, Berry turned to another record as a model for his song. \"Havana Moon\" by Chuck Berry was the B-side to \"You Can't Catch Me\", and Richard Berry took its vocal melody, its lyrical theme of someone drinking while waiting for a ship to arrive and missing a girl who the narrator will see at the end of the boat journey, and its attempt at imitating Caribbean speech patterns by saying things like \"Me stand and wait for boat to come\":\n\n[Excerpt: Chuck Berry, \"Havana Moon\"]\n\nOf course, nothing is original, and the Chuck Berry track itself was almost certainly inspired by Nat \"King\" Cole's \"Calypso Blues\":\n\n[Excerpt: Nat \"King\" Cole, \"Calypso Blues\"]\n\nRichard Berry took these influences, and turned them into \"Louie Louie\", which he originally intended to have a Latin feel. But the owners of his record label wanted something more straight-ahead R&B, so that's what they got:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Louie Louie\"]\n\nWhile Berry's inspiration had been based on the I-IV-V-IV chord sequence that you get in \"La Bamba\", \"Louie Louie\" didn't actually use that precise sequence. I'm going to get into some music-theory stuff here, which I know some of you like and some of you detest, and so if you dislike that stuff skip forward a couple of minutes.\n\nIf you take just the \"Louie Louie\" riff, and play it with the standard I-IV-V-IV chords, you get \"Wild Thing\":\n\n[Excerpt: \"Wild Thing\" riff, piano]\n\nBut Berry, in his arrangement, incorporated a second melody part, a little standard motif you get in a lot of blues stuff, the fifth, sixth, flattened seventh, and sixth of the scale, repeating:\n\n[Excerpt: motif, piano]\n\nThe problem is that the normal way to use that motif is over a single chord. Berry was using it over three chords, and the flattened seventh note clashes with the V chord -- if you're playing in C, you've got a G chord, which is the notes G, B, and D, but that little motif has a B-flat note. So you get a B and a B-flat played together, which doesn't sound great:\n\n[Excerpt: tonal clash, piano]\n\nNow, if you're a rock guitarist from the late sixties onwards, the way you'd resolve that problem is to play power chords -- power chords have just the root and fifth note, no third, so in this case you wouldn't be playing the B. Problem solved.\n\nBut this was the 1950s, and while there were a handful of records using power chords, when Berry was making his record in 1957, they weren't particularly common. Also, Berry was a piano player rather than a guitarist, and so he went for a different option. Instead of playing the normal V chord, he used the I chord, with a seventh -- so if you were to play it in the key of C, it would be C7 -- but he played it in the second inversion, with the dominant in the bass. So if you were playing it in the key of C, the notes would be G-Bflat-C-E. So the bass riff is still the I-IV-V-IV riff, but the chords sound like this:\n\n[Excerpt: \"Louie Louie\" chords, piano]\n\nThat wouldn't be the solution that many later cover versions would use, but it worked for Berry's record, which was released as the B-side to a version of \"You Are My Sunshine\", and became a minor local hit:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Louie Louie\"]\n\nBy this time, Berry had left Modern Records, and \"Louie Louie\" was on a small label, Flip Records. Berry was twenty-one, he'd been a professional musician since he was sixteen and was thinking of getting married, and he was making so little money from his music that he took a day job, working at a record-pressing plant, smashing returned records. When \"Louie Louie\" started getting played on local radio, people started giving him a hard time at work, asking why he needed that job when he had a hit record, not understanding that he was making no money from it. He ended up being treated so badly that he quit that job\n\nAnd Flip Records started pressuring him to make follow-ups to \"Louie Louie\" rather than do anything new. He did come up with a great follow-up, \"Have Love Will Travel\", but that wasn't a hit:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Have Love Will Travel\"]\n\nHe got a few big gigs for a while off the back of his local hit, but he ended up working at the docks with his father -- but he eventually had to quit that because his disability made it impossible for him to do it. In 1959, in order to pay for his wedding, he sold his songwriting rights to \"Louie Louie\" and several of his other songs to the owner of Flip Records, for $750 -- he wanted to hold out for a full thousand, but he ended up settling for a lower amount. From that point on, he would still get paid his BMI royalties when the song was played on the radio -- you couldn't sell those rights -- but he wouldn't receive anything from record sales or sheet music sales, or use in films, or anything like that.\n\nBut that didn't matter. A song like \"Louie Louie\", a three-chord B-side to a flop single from two years earlier, was hardly going to earn any real money, and seven hundred and fifty dollars was a lot of money. Berry was a working man who needed money, and anyway he was moving into soul music. \"Louie Louie\" was just another song he'd written, no more important than \"Look Out Miss James\" or \"Rockin' Man\", and while R&B fans in LA loved it (if you listen to the later version by the Beach Boys, or to Frank Zappa's riffs on the song, you can tell they grew up listening to Berry's original, not the later versions) it wasn't going to ever be heard outside those people.\n\nAnd that would have been true, if it hadn't been for Ron Holden.\n\nWe've not talked about the Pacific Northwest's music scene in the podcast so far, but it had one of the most vibrant and interesting music scenes in the US in the late fifties and early sixties, and much of the music that gets labelled garage rock or frat rock comes from that area. The closest parallel I can think of is Liverpool -- another place where mostly-white musicians were performing their own versions of music made by Black musicians, and performing it on electric guitars. But anyone who became big from the area immediately moved somewhere else and became \"an LA musician\" or \"a New York musician\", and the scene as a whole has never really had the attention it deserves.\n\nRon Holden was one of the few Black musicians in that scene. In fact, he was a second-generation musician -- his father, Oscar Holden, was known as \"the father of Seattle jazz\", and had played with both Louis Armstrong and Jelly Roll Morton. Ron Holden led the most popular band in the Seattle area, the Thunderbirds, and in 1960, he had a top ten hit with a song called \"Love You So\":\n\n[Excerpt: Ron Holden, \"Love You So\"]\n\nHe didn't have any follow-up hits, but as every musician from Seattle who had any success did, he moved away. He moved to LA, where he signed to Keen Records, where he recorded an entire album of songs written and produced by Keen's new staff producer Bruce Johnston, including \"Gee, But I'm Lonesome\", a song which was coincidentally also recorded around that time by Richard Berry's old collaborators the Blossoms:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nHolden was also the MC for the Ritchie Valens Memorial Concert which was the Beach Boys' first major professional live performance.\n\nBut before he left Seattle, he had introduced \"Louie Louie\" to the music scene there -- he'd heard it on the radio in 1957 and worked up an arrangement with his band, and it had been a highlight of his shows. Once he left the city, so he wasn't performing the song there, all the white bands in Seattle, and in nearby Tacoma, picked up on the song and added Holden's arrangement of the song to their own sets.\n\nHolden -- or rather his saxophone player Carlos Ward, who did the Thunderbirds' arrangements -- had made a crucial change to \"Louie Louie\", one that made it simpler to play on the guitar, and thus suitable for the guitar-heavy music that was starting to predominate in the Pacific Northwest. Remember that Richard Berry had that second-inversion major seventh chord in there?\n\n[Excerpt: \"Louie Louie\" chords, piano]\n\nWard changed that chord for a simpler minor V chord, just flattening the third so there was no clash there:\n\n[Excerpt: \"Louie Louie\" chords, Pacific Northwest version]\n\nThat would be how almost every version of \"Louie Louie\" from this point on would be performed, because it was how they played it in the Pacific Northwest, because it was how Ron Holden and the Thunderbirds played it, and few of those bands had heard Richard Berry's original record, just Ron Holden's live performances of the song.\n\nBut one band who based their version on Holden's did listen to the original record -- once Holden had brought the song to their attention. The Wailers -- who are often referred to as \"the Fabulous Wailers\" to distinguish them from Bob Marley's later, more famous group -- were a group from Tacoma, which had a strong instrumental guitar band scene -- most famously, the Ventures came from Tacoma, and a lot of the bands in the area sounded like that.\n\nIn 1959, the Wailers recorded a self-penned instrumental, \"Tall Cool One\", which made the top forty:\n\n[Excerpt: The Wailers, \"Tall Cool One\"]\n\nThey didn't have any other hits, but soon after recording that, they got in a local singer, Rockin Robin Roberts, who became one of the band's three lead singers. The group had a residence at a local venue, the Spanish Castle, and a live recording of one of their sets there, released as the \"Live at the Castle\" album, shows that they were a hugely exciting live band:\n\n[Excerpt: The Fabulous Wailers, \"Since You Been Gone\"]\n\nThe shows at that venue were so good that several years later one of the regular audience members, Jimi Hendrix, would commemorate them in the song \"Spanish Castle Magic\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Spanish Castle Magic\"]\n\nBut it was their version of \"Louie Louie\" that became the template for almost every version that ever followed. For contractual reasons, it was released as a Rockin' Robin Roberts solo record, but it was the full Wailers playing on the track. No-one else in the Pacific Northwest knew what the lyrics were -- they'd all learned it from Ron Holden's live performances, but Roberts had actually tracked down a copy of the Richard Berry record and learned the words. Which, if you look at what happened later, is rather ironic.\n\nTheir version of the song came out on their own label, and had few sales outside their home area, but it would be one of the most influential records ever, because everyone else in the Pacific Northwest started copying their version, right down to Roberts' ad-libbed shout as they go into the guitar solo:\n\n[Excerpt: Rockin' Robin Roberts, \"Louie Louie\"]\n\nThe Wailers struggled on for a few more years, but never had any more commercial success. Rockin' Robin Roberts went on to become an associate professor of biochemistry, before dying far too young in a car crash in 1967.\n\nBut while their version of \"Louie Louie\" wasn't a hit, a few copies made their way a couple of hours' drive south, to Oregon. Here the story becomes a little difficult, because different people had different recollections of what happened. I'm going to tell one version of the story, but there are others.\n\nThe story goes that one copy made its way into a jukebox at a club called the Pypo Club, in Seaside, Oregon, a club frequented by surfers. And one day in the early sixties -- people seem to disagree whether it was summer 1961 or 62, two local bands played that club. During the intermission, the audience danced to the music on the jukebox -- indeed, they danced to just one record on the jukebox, over and over. They just kept playing \"Louie Louie\" by Rockin' Robin Roberts, no other records.\n\nBoth bands immediately added the song to their sets, and it became a highlight of both band's shows.\n\nBy far the bigger of the two bands was Paul Revere and the Raiders. The Raiders actually came from Idaho, and had had a top forty hit with \"Like, Long Hair\" a novelty surf-rock version of a Rachmaninoff piece that Kim Fowley had produced:\n\n[Excerpt: Paul Revere and the Raiders, \"Like, Long Hair\"]\n\nBut their career had stalled and they had moved to Oregon, because Revere, the group's piano player and leader, had been drafted, and while he was allowed not to serve in the military because of his Mennonite faith, he had to do community service work there for two years instead.\n\nThe Raiders were undoubtedly the best and most popular band in the Oregon area at the time, and their showmanship was on a whole other level from any other band -- they were one of the first bands to smash their instruments on stage, except they weren't smashing guitars -- Revere would buy cheap second-hand pianos and smash *those* on stage.\n\nA local DJ, Roger Hart, had become the group's manager, and he was going to start up his own label, and he wanted them to record \"Louie Louie\" as the label's first single. Revere wasn't keen -- he didn't like the song much, but Roger Hart insisted. He was sure it could be the hit that would restore the Raiders to the charts. So in April 1963, Paul Revere and the Raiders went into Northwest Recorders in Portland and recorded this:\n\n[Excerpt: Paul Revere and the Raiders, \"Louie Louie\"]\n\nHart paid for the recording session and put the single out on his small label, Sande. It was soon picked up by Columbia Records, who put it out nationally. It started to get a bit of airplay, and started rising up the charts -- it didn't break the Hot One Hundred straight away, but it was clearly heading in the right direction.\n\nThe Raiders signed to Columbia, and with Hart as their manager and occasional songwriter, and Terry Melcher as their producer, they became one of the biggest bands in the US, and had a string of hits stretching from 1965 to 1971. We won't be doing a full episode on them, but they became an integral part of the LA music scene in the sixties, and they're sure to turn up as background characters in future episodes.\n\nBut note that I said their run of hits started in 1965. Because there had been two bands playing the Pypo Club, and they had both added \"Louie Louie\" to their set. And they'd both recorded versions of it in the same studio, in the same week.\n\nThe Kingsmen were... not as big as the Raiders. They were a bunch of teenagers who had formed a group a few years earlier, and even on a good day they were at best the second-best band in Portland, with the Raiders far, far, ahead. The core of the group was based around the friendship of Jack Ely, the group's lead singer, and Lynn Easton, the drummer, whose parents were friends -- both families were Christian Scientists and actively involved in their local church -- and they had grown up together. Ely's parents didn't encourage the duo's music -- Ely's biological father had been a professional singer, but when the father died and Ely's mother remarried, his stepfather didn't want him to have anything to do with music -- but Easton's did, and Easton's father became the group's manager. Easton's mother even went to the local courthouse to register the group's name for them.\n\nEaston's father was replaced as their manager by Ken Chase, the owner of the radio station where Roger Hart was the most popular DJ, and they started pressuring him to make a record with them. Eventually he did -- and he booked them into the same studio as the Raiders, the same week. Different people have different stories about which was first and which was second, but there is no doubt that they were only two days or so apart. And there's also no doubt that they were very different in terms of professionalism.\n\nThe Kingsmen did their best to copy the Rockin' Robin Roberts version, right down to his shout of \"Let's give it to them right now!\" but it was shockingly amateurish. The night before, they'd done a live show which consisted of a single ninety-minute-long performance of \"Louie Louie\" with no breaks, and Ely's voice was shot. The mic was positioned too high for him and he had to strain his throat, and his braces were also making him slur the words. At one point early in the song, Easton clicks his drumsticks together by accident, and yells an obscenity loud enough to be captured on the tape:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nAfter the solo, Ely comes back in, wrongly thinks he's come in in the wrong place, and stops, leaving Easton to quickly improvise a drum fill before they pick up again:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThe difference with the Raiders can be summed up most succinctly by what happened next -- the Raiders' manager paid for their session, but when the engineer at this session asked who was paying, and the Kingsmen pointed to their manager, he said \"No, I'm not. I've not got any money\", and the members of the group had to dig through their pockets to get together the fifty dollars themselves.\n\nIt's incompetent teenagers, who have no idea what they're doing, and it would become one of the most important records of all time.\n\nBut when it was released... well, it was the second-best version of \"Louie Louie\" recorded in Portland that week, so while the Raiders were selling thousands, the Kingsmen only sold a couple of hundred copies. Jerry Dennon, the owner of the tiny label that released it, tried to get it picked up by Capitol Records, who rejected it saying it was the worst garbage they'd ever heard. He also sent it out to bigger indie labels, like Scepter, who stuck it in a drawer and forgot about it.\n\nAnd that was basically the end of the Kingsmen. In August, Easton decided that he was going to stop being the drummer and be the lead singer instead -- he told Ely that Ely was going to be the drummer now. The other band members were astonished, because Easton couldn't sing and Ely couldn't play the drums, and they said that wasn't going to happen. Easton then played his trump card -- when his mother had registered the band name, she'd registered it just in his name. If they didn't do things his way, they weren't going to be in the Kingsmen any more, and he was going to find new Kingsmen to replace them. Ely and a couple of other members quit, and that was the end of the group.\n\nAnd then, in October, as the Raiders' record was still slowly making some national progress, Arnie \"Woo Woo\" Ginsburg heard the Kingsmen's version. This Arnie Ginsburg isn't the Arnie Ginsburg we heard about in the episode on \"LSD-25\", and who we'll be meeting again briefly next week. This one was a DJ in Boston, and the most popular DJ in the area. And he *hated* the record.\n\nHe hated it so much, he played it on his show, because he had a slot called The Worst Record Of The Week. He played it twice, and the next day, he had fifty calls from record shops -- customers had been coming in wanting to know where they could get \"Louie Louie\". Marv Schlachter at Scepter heard from the distributors how well the record was doing and picked it up for national distribution on their Wand subsidiary. In its first week on Wand, the single sold twenty-one thousand copies in Boston.\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nFor a few weeks, the Raiders and the Kingsmen both hung around the \"bubbling under\" section of the charts -- the Raiders selling and being played on the West Coast, and the Kingsmen on the East. By the ninth of November, the Kingsmen were at eighty-three in the charts, while the Raiders were at 108. By December the fourteenth, the Kingsmen were at number two, behind \"Dominique\" by the Singing Nun, a Belgian nun singing in French:\n\n[Excerpt: The Singing Nun, \"Dominique\"]\n\nYou might think that there could not be two more different records at the top of the charts, and you'd mostly be right, but there was one thing that linked them -- the Singing Nun's song had a chorus that went \"Dominique, nique, nique\", and one of the reasons it had become popular was that in France, but not in Belgium where she lived, \"nique\" was a swear word, an expletive meaning \"to fornicate\", roughly the French equivalent of the word that Lynn Easton shouted when he clicked his drumsticks together.\n\nSo a big part of its initial popularity was because of people finding an obscene meaning in the lyrics that simply wasn't there.\n\nAnd that was true of \"Louie Louie\" as well. Jack Ely had slurred the lyrics so badly that people started imagining that there must be dirty words in there, because otherwise why wouldn't he be singing it clearly? People started passing notes in schools and colleges, saying what the lyrics \"really\" were -- apparently you had to play the single at 33RPM to hear them properly.\n\nThese lyrics never made any actual sense, but they were things like \"We'll take her and park all alone/She's never a girl I lay at home/At night at ten I lay her again\" and \"on that chair I'll lay her there/I felt my boner in her hair\" -- the kind of thing, in short, that kids make up all the time.\n\nSo obviously, they were reported to the FBI.\n\nAnd obviously the FBI spent two years investigating the song:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThey checked it anyway, of course, and reported \"A comparison was made of the recording on the tape described above as specimen K1 with the recording on the disk, submitted by the Detroit Office and described as specimen Q3 in this case and no audible differences were noted.\"\n\nOn the FBI website, you can read 119 pages of memos from FBI agents (with various bits blacked out for security reasons), and read about them shipping copies of \"Louie Louie\" to labs (under special seal, in case they'd be violating laws about transferring obscene material across state lines and breaking the very law they were investigating), listening to the record at 33, 45, and 78 RPM and trying to see if they could make out the lyrics, comparing them to the published words, to the various samizdat versions being shared by kids, and to Berry's record, and destroying the records after listening. They interviewed members of the Kingsmen and DJs, and they went to Scepter Records to get a copy of the original master tape, which they were surprised to discover was mono so left them no way of isolating the vocals.\n\nMeanwhile they were getting letters from concerned citizens doing things like playing the single at 78 RPM, making a tape recording of that at double speed, and then slowing it down, saying \"at that speed the obscene articulation is clearer\".\n\nThis went on for two years. At no point does any of these highly trained FBI agents listening over and over to \"Louie Louie\" at different speeds appear to have heard Lynn Easton's yelled expletive, which unlike all these other things is actually on the record.\n\nMeanwhile, the Kingsmen went on to have one more top twenty hit, with only Easton and the lead guitarist left of the original lineup, and then continued to tour playing their hit. Jack Ely toured solo playing his one hit. The most successful member of the group was Don Gallucci, the keyboard player, who formed Don and the Goodtimes, who had a minor hit with \"I Could Be So Good To You\":\n\n[Excerpt: Don and the Goodtimes, \"I Could Be So Good To You\"]\n\nGallucci went on to produce Fun House for the Stooges, who would also of course later record their own version of \"Louie Louie\", in which they sung those dirty lyrics:\n\n[Excerpt: the Stooges, \"Louie Louie\"]\n\nBut then, nearly everyone did a version of the song -- there are at least two thousand recordings of it. But, other than from radio play, Richard Berry was receiving no money from any of these. After his marriage ended, he'd quit working as a musician to raise his daughter, gone back to school, and taken a day job -- but then he'd been further disabled in an accident and had ended up on welfare, while his song was making millions for the people who'd bought it from him for seven hundred and fifty dollars. He didn't even understand why the song was popular -- the only version that sounded like the record he'd wanted to make was the one by Barry White, another ex-Jefferson High student, who'd added the Latin percussion Berry had wanted to put on before he'd been told to make it more R&B.\n\nBut in the eighties, things started to change. Some radio stations started doing all-Louie weekends, where for a whole weekend they'd just play different versions of the song, never repeating one. One of those stations invited Berry to do a live performance of the song with Jack Ely, backed by Bo Diddley's former rhythm player Lady Bo and her band:\n\n[Excerpt: Richard Berry and Jack Ely, \"Louie Louie\"]\n\nThat was the first time Berry ever met the man who'd made his song famous. Soon after that, Berry's old friend Darlene Love, who had been one of the Dreamers who'd sung with Berry back in the fifties, introduced him to the man who would change his life -- Chuck Rubin. Rubin had, in the seventies, been the manager of the blues singer Wilbur Harrison, and had realised that not only was Harrison not getting any money from his old recordings, nor were many other Black musicians. He'd seen a business opportunity, and had started a company that helped get those artists what they deserved -- along with giving himself fifty percent of whatever they made. Which seems like a lot, but many people, including Berry, figured that fifty percent of a fortune was better than the hundred percent of nothing they were currently getting.\n\nMost of these artists had signed legally valid bad deals, which meant that while they were morally entitled to something, they weren't legally entitled. But Rubin had a way of getting round that, and he did the same thing with Berry that he did with many other people. He kept starting lawsuits that put off potential business partners, and in 1986 a company wanted to use \"Louie Louie\" in a TV advertising campaign that would earn huge amounts of money for its owners -- but they didn't want to use a song that was tied up in litigation. If the legal problems weren't sorted, they'd just use \"Wild Thing\" instead. In order to make sure the commercials used \"Louie Louie\", the song's owner gave Berry half the publishing rights and full songwriting rights (which Berry then split with Rubin). He didn't get any back payment from what the song had already earned, but he went from getting $240 a month on welfare in 1985, to making $160,000 from \"Louie Louie\" in 1989 alone.\n\nRichard Berry died in 1997, happy, respected, and wealthy. In the last decade of his life people started to explore his music again, and give him some of the credit he was due. Jack Ely continued performing \"Louie Louie\" until his death in 2015. Lynn Easton quit music in 1968, giving the Kingsmen's name to the lead guitarist Mike Mitchell, the only other original member still in the band. Easton died in April this year -- no-one's sure what of, as his religious beliefs meant he never saw a doctor. Mitchell's lineup of Kingsmen continued to perform until covid happened, and will presumably do so again once the pandemic is over. And somewhere out there, whenever you're listening to this, someone will be playing \"duh-duh-duh, duh-duh, duh-duh-duh\"",
  "itunes:subtitle": "Episode 106 of A History of Rock Music in Five Hundred Songs looks at Louie Louie by the Kingsmen, and the story of how a band that had already split up accidentally had one of the biggest hits of the sixties and sparked a two-year FBI investigation.\n\nCl",
  "itunes:keywords": "Bruce Johnston,censorship,Chuck Berry,Cornell Gunter,Curtis Williams,Darlene Love,garage rock,Gaynel Hodge,Hollywood Flames,Ike Turner,Jefferson High School,Jesse Belvin,Jimi Hendrix,John Dolphin,Kim Fowley,lawsuits,Leiber and Stoller,Modern Records,Paul Revere and the Raiders,Richard Berry,Terry Melcher,The Blossoms,The Coasters,The Fabulous Wailers,The Kingsmen,The Penguins,The Platters,The Robins",
  "itunes:episodeType": "full",
  "itunes:episode": 106,
  "content:encoded": "Episode 106 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Louie Louie\" by the Kingsmen, and the story of how a band that had already split up accidentally had one of the biggest hits of the sixties and sparked a two-year FBI investigation.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/44596550\">\"It's My Party\" by Lesley Gore</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-106-louie-louie/\">Mixcloud streaming playlist </a>with full versions of all the songs in the episode.\n\nThe single biggest resource I used in this episode was <a href=\"https://amzn.to/2VvBzhe\">Dave Marsh's book on Louie Louie</a>.\n\nInformation on Richard Berry also came from <a href=\"http://uncamarvy.com\">Marv Goldberg's page,</a> specifically his articles on the Flairs and Arthur Lee Maye and the Crowns.\n\n<a href=\"http://www.academia.edu/2137366/A_Tale_of_Two_Louies_Interpreting_an_Archetypal_American_Musical_Icon_\">This academic paper on the song </a>is where I learned what the chord Richard Berry uses instead of the V is.\n\n<a href=\"https://amzn.to/39gyJBF\">The Coasters by Bill Millar</a> also had some information about Berry.\n\n<a href=\"https://amzn.to/3olsq7l\"><em>Love That Louie: The Louie Louie Files</em> </a>has the versions of the song by the Kingsmen, Berry, Rockin' Robin Roberts, and Paul Revere and the Raiders, plus many more, and also has the pre-\"Louie\" \"Havana Moon\" and \"El Loco Cha Cha Cha\"\n\n<a href=\"https://amzn.to/3g1IyHV\"><em>The Ultimate Flairs</em> </a>has twenty-nine tracks by the Flairs under various names.\n\n<a href=\"https://amzn.to/3lu5v81\"><em>Yama Yama! The Modern Recordings 1954-56</em> </a>contains twenty-eight tracks Richard Berry recorded for Modern Records in the mid-fifties, including the Etta James duets.\n\nAnd&nbsp;<a href=\"https://amzn.to/33DJY6v\"><em>Have \"Louie\" Will Travel</em> </a>collects Berry's post-Modern recordings, including \"Louie Louie\" itself.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nToday we're going to look at what is arguably the most important three-chord rock and roll record ever made, a song written by someone who's been a bit-part player in many episodes so far, but who never had any success with it himself, and performed by a band that had split up before the record started to chart. We're going to look at how a minor LA R&B hit was picked up by garage rock bands in the Pacific Northwest and sparked a two-and-a-half-year FBI investigation, and was recorded by everyone from Barry White to Iggy Pop, from Motorhead to the Beach Boys, from Julie London to Frank Zappa. We're going to look at \"Louie Louie\" by the Kingsmen:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThe story of \"Louie Louie\" begins with Richard Berry. We've seen Berry pop up here and there in several episodes -- most recently in the episode on the Crystals, where we looked at how he'd been involved in the early career of the Blossoms, but the only time he's been a signficant part of the story was in the episode on \"The Wallflower\", back in March 2019, and even there he wasn't the focus of the episode, so I should start by talking about his career. Some of this will be familiar from other episodes from a year or two ago, but here we're looking at Berry specifically.\n\nRichard Berry was one of the many, many, great musicians of the fifties to go to Jefferson High School in Los Angeles, and was very involved in music at that school. When he arrived in the school, he had an aggressive attitude, formed by a need to defend himself -- he walked with a limp, and had first started playing music at a camp for disabled kids, and he didn't want people to think he was soft because of his disability. But as soon as he found out that you had to behave well in order to join the school a capella choir he became a changed character -- he needed to be involved in music.\n\nAnd he soon was. He joined a group named The Flamingos, who were all students at Jefferson and proteges of Jesse Belvin, who was a couple of years older than them. That group consisted of Cornell Gunter on lead vocals, Gaynel Hodge on first tenor, Joe Jefferson on second tenor, Curtis Williams on baritone, and Berry on bass -- though Berry was one of those rare vocalists who could sing equally well in the bass and tenor ranges, and in every style from gritty blues to Jesse Belvin style crooning.\n\nBut as we've seen before, the membership of these groups was ever changing, and soon Curtis Williams left, first to join the Hollywood Flames, and then to join the Penguins. He was replaced, but Gunter and Berry left soon afterwards, and the remaining members of the band renamed themselves to The Platters.\n\nBerry and Gunter joined another group, the Debonairs, which was originally led by Arthur Lee Maye, with whom Berry would make many records over the years in the off-season -- Maye was a major-league baseball player, and couldn't record in the months his main career was taking up his time. Maye soon left the group, and in 1952 The Debonairs, with a lineup of Berry, Gunter, Young Jessie, Thomas Fox and Beverly Thompson, visited John Dolphin and made their first record, for Dolphins of Hollywood. The A-side featured Gunter on lead:\n\n[Excerpt: The Hollywood Blue Jays, \"I Had a Love\"]\n\nWhile the B-side featured Berry:\n\n[Excerpt: The Hollywood Blue Jays, \"Tell Me You Love Me\"]\n\nThe group were disappointed when the record came out to discover that it wasn't credited to the Debonairs, but instead to the Hollywood Blue Jays, a name Dolphin had also used for other groups.\n\nThe record didn't have any success, and so the group started looking for other labels that might record them. Cornell Gunter sat down with a pile of records and looked for ones with a label in LA. They decided to go with Modern Records, and ended up signed to Flair records, one of Modern's subsidiaries. The label suggested they change their name to The Flairs, and they eagerly agreed, thinking that if their band had the same name as the label, the label would be more likely to promote them.\n\nTheir first single for their new label was produced by Leiber and Stoller. One side was a remake of their first single, in better quality, with Gunter again singing lead, while the B-side was another Richard Berry song, \"She Wants to Rock\":\n\n[Excerpt: The Flairs, \"She Wants to Rock\"]\n\nApparently in 1953, when that came out, the title was still considered racy enough that the DJ Hunter Hancock insisted on them going on his radio show and explaining that by \"rock\" they merely meant to dance, and not anything more suggestive.\n\nOver the next couple of years, the Flairs would record and release tracks under all sorts of names -- as well as many Flairs records they also released tracks as by The Hunters:\n\n[Excerpt: The Hunters, \"Rabbit on a Log\"]\n\nas Young Jessie solo records:\n\n[Excerpt: Young Jessie, \"Lonesome Desert\"]\n\nAnd as the Chimes. Several of these records were produced by Ike Turner, who by this point had moved on from working with Sam Phillips and was now working for the Bihari brothers, who owned Modern Records.\n\nBerry also released solo recordings, and recorded with a group led by Arthur Lee Maye, first as the Five Hearts (though there were only three of them at the time), then as the Rams, before the group settled down to become Arthur Lee Maye and the Crowns:\n\n[Excerpt: Arthur Lee Maye and the Crowns, \"Set My Heart Free\"]\n\nAt one point in 1954, Berry was in three groups at the same time. He was in the Flairs, the Crowns, and the Dreamers -- the group who became the Blossoms, who we talked about two weeks ago. And on top of that he was also recording a lot of sessions both as a solo singer, and as a duo with Jenell Hawkins, who also sometimes sang with the Dreamers:\n\n[Excerpt: Rickey and Jenelle, \"Each Step\"]\n\nThe reason Berry was working on so many records wasn't just that he loved singing, though he did, but because he'd learned from Jesse Belvin that it didn't matter what the contract said, you were never going to get any royalties when you made records. So he sang on as many sessions as he could, pocketed his fifty-dollar fee, and then tried to get on another session.\n\nThe Flairs eventually got sick of Berry working on so many other people's records and singing with so many groups, and so he was out of the group -- but he just formed his own new group, the Pharaohs, and carried on. The Flairs continued for years, though one at a time they left for other groups -- Thomas Fox joined the Cadets, who had a hit with \"Stranded in the Jungle\", and most famously, Cornell Gunter went on to join the classic lineup of the Coasters.\n\nBut Berry actually sang on a Coasters record even before Gunter. As we saw, the first Coasters album was padded out with several singles by the Robins, credited to the Coasters, and one of the sessions that Berry had sung on was the Robins' \"Riot in Cell Block #9\", where Leiber and Stoller had asked him to sing lead, subbing for the Robins' normal bass singer Bobby Nunn:\n\n[Excerpt: The Robins, \"Riot in Cell Block #9\"]\n\nThe Bihari brothers were annoyed when they recognised Berry's voice on that record -- he was meant to be under contract to them, and even though he protested that it wasn't him, they knew better. But they got Berry to start a solo career with a sequel to \"Riot\", \"The Big Break\", which he wrote himself:\n\n[Excerpt: Richard Berry, \"The Big Break\"]\n\nAnd for the next few years, Berry was promoted as a solo artist, recording songs like the Little Richard knockoff \"Yama Yama Pretty Mama\":\n\n[Excerpt: Richard Berry, \"Yama Yama Pretty Mama\"]\n\nBut of course that didn't stop him from working with everyone else he could. Most famously, he was Henry on Etta James' \"The Wallflower\", which we looked at eighteen months ago:\n\n[Excerpt: Etta James and the Peaches, \"The Wallflower\"]\n\nBerry collaborated with James on the sequel, \"Hey! Henry\", which was less successful:\n\n[Excerpt: Etta James, \"Hey! Henry\"]\n\nAnd he wrote \"Good Rockin' Daddy\" for her, which made the R&B top ten:\n\n[Excerpt: Etta James, \"Good Rockin' Daddy\"]\n\nThis is all just scratching the surface. Between 1952 and the early sixties, Berry was on literally hundreds of records, under many names, and it's likely we will never accurately know all of them. A fair number of them were classics of the genre, many more were derivative hackwork -- quick knockoffs of the latest hit by Chuck Berry or Fats Domino, with the serial numbers not filed off all that well -- and more than a few managed to be derivative hackwork *and* classics of the genre.\n\nBerry's most famous song, \"Louie Louie\", was both. There is nothing original about \"Louie Louie\", yet it had an incalculable effect on popular music history, and Berry's original version is a genuinely great record.\n\nThe song had its genesis in a piece that Berry heard played as an instrumental by a group he was singing with at a gig one night, the Rhythm Rockers. When he asked them what the song was, he found out it was \"El Loco Cha Cha Cha\", originally recorded by Rene Touzet. Berry loved the intro for the song, and immediately decided to rip it off:\n\n[Excerpt: Rene Touzet, \"El Loco Cha Cha Cha\"]\n\nThat song is based around the same three-chord Latin groove as \"La Bamba\", \"Twist and Shout\", and roughly a million other songs, and so in keeping with the Latin feel of the song, Berry turned to another record as a model for his song. \"Havana Moon\" by Chuck Berry was the B-side to \"You Can't Catch Me\", and Richard Berry took its vocal melody, its lyrical theme of someone drinking while waiting for a ship to arrive and missing a girl who the narrator will see at the end of the boat journey, and its attempt at imitating Caribbean speech patterns by saying things like \"Me stand and wait for boat to come\":\n\n[Excerpt: Chuck Berry, \"Havana Moon\"]\n\nOf course, nothing is original, and the Chuck Berry track itself was almost certainly inspired by Nat \"King\" Cole's \"Calypso Blues\":\n\n[Excerpt: Nat \"King\" Cole, \"Calypso Blues\"]\n\nRichard Berry took these influences, and turned them into \"Louie Louie\", which he originally intended to have a Latin feel. But the owners of his record label wanted something more straight-ahead R&B, so that's what they got:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Louie Louie\"]\n\nWhile Berry's inspiration had been based on the I-IV-V-IV chord sequence that you get in \"La Bamba\", \"Louie Louie\" didn't actually use that precise sequence. I'm going to get into some music-theory stuff here, which I know some of you like and some of you detest, and so if you dislike that stuff skip forward a couple of minutes.\n\nIf you take just the \"Louie Louie\" riff, and play it with the standard I-IV-V-IV chords, you get \"Wild Thing\":\n\n[Excerpt: \"Wild Thing\" riff, piano]\n\nBut Berry, in his arrangement, incorporated a second melody part, a little standard motif you get in a lot of blues stuff, the fifth, sixth, flattened seventh, and sixth of the scale, repeating:\n\n[Excerpt: motif, piano]\n\nThe problem is that the normal way to use that motif is over a single chord. Berry was using it over three chords, and the flattened seventh note clashes with the V chord -- if you're playing in C, you've got a G chord, which is the notes G, B, and D, but that little motif has a B-flat note. So you get a B and a B-flat played together, which doesn't sound great:\n\n[Excerpt: tonal clash, piano]\n\nNow, if you're a rock guitarist from the late sixties onwards, the way you'd resolve that problem is to play power chords -- power chords have just the root and fifth note, no third, so in this case you wouldn't be playing the B. Problem solved.\n\nBut this was the 1950s, and while there were a handful of records using power chords, when Berry was making his record in 1957, they weren't particularly common. Also, Berry was a piano player rather than a guitarist, and so he went for a different option. Instead of playing the normal V chord, he used the I chord, with a seventh -- so if you were to play it in the key of C, it would be C7 -- but he played it in the second inversion, with the dominant in the bass. So if you were playing it in the key of C, the notes would be G-Bflat-C-E. So the bass riff is still the I-IV-V-IV riff, but the chords sound like this:\n\n[Excerpt: \"Louie Louie\" chords, piano]\n\nThat wouldn't be the solution that many later cover versions would use, but it worked for Berry's record, which was released as the B-side to a version of \"You Are My Sunshine\", and became a minor local hit:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Louie Louie\"]\n\nBy this time, Berry had left Modern Records, and \"Louie Louie\" was on a small label, Flip Records. Berry was twenty-one, he'd been a professional musician since he was sixteen and was thinking of getting married, and he was making so little money from his music that he took a day job, working at a record-pressing plant, smashing returned records. When \"Louie Louie\" started getting played on local radio, people started giving him a hard time at work, asking why he needed that job when he had a hit record, not understanding that he was making no money from it. He ended up being treated so badly that he quit that job\n\nAnd Flip Records started pressuring him to make follow-ups to \"Louie Louie\" rather than do anything new. He did come up with a great follow-up, \"Have Love Will Travel\", but that wasn't a hit:\n\n[Excerpt: Richard Berry and the Pharaohs, \"Have Love Will Travel\"]\n\nHe got a few big gigs for a while off the back of his local hit, but he ended up working at the docks with his father -- but he eventually had to quit that because his disability made it impossible for him to do it. In 1959, in order to pay for his wedding, he sold his songwriting rights to \"Louie Louie\" and several of his other songs to the owner of Flip Records, for $750 -- he wanted to hold out for a full thousand, but he ended up settling for a lower amount. From that point on, he would still get paid his BMI royalties when the song was played on the radio -- you couldn't sell those rights -- but he wouldn't receive anything from record sales or sheet music sales, or use in films, or anything like that.\n\nBut that didn't matter. A song like \"Louie Louie\", a three-chord B-side to a flop single from two years earlier, was hardly going to earn any real money, and seven hundred and fifty dollars was a lot of money. Berry was a working man who needed money, and anyway he was moving into soul music. \"Louie Louie\" was just another song he'd written, no more important than \"Look Out Miss James\" or \"Rockin' Man\", and while R&B fans in LA loved it (if you listen to the later version by the Beach Boys, or to Frank Zappa's riffs on the song, you can tell they grew up listening to Berry's original, not the later versions) it wasn't going to ever be heard outside those people.\n\nAnd that would have been true, if it hadn't been for Ron Holden.\n\nWe've not talked about the Pacific Northwest's music scene in the podcast so far, but it had one of the most vibrant and interesting music scenes in the US in the late fifties and early sixties, and much of the music that gets labelled garage rock or frat rock comes from that area. The closest parallel I can think of is Liverpool -- another place where mostly-white musicians were performing their own versions of music made by Black musicians, and performing it on electric guitars. But anyone who became big from the area immediately moved somewhere else and became \"an LA musician\" or \"a New York musician\", and the scene as a whole has never really had the attention it deserves.\n\nRon Holden was one of the few Black musicians in that scene. In fact, he was a second-generation musician -- his father, Oscar Holden, was known as \"the father of Seattle jazz\", and had played with both Louis Armstrong and Jelly Roll Morton. Ron Holden led the most popular band in the Seattle area, the Thunderbirds, and in 1960, he had a top ten hit with a song called \"Love You So\":\n\n[Excerpt: Ron Holden, \"Love You So\"]\n\nHe didn't have any follow-up hits, but as every musician from Seattle who had any success did, he moved away. He moved to LA, where he signed to Keen Records, where he recorded an entire album of songs written and produced by Keen's new staff producer Bruce Johnston, including \"Gee, But I'm Lonesome\", a song which was coincidentally also recorded around that time by Richard Berry's old collaborators the Blossoms:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nHolden was also the MC for the Ritchie Valens Memorial Concert which was the Beach Boys' first major professional live performance.\n\nBut before he left Seattle, he had introduced \"Louie Louie\" to the music scene there -- he'd heard it on the radio in 1957 and worked up an arrangement with his band, and it had been a highlight of his shows. Once he left the city, so he wasn't performing the song there, all the white bands in Seattle, and in nearby Tacoma, picked up on the song and added Holden's arrangement of the song to their own sets.\n\nHolden -- or rather his saxophone player Carlos Ward, who did the Thunderbirds' arrangements -- had made a crucial change to \"Louie Louie\", one that made it simpler to play on the guitar, and thus suitable for the guitar-heavy music that was starting to predominate in the Pacific Northwest. Remember that Richard Berry had that second-inversion major seventh chord in there?\n\n[Excerpt: \"Louie Louie\" chords, piano]\n\nWard changed that chord for a simpler minor V chord, just flattening the third so there was no clash there:\n\n[Excerpt: \"Louie Louie\" chords, Pacific Northwest version]\n\nThat would be how almost every version of \"Louie Louie\" from this point on would be performed, because it was how they played it in the Pacific Northwest, because it was how Ron Holden and the Thunderbirds played it, and few of those bands had heard Richard Berry's original record, just Ron Holden's live performances of the song.\n\nBut one band who based their version on Holden's did listen to the original record -- once Holden had brought the song to their attention. The Wailers -- who are often referred to as \"the Fabulous Wailers\" to distinguish them from Bob Marley's later, more famous group -- were a group from Tacoma, which had a strong instrumental guitar band scene -- most famously, the Ventures came from Tacoma, and a lot of the bands in the area sounded like that.\n\nIn 1959, the Wailers recorded a self-penned instrumental, \"Tall Cool One\", which made the top forty:\n\n[Excerpt: The Wailers, \"Tall Cool One\"]\n\nThey didn't have any other hits, but soon after recording that, they got in a local singer, Rockin Robin Roberts, who became one of the band's three lead singers. The group had a residence at a local venue, the Spanish Castle, and a live recording of one of their sets there, released as the \"Live at the Castle\" album, shows that they were a hugely exciting live band:\n\n[Excerpt: The Fabulous Wailers, \"Since You Been Gone\"]\n\nThe shows at that venue were so good that several years later one of the regular audience members, Jimi Hendrix, would commemorate them in the song \"Spanish Castle Magic\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Spanish Castle Magic\"]\n\nBut it was their version of \"Louie Louie\" that became the template for almost every version that ever followed. For contractual reasons, it was released as a Rockin' Robin Roberts solo record, but it was the full Wailers playing on the track. No-one else in the Pacific Northwest knew what the lyrics were -- they'd all learned it from Ron Holden's live performances, but Roberts had actually tracked down a copy of the Richard Berry record and learned the words. Which, if you look at what happened later, is rather ironic.\n\nTheir version of the song came out on their own label, and had few sales outside their home area, but it would be one of the most influential records ever, because everyone else in the Pacific Northwest started copying their version, right down to Roberts' ad-libbed shout as they go into the guitar solo:\n\n[Excerpt: Rockin' Robin Roberts, \"Louie Louie\"]\n\nThe Wailers struggled on for a few more years, but never had any more commercial success. Rockin' Robin Roberts went on to become an associate professor of biochemistry, before dying far too young in a car crash in 1967.\n\nBut while their version of \"Louie Louie\" wasn't a hit, a few copies made their way a couple of hours' drive south, to Oregon. Here the story becomes a little difficult, because different people had different recollections of what happened. I'm going to tell one version of the story, but there are others.\n\nThe story goes that one copy made its way into a jukebox at a club called the Pypo Club, in Seaside, Oregon, a club frequented by surfers. And one day in the early sixties -- people seem to disagree whether it was summer 1961 or 62, two local bands played that club. During the intermission, the audience danced to the music on the jukebox -- indeed, they danced to just one record on the jukebox, over and over. They just kept playing \"Louie Louie\" by Rockin' Robin Roberts, no other records.\n\nBoth bands immediately added the song to their sets, and it became a highlight of both band's shows.\n\nBy far the bigger of the two bands was Paul Revere and the Raiders. The Raiders actually came from Idaho, and had had a top forty hit with \"Like, Long Hair\" a novelty surf-rock version of a Rachmaninoff piece that Kim Fowley had produced:\n\n[Excerpt: Paul Revere and the Raiders, \"Like, Long Hair\"]\n\nBut their career had stalled and they had moved to Oregon, because Revere, the group's piano player and leader, had been drafted, and while he was allowed not to serve in the military because of his Mennonite faith, he had to do community service work there for two years instead.\n\nThe Raiders were undoubtedly the best and most popular band in the Oregon area at the time, and their showmanship was on a whole other level from any other band -- they were one of the first bands to smash their instruments on stage, except they weren't smashing guitars -- Revere would buy cheap second-hand pianos and smash *those* on stage.\n\nA local DJ, Roger Hart, had become the group's manager, and he was going to start up his own label, and he wanted them to record \"Louie Louie\" as the label's first single. Revere wasn't keen -- he didn't like the song much, but Roger Hart insisted. He was sure it could be the hit that would restore the Raiders to the charts. So in April 1963, Paul Revere and the Raiders went into Northwest Recorders in Portland and recorded this:\n\n[Excerpt: Paul Revere and the Raiders, \"Louie Louie\"]\n\nHart paid for the recording session and put the single out on his small label, Sande. It was soon picked up by Columbia Records, who put it out nationally. It started to get a bit of airplay, and started rising up the charts -- it didn't break the Hot One Hundred straight away, but it was clearly heading in the right direction.\n\nThe Raiders signed to Columbia, and with Hart as their manager and occasional songwriter, and Terry Melcher as their producer, they became one of the biggest bands in the US, and had a string of hits stretching from 1965 to 1971. We won't be doing a full episode on them, but they became an integral part of the LA music scene in the sixties, and they're sure to turn up as background characters in future episodes.\n\nBut note that I said their run of hits started in 1965. Because there had been two bands playing the Pypo Club, and they had both added \"Louie Louie\" to their set. And they'd both recorded versions of it in the same studio, in the same week.\n\nThe Kingsmen were... not as big as the Raiders. They were a bunch of teenagers who had formed a group a few years earlier, and even on a good day they were at best the second-best band in Portland, with the Raiders far, far, ahead. The core of the group was based around the friendship of Jack Ely, the group's lead singer, and Lynn Easton, the drummer, whose parents were friends -- both families were Christian Scientists and actively involved in their local church -- and they had grown up together. Ely's parents didn't encourage the duo's music -- Ely's biological father had been a professional singer, but when the father died and Ely's mother remarried, his stepfather didn't want him to have anything to do with music -- but Easton's did, and Easton's father became the group's manager. Easton's mother even went to the local courthouse to register the group's name for them.\n\nEaston's father was replaced as their manager by Ken Chase, the owner of the radio station where Roger Hart was the most popular DJ, and they started pressuring him to make a record with them. Eventually he did -- and he booked them into the same studio as the Raiders, the same week. Different people have different stories about which was first and which was second, but there is no doubt that they were only two days or so apart. And there's also no doubt that they were very different in terms of professionalism.\n\nThe Kingsmen did their best to copy the Rockin' Robin Roberts version, right down to his shout of \"Let's give it to them right now!\" but it was shockingly amateurish. The night before, they'd done a live show which consisted of a single ninety-minute-long performance of \"Louie Louie\" with no breaks, and Ely's voice was shot. The mic was positioned too high for him and he had to strain his throat, and his braces were also making him slur the words. At one point early in the song, Easton clicks his drumsticks together by accident, and yells an obscenity loud enough to be captured on the tape:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nAfter the solo, Ely comes back in, wrongly thinks he's come in in the wrong place, and stops, leaving Easton to quickly improvise a drum fill before they pick up again:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThe difference with the Raiders can be summed up most succinctly by what happened next -- the Raiders' manager paid for their session, but when the engineer at this session asked who was paying, and the Kingsmen pointed to their manager, he said \"No, I'm not. I've not got any money\", and the members of the group had to dig through their pockets to get together the fifty dollars themselves.\n\nIt's incompetent teenagers, who have no idea what they're doing, and it would become one of the most important records of all time.\n\nBut when it was released... well, it was the second-best version of \"Louie Louie\" recorded in Portland that week, so while the Raiders were selling thousands, the Kingsmen only sold a couple of hundred copies. Jerry Dennon, the owner of the tiny label that released it, tried to get it picked up by Capitol Records, who rejected it saying it was the worst garbage they'd ever heard. He also sent it out to bigger indie labels, like Scepter, who stuck it in a drawer and forgot about it.\n\nAnd that was basically the end of the Kingsmen. In August, Easton decided that he was going to stop being the drummer and be the lead singer instead -- he told Ely that Ely was going to be the drummer now. The other band members were astonished, because Easton couldn't sing and Ely couldn't play the drums, and they said that wasn't going to happen. Easton then played his trump card -- when his mother had registered the band name, she'd registered it just in his name. If they didn't do things his way, they weren't going to be in the Kingsmen any more, and he was going to find new Kingsmen to replace them. Ely and a couple of other members quit, and that was the end of the group.\n\nAnd then, in October, as the Raiders' record was still slowly making some national progress, Arnie \"Woo Woo\" Ginsburg heard the Kingsmen's version. This Arnie Ginsburg isn't the Arnie Ginsburg we heard about in the episode on \"LSD-25\", and who we'll be meeting again briefly next week. This one was a DJ in Boston, and the most popular DJ in the area. And he *hated* the record.\n\nHe hated it so much, he played it on his show, because he had a slot called The Worst Record Of The Week. He played it twice, and the next day, he had fifty calls from record shops -- customers had been coming in wanting to know where they could get \"Louie Louie\". Marv Schlachter at Scepter heard from the distributors how well the record was doing and picked it up for national distribution on their Wand subsidiary. In its first week on Wand, the single sold twenty-one thousand copies in Boston.\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nFor a few weeks, the Raiders and the Kingsmen both hung around the \"bubbling under\" section of the charts -- the Raiders selling and being played on the West Coast, and the Kingsmen on the East. By the ninth of November, the Kingsmen were at eighty-three in the charts, while the Raiders were at 108. By December the fourteenth, the Kingsmen were at number two, behind \"Dominique\" by the Singing Nun, a Belgian nun singing in French:\n\n[Excerpt: The Singing Nun, \"Dominique\"]\n\nYou might think that there could not be two more different records at the top of the charts, and you'd mostly be right, but there was one thing that linked them -- the Singing Nun's song had a chorus that went \"Dominique, nique, nique\", and one of the reasons it had become popular was that in France, but not in Belgium where she lived, \"nique\" was a swear word, an expletive meaning \"to fornicate\", roughly the French equivalent of the word that Lynn Easton shouted when he clicked his drumsticks together.\n\nSo a big part of its initial popularity was because of people finding an obscene meaning in the lyrics that simply wasn't there.\n\nAnd that was true of \"Louie Louie\" as well. Jack Ely had slurred the lyrics so badly that people started imagining that there must be dirty words in there, because otherwise why wouldn't he be singing it clearly? People started passing notes in schools and colleges, saying what the lyrics \"really\" were -- apparently you had to play the single at 33RPM to hear them properly.\n\nThese lyrics never made any actual sense, but they were things like \"We'll take her and park all alone/She's never a girl I lay at home/At night at ten I lay her again\" and \"on that chair I'll lay her there/I felt my boner in her hair\" -- the kind of thing, in short, that kids make up all the time.\n\nSo obviously, they were reported to the FBI.\n\nAnd obviously the FBI spent two years investigating the song:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThey checked it anyway, of course, and reported \"A comparison was made of the recording on the tape described above as specimen K1 with the recording on the disk, submitted by the Detroit Office and described as specimen Q3 in this case and no audible differences were noted.\"\n\nOn the FBI website, you can read 119 pages of memos from FBI agents (with various bits blacked out for security reasons), and read about them shipping copies of \"Louie Louie\" to labs (under special seal, in case they'd be violating laws about transferring obscene material across state lines and breaking the very law they were investigating), listening to the record at 33, 45, and 78 RPM and trying to see if they could make out the lyrics, comparing them to the published words, to the various samizdat versions being shared by kids, and to Berry's record, and destroying the records after listening. They interviewed members of the Kingsmen and DJs, and they went to Scepter Records to get a copy of the original master tape, which they were surprised to discover was mono so left them no way of isolating the vocals.\n\nMeanwhile they were getting letters from concerned citizens doing things like playing the single at 78 RPM, making a tape recording of that at double speed, and then slowing it down, saying \"at that speed the obscene articulation is clearer\".\n\nThis went on for two years. At no point does any of these highly trained FBI agents listening over and over to \"Louie Louie\" at different speeds appear to have heard Lynn Easton's yelled expletive, which unlike all these other things is actually on the record.\n\nMeanwhile, the Kingsmen went on to have one more top twenty hit, with only Easton and the lead guitarist left of the original lineup, and then continued to tour playing their hit. Jack Ely toured solo playing his one hit. The most successful member of the group was Don Gallucci, the keyboard player, who formed Don and the Goodtimes, who had a minor hit with \"I Could Be So Good To You\":\n\n[Excerpt: Don and the Goodtimes, \"I Could Be So Good To You\"]\n\nGallucci went on to produce Fun House for the Stooges, who would also of course later record their own version of \"Louie Louie\", in which they sung those dirty lyrics:\n\n[Excerpt: the Stooges, \"Louie Louie\"]\n\nBut then, nearly everyone did a version of the song -- there are at least two thousand recordings of it. But, other than from radio play, Richard Berry was receiving no money from any of these. After his marriage ended, he'd quit working as a musician to raise his daughter, gone back to school, and taken a day job -- but then he'd been further disabled in an accident and had ended up on welfare, while his song was making millions for the people who'd bought it from him for seven hundred and fifty dollars. He didn't even understand why the song was popular -- the only version that sounded like the record he'd wanted to make was the one by Barry White, another ex-Jefferson High student, who'd added the Latin percussion Berry had wanted to put on before he'd been told to make it more R&B.\n\nBut in the eighties, things started to change. Some radio stations started doing all-Louie weekends, where for a whole weekend they'd just play different versions of the song, never repeating one. One of those stations invited Berry to do a live performance of the song with Jack Ely, backed by Bo Diddley's former rhythm player Lady Bo and her band:\n\n[Excerpt: Richard Berry and Jack Ely, \"Louie Louie\"]\n\nThat was the first time Berry ever met the man who'd made his song famous. Soon after that, Berry's old friend Darlene Love, who had been one of the Dreamers who'd sung with Berry back in the fifties, introduced him to the man who would change his life -- Chuck Rubin. Rubin had, in the seventies, been the manager of the blues singer Wilbur Harrison, and had realised that not only was Harrison not getting any money from his old recordings, nor were many other Black musicians. He'd seen a business opportunity, and had started a company that helped get those artists what they deserved -- along with giving himself fifty percent of whatever they made. Which seems like a lot, but many people, including Berry, figured that fifty percent of a fortune was better than the hundred percent of nothing they were currently getting.\n\nMost of these artists had signed legally valid bad deals, which meant that while they were morally entitled to something, they weren't legally entitled. But Rubin had a way of getting round that, and he did the same thing with Berry that he did with many other people. He kept starting lawsuits that put off potential business partners, and in 1986 a company wanted to use \"Louie Louie\" in a TV advertising campaign that would earn huge amounts of money for its owners -- but they didn't want to use a song that was tied up in litigation. If the legal problems weren't sorted, they'd just use \"Wild Thing\" instead. In order to make sure the commercials used \"Louie Louie\", the song's owner gave Berry half the publishing rights and full songwriting rights (which Berry then split with Rubin). He didn't get any back payment from what the song had already earned, but he went from getting $240 a month on welfare in 1985, to making $160,000 from \"Louie Louie\" in 1989 alone.\n\nRichard Berry died in 1997, happy, respected, and wealthy. In the last decade of his life people started to explore his music again, and give him some of the credit he was due. Jack Ely continued performing \"Louie Louie\" until his death in 2015. Lynn Easton quit music in 1968, giving the Kingsmen's name to the lead guitarist Mike Mitchell, the only other original member still in the band. Easton died in April this year -- no-one's sure what of, as his religious beliefs meant he never saw a doctor. Mitchell's lineup of Kingsmen continued to perform until covid happened, and will presumably do so again once the pandemic is over. And somewhere out there, whenever you're listening to this, someone will be playing \"duh-duh-duh, duh-duh, duh-duh-duh\"",
  "enclosure": "",
  "itunes:summary": "Episode 106 of A History of Rock Music in Five Hundred Songs looks at \"Louie Louie\" by the Kingsmen, and the story of how a band that had already split up accidentally had one of the biggest hits of the sixties and sparked a two-year FBI investigation.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"It's My Party\" by Lesley Gore.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe single biggest resource I used in this episode was Dave Marsh's book on Louie Louie.\n\nInformation on Richard Berry also came from Marv Goldberg's page, specifically his articles on the Flairs and Arthur Lee Maye and the Crowns.\n\nThis academic paper on the song is where I learned what the chord Richard Berry uses instead of the V is.\n\nThe Coasters by Bill Millar also had some information about Berry.\n\nLove That Louie: The Louie Louie Files has the versions of the song by the Kingsmen, Berry, Rockin' Robin Roberts, and Paul Revere and the Raiders, plus many more, and also has the pre-\"Louie\" \"Havana Moon\" and \"El Loco Cha Cha Cha\"\n\nThe Ultimate Flairs has twenty-nine tracks by the Flairs under various names.\n\nYama Yama! The Modern Recordings 1954-56 contains twenty-eight tracks Richard Berry recorded for Modern Records in the mid-fifties, including the Etta James duets.\n\nAnd&nbsp;Have \"Louie\" Will Travel collects Berry's post-Modern recordings, including \"Louie Louie\" itself.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript\n\nToday we're going to look at what is arguably the most important three-chord rock and roll record ever made, a song written by someone who's been a bit-part player in many episodes so far, but who never had any success with it himself, and performed by a band that had split up before the record started to chart. We're going to look at how a minor LA R&B hit was picked up by garage rock bands in the Pacific Northwest and sparked a two-and-a-half-year FBI investigation, and was recorded by everyone from Barry White to Iggy Pop, from Motorhead to the Beach Boys, from Julie London to Frank Zappa. We're going to look at \"Louie Louie\" by the Kingsmen:\n\n[Excerpt: The Kingsmen, \"Louie Louie\"]\n\nThe story of \"Louie Louie\" begins with Richard Berry. We've seen Berry pop up here and there in several episodes -- most recently in the episode on the Crystals, where we looked at how he'd been involved in the early career of the Blossoms, but the only time he's been a signficant part of the story was in the episode on \"The Wallflower\", back in March 2019, and even there he wasn't the focus of the episode, so I should start by talking about his career. Some of this will be familiar from other episodes from a year or two ago, but here we're looking at Berry specifically.\n\nRichard Berry was one of the many, many, great musicians of the fifties to go to Jefferson High School in Los Angeles, and was very involved in music at that school. When he arrived in the school, he had an aggressive attitude, formed by a need to defend himself -- he walked with a limp, and had first started playing music at a camp for disabled kids, and he didn't want people to think he was soft because of his disability. But as soon as he found out that you had to behave well in order to join the school a capella choir he became a changed character -- he needed to be involved in music.\n\nAnd he soon was. He joined a group named The Flamingos, who were all students at Jefferson and proteges of Jesse Belvin, who was a couple of years older than them. That group consisted of Cornel",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 106 of A History of Rock Music in Five Hundred Songs looks at \"Louie Louie\" by the Kingsmen, and the story of how a band that had already split up accidentally had one of the biggest hits of the sixties and sparked a two-year FBI investigation.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have an eight-minute bonus episode available, on \"It's My Party\" by Lesley Gore.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe single biggest resource I used in this episode was Dave Marsh's book on Louie Louie.\n\nInformation on Richard Berry also came from Marv Goldberg's page, specifically his articles on",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}