{
  "title": "Quantum Sensors Could Quell EV Range Anxiety",
  "link": "https://spectrum.ieee.org/quantum-sensor-range-anxiety",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/dashboard-lights-reading-118-miles-range-with-battery-symbol.jpg?id=31728149&width=1200&height=800&coordinates=0%2C104%2C0%2C105\"/><br/><br/><p>A major concern when it comes to electric vehicles is <u><a href=\"https://spectrum.ieee.org/new-ev-prototype-leaves-range-anxiety-in-the-dust\" target=\"_self\">how far their batteries will let them drive</a></u>. Now, scientists in Japan reveal that diamond quantum sensors can help improve electric-vehicle battery-monitoring accuracy by a hundredfold or more, potentially significantly boosting their driving range.</p><p>Electric vehicles monitor how much charge is left in their batteries, and their remaining driving range, by analyzing the batteries’ current output. Although their average battery-current output is roughly 10 amperes, it can reach as much as several hundred amperes.</p><p>Given the wide range of current strengths that electric-vehicle battery sensors have to analyze, they are typically limited to an accuracy of 1 ampere. This inaccuracy leads to an ambiguity of about 10 percent in battery-charge estimates, rendering battery usage inefficient.</p><p>Now, in a new study, researchers in Japan reveal that diamond quantum sensors can work over a range of more than 1,000 amperes while also measuring current strengths with an accuracy of 10 milliamperes. This suggests they can reduce the ambiguity in electric-vehicle battery-charge estimates from 10 percent to 1 percent or even 0.11 percent.</p><p>“We developed the world’s first diamond quantum sensor for electric-vehicle batteries,” says study corresponding author Mutsuko Hatano, an electrical engineer at the Tokyo Institute of Technology. “By developing a new sensor with high performance and improved accuracy, we can make efficient use of the batteries.”</p><p>Quantum technology depends on quantum effects that can emerge because the universe can become quite fuzzy at its very smallest levels. For instance, the quantum effect known as <u><a href=\"https://spectrum.ieee.org/longlasting-qubits\" target=\"_self\">superposition</a></u> enables atoms and other building blocks of the cosmos to essentially exist in two or more places or states at the same time.</p><p>These <u><a href=\"https://spectrum.ieee.org/fault-tolerant-quantum-computing\" target=\"_self\">quantum effects are very fragile to outside interference</a></u>. However, quantum sensors capitalize on this fact to achieve extraordinary sensitivity to any disturbances in their surroundings. For example, scientists are currently developing quantum sensors that can <u><a href=\"https://spectrum.ieee.org/quantum-sensors-gravity-birmingham\" target=\"_self\">detect features hidden underground with unprecedented detail</a></u>.</p><p>A common quantum-sensor platform uses microscopic artificial diamonds with defects within them, in which a carbon atom is replaced with a nitrogen atom and the adjacent carbon atom is missing. When these <u><a href=\"https://spectrum.ieee.org/singleatom-sensor-offers-new-view-of-the-nanoscale\" target=\"_self\">nitrogen-vacancy (NV) centers</a></u> are illuminated with green light, they fluoresce red. Magnetic, thermal, and other disturbances can alter this response, allowing NV centers to help serve as sensors.</p><p>In the new study, the researchers experimented with diamond quantum sensors, each a 2- by 2-millimeter square that is 1 mm thick. They placed a sensor on either side of the busbar, the conductive bar that current from a battery flows through in the junction box. By placing two sensors far apart from one another instead of close together and then comparing their data to see what they had in common, the scientists could identify and eliminate false readings from each sensor that came from environmental noise.</p><p>These sensors could detect battery currents as small as 10 milliamperes over temperatures from -40 to +85 °C, a range one sees in general vehicle applications, Hatano says. The sensors could also help monitor temperature, which can help improve battery control, she adds.</p><p>The researchers note that the ability of these sensors to work at roughly 1,000 amperes will be needed as <a href=\"https://spectrum.ieee.org/solid-state-battery\" target=\"_self\">all-solid-state batteries</a> promote higher power and higher capacities in electric vehicles. This capability will also find use when new <a href=\"https://spectrum.ieee.org/ev-charging-800-volt\" target=\"_self\">fast chargers</a> arrive, Hatano notes.</p><p>These findings suggest diamond quantum sensors can extend the driving range of electric vehicles by 10 percent. Alternatively, they could help keep the driving range the same but decrease battery weight by 10 percent. This would reduce the energy needed to run each vehicle by 3.5 percent and the energy needed to produce the vehicles by 5 percent. Given an estimated 20 million new electric vehicles worldwide by 2030, such reductions would correspond to a 0.2 percent decrease in the global transportation sector’s carbon dioxide emissions, the researchers say.</p><p>Hatano, along with study lead author Yuji Hatano and their colleagues, detailed <u><a href=\"https://www.nature.com/articles/s41598-022-18106-x\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a></u> online 6 September in the journal <em>Scientific Reports</em>.</p>",
  "pubDate": "Fri, 16 Sep 2022 16:22:58 +0000",
  "guid": "https://spectrum.ieee.org/quantum-sensor-range-anxiety",
  "category": [
    "Nitrogen vacancy defect",
    "Diamond",
    "Range anxiety",
    "Electric vehicles",
    "Batteries",
    "Carbon emissions",
    "Quantum sensor"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}