{
  "title": "Not frequentist enough.",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/05/not-frequentist-enough/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/05/not-frequentist-enough/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Wed, 05 Oct 2022 13:58:00 +0000",
  "category": [
    "Bayesian Statistics",
    "Decision Theory",
    "Miscellaneous Statistics",
    "Political Science",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47932",
  "description": "I think that many mistakes in applied statistics could be avoided if people were to think in a more frequentist way. Look at it this way: In the usual way of thinking, you apply a statistical procedure to the data, &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/05/not-frequentist-enough/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>I think that many mistakes in applied statistics could be avoided if people were to think in a more frequentist way.</p>\n<p>Look at it this way:</p>\n<p>In <strong>the usual way of thinking</strong>, you apply a statistical procedure to the data, and if the result reaches some statistical-significance threshold, and you get similar results from a robustness study, changing some things around, then you&#8217;ve made a discovery.</p>\n<p>In <strong>the frequentist way of thinking</strong>, you consider your entire procedure  (all the steps above) as a single unit, and you consider what would happen if you apply this procedure to a long series of similar problems.</p>\n<p>The first thing to recognize is that <em>the frequentist way of thinking requires extra effort</em>:  you need to define this potential series of similar problems and then either do some mathematical analysis or, more likely, set up a simulation on the computer.</p>\n<p>The second thing to recognize is that, just because a statistical method is defined in a &#8220;classical&#8221; or hypothesis-testing framework, that doesn&#8217;t make it a &#8220;frequentist&#8221; method.  For a method to be frequentist, it needs to defined relative to some frequency calibration.  A p-value or a confidence interval, by itself, is not frequentist; for it to be frequentist there needs to be some model of what would be done in a family of replications of the procedure.  This is the point that Loken and I make in section 1.2 of our <a href=\"http://www.stat.columbia.edu/~gelman/research/unpublished/forking.pdf\">forking paths paper</a>.</p>\n<p>In the usual way of teaching statistics, the extra effort required by the frequentist approach is not clear, for two reasons.  First, textbooks present the general theory in the context of simple examples such as linear models with no selection, where there are simple analytic solutions.  Second, textbook examples of statistical theory typically start with an assumed probability model for the data, in which case most of the hard work has already been done.  The model is just <em>there</em>, postulated; it doesn&#8217;t look like a set of &#8220;assumptions&#8221; at all.  It&#8217;s <a href=\"https://statmodeling.stat.columbia.edu/2009/05/24/handy_statistic/\">the camel that is the likelihood</a> (although, strictly speaking, the likelihood is not the data model; additional assumptions are required to go from an (unnormalized) likelihood function to get a generative model for the data).</p>\n<p><strong>An example</strong></p>\n<p>To demonstrate this point, I&#8217;ll use an example from a recent article, <a href=\"http://www.stat.columbia.edu/~gelman/research/published/causal_paths_3.pdf\">Criticism as asynchronous collaboration: An example from social science research</a>, where I discussed a published data analysis that claimed to show that &#8220;politicians winning a close election live 5–10 years longer than candidates who lose,&#8221; with this claim being based on a point estimate from a few hundred elections:  the estimate was statistically significantly different from zero and similar estimates were produced in a robustness study in which various aspects of the model were tweaked.  The published analysis was done using what I describe above as &#8220;the usual way of thinking.&#8221;</p>\n<p>Now let&#8217;s consider the frequentist approach.  We have to make some assumptions.  Suppose you start with the assumption that losing an election has the effect of increasing your lifespan by X years, where X has some value between -1 and 1.  (From an epidemiological point of view, an effect of 1 year is large, really on the very high end of what could be expected as an average treatment effect of something as indirect as winning or losing an election.)  From there you can work out what might happen from a few hundred elections, and you&#8217;ll see that any estimate will be super noisy, to the extent that if you fit a model and select on statistical significance, you&#8217;ll get an estimated effect that&#8217;s much higher than the real effect (a large type M error, as we say).  You&#8217;ll also see that, if you want to get a large effect (large effects are exciting, right!) then you&#8217;ll want the standard error of your estimate to be larger, and you can get this by the simple expedient of predicting future length of life without including current age as a predictor.  For more discussion of all these issues, see section 4 of the <a href=\"http://www.stat.columbia.edu/~gelman/research/published/causal_paths_3.pdf\">linked article</a>.  My point here is that whatever analysis we do, there is a benefit to thinking about it from a frequentist perspective&#8212;what would things look like if the procedure were replied repeatedly to many datasets?&#8212;rather than to fixate on the results of the analysis as applied to the data at hand.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/05/not-frequentist-enough/feed/",
  "slash:comments": 4
}