{
  "title": "TU101: Treating Attachment Disruptions in Adults With David Elliott (Replay)",
  "link": "https://therapistuncensored.com/episodes/tu101-treating-attachment-disruptions-in-adults-with-david-elliott-replay/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu101-treating-attachment-disruptions-in-adults-with-david-elliott-replay",
  "pubDate": "Sun, 14 Jul 2019 08:57:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=7303",
  "description": "We knew we had to interview Dr. Elliott upon finding his book, Attachment Disturbances in Adults, Treatment for Comprehensive Repair(2016). It immediately became Sue’s current favorite read and that is saying a lot!\n\nWe cover quite a lot in this podcast, especially about treatment, but if that still isn’t enough, these show notes are PACKED with PDF’s of great material offered by Dr. Elliott! Below you will find 4 full PDF handouts about the salient ideas of their synthesis of treatment for adults with attachment disruptions.\n\nIn today’s episode you will hear about why attachment matters, background thoughts on insecurity and prevalence, brand new (to the US) and updated attachment research and then we mostly focus on how to apply all this knowledge with clients with attachment issues, and ourselves.\n\nDr. Elliott introduces our audience to the 3 Pillars of Comprehensive Treatment: Ideal Parent Protocol, Metacognition and Fostering Collaborative Capacity. While he touches on them all, please download the 4 PDF attachments provided below, and start by reviewing the Overview. If for any reason you have trouble getting them, contact us and we will shoot them over to you!\nDr David Elliott’s Bio:\nDr. Elliott received his Ph.D. in Psychology in 1989 from Harvard University. His clinical training while at Harvard included externships at the Tufts University Counseling Center, the Outpatient Psychiatry Clinic of St. Elizabeth’s Medical Center in Brighton, Massachusetts, and a clinical psychology internship at McLean Hospital, the psychiatric teaching hospital of Harvard Medical School. He also completed a post-doctoral fellowship at McLean Hospital, where he worked on the Adolescent and Family Treatment Unit and at the hospital’s mental health outpatient clinic. He was licensed as a Psychologist in Massachusetts in 1990, and in Rhode Island in 1993.\n\nRecognizing from an early age that there are many dimensions to human experience, any and all of which can contribute to well-being or to difficulty, Dr. Elliott has maintained a commitment to learning and understanding the whole range of human possibility — from the deepest confusions and struggles of psychosis, to the patterns of personality that create personal and relational conflicts, to the development of the self in ways that promote both independence and intimacy, and to higher levels of growth that allow for flourishing and even a recognition of oneself as beyond the limits of the personal self.\nFour PDFs\n\n \tOverview of the Three Pillars Model of Attachment Treatment (Brown & Elliott, 2016)\n \tThe Five Primary Conditions that Promote Secure Attachment (Brown & Elliott, 2016)\n \tLevels of Metacognitive Skills (Brown & Elliott, 2016)\n \tFostering Collaborative Capacity and Behavior (Brown & Elliott, 2016)\n\nAdditional resources for this episode:\n\n \tDaniel Brown, co-author of Attachment Disturbances in Adults This is his current website, which focuses on his meditation and spiritual development activities.\n \tAttachment Disturbances in Adults Treatment for Comprehensive Repair (2016) Daniel Brown andDavid Elliott \n \tClinical Application of the Adult Attachment Interview Edited by Howard Steele and Mariam Steele Our favorite clinical reference for those that want to learn much more deeply about using the AAI to treat attachment and learn about its usefulness with various populations.\n \tVideo of Strange Situation to familiarize yourself with Mary Ainsworth and later Mary Main’s phenomenal work.\n \tThese and other resources have been collected for you on our Resources page!\n\nIf you appreciate this work you can help it continue by becoming a Patron – ie. a super fan, or what we call Neuronerds. Get access to a private community, direct access to us and more content  Click here to sign up for as little as $5 a month.\n\nYou can also help us by subscribing on Apple Podcast, Google Podcast, Spotify or Podbean to name a few and by leaving a review so others can discove...",
  "enclosure": "",
  "itunes:subtitle": "We knew we had to interview Dr. Elliott upon finding his book, Attachment Disturbances in Adults, Treatment for Comprehensive Repair(2016). It immediately became Sue’s current favorite read and that is saying a lot! -",
  "itunes:summary": "We talk to Dr David Elliott about treatment for adults with attachment disruptions and much more! Check out the show notes for excellent resources!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "49:01"
}