{
  "title": "China, Australia give equipment to Solomon Islands police as rivalry escalates",
  "description": "Solomon Islands police are under equipped but their weapons have previously been stolen and used in conflicts.",
  "link": "https://www.rfa.org/english/news/pacific/solomons-11042022133221.html",
  "guid": "https://www.rfa.org/english/news/pacific/solomons-11042022133221.html",
  "author": "By Gina Maka’a and Stephen Wright for BenarNews",
  "media:content": {
    "media:description": "Australian Federal Police Deputy Commissioner Lesa Gale, Australian High Commissioner Lachlan Strahan, Solomon Islands Prime Minister Manasseh Sogavare, and Solomon Islands Police Commissioner Mostyn Mangau (left to right) with Daniels Defense MK18 rifles gifted by Australia to the Solomon Islands police force, on November 2, 2022 in Honiara, the Solomon Islands capital.",
    "media:credit": "Australian High Commission handout"
  },
  "content:encoded": "\n        <p><span>China and U.S. ally Australia have donated weapons and vehicles to the Solomon Islands police, sparking criticism their rivalry could cause new instability in a South Pacific country that spiraled into chaos only two decades ago.</span></p>\n<figure>\n<figcaption></figcaption>\n</figure>\n<p><span>On Friday, China handed over two water cannon trucks, 30 motorbikes and 20 white utility vehicles emblazoned with the red China Aid logo. Two days earlier, Australia presented 60 MK18 rifles and 13 vehicles, some of which will be used in a new mobile protection unit for VIPs. Both countries also have been providing training in policing techniques</span>.</p>\n<figure><img alt=\"\" class=\"image-richtext image-inline\" height=\"\" src=\"https://www.benarnews.org/english/news/pacific/solomon-isands-weapons-11042022033133.html/policemanandvan.jpg/@@images/e8e804a3-8a60-4c41-ac42-6e81ff6ee6e3.jpeg\" width=\"\"/>\n<figcaption>Solomon Islands Prime Minister Manasseh Sogavare looks on as a member of China’s police liaison team talks at the handover ceremony for vehicles that China donated to Solomon Islands police force, on Nov. 4, 2022 in Honiara, the Solomon Islands capital. Credit:Gina Maka’a</figcaption>\n</figure>\n<p><span></span></p>\n<p><span>“It is clear Australia is anxious that if they do not supply guns then China will. Geopolitical interests have surpassed national interest in this country and it is a sad state of affairs,” said Solomon Islands opposition leader Matthew Wale.</span></p>\n<p><span>The country of some 700,000 people has become a hot spot for the U.S.-China rivalry in the Pacific. Prime Minister Manasseh Sogavare’s government switched its diplomatic recognition to China from Taiwan in 2019 and signed a secret security pact with Beijing earlier this year. China, along with countries such as Australia and Indonesia, is also helping to bankroll the Pacific Games in the capital Honiara next year.</span></p>\n<p><span>The new weapons have caused concern in the Solomon Islands and abroad. </span></p>\n<p><span>Several years of instability around the turn of the century, fueled by stolen police equipment, still looms large for Solomon Islanders, who call the period The Tensions. Corruption, ethnic strife and political divides made the country seem ungovernable and culminated in an Australian-led military intervention from 2003 until 2017.</span></p>\n<p></p>\n<figure><img alt=\"\" class=\"image-richtext image-inline\" src=\"https://www.benarnews.org/english/news/pacific/chinaaidcars.jpg/@@images/88019cce-2826-4cd0-8dd0-bb569b5fa0b3.jpeg\"/>\n<figcaption>Vehicles donated by China to the Solomon Islands police force are on display at a handover ceremony in the Solomon Islands capital Honiara on November 4, 2022. Photo: Gina Maka’a</figcaption>\n</figure>\n<p><span></span></p>\n<p><span>Sogavare, speaking at the ceremony for the handover of China’s equipment, said people who see a better equipped police force through a negative lens should consider that it has a responsibility to “protect the lives and welfare, liberty, property of all people in this country.” </span></p>\n<p><span>He said riots in Honiara in November last year – which torched the city’s Chinatown and were linked to the change of diplomatic recognition – and earlier public unrest, showed the consequences of a lack of police capacity. </span></p>\n<p><span>“We must have the capacity as our first line of defense and not depend on others,” Sogavare said.</span></p>\n<p><span>Mihai Sora, an analyst at Australia’s Lowy Institute and former diplomat in the Solomon Islands, said community concerns about the gifts of water cannon, high-powered rifles and vehicles are well founded.</span></p>\n<p><span>“There is a risk that the donated weapons and water cannons could be misused against protesters, further inflaming local tensions,” he said. </span></p>\n<p><span>It appears that Australia’s hand was forced as it tries to retain its relationship with the Solomon Islands police in the face of the government’s increasingly close police and security ties with China, Sora said.</span></p>\n<p></p>\n<figure><img alt=\"\" class=\"image-richtext image-inline\" height=\"\" src=\"https://www.benarnews.org/english/news/pacific/policecars.jpg/@@images/6d9c5f01-2940-4465-b3d4-c4949a94f529.jpeg\" width=\"\"/>\n<figcaption>Vehicles donated by Australia to the Solomon Islands police force on display at a handover ceremony in the Solomon Islands capital Honiara on November 2, 2022. Credit: Australian High Commission handout</figcaption>\n</figure>\n<p></p>\n<p><span>China’s ambassador to the Solomon Islands, Li Ming, said China’s donation of equipment is meant to improve the capacity of Solomon Islands police.</span></p>\n<p><span>“We are fully opposed to any geopolitical games. What we are doing is to provide necessary assistance to Solomon Islands’ government and people to help maintain the safety, security and public order of the country,” he said on Friday.</span></p>\n<p><span>Australia’s High Commission to the Solomon Islands said earlier in the week that there are “stringent” training and safeguards for the rifles that Australia has provided. </span></p>\n<p><span>The weapons are part of a police rearming that began in 2013 and would be used by a specialized police response team as a last-resort option only, it said.</span></p>\n<p><span>“In the wrong hands it will all go wrong, but the police do need equipment, and water cannons are better than bullets,” said Clive Moore, a University of Queensland professor who authored a Solomon Islands encyclopedia.</span></p>\n<p><span>“But every time this happens it moves the Solomons further away from unarmed community policing. It’s part of a drift that suits Sogavare,” he said.</span></p>\n<p><em><strong>BenarNews is an RFA-affiliated news service.</strong></em></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 13:33:14 -0400"
}