{
  "id": "yt:video:-wMU8vmfaYo",
  "yt:videoId": "-wMU8vmfaYo",
  "yt:channelId": "UCS0N5baNlQWJCUrhCEo8WlA",
  "title": "Why was Facebook down for five hours?",
  "link": "",
  "author": {
    "name": "Ben Eater",
    "uri": "https://www.youtube.com/channel/UCS0N5baNlQWJCUrhCEo8WlA"
  },
  "published": "2021-10-12T16:03:58+00:00",
  "updated": "2022-01-13T11:00:40+00:00",
  "media:group": {
    "media:title": "Why was Facebook down for five hours?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Facebook was down for five hours last week. What happened and what do DNS and BGP have to do with it?\n\nFacebook's explanation: https://engineering.fb.com/2021/10/05/networking-traffic/outage-details/\n\nSupport these videos on Patreon: https://www.patreon.com/beneater or https://eater.net/support for other ways to support.&#13;\n\n0:00 DNS\n7:13 Caching DNS\n10:34 Hop-by-hop routing\n14:07 Default-free routing\n18:28 Peering\n19:50 BGP\n26:08 The outage\n\n------------------&#13;\n&#13;\nSocial media:&#13;\nWebsite: https://www.eater.net&#13;\nTwitter: https://twitter.com/ben_eater&#13;\nPatreon: https://patreon.com/beneater&#13;\nReddit: https://www.reddit.com/r/beneater&#13;\n&#13;\nSpecial thanks to these supporters for making this video possible:\nAleksey Smolenchuk, Anders Carlsson, Andrew C. Young, Anson VanDoren, Anthanasius, anula, Armin Brauns, Ben, Ben Cochran, Ben Kamens, Ben Williams, Benny Olsson, Bill Cooksey, Binh Tran, Bouke Groenescheij, Bradley Pirtle, Bradley Stach, Bryan Brickman, Burt Humburg, Christopher Blackmon, Dale Andrew Darling, Daniel Jeppsson, Daniel Pink, Daniel Tang, Dave Burley, Dave Walter, David Clark, David Cox, David Dawkins, David House, David Sastre Medina, David Turner, David Worsham, Dean Bevan, Dean Winger, Dilip Gowda, Dissy, dko, Dmitry Guyvoronsky, Dušan Dželebdžić, Dzevad Trumic, Emilio Mendoza, Eric Dynowski, Erik Broeders, Eugene Bulkin, Evan Thayer, Eveli László, fisksvett, fxshlein, George Miroshnykov, Harry McDow, hotwire33, Ingo Eble, Ivan Sorokin, James Capuder, james schaefer, Jared Dziedzic, Jason DeStefano, Jason Dew, JavaXP, Jaxon Ketterman, Jay Binks, Jayne Gabriele, Jeremy, Jeremy Cole, Jesse Miller, Jim Kelly, Jim Knowler, Jim Van Meggelen, Joe Beda, Joe Pregracke, Joel Miller, John Fenwick, John Hamberger jn., John Meade, Jon Dugan, Jonn Miller, Joseph Portaro, Joshua King, Jurģis Brigmanis, Kai Wells, Kefen, Kenneth Christensen, Kitick, Koreo, Lambda GPU Workstations, Larry, László Bácsi, Lucky Resistor, Lukasz Pacholik, Marcos Fujisawa, Marcus Classon, Mark Day, Marko Clemente, Martin Noble, Martin Roth, Mats Fredriksson, Matt Krueger, Matthäus Pawelczyk, Matthew Duphily, Max Gawletta, Maxim Hansen, melvin2001, Michael Tedder, Michael Timbrook, Michael Weitman, Miguel Ríos, mikebad, Mikel Lindsaar, Miles Macchiaroli, Muqeet Mujahid, My Yiddishe Mama, Nicholas Counts, Nicholas Moresco, Nick Chapman, Not Yet Wise, Örn Arnarson, Paul Pluzhnikov, Paul Randal, Pete Dietl, Phil Dennis, Philip Hofstetter, PixelSergey, Porus, ProgrammerDor, Randal Masutani, Randy True, raoulvp, Renaldas Zioma, Ric King, Richard Butler-Malone, Richard Ertel, Rick Hennigan, Robert Comyn, Robert Diaz, Robey Pointer, §çīŤøşHï ŇåĶąýŐbŕÔ, Scott Holmes, Sean Patrick O’Brien, Sergey Kruk, solderspot, SonOfSofaman, Stefan Nesinger, Stefanus Du Toit, Stephen Kovalcik, Stephen Riley, Stephen Smithstone, Steve  Jones, Tayler Porter, TheWebMachine, Thomas Bruggink, Thomas Eriksen, Tim Walkowski, Tom, Tom Yedwab, Tommaso Palmieri, Tyler Latham, Vincent Bernat, Walter Montalvo, Warren Miller, William, Wim Coekaerts, Wraithan McCarroll, xisente, Yee Lam Wan",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}