{
  "title": "Episode 113: Interview with Scott Lilienfeld on the 50 Great Myths of Popular Psychology",
  "pubDate": "Mon, 28 Dec 2009 00:41:18 +0000",
  "guid": "episode-114-interview-with-scott-lilienfeld-on-th",
  "link": "http://www.thepsychfiles.com/2009/12/episode-114-interview-with-scott-lilienfeld-on-the-50-great-myths-of-popular-psychology/",
  "itunes:image": "",
  "description": "I interview Dr. Scott Lilienfeld, author of 50 Myths of Popular Psychology and we talk about, a) whether the polygraph actually works, b) whether women really talk more than men, c) does handwriting analysis reveals your personality and d) when you're taking a multiple choice test should you change your first answer or leave it alone?  Along the way we also talk about whether the full moon really does make people act strangely (and cause more dog bites).  Finally, Dr. Lilienfeld provides his opinion on whether psychotherapists need to be more up-to-date on the scientific research behind the various types of psychotherapy.",
  "content:encoded": "I interview Dr. Scott Lilienfeld, author of 50 Myths of Popular Psychology and we talk about, a) whether the polygraph actually works, b) whether women really talk more than men, c) does handwriting analysis reveals your personality and d) when you're taking a multiple choice test should you change your first answer or leave it alone?  Along the way we also talk about whether the full moon really does make people act strangely (and cause more dog bites).  Finally, Dr. Lilienfeld provides his opinion on whether psychotherapists need to be more up-to-date on the scientific research behind the various types of psychotherapy.",
  "enclosure": "",
  "itunes:duration": "43:22",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture",
  "itunes:subtitle": "Does the polygraph test work? Does handwriting analysis reveal your personality? When you're taking a multiple choice test should you change your first answer or leave it alone? I interview  Dr. Scott Lilienfeld, author of 50 Myths of Popular Psychology.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "I interview Dr. Scott Lilienfeld, author of 50 Myths of Popular Psychology and we talk about, a) whether the polygraph actually works, b) whether women really talk more than men, c) does handwriting analysis reveals your personality and d) when you're taking a multiple choice test should you change your first answer or leave it alone? Along the way we also talk about whether the full moon really does make people act strangely (and cause more dog bites). Finally, Dr. Lilienfeld provides his opinion on whether psychotherapists need to be more up-to-date on the scientific research behind the various types of psychotherapy."
}