{
  "feedburner:origLink": "https://www.brookings.edu/blog/fixgov/2022/11/04/why-spanish-language-mis-and-disinformation-is-a-huge-issue-in-2022/",
  "title": "Why Spanish-language mis- and disinformation is a huge issue in 2022",
  "link": "http://webfeeds.brookings.edu/~/718521958/0/brookingsrss/topfeeds/latestfrombrookings~Why-Spanishlanguage-mis-and-disinformation-is-a-huge-issue-in/",
  "dc:creator": "Gabriel R. Sanchez, Carly Bennett",
  "pubDate": "Fri, 04 Nov 2022 13:25:52 +0000",
  "guid": "https://www.brookings.edu/?p=1646494",
  "description": "As prepare for election night, it will be important to consider the impact that misleading and biased information has on the voting behavior of the public. This post draws from a conversation we had with Dr. Nicole Turner Lee for the TechTank podcast which focused on the implications of misinformation targeting Latinos, with a particular&hellip;<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/shutterstock_1737374783.jpg?w=320\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/shutterstock_1737374783.jpg?w=320\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718521958/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "content:encoded": "<p>By Gabriel R. Sanchez, Carly Bennett</p><p>As prepare for election night, it will be important to consider the impact that misleading and biased information has on the voting behavior of the public. This post draws from a conversation we had with <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.brookings.edu/experts/nicol-turner-lee/\">Dr. Nicole Turner</a> Lee for the <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.brookings.edu/blog/techtank/2022/10/31/techtank-podcast-episode-56-latino-voters-midterm-elections-and-the-effects-of-misinformation-and-disinformation/\">TechTank podcast</a> which focused on the implications of misinformation targeting Latinos, with a particular emphasis on Spanish-language media.</p>\n<p>Latinos are vital to the goal of decreasing the impact of blatant misinformation campaigns in the United States because they are more likely to <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.nielsen.com/wp-content/uploads/sites/2/2021/09/nielsen-2021-hispanic-diverse-insights-report-210682-D9.pdf\">receive, consume, and share “fake news” and misinformation online compared to the general population</a>. We utilize a mix of existing research and original analysis to identify what puts Latinos at greater risk for misinformation, the implications of misinformation specific to this campaign season, and how we might improve our collective defense against dangerous misinformation efforts.</p>\n<h2>Factors that make Latino Americans vulnerable to misinformation</h2>\n<p>Several <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.texastribune.org/2022/10/13/spanish-latino-misinformation-2022-elections/\">media stories have suggested that Latinos’ reliance on digital media for political information has made them particularly vulnerable to misleading information,</a> as they are platforms regularly used to spread lies.</p>\n<p>According to the <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.pewresearch.org/fact-tank/2018/01/11/among-u-s-latinos-the-internet-now-rivals-television-as-a-source-for-news/\">Pew Research Center</a>, Latinos’ use of social media, mobile apps, and other digital platforms increased more than that of the general U.S. population during the COVID-19 pandemic, with social media rivaling television as the dominant source of new content.</p>\n<p>False political information is <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.nielsen.com/insights/2021/on-screen-representation-is-driving-latino-tv-viewing/\">more likely to reach U.S. Latinos as they spend more time on sites such as YouTube, WhatsApp, Instagram, and Telegram.</a> Recently, the <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://naleo.org/wp-content/uploads/2022/10/10_11_22_-_NEF_Release_-_Tracking_Poll_-_Week_5_FINAL.pdf\">National Association of Latino Elected and Appointed Officials’ (NALEO) National Latino Voter Tracking Poll</a> identified YouTube as the top source of political news used by Latino voters this election cycle, with nearly half of the sample reporting they use it “very often.” When we look at potential variation based on language preference, we find that Spanish-speaking Latino households are 12% more reliant on YouTube than English dominant homes–48% to 36%.</p>\n<p>The high rate of Spanish-language use among Latinos is suggested to be a factor that has likely led them to be targeted for misinformation, with high rates of false information occurring in Spanish. Targeting Latinos in Spanish is particularly problematic given that most social media platforms do not perform the same amount of fact checking in languages other than English, which results in misleading content staying live on these platforms for a much longer period of time than English content. Analysis of online misinformation also found that Facebook (now Meta) <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://secure.avaaz.org/campaign/en/facebook_coronavirus_misinformation/\">failed to flag 70% of Spanish-language misinformation surrounding COVID-19</a> compared to just 29% of such information in English.</p>\n<p>Although most research on this subject has focused on digital media, older and more traditional forms of media are also susceptible to false information. The use of <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.washingtonpost.com/politics/2022/02/25/latino-misinformation-spanish-social-media/\">Spanish-language radio has been particularly damaging to Latinos</a> because of its prevalence, as well as the fact that Spanish-language media outlets offer little to no response to misinformation, allowing conspiracy theories to spread.</p>\n<p>Addressing the structural challenges to combating misinformation in Spanish at the source is vital given the high levels of trust Latinos have in Spanish-language news. In a <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.mdpi.com/1660-4601/18/18/9629\">recently published academic article</a>, my co-authors and I find that trust in Spanish-language media correlated with more positive views about COVID-19 vaccination information coming from state and local governments, and that this relationship is partially due to Spanish-language news journalists being highly trusted messengers among Latinos.</p>\n<h2>Misinformation Directed at Latinos During the 2020 Election</h2>\n<p>Although misinformation has been an issue well before the 2020 election, the 2020 election definitely saw a marked increase in the impact of misinformation on voting behavior. Scholars from the University of Houston found <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.washingtonpost.com/politics/2022/02/25/latino-misinformation-spanish-social-media/\">in their survey of Texas respondents during the 2020 election</a> that 35% or more of Latinos believed unfounded conspiracy theories, including 41% who believed that President Biden was under the influence of Black Lives Matter and Antifa.</p>\n<p>External actors interested in utilizing misinformation to impact election outcomes, not surprisingly, focus on states where a slight shift in voting behavior can have an outcome on the electoral college. This means battleground states like Florida will continue to be a hotbed for this activity. <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://secure.avaaz.org/campaign/en/facebook_election_insurrection/\">Almost half</a> of Spanish-speaking voters in Florida encountered misinformation on Facebook in the days leading to the 2020 elections. Demonstrating the strategic and targeted nature of false information campaigns, ads that were aired in Florida, where the largest concentration of Venezuelan Americans resides, attempted to link Biden to Venezuela’s socialist President Nicolás Maduro.</p>\n<p>During the 2020 elections, YouTube was the source of several videos that were deemed as credible news stories coming from Latin America but, in reality, were full of lies directed at Democratic candidates. In New Mexico, for example, video clips directed at Latino voters <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.axios.com/2021/04/15/republicans-youtube-latino-voters-democrats-trump\">that falsely indicated that former Representative Xochitl Torres-Small (D-NM) supported the Green New Deal.</a> This was one of the factors that led Torres-Small to lose her seat.</p>\n<h2>Evidence of misinformation disproportionately impacting Spanish-speaking Latinos this cycle</h2>\n<p>Abortion policy has emerged as a key policy issue in this election cycle, and misinformation regarding the issue is unfortunately being directed at Latinos. The <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://naleo.org/COMMS/PRA/2022/BSP_Latino_Voter_Tracking_Poll/10_26_22_-_BSP_NEF_Week_Seven_Toplines_-_FINAL.pdf\">NALEO National Latino Voter Tracking Poll</a> found that an overwhelming majority of Latinos in the survey (76%) have heard that abortion is now illegal nationwide and that a person can get arrested for seeking one. The percentage is even higher among Spanish-speaking Latino households, as 43% of Latinos who live in predominately Spanish-speaking households reported that they had seen or heard “a lot” about this, 7% higher than predominately English-speaking households.</p>\n<p>Not only is this misinformation saturating the Latino community, more than three fifths of Latino registered voters (63%) believe that this is true. When we look at differences based on language, these have significant impact on the likelihood that Latinos will believe these false claims. Latinos who live in Spanish-speaking households are 13% more likely to believe that this statement is “mostly true” compared to English-speaking Latino households.</p>\n<p>This survey also provides evidence that the Big Lie continues to be a problem for Latinos this election cycle, as 75% of voters have heard or read that there was “cheating and election fraud in 2020 and that Donald Trump was the true winner.” Despite no evidence to suggest that this is accurate, over a third (34%) of Latino voters believe that this is “mostly true.”</p>\n<p>There is a large difference in exposure and acceptance of this dangerous narrative based on language. As reflected in the figure below, 62% of Spanish-speaking Latino households report that they have “seen or heard a lot” about this issue, which is a robust 22% more than English-speaking Latino households. Fortunately, there is a much smaller difference in believing the statement is “mostly true” based on language spoken at home: 21% for Spanish-dominant households compared to 20% of English-speaking households.</p>\n<h2>Potential solutions</h2>\n<p>Facebook’s leaked data suggests that the company <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://time.com/6110234/facebook-papers-testimony-explained/\">spends 87% of its misinformation budget on U.S. content</a> but does not have a solution for detecting non-English comments and misinformation that may be generated outside of the country. Given that this is likely not unique to Facebook, there needs to be a sector-wide movement to increase the focus on misinformation in Spanish and other non-English languages.</p>\n<p>Having more high-level Latino representation in ownership of media would be a game changer for the fight against misinformation directed at this community. We are therefore excited to see the emergence of the Latino Media Network, which has purchased several major Spanish-language radio stations across the country. The partners of the network say they plan to prioritize helping Spanish-language audiences <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://latinomedianetwork.com/about/\">“navigate the ocean of information that exists in our society.”</a></p>\n<p><a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.brookings.edu/blog/fixgov/2022/07/26/misinformation-is-eroding-the-publics-confidence-in-democracy/\">As discussed in a prior post</a>, many of the longer-term strategies to combat misinformation revolve around improving the ability of the public to be informed consumers of digital information. Requiring every state <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://www.npr.org/2021/08/12/1026993142/illinois-is-the-first-state-to-have-high-schools-teach-news-literacy\">to offer news literacy courses at every high school,</a> like Illinois has done, would be highly valuable to the Latino community given that Latinos are significantly younger than the overall population.</p>\n<p>Finally, our review of the relevant research in this area has identified one silver lining in Latinos’ consumer behavior. <a href=\"http://webfeeds.brookings.edu/~/t/0/0/brookingsrss/topfeeds/latestfrombrookings/~https://medium.com/harmony-labs/finding-the-immigrant-story-a1aab067c704\">Research conducted by United We Dream and Harmony Labs</a> found Latinas are more likely to consume information about immigration and immigrants from a variety of sources, minimizing the spread of misinformation. Learning more about how Latinas navigate political information broadly would be worthwhile, as it may identify strategies for improving the ability of Latino men (and other communities) to identify and discount misinformation.</p>\n<hr />\n<p><em><span class=\"TextRun SCXW265413800 BCX0\" lang=\"EN-US\" xml:lang=\"EN-US\" data-contrast=\"none\"><span class=\"NormalTextRun SCXW265413800 BCX0\">Meta is a general unrestricted donor to the Brookings Institution. The findings, interpretations, and conclusions posted in this piece are solely those of the authors and not influenced by any donation.</span></span></em></p>\n<Img align=\"left\" border=\"0\" height=\"1\" width=\"1\" alt=\"\" style=\"border:0;float:left;margin:0;padding:0;width:1px!important;height:1px!important;\" hspace=\"0\" src=\"http://webfeeds.brookings.edu/~/i/718521958/0/brookingsrss/topfeeds/latestfrombrookings\">\n<div class=\"fbz_enclosure\" style=\"clear:left\"><a href=\"https://www.brookings.edu/wp-content/uploads/2022/11/shutterstock_1737374783.jpg?w=320\" title=\"View image\"><img border=\"0\" style=\"max-width:100%\" src=\"https://www.brookings.edu/wp-content/uploads/2022/11/shutterstock_1737374783.jpg?w=320\"/></a></div>\n<div style=\"clear:both;padding-top:0.2em;\"><a title=\"Like on Facebook\" href=\"http://webfeeds.brookings.edu/_/28/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Pin it!\" href=\"http://webfeeds.brookings.edu/_/29/718521958/BrookingsRSS/topfeeds/LatestFromBrookings,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Tweet This\" href=\"http://webfeeds.brookings.edu/_/24/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by email\" href=\"http://webfeeds.brookings.edu/_/19/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" style=\"border:0;margin:0;padding:0;\"></a>&#160;<a title=\"Subscribe by RSS\" href=\"http://webfeeds.brookings.edu/_/20/718521958/BrookingsRSS/topfeeds/LatestFromBrookings\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" style=\"border:0;margin:0;padding:0;\"></a>&nbsp;&#160;</div>",
  "enclosure": "",
  "atom:category": ""
}