{
  "id": "yt:video:or6W4sXpl3c",
  "yt:videoId": "or6W4sXpl3c",
  "yt:channelId": "UC-JWw2juO3Ikj5C9VsNoGIw",
  "title": "Aztec Human Sacrifices",
  "link": "",
  "author": {
    "name": "M. Laser History",
    "uri": "https://www.youtube.com/channel/UC-JWw2juO3Ikj5C9VsNoGIw"
  },
  "published": "2021-11-22T17:45:29+00:00",
  "updated": "2022-09-02T06:54:07+00:00",
  "media:group": {
    "media:title": "Aztec Human Sacrifices",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I originally uploaded two videos. One where I complained about demonetization and one where I didn't. The video where I complained about demonetization was, ironically, monetized and the one without the complaining was demonetized. Hence I am leaving the complaining in the video hoping that it will stay monetized.\n\nStefan's video has been released but the topic of the video has changed from what it original was supposed to be (about the archaeology of human sacrifices) but it's still a great video and you should check it out. -https://youtu.be/FVgNulhQ9Fg\n\nMy Patreon- https://www.patreon.com/mlaser\n\nIf you want to directly donate money you can do so on Ko-Fi- https://ko-fi.com/mlaserhistory\n\nMy Twitter- https://twitter.com/MnLaser\n\nMy second channel M. Laser Random- https://www.youtube.com/c/MLaser2 \nwhere I just upload random videos from game-plays to vlogs and more.\n\nSources for all my videos are in the bibliography of my scripts available for free to download on my Patreon. https://www.patreon.com/mlaser?filters[tag]=script\n\nI actually had way more comments for this video than I could fit into the pinned comment (it has a 10k character limit) so, I recommend downloading the script and reading all the extra comments if you're interested.\n\nSince I have not gone into much detail about the actual political history of the Mexica in this video as the video focused on the topic of human sacrifices, I do recommend checking out Invicta's video and QnA podcast on the subject. There are some mistakes (as there always are, nothing is perfect) but over all I think it is a very good introduction into the Mexican history.\nVideo- https://youtu.be/8a8SkSYtHXo\nQnA- https://youtu.be/g4mFK5AFP7s\n\n0:00 Introduction\n2:52 Intro to \"Aztec\" Religion\n6:04 Intro to \"Aztec\" Sacrifices\n8:15 Heart-Extraction Sacrifice\n16:52 God Impersonator Sacrifice\n19:15 Intro to the Historical Theories\n20:01 Ecological Argument\n21:23 Political Argument\n23:58 Conclusion to the Sacrifices and Theories\n26:20 Problems With the Source Material\n33:53 Conclusion\n\n!!!!!!!!!!!!! Extra information and Corrections that didn't fit into the Pinned Comment !!!!!!!!!!!!!!\n\n- For the creation myth I seemed to have confused the fact that Huitzilopochtli, even though being the sun god (maybe), was not the god that sacrificed himself to be the sun in the fifth iteration of the sun. Basically Huitzilopochtli did not sacrifice himself to be the sun as I said in the video. Also the whole celestial battle between the sun and the moon was a bit too oversimplified on my part as to be really accurate. See the long comment I \"hearted\" in the description by MajoraZ for more information on this.\n\n- For more context into the religious continuum I talk about in the pinned comment see Zuyuano Regime.\n\n- The Itzcoatl quote does not say 'history' but 'paintings' but the Aztecs called their codices paintings as that's partly what they where and in the context of the quote it most definitely means history when it says paintings. That's why for the sake of clarity I amended the quote.\nThe king was also helped in this or persuaded to do this by the chief Mexica advisor at the time Tlacaelel. It is also argued it was Tlacaelel who helped established the whole imperial cult.\nDurán, Diego, Doris. Heyden, and Fernando Horcasitas. The Aztecs : The History of the Indies of New Spain. New York: Orion Press, 1964. p. 141.\n\nThanks to @Aztlan Historian and MajoraZ for pointing out the mistakes in the video.\n_________________________________________________________________\nDuke tier Patreons\n-Sahni\n-DaneToast\n_________________________________________________________________\n#History #Mexico #Aztecs #Mexica",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}