{
  "title": "Detecting Earthquake Victims Through Walls",
  "link": "https://spectrum.ieee.org/dopppler-radar-detects-breath",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/rescue-workers-looking-at-a-demolished-building.jpg?id=30827908&width=1245&height=700&coordinates=0%2C207%2C0%2C0\"/><br/><br/><p><em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em></p><p><em></em>When a disaster strikes and buildings collapse, it’s important to locate survivors as quickly as possible. A wide range of tech solutions are being explored to help make the search-and-rescue process quicker and more efficient—one example being mobile robots that can squeeze through small spaces. However, these robots aren’t helpful in situations where there’s a solid wall of concrete between the search-and-rescue team and the victim.</p><p>To address this issue, researchers from Taiwan and Indonesia have developed a novel technique that uses radar to detect a person’s breathing through a concrete wall. Experiments show that when a human is half a meter behind a concrete wall, their location can be detected with significant specificity: Any error is generally no more than about 3.375 centimeters wide of the actual position of the person’s chest cavity. The results the researchers obtained with their sensor system are described in a <a href=\"https://ieeexplore.ieee.org/document/9826342\" target=\"_blank\">paper</a> published 11 July  in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7361\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Sensors Journal</em></a>. </p><p>Aloysius Adya Pramudita is an associate professor at the Intelligent Sensing-IoT Centre, Telkom University, in Indonesia, who was involved in the research. He notes that Indonesia is located at the meeting point of several tectonic plates, making the country prone to disasters such as earthquakes. “Our research deals with postdisaster problems and activity,” he explains. “The objective is to reduce the loss [of life] and speed [up] recovery.”</p><p>Radar is often considered in search-and-rescue technology because of its ability to penetrate thick, dense objects like concrete. It’s also sensitive enough, via the Doppler effect, to detect the minute movements of a person’s chest as they breathe. However, when standard radar of the type clinicians use in medical offices hits the barriers and rubble between a rescue team and a disaster victim, this can alter the phase and amplitude of the signal, distorting it.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"person laying underneath table of bricks\" class=\"rm-shortcode\" data-rm-shortcode-id=\"41a2a6ba967c2361f109e72d938576ee\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"969b9\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/person-laying-underneath-table-of-bricks.jpg?id=30842741&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In this experimental setup by Aloysius Adya Pramudita and his colleagues, radar is used to detect a person's breathing through a concrete barrier.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Aloysius Adya Pramudita/Telkom University</small></p><p>Pramudita’s team overcame this issue by developing a technique using frequency-modulated continuous-wave (FMCW) radar, which takes two measurements. The first measurement is used to estimate the signal distortion caused by a large object, while an algorithm adjusts for this distortion. The second radar measurement is then used to detect a person's breathing and estimate their position behind the object, taking into account the distortion endemic to the first measurement. In terms of hardware, the approach just needs a FMCW system, a mini-PC for computation, and a 12-volt lithium battery for power.</p><p>The researchers tested their approach with four volunteers, who lay behind a concrete wall with a thickness of either 20 or 40 cm. The results show that the thicker walls do attenuate the radar signal more; however, the system is still able to detect a person and determine their position to within a few centimeters. The data suggest that the maximum depth at which the proposed FMCW system can detect a victim behind a concrete wall is 3.28 meters. </p><p>“Our proposed method successfully overcomes the obstacle problem, and the breathing vital sign [indicating the presence] of the live victim can be detected,” says Pramudita, noting that his team is currently collaborating with industry partners to commercialize the technology. He says the team is also interested in integrating their radar approach with autonomous technology, such as robots and drones.</p><p>Adding this functionality to drones and robots “will support victim search efforts using the proposed radar system to reach the areas or locations that are difficult to reach by humans, and therefore will speed up the search process,” explains Pramudita. </p>",
  "pubDate": "Thu, 11 Aug 2022 17:49:32 +0000",
  "guid": "https://spectrum.ieee.org/dopppler-radar-detects-breath",
  "category": [
    "Disaster response",
    "Radar",
    "Earthquake",
    "Search and rescue"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}