{
  "title": "158: Dannemora Prison Break",
  "link": "https://audioboom.com/posts/7731754",
  "itunes:episode": 158,
  "itunes:title": "Dannemora Prison Break",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3552,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Is it just me, or should breaking our of a SUPER MAX PRISON be hard? AND YET SOMEHOW THESE TWO IDIOTS FIUGURED OUT HOW TO DO IT?<br>\n<br>\nOn the night of June 5, 2015, two MURDERERS, broke out of  a prison fortress thought to be impenetrable. A little after 11 p.m., they climbed through holes they had cut — over months, with tools smuggled in by a prison guard — in the cell walls. They snaked through tunnels and between walls and through a steam pipe, which took them underneath the prison. They popped out of a manhole on the other side of the prison wall. THE ACCOMPLISHED ALL THIS WITH THE HELP OF A PRISON SEAMSTRESS, You are not going to BELIEVE this story. Or the rage we feel about. Oh, the beautiful rage.<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div><a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description</a></div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. From the 220 year old murder that brought Alexander Hamilton and Aaron Burr together to fight for the defense, to Jazz Age thrill killers, Lady mob bosses, murdering grandmothers, and serial killers you've never heard of. <strong>Check out \"Crimes of the Centuries wherever you get your podcasts. </strong>\n</div>\n<div>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Tue, 17 Nov 2020 11:22:37 +0000",
  "guid": "tag:audioboom.com,2020-11-17:/posts/7731754",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}