{
  "id": "yt:video:9SYcH9fwh3E",
  "yt:videoId": "9SYcH9fwh3E",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Brandon Kyle Goodman | You Gotta Be You | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-12T16:00:13+00:00",
  "updated": "2022-10-13T12:43:24+00:00",
  "media:group": {
    "media:title": "Brandon Kyle Goodman | You Gotta Be You | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Brandon Kyle Goodman discusses his/their book \"You Gotta Be You: How to Embrace This Messy Life and Step Into Who You Really Are.\" From the time we’re born, a litany of do’s and don’ts are placed on us by our families, our communities, and society. We're required to fit into boxes based on our race, gender, sexuality, and other parts of our identities, being told by others how we should behave, who we should date, or what we should be interested in. For so many of us, those boxes begin to feel like shackles when we realize they don’t fit our unique shape, yet we keep trying because we crave acceptance and validation. But is “fitting in” worth the time, energy, and suffering?  \n\nGet the book here: https://goo.gle/3BlBT7N.\n\nAs a Black nonbinary, queer person born into a religious immigrant household, Brandon knows the pain of having to hide one’s true self, the work of learning to love that true self, and the freedom of finally being your true self. In You Gotta Be You, Brandon affectionately challenges you to consider, “Who would I be if society never got its hands on me?” This question set Brandon on a mission to dropkick societal shackles by unlearning all the things he was told he should be in order to step into who he really is.  \n\nCompassionate and soulful, funny and revealing, You Gotta Be You is an unapologetic call to self-freedom. It’s about turning rejection (from others and yourself) into a roadmap to self-love. It’s a guide to setting boundaries and fostering self-growth. And most importantly, it’s an affirmation that we are enough exactly as we are.\n\nBrandon Kyle Goodman (he/they) is an actor, writer, and activist. In addition to writing and voice acting on Netflix’s smash-hit animated comedy series Big Mouth, he stars and writes for its spin-off Human Resources. He can also be seen in Amazon’s Modern Love, Hulu’s Plus One, and Netflix’s Feel the Beat. \n\nModerated by Jules Wagner.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}