{
  "id": "https://bibleinoneyear.org/en/youth/149",
  "title": "Day 149: Five Burdens You Need Not Carry",
  "description": "Psalm 68:19, 1 Samuel 24:2–6, John 18:25–28a,29–30,33–40.  Keep company with me and you’ll learn to live freely and lightly’ (vv 28–30)",
  "pubDate": "Sun, 29 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/149/",
  "itunes:duration": "15:09",
  "guid": "enyouth29052022-149",
  "length": 909.87,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 149: Five Burdens You Need Not Carry",
  "itunes:subtitle": "Psalm 68:19, 1 Samuel 24:2–6, John 18:25–28a,29–30,33–40.  Keep company with me and you’ll learn to live freely and lightly’ (vv 28–30)",
  "itunes:summary": "At the end of his life, Sir Winston Churchill said, ‘When I look back on all these worries, I remember the story of the old man who said on his deathbed that he had had a lot of trouble in his life, most of which had never happened!’\nChurchill was speaking about the burden of worries that never materialise. However, there are many different types of ‘burdens’ in life, and some of them are very real. Jesus said, ‘Come to me, all you who are weary and burdened, and I will give you rest. Take my yoke upon you… and you will find rest for your souls. For my yoke is easy and my burden is light’ (Matthew 11:28–30).\nA yoke is something Jesus would have made in a carpenter’s shop. It is a wooden frame joining two animals (usually oxen) at the neck, enabling them to pull a plough or wagon together. The function of the yoke is to make the burden easier to carry.\nI love the way Eugene Peterson translates this passage in The Message: ‘Are you tired? Worn out? Burned out on religion? Come to me. Get away with me and you’ll recover your life. I will show you how to take a real rest. Walk with me and work with me – watch how I do it. Learn the unforced rhythms of grace. I won’t lay anything heavy or ill-fitting on you. Keep company with me and you’ll learn to live freely and lightly’ (vv.28–30).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 514
}