{
  "title": "Numbers that lie to you",
  "description": "<p>Either you don’t understand what they mean or how those were cooked.</p>\n\n<ul>\n  <li>Scientists achieved <strong>92%</strong> quality in the problem of …</li>\n  <li>Our system filters out <strong>99%</strong> of spam …</li>\n  <li>New vaccine/technique is <strong>40%</strong> more efficient than …</li>\n  <li>(updated) COVID-19 mortality rate is <strong>X%</strong> - this perfect example appeared after the post was written</li>\n</ul>\n\n<p>This post-informational world is complicated. \nWe desperately need ways to receive and analyze less information to make judgements, \nand here they are — simple numbers that help us with decisions.</p>\n\n<p>However, <strong>connecting numbers and real things is surprisingly hard</strong>.\nAnd producing just <em>some</em> numbers is times easier. \nMost shocking numbers are spread ny media but almost never checked.</p>\n\n<p>Let’s talk in examples.</p>\n\n<h3 id=\"example-surveys\">Example: surveys</h3>\n\n<p>Surveys are perfect tool for newsmakers:</p>\n<ul>\n  <li>76% of people are not aware that …</li>\n  <li>82% support new initiative …</li>\n</ul>\n\n<p>Ok, first question. After these claims were announced in media, <em>do numbers stay the same</em>? \nParadox: this fact after being declared in news is already wrong (even if it was correct before), \nbecause people tend to agree with majority (while considering themselves smarter than majority).</p>\n\n<p>But how do you measure that percent? Surveys/polls are extremely tough to conduct well.</p>\n\n<ul>\n  <li>many people refuse participating (and that’s correlated to life setting and choices)</li>\n  <li>people frequently don’t answer what they think (even if there is no pressure on them, they may answer ‘the way that sounds right’)\n    <ul>\n      <li>if you ask in poll about salary, you’ll get significantly higher average compared to national stats bureau <code class=\"language-plaintext highlighter-rouge\">¯\\_(ツ)_/¯</code></li>\n    </ul>\n  </li>\n  <li>do you encounter that opinion on current affairs can change after each news episode?</li>\n  <li>children are counted? seniors? imprisoned? expats? immigrants?</li>\n  <li>what is the way you posed the question? Question itself already biases the answer.\n    <ul>\n      <li>For example, let’s take <a href=\"https://www.nature.com/articles/s41557-019-0377-8\">a funny survey about chemophobia</a> that was published in nature chemistry (???).\n        <ul>\n          <li>30% of Europeans report being “scared” of chemicals</li>\n          <li>about 40% try to “avoid contact with chemical substances” and want to “live in a world where chemical substances don’t exist.”</li>\n        </ul>\n      </li>\n      <li>Now, what if you don’t mention chemicals, and ask people what kind of stuff society needs to get rid off, very few will mention chemicals\n        <ul>\n          <li>but shitty media will be in the list ;)</li>\n        </ul>\n      </li>\n    </ul>\n  </li>\n  <li>not only question matters, but the whole context of discussion is important\n    <ul>\n      <li>there is a simple way to artificially raise someone’s ratings. Say, politician X puts topic Y at the center of his program and speeches. He is known for this (and only for this).\nSo if you ask interviewee first about topic Y, that will probably remind about politician X. Right after that interviewee is asked: “which politicians you’re …”, and chances of X being mentioned increase significantly.</li>\n    </ul>\n  </li>\n  <li>how polling base was collected? (Typically, many ways combined) How misrepresentation was compensated? What is the reference distribution (e.g. of age)?</li>\n  <li>how do you detect interviewer’s mistakes? fake data?</li>\n</ul>\n\n<p>Have you ever heard media to discuss the way a particular number from poll was received? \nMany years ago I heard frequently remarks like ‘people in age from X to Y were surveyed in regions 1,2,3’, but no mentions nowadays. Only endless percentages.</p>\n\n<p>Companies that run surveys publish their protocol, but that’s only a part of the story. <br />\nCommon benchmark for such companies are elections. How often elections’ results coincide with polls? Why?</p>\n\n<h3 id=\"example-face-recognition-system\">Example: face recognition system</h3>\n\n<p>Suppose you simply want reliable face recognition system, and don’t care about money and speed.</p>\n\n<p>Sounds simple. Independent benchmark says the system of your choice has an accuracy of 99.9%. Impressive, right? Wait.</p>\n\n<ul>\n  <li>what does ‘accuracy’ mean? Is it verification (e.g. of device owner) or recognition (finding correct person in the database)?</li>\n  <li>if second, how many people are there in the database? 100? 1’000? 1’000’000?\n    <ul>\n      <li>do we assume that person we are recognizing is picked during tests uniformly from the database?</li>\n    </ul>\n  </li>\n  <li>if we know size of the database, which photos are there? On the street? At home? What’s light conditions?\n    <ul>\n      <li>these questions apply both to images in the database and to images you will recognize from.</li>\n      <li>oh, and don’t forget about image/camera quality</li>\n    </ul>\n  </li>\n  <li>quality drops when person does not look straight at the camera. How significant is this drop in quality depending on angle?</li>\n  <li>what ethnicities are there in the database? Do they cover all your cases of interest?</li>\n  <li>how much data do you need to identify a person?</li>\n  <li>glasses? makeup? should I update images in the database each year? Twins are considered the same person or not?</li>\n</ul>\n\n<p>Reports of some <a href=\"https://www.nist.gov/programs-projects/face-recognition-vendor-test-frvt\">professional independent comparisons</a> \nof face recognition systems include dozens of plots.</p>\n\n<p>… hey, do you want to talk about speech recognition? That’s not simpler</p>\n\n<p>Cases when everything sounds quantifiable turn out to be already quite complicated.</p>\n\n<h3 id=\"another-example-spam-detection-system\">Another example: spam detection system</h3>\n\n<p>“Our spam detection system correctly classifies 99% of messages!” - sales person says.</p>\n\n<p>Consider this as a practice for your scepticism. Or keep reading. But better first try to collect questions about this number.</p>\n\n<ul>\n  <li>Does it mean there are 99% of spam and 1% of ham, and everything put into spam folder?\n    <ul>\n      <li>or maybe it is only 1% percent of spam ond everything lands in your inbox?</li>\n      <li>so, we need to start from <a href=\"http://arogozhnikov.github.io/2015/10/05/roc-curve.html\">TPR, FRP, curves</a> and relative rates of spam?</li>\n      <li>do you think those rates will be the same in your case? Some people/companies get lots of spam, some don’t</li>\n    </ul>\n  </li>\n  <li>False negatives are messages from your relatives or maybe from your colleagues? Or some newsletters you don’t mind to receive?</li>\n  <li>Languages the system supports. ‘English’ is not an answer, there are many dialects on this planet.</li>\n  <li>Hey, you know, those sites I left by mistake my address three years ago, they keep sending me stuff, do I you consider that spam?</li>\n  <li>What is spam after all?\n    <ul>\n      <li>Think about this question. To claim numbers you need definition</li>\n    </ul>\n  </li>\n  <li>How do you get ground truth for what is spam?\n    <ul>\n      <li>user’s labels would be so dirty you will never get high numbers there. But those can be useful for training anyway</li>\n      <li>spammers can also be among users of your system and label things intentionally wrong</li>\n      <li>is it representative at all?</li>\n    </ul>\n  </li>\n  <li>Spam sent next month will be targeted to trick current systems. Why good results in the past can be a justification for good results in future?</li>\n</ul>\n\n<p>There are more in-depth questions, that require diving deeper, but you already got it.</p>\n\n<h2 id=\"reacting-to-numbers\">Reacting to numbers</h2>\n\n<p><img src=\"/images/etc/pile_of_numbers.jpg\" width=\"600\" /></p>\n\n<p><small>Image source: <a href=\"https://pixabay.com/illustrations/pay-digit-number-fill-count-mass-1036470/\">pixabay.com</a></small></p>\n\n<p>News shoot numbers at you. Ads claim more numbers. Presentations bury you in numbers.</p>\n\n<ul>\n  <li>Soap X kills 99% of bacteria</li>\n  <li>Two doses of X is more than 90% effective at preventing disease …</li>\n  <li>Batteries X work up to 10 times longer</li>\n  <li>Average income increased by N%</li>\n  <li>X is clinically shown to improve attentiveness by nearly 20%.</li>\n  <li>Our support resolves N% of issues within 12 hours</li>\n  <li>This display can show N billion colors!</li>\n  <li>X fights disease symptoms 50% faster then other medications</li>\n  <li>University rankings, school rankings — what’s this they compare? Why formulae are readjusted each year?</li>\n  <li>etc.</li>\n</ul>\n\n<p>Do you really understand what those mean and how useful they are? Can you connect number with an effect or reason in real world?</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Numbers sound like facts. <br />\nNumbers make presentations sound convincing. <br />\nNumbers give us impression of general insight into situation. <br />\n<!-- Insight drives decisions. --></p>\n\n<p>That’s only an illusion.</p>\n\n<p>Numbers have story and context, discovering those breaks an illusion of simplicity but gives number a meaning.</p>\n\n<h2 id=\"more\">More</h2>\n\n<ul>\n  <li>Darrell Huff, How to lie with statistics</li>\n</ul>",
  "pubDate": "Sat, 01 Feb 2020 12:00:00 +0000",
  "link": "https://arogozhnikov.github.io/2020/02/01/93-percent-of-readers.html",
  "guid": "https://arogozhnikov.github.io/2020/02/01/93-percent-of-readers.html",
  "category": [
    "Stats",
    "Life",
    "Analysis"
  ]
}