{
  "title": "Interview with Simon Horobin, Author of \"Bagels, Bumf, and Buses\"",
  "pubDate": "Sun, 12 Apr 2020 03:00:40 +0000",
  "guid": "3e7855d1-dd13-4582-81b3-5a9ac4b4151f",
  "link": "https://wordsforgranted.libsyn.com/interview-with-simon-horobin-author-of-bagels-bumf-and-buses",
  "itunes:image": "",
  "description": "<p>In today's episode, I talk with Simon Horobin, Oxford professor and author of \"Bagels, Bumf and Buses: A Day in the Life of the English Language,\" a book that explores the etymology of common words we encounter every day. In addition to discussing Simon's latest book, we discuss a range of language topics including the standardization of grammar, the history of spelling, and more. You can purchase \"Bagels, Bumf, and Buses\" <a href= \"https://www.amazon.com/dp/B07X35XQ4T/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\"> here</a>.<br /> <br /> Click <a href=\"https://literati.com/?extCouponCode=WORDS\">here</a> 25% off your first order with Literati.<br /> <br /> Listen to Words for Granted on <a href= \"https://www.lyceum.fm/\">Lyceum</a>, a curated podcast app featuring educational podcasts.</p>",
  "content:encoded": "<p>In today's episode, I talk with Simon Horobin, Oxford professor and author of \"Bagels, Bumf and Buses: A Day in the Life of the English Language,\" a book that explores the etymology of common words we encounter every day. In addition to discussing Simon's latest book, we discuss a range of language topics including the standardization of grammar, the history of spelling, and more. You can purchase \"Bagels, Bumf, and Buses\" <a href= \"https://www.amazon.com/dp/B07X35XQ4T/ref=dp-kindle-redirect?_encoding=UTF8&btkr=1\"> here</a>.  Click <a href=\"https://literati.com/?extCouponCode=WORDS\">here</a> 25% off your first order with Literati.  Listen to Words for Granted on <a href= \"https://www.lyceum.fm/\">Lyceum</a>, a curated podcast app featuring educational podcasts.</p>",
  "enclosure": "",
  "itunes:duration": "42:42",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In today's episode, I talk with Simon Horobin, Oxford professor and author of \"Bagels, Bumf and Buses: A Day in the Life of the English Language,\" a book that explores the etymology of common words we encounter every day. In addition to discussing...",
  "itunes:episodeType": "full"
}