{
  "title": "Tiny Ultrasound Sensors Could Monitor EV Batteries",
  "link": "https://spectrum.ieee.org/ev-battery",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-in-protective-goggles-sits-at-a-bench-adjusting-a-knob-on-the-bench-is-a-silver-pouch-in-a-stand-with-wires-attached-to-i.jpg?id=31994641&width=1245&height=700&coordinates=0%2C0%2C0%2C283\"/><br/><br/><p>Ultrasound sensors as small as a thumbnail can scan lithium-ion batteries to check their charge, health, and safety, a new study finds.</p><p>The findings suggest that ultrasound—that is, sound waves at frequencies higher than human hearing can detect—might one day help <a href=\"https://spectrum.ieee.org/ev-battery-fast-charging\" target=\"_self\">electric vehicles</a> better estimate how much charge remains in their batteries. This approach might also help detect unstable batteries on the verge of disaster, quickly test battery quality during manufacturing, and identify which used batteries are healthy enough to be resold to reduce waste, says study lead author <a href=\"https://www.ornl.gov/staff-profile/hongbin-sun\" target=\"_blank\">Hongbin Sun</a>, an ultrasonic engineer at the <a href=\"https://www.ornl.gov/\" target=\"_blank\">Oak Ridge National Laboratory</a>, in Tennessee.</p><p>Estimating how much charge is left in a commercial lithium-ion battery is currently a challenging task. For instance, <a href=\"https://spectrum.ieee.org/electric-vehicles\" target=\"_self\">electric vehicles</a> typically experience an uncertainty of about <a href=\"https://spectrum.ieee.org/quantum-sensor-range-anxiety\" target=\"_self\">10 percent</a> when estimating battery charge. This in turn reduces their driving range by about 10 percent, to ensure that they stay within their batteries’ safety margins.</p><hr/><p>In order to find a simple, inexpensive, and nondestructive way to estimate lithium-ion battery charge, scientists investigated ultrasound. As lithium-ion batteries discharge and recharge, the underlying electrochemical reactions lead to mechanical changes in the properties and structure of their components, which ultrasound scans can detect, in principle.</p><p>Previous work on ultrasonic scans of lithium-ion batteries each typically experimented with just one ultrasonic frequency. In the new study, researchers examined multiple ultrasonic frequencies to see what advantages and disadvantages each might have in estimating battery charge.</p><p>In experiments, scientists used commercial off-the-shelf ultrasound sensors about 1.25 centimeters wide to monitor 2.4 ampere-hour lithium-ion battery cells during charging and discharging. They tested relatively low-frequency 750-kilohertz, 1-megahertz, and 1.5-MHz ultrasound waves, since battery materials largely absorb frequencies higher than that. (For reference, humans can hear frequencies between roughly 20 hertz and 20 kHz.)</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"Diagram of a grey rectangle labelled pouch cell, with an ultrasonic transmitter on top and an ultrasonic receiver below.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"f46a7a6e7fd70ffb865f2bb2aa6cb696\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"24795\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/diagram-of-a-grey-rectangle-labelled-pouch-cell-with-an-ultrasonic-transmitter-on-top-and-an-ultrasonic-receiver-below.jpg?id=31994690&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">An ultrasonic transmitter can send ultrasonic waves through a lithium-ion battery to an ultrasonic receiver, conveying data on the battery’s state.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\">ORNL/U.S. Department of Energy/Elsevier</small></p><p>The researchers observed that the wave velocities of all three frequencies were linked with the state of charge. The way the waves weakened also helped reveal how materials in the battery changed in terms of <a href=\"https://en.wikipedia.org/wiki/Phase_(matter)\" rel=\"noopener noreferrer\" target=\"_blank\">phase</a> during charging and discharging.</p><p>“The method we proposed provides a fast and low-cost solution for battery performance assessment and understanding material phase changes during battery charge and discharge,” Sun says. “For industrial-scale applications, it could potentially be used for the prediction of the battery state of charge and assessment of whether the battery is losing the ability to hold its charge.”</p><p>Sun notes that a potential application of this method would embed low-cost piezoelectric ultrasound sensors in electric-vehicle batteries to continuously monitor them. He says the technique currently has an uncertainty of about 5 percent when estimating battery charge, roughly twice as good as current techniques. By improving sensor calibration and accounting for temperature effects during measurements, “we expect the error can be decreased to about 2 percent,” Sun says. “We expect this reduction in uncertainty to translate into improved EV range.”</p><p>Moreover, using ultrasound scans, “flawed batteries can be easily detected,” Sun says. Ultrasound scanning “may also have the potential to provide an early warning for battery fires, since ultrasound is very sensitive to temperature changes and material changes inside a battery.”</p><p>Future research needs to test this technique on multiple kinds of lithium-ion batteries, as well as a range of charging rates and a larger number of charging cycles; the method “still needs a lot of additional work and validation of the technique before commercialization,” Sun says.</p><p>The scientists detailed <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0378775322010680?via=ihub\" rel=\"noopener noreferrer\" target=\"_blank\">their findings</a> in the 30 November issue of the <em>Journal of Power Sources</em>.</p>",
  "pubDate": "Mon, 24 Oct 2022 15:39:28 +0000",
  "guid": "https://spectrum.ieee.org/ev-battery",
  "category": [
    "Ultrasound",
    "Batteries",
    "Lithium-ion batteries",
    "Electric vehicles"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}