{
  "title": "Germany pushes back against the US by talking to China",
  "link": "https://www.rt.com/news/565744-scholz-germany-us-china/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565744-scholz-germany-us-china/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636133d285f5402fe07f45b5.jpg\" /> German Chancellor Olaf Scholz strives for strategic autonomy by maintaining ties with China despite American pressure <br/><a href=\"https://www.rt.com/news/565744-scholz-germany-us-china/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Olaf Scholz’s upcoming visit to China is a message that Washington can’t dictate Berlin’s foreign policy</strong></p>\n            \n                        \n            <p>German Chancellor Olaf Scholz is <a href=\"https://www.scmp.com/news/china/diplomacy/article/3197667/german-chancellor-olaf-scholz-visit-china-next-week\" target=\"_blank\" rel=\"noopener noreferrer\">set to visit China</a> this week. It marks his first ever trip to the Asian country, amidst growing tensions between&nbsp;Beijing and the West. But the decision to make the trip and the timing behind it is no coincidence. Scholz is sending a deliberate message to the US that Germany isn&rsquo;t going to close the door on China, as Washington attempts to force countries to take a side.</p>\n<p>In fact, he even made an explicit warning against &lsquo;decoupling&rsquo;, something the US has also been pushing for, as seen with its aggressive semiconductor-related sanctions last month. But there&rsquo;s more. Germany also approved a Chinese ownership stake in a critical port, as well as the takeover of a semiconductor company. It&rsquo;s all part of that same message.</p>\n<p>Germany has the most open and enthusiastic policy towards China in Europe, or at least it did. Strengthening ties with Beijing was a critical focus for the government of Angela Merkel, who saw China as its biggest and most lucrative export market for automobile and engineering products.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6360031b85f5407f307f3872.png\" alt=\"FILE PHOTO: German Chancellor Olaf Scholz\" />\n            <figcaption><a href=\"https://www.rt.com/news/565688-germany-scholz-approval-rating/\">Most Germans believe Scholz is not up to the job – poll</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>But the US has always resented this. The US wants to politically dominate Europe, including Germany. It seeks for Berlin to be a lapdog who uncritically follows its foreign policy agenda. Therefore, the US has long raged against open German foreign policy towards both Moscow and Beijing. It funds <a href=\"https://carnegieeurope.eu/strategiceurope/88210\" target=\"_blank\" rel=\"noopener noreferrer\">think-tanks</a> to aggressively lobby Berlin to follow transatlantic goals, an overt form of foreign influence in the country.</p>\n<p>When the conflict in Ukraine broke out, the US believed all its Christmases had come at once and Washington now had the perfect opportunity to make Berlin follow its agenda, and for a while it certainly seemed like that. Olaf Scholz is no Angela Merkel, and at the very least he has talked the talk for most of this year concerning Germany&rsquo;s foreign policy.</p>\n<p>Until reality hit. The costs of the American-led crusade against both Russia and China are exorbitant for Germany and its resource-sparse, export-heavy economy. Germany is facing crippling levels of inflation, its trade surplus has been wiped out by a surge in energy costs which has culled manufacturing, and what&rsquo;s worse is that this entire situation has been to America&rsquo;s own benefit. This prompted rare criticism from French President Emmanuel Macron, who effectively said the US was using the conflict to exploit Europe.</p>\n<p>This has led Germany to hedge its foreign policy options and reassert &ldquo;<em>strategic autonomy</em>&rdquo; from the US. The US has devoted considerable effort to trying to sabotage the China-EU relationship, making this a bold act on Scholz&rsquo;s behalf. While he will have the support of France, which is usually unified with Germany on foreign policy, it will be a struggle to get the entirety of the European Union to follow. The US has gained an ironclad grip over many EU nations, with the exception of Hungary. This has allowed the US to use small countries, such as Lithuania, to drive wedges in the China-EU relationship, making it impossible for the EU to collectively engage with China in a positive way.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/633d620620302708af213f70.jpg\" alt=\"German Economy Minister Robert Habeck\" />\n            <figcaption><a href=\"https://www.rt.com/business/564092-berlin-denounces-washington-astronomical-profiteering/\">Berlin denounces Washington’s ‘astronomical’ profiteering</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>To make it worse, the EU institution itself (beyond the member states) has also become increasingly <a href=\"https://gcaptain.com/eu-warns-germany-against-china-port-buy/\" target=\"_blank\" rel=\"noopener noreferrer\">aggressive and vocal</a> concerning China, with leading commissioners such as Ursula von der Leyen being very pro-US. This means the EU&rsquo;s China policy will continue to be a struggle and tug-of-war concerning multiple agendas. Germany may be the most powerful state, but is even wrestling with itself in respect to its China policy. This means that while Scholz is intent on sending a message to the US in regards to China, one which has been met with a tidal wave of US-centric <a href=\"https://www.reuters.com/world/china/eu-industry-chief-issues-china-warning-ahead-scholzs-beijing-visit-2022-10-31/\" target=\"_blank\" rel=\"noopener noreferrer\">media negativity</a>, it is going to be challenging to maintain the closeness of the Merkel years.</p>\n<p>But one message is otherwise clear: European countries should be able to take their own path and the US has no right to demand their absolute compliance and obedience regarding their own foreign policy goals. Germany&rsquo;s post-war prosperity is built on being a great power that pursues openness and stable ties with other countries, including geopolitical rivals.&nbsp;The Biden administration, meanwhile, has run roughshod imposing its will on Europe. This move by Scholz is an early indication that Berlin is not ready to be Washington's puppet in every respect at the cost of its own wellbeing.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 13:49:45 +0000",
  "dc:creator": "RT"
}