{
  "title": "New Technique Reduces Electrocution Risk After EV Crash",
  "link": "https://spectrum.ieee.org/ev-safety",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-transparent-car-with-red-battery-and-voltage-sign.jpg?id=31691174&width=1245&height=700&coordinates=0%2C234%2C0%2C235\"/><br/><br/><p><em></em><p>\n<em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em>\n</p></p><p>Although the chances are low, gas-powered cars can sometimes catch on fire following a crash. But as the market shifts more toward electric vehicles (EVs), is there an equivalent safety issue, whereby passengers might be electrocuted following a crash?</p><p>Indeed, there is some risk that EVs—which rely on batteries with extremely high voltages—could electrocute passengers after a collision. In a <a href=\"https://ieeexplore.ieee.org/document/9695266\" target=\"_blank\">study</a> published the July issue of <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=63\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Transactions on Power Electronics</em></a>, researchers describe a technique to significantly reduce the chances of this happening. </p><p><a href=\"https://www.york.ac.uk/physics-engineering-technology/people/yihua_hu/\" target=\"_blank\">Yihua Hu</a>, a <a href=\"https://en.wikipedia.org/wiki/Reader_(academic_rank)\" target=\"_blank\">reader</a> (equivalent to an associate professor) at the University of York, in the United Kingdom, was involved in the study. He notes that the propulsion systems of electric vehicles rely on batteries with very high voltages, between 346 and 800 volts. For safety reasons, the <a href=\"https://unece.org/\" target=\"_blank\">Economic Commission for Europe of the United Nations</a> (UNECE) <a href=\"file:///C:/Users/Michelle/Downloads/l_25420120920en00770135.pdf.en.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Regulation R94</a> has already specified that following a crash, the voltages in any vehicle components, except the battery itself, must drop to a safe level (60 V) in less than a minute.</p><p>To accommodate this, electric vehicles are programmed with a protection mode that is instantly triggered following a collision. “The breaker will be tripped immediately to isolate the battery from the other components, and the axle is disconnected from the traction motor by the gear box, and the [propulsion system] just rotates with no load,” explains Hu. “However, in this case, the residual electrical and mechanical energy stored in the capacitor and motor, respectively, will be maintained within the DC bus at the initial level for a long period—as long as over 5 minutes—not only violating the high-voltage safety requirement but increasing the possibility of electric shock.”</p><p>To address this issue, Hu’s team designed a hybrid approach, which relies on both the internal machine windings and external bleeder circuits to achieve the quick and safe discharge. “With the hybrid approach, the machine windings can be adopted as the auxiliary plant for the external bleeder circuits so as to reduce its size, achieving a relatively lightweight and cost-effective discharge technique suited to any EV drives,” explains <a href=\"https://apps.ualberta.ca/directory/person/cgong2\" rel=\"noopener noreferrer\" target=\"_blank\">Chao Gong</a>, a member of Hu’s team who is now a postdoctoral researcher at the <a href=\"https://www.ualberta.ca/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">University of Alberta</a>, in Canada.</p><p>They tested the approach, which involves three different algorithms, depending on the vehicle’s speed at the time of a crash, through simulations and experiments conducted on an electric-motor system in their lab. The results show that the combination of circuit bleeders and internal machine windings can safely lower the voltage of the DC bus to 60 V in just 5 seconds, which is among the fastest discharge times observed, and well within the UNECE safety guidelines. </p><p>Hu notes that his team’s proposed method is low cost, involves a compact structure, and has high reliability. He is currently collaborating with <a href=\"https://www.dynexsemi.com/\" target=\"_blank\">Dynex Semiconductor</a> and <a href=\"https://www.lotuscars.com/en-US/\" target=\"_blank\">Lotus Cars</a> to test the technology in real-world settings. </p><p><strong>“</strong>Further investigation will be needed to address crash-safety-related problems, both in relation to the safety of the occupants and the protection of the fragile components in the EV. This might involve the use of more algorithms to improve the reliability of the safety features,” Hu says, noting that additional work would also have to be done to apply this approach to other electrified transportation systems, such as electric ships or trains.</p>",
  "pubDate": "Mon, 12 Sep 2022 16:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ev-safety",
  "category": [
    "Electric vehicles",
    "Safety",
    "Journal watch"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}