{
  "title": "How to Evaluate Company Leadership",
  "pubDate": "Sat, 19 Mar 2022 16:30:00 +0000",
  "guid": "b4861781-b0a7-4274-b85a-fcfe6295d6f6",
  "link": "https://fool.libsyn.com/how-to-evaluate-company-leadership",
  "itunes:image": "",
  "description": "<p>You probably can’t meet with the CEO of a company on your watch list, but you have some tools to evaluate them. Motley Fool Senior Analyst John Rotonti talks with fellow analysts Auri Hughes and Alyce Lomax about how to spot great business leaders. We also break into our archives to share a 2012 interview with former Costco CEO Jim Sinegal. Both conversations discuss:<br aria-hidden=\"true\" /> - Identifying great corporate leaders<br aria-hidden=\"true\" /> - How excellent CEOs balance stakeholder needs<br aria-hidden= \"true\" /> - Why company culture is one of the most important competitive advantages<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Want more tips for evaluating a CEO?<br aria-hidden=\"true\" /> Click here: <a id=\"LPlnk799700\" href= \"https://www.fool.com/investing/2019/08/28/esg-investing-how-to-evaluate-a-ceo-using-the-4-cs.aspx\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-linkindex=\"0\" name= \"LPlnk799700\">https://www.fool.com/investing/2019/08/28/esg-investing-how-to-evaluate-a-ceo-using-the-4-cs.aspx</a><br aria-hidden=\"true\" />  <br aria-hidden=\"true\" /> Stocks: SHOP, COST, SBUX, ACN, HD, TXN, BRK, MSFT, AMZN<br aria-hidden=\"true\" /> <br aria-hidden=\"true\" /> Host: John Rotonti<br aria-hidden=\"true\" /> Guest: Auri Hughes, Alyce Lomax<br aria-hidden=\"true\" /> Producer: Ricky Mulvey<br aria-hidden=\"true\" /> Engineers: Tim Sparks, Rick Engdahl</p>",
  "content:encoded": "<p>You probably can’t meet with the CEO of a company on your watch list, but you have some tools to evaluate them. Motley Fool Senior Analyst John Rotonti talks with fellow analysts Auri Hughes and Alyce Lomax about how to spot great business leaders. We also break into our archives to share a 2012 interview with former Costco CEO Jim Sinegal. Both conversations discuss: - Identifying great corporate leaders - How excellent CEOs balance stakeholder needs - Why company culture is one of the most important competitive advantages  Want more tips for evaluating a CEO? Click here: <a id=\"LPlnk799700\" href= \"https://www.fool.com/investing/2019/08/28/esg-investing-how-to-evaluate-a-ceo-using-the-4-cs.aspx\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\" data-linkindex=\"0\" name= \"LPlnk799700\">https://www.fool.com/investing/2019/08/28/esg-investing-how-to-evaluate-a-ceo-using-the-4-cs.aspx</a>   Stocks: SHOP, COST, SBUX, ACN, HD, TXN, BRK, MSFT, AMZN  Host: John Rotonti Guest: Auri Hughes, Alyce Lomax Producer: Ricky Mulvey Engineers: Tim Sparks, Rick Engdahl</p>",
  "enclosure": "",
  "itunes:duration": "23:39",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "You probably can’t meet with the CEO of a company on your watch list, but you have some tools to evaluate them. Motley Fool Senior Analyst John Rotonti talks with fellow analysts Auri Hughes and Alyce Lomax about how to spot great business leaders....",
  "itunes:episodeType": "full"
}