{
  "title": "EPISODE 78: Bruce Lee (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 17 Jan 2022 21:29:11 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/1/17/episode-78-bruce-lee-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:61e5dee9b5857c26262657f0",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/d514ddb5-9436-4660-83d8-01a8b8f89547/HOF-78.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"61e5defe7150193fd166bdc9\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/d514ddb5-9436-4660-83d8-01a8b8f89547/HOF-78.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Jeet Kune Do favors formlessness so that it can assume all forms and since Jeet Kune Do has no style, it can fit with all styles. As a result, Jeet Kune Do utilizes all ways and is bound by none and, likewise, uses any techniques or means which serve its ends.”</em>  — Bruce Lee </p><p class=\"\"><em>“1. Research your own experience. 2. Absorb what is useful. 3. Reject what is useless. 4. Add what is specifically your own.”</em> — Bruce Lee’s methodology </p><p class=\"\"><em>“I maintain that truth is a pathless land and you cannot approach it by any religion. A belief is purely an individual matter, and you cannot and must not organize it. If you do, it becomes dead, crystallized; it becomes a creed, a sect, a religion, to be imposed on others.” —</em> Jiddhu Krishnamurti </p><p class=\"\"> </p><p class=\"\"><em>“This doesn’t look like success to me.”</em> — Sovannahry Em </p><p class=\"\"><em>“A martial artist is a human being first. Just as nationalities have nothing to do with one’s humanity, so they have nothing to do with the martial arts.” —</em> Bruce Lee</p><p class=\"\">Ask anyone for one name they associate with martial arts, and odds are they will mention Bruce Lee. Because of his career, millions of people were introduced to martial arts. Thanks to his movies, Lee achieved enduring, worldwide fame, broke plenty of box office records, and forever changed the aesthetics of action films. Not bad for a skinny kid from Hong Kong who arrived in United States with the proverbial shirt on his back. The image of his hyper-muscular body in combat pose has become iconic. But there was a lot more to Bruce Lee than meets the eye. He could have been a rock star or a spiritual leader or anything else he had wished… Martial arts was just a channel for his energy. Had he put that same energy anywhere else, he’d have probably had similar success. Despite Hollywood turning him down time and time again due to racial prejudices, Lee refused to take no for an answer and more or less single-handedly changed the way in which Asian people were perceived in the West. His philosophical insights also changed the face of martial arts training, and introduced masses of people to Taoism and Zen Buddhism. His creative & anti-authoritarian approach to life captured the best of the essence of the 1960s. Get ready for a ride because this is an incredible story I have wanted to tell since I first started podcasting.</p><p class=\"\">This episode covers Bruce Lee’s philosophy and life from 1965 through his death in 1973.</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:26:27",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 78,
  "itunes:title": "EPISODE 78: Bruce Lee (Part 2)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 78: Bruce Lee (Part 2)"
  }
}