{
  "title": "Taming the Climate Is Far Harder Than Getting People to the Moon",
  "link": "https://spectrum.ieee.org/decarbonization",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/chimneys-and-cooling-towers-from-a-coal-fired-power-station-releasing-smoke-and-steam-into-the-atmosphere.jpg?id=31803087&width=1200&height=800&coordinates=0%2C81%2C0%2C81\"/><br/><br/><p>\n<strong>In his 1949</strong> book <em>The Concept of Mind</em>, Gilbert Ryle, an English philosopher, introduced the term “category mistake.” He gave the example of a visitor to the University of Oxford who sees colleges and a splendid library and then asks, “But where is the university?” The category mistake is obvious: A university is an institution, not a collection of buildings.\n</p><p>\n\tToday, no category mistake is perhaps more consequential than the all-too-common view of the global energy transition. The error is to think of the transition as the discrete, well-bounded task of replacing carbon fuels by noncarbon alternatives. The apparent urgency of the transition leads to calls for confronting the challenge just as the United States dealt with two earlier ones: winning the nuclear-arms race against Nazi Germany and the space race against the Soviet Union. The Manhattan Project produced an atomic bomb in three years, and Project Apollo put two U.S. citizens on the moon in July 1969, eight years after President Kennedy had announced the goal.\n</p><hr/><p>\n\tBut difficult and costly as those two endeavors were, they affected only small parts of the economy, their costs were relatively modest, and the lives of average citizens were hardly affected. It is just the opposite for the decarbonization of the energy supply.\n</p><p>\n\tOurs is an overwhelmingly fossil-fueled civilization, and the size and complexity of our extensive supersystem of fuel extraction, processing, distribution, storage, and conversion means that a complete displacement of it will directly affect every person and every industry, not least the growing of food and the long-distance transport of goods and people. The costs will be stupendous.\n</p><p class=\"pull-quote\">\n\tAffluent nations would have to devote on the order of 15 to 20 percent of their annual economic product to the task of decarbonizing the economy.\n</p><p>\n\tBy the time the <a href=\"https://www.ctbto.org/nuclear-testing/history-of-nuclear-testing/manhattan-project/manhattan-project/\" target=\"_blank\">Manhattan Project</a> ended in 1946, it had cost the country nearly US $2 billion, about $33 billion in today’s money, the total equal to only about 0.3 percent of the 1943-45 gross domestic product. When Project Apollo ended in 1972, it had cost about $26 billion, or $207 billion in today’s money; over 12 years it worked out annually to about 0.2 percent of the country’s 1961-72 GDP.\n</p><p>\n\tOf course, nobody can provide a reliable account of the eventual cost of global energy transition because we do not know the ultimate composition of the new primary energy supply. Nor do we know what shares will come from converting natural renewable flows, whether we will use them to produce hydrogen or synthetic fuels, and the extent to which we will rely on nuclear fission (and, as some hope, on fusion) or from other, still unknown options.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A series of cubes made of red blocks where each block is worth 1 billion dollars.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"f92cd39478fc49dcab74edc3fac8c89e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e3193\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-series-of-cubes-made-of-red-blocks-where-each-block-is-worth-1-billion-dollars.png?id=31812355&width=980\"/>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Chris Philpot; Sources: CTBTO Preparatory Commission; ScienceDirect; McKinsey Global Institute</small>\n</p><p>\n\tBut a recent attempt to estimate such costs confirms the magnitude of the category mistake. The <a href=\"https://www.mckinsey.com/business-functions/sustainability/our-insights/the-economic-transformation-what-would-change-in-the-net-zero-transition\" rel=\"noopener noreferrer\" target=\"_blank\">McKinsey Global Institute</a>, in a highly conservative estimate, puts the cost at $275 trillion between 2021 and 2050. That is roughly $9.2 trillion a year, compared with the 2021 <a href=\"https://www.visualcapitalist.com/visualizing-the-94-trillion-world-economy-in-one-chart/\" rel=\"noopener noreferrer\" target=\"_blank\">global economic produc</a>t of $94 trillion. Such numbers imply an annual expenditure of about 10 percent of today’s world economic product. And because the world’s low-income countries could not carry such burdens, affluent nations would have to devote on the order of 15 to 20 percent of their annual economic product to the task. Such shares are comparable only to the spending that was required to win World War II.\n</p><p><em>This article appears in the October 2022 print issue as “Decarbonization Is Our Greatest Challenge.”</em></p>",
  "pubDate": "Thu, 29 Sep 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/decarbonization",
  "category": [
    "Energy",
    "Decarbonization",
    "Reducing carbon emissions"
  ],
  "dc:creator": "Vaclav Smil",
  "media:content": ""
}