{
  "title": "A coherence parameter characterizing generative compressed sensing with Fourier measurements. (arXiv:2207.09340v4 [cs.IT] UPDATED)",
  "link": "http://arxiv.org/abs/2207.09340",
  "description": "<p>In Bora et al. (2017), a mathematical framework was developed for compressed\nsensing guarantees in the setting where the measurement matrix is Gaussian and\nthe signal structure is the range of a generative neural network (GNN). The\nproblem of compressed sensing with GNNs has since been extensively analyzed\nwhen the measurement matrix and/or network weights follow a subgaussian\ndistribution. We move beyond the subgaussian assumption, to measurement\nmatrices that are derived by sampling uniformly at random rows of a unitary\nmatrix (including subsampled Fourier measurements as a special case).\nSpecifically, we prove the first known restricted isometry guarantee for\ngenerative compressed sensing with subsampled isometries, and provide recovery\nbounds with nearly order-optimal sample complexity, addressing an open problem\nof Scarlett et al. (2022, p. 10). Recovery efficacy is characterized by the\ncoherence, a new parameter, which measures the interplay between the range of\nthe network and the measurement matrix. Our approach relies on subspace\ncounting arguments and ideas central to high-dimensional probability.\nFurthermore, we propose a regularization strategy for training GNNs to have\nfavourable coherence with the measurement operator. We provide compelling\nnumerical simulations that support this regularized training strategy: our\nstrategy yields low coherence networks that require fewer measurements for\nsignal recovery. This, together with our theoretical results, supports\ncoherence as a natural quantity for characterizing generative compressed\nsensing with subsampled isometries.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Berk_A/0/1/0/all/0/1\">Aaron Berk</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Brugiapaglia_S/0/1/0/all/0/1\">Simone Brugiapaglia</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Joshi_B/0/1/0/all/0/1\">Babhru Joshi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Plan_Y/0/1/0/all/0/1\">Yaniv Plan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Scott_M/0/1/0/all/0/1\">Matthew Scott</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yilmaz_O/0/1/0/all/0/1\">&#xd6;zg&#xfc;r Yilmaz</a>"
}