{
  "title": "#434: His Last (OOTP Chapter 2, A Peck of Owls)",
  "link": "https://audioboom.com/posts/7370407",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5293,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>No word back from the Nashville school that banned Harry Potter</li>\n<li>Eddie Redmayne provides us a smidge of an update on Fantastic Beasts 3</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix, Chapter 2: A Peck of Owls</li>\n<li>7-Word Summary: Many owls arrive at Harry's home tonight</li>\n<li>Mr. Tibbles was on the case! Good to know that Harry is being watched by... cats!</li>\n<li>We question Mrs. Figg's qualifications for keeping an eye on Harry all of these years</li>\n<li>If Dumbledore was so afraid of Harry using magic this summer why did he not institute a better plan for protecting him?</li>\n<li>We learn Mrs. Figg had to make coming to her house miserable... so the Dursleys allowed it to continue.</li>\n<li>Given his track record, is Mundungus the best person to be keeping tabs on Harry?</li>\n<li>What does it say about Vernon that he thinks Dudley's condition is due to a bad bit of \"foreign\" tea?</li>\n<li>Why wouldn't Harry be innocent until proven guilty following the Dementor attack?</li>\n<li>How quickly did Mundungus get word to Dumbledore about what happened?</li>\n<li>Petunia knows about Dementors... from Snape!</li>\n<li>Vernon asks if Harry's lot has the death penalty! What?!?</li>\n<li>Everyone in the room wonders why the Dementors are in Little Whinging… did Voldemort send them? </li>\n<li>What happens when worlds collide? We share some of our personal experiences.</li>\n<li>Could the Dementors have actually attacked Harry inside the Dursley's house?</li>\n<li>Did a bond form between Petunia and Harry when she proves she understands what Voldemort's return means?</li>\n<li>Are we at all sympathetic to Vernon’s desire to kick Harry out of the house after all that has happened? Our patrons weigh in.</li>\n<li>REMEMBER MY LAST!</li>\n<li>Connecting the Threads, MVP of the Week and Rename The Chapter return!</li>\n<li>Quizzitch: What is the make and model of Nymphadora Tonks’ broom?</li>\n<li>Micah and Eric will be at LeakyCon 2019 from October 11-13 in Boston - <a href=\"http://www.leakycon.com/muggle\">register today</a> using code MUGGLE for $10 off!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits! </li>\n<li>This week in Bonus MuggleCast, available exclusively on Patreon, we discuss what Dudley saw when he was attacked by the Dementor!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 16 Sep 2019 15:22:40 +0000",
  "guid": "tag:audioboom.com,2019-09-16:/posts/7370407",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}