{
  "title": "Russia Cracks Down on &#8216;Foreign Threats&#8217;",
  "link": "https://jamestown.org/russia-cracks-down-on-foreign-threats/",
  "dc:creator": "web1983",
  "pubDate": "Thu, 29 Apr 2021 14:28:27 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=89315",
  "description": "<p>On April 21, Vasily Piskarev, the head of the State Duma’s commission to investigate the facts of interference in the internal affairs of Russia, announced that his body was preparing legislative initiatives to combat foreign interference in Russia, including in its elections, by non-profits and non-governmental organizations (NGO). Piskarev said that “insults against Russia” will receive a “worthy response, including &#8230; <a href=\"https://jamestown.org/russia-cracks-down-on-foreign-threats/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/russia-cracks-down-on-foreign-threats/\">Russia Cracks Down on &#8216;Foreign Threats&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>On April 21, Vasily Piskarev, the head of the State Duma’s commission to investigate the facts of interference in the internal affairs of Russia, announced that his body was preparing legislative initiatives to combat foreign interference in Russia, including in its elections, by non-profits and non-governmental organizations (NGO). Piskarev said that “insults against Russia” will receive a “worthy response, including at the legislative level” (<a href=\"https://ria.ru/20210421/vybory-1729366819.html\">RIA Novosti</a>, April 21). In President Vladimir Putin’s speech to the joint session of parliament that same day, he warned that those who organized against Russia’s interests would “regret their actions like they have not regretted anything for a long time” (<a href=\"https://radiosputnik.ria.ru/20210421/otvet-1729274440.html\">Radio Sputnik</a>, April 21). Taken together, these policies and rhetoric confirm once again spotlight Russia’s attempts to casts itself in the role of victim even when it is the antagonist on the world stage.</p>\n<p>It is not for nothing, for example, that Piskarev announced his commission was investigating foreign interference into the 2021 Russian parliamentary elections just days after a report from the United States’ National Intelligence Council proposed sanctions on Russia for interfering in the 2020 presidential election (<a href=\"https://www.rbc.ru/politics/17/03/2021/60512c879a79473cd4dd0a0e\">RBC</a>, March 17; <a href=\"https://ria.ru/20210320/vmeshatelstvo-1602139530.html?in=t\">RIA Novosti</a>, March 20). Russian politicians allege their victimhood in cases like this, when the reality of Russian interference in US elections is plain to see. In his statement on Instagram, Piskarev said that elections should be “open, competitive, and in full compliance with Russian electoral legislation” (<a href=\"https://www.instagram.com/p/CMpLmv5pVKz/?utm_source=ig_web_copy_link\">Instagram</a>, March 20). One would be hard-pressed to find many experts who would call Russian elections over the last 20 years truly open and competitive, but Piskarev paints foreign powers as the threat to free elections rather than internal forces.</p>\n<p>At the same time that the government is preparing legislative action against NGOs and non-profits it deems as acting on behalf of foreign governments, it is labeling media outlets as foreign agents, too. <em>Meduza</em>, an independent Russian- and English-language news site, received that label on April 23. The outlet now has to warn readers on every post that they are on the foreign agents list; and the worry is that readers will be wary of <em>Meduza</em> going forward. Even more significantly, advertisers may pull out, and <em>Meduza</em> may fold. “We really don’t know what to do next,” wrote Editor-in-Chief Ivan Kolpakov (<a href=\"https://meduza.io/feature/2021/04/26/meduza-inostrannyy-agent-chto-dalshe\">Meduza</a>, April 26).</p>\n<p>The narrative that is being proposed by the government is clear: foreign forces are attempting to interfere in Russian matters, by means of elections, by means of the press and by means of NGOs, so Russia has to protect itself. This messaging plays well among a citizenry with low trust in institutions, particularly the press. According to a Levada survey from 2018, only 31 percent of Russians completely trusted the press (<a href=\"https://www.levada.ru/en/2018/10/22/institutional-trust-4/\">Levada.ru</a>, October 22, 2018). That same survey, interestingly, found that 58 percent of Russians called Putin “completely trustworthy.” The dynamics at play here allow for Putin and his government to attack other institutions as foreign actors, thereby discrediting them.</p>\n<p>Of course, there is a denial of reality occurring here, too. Russia’s interference in foreign elections, be it in the US or in smaller countries like Moldova, is well documented (see <a href=\"https://jamestown.org/program/russia-perfecting-its-elections-interference-toolkit-in-moldova/\">EDM</a>, January 31 2019). By proclaiming its commitment to the sovereignty of all countries, Russia is articulating a worldview it has no interest in actually prescribing to. Ultimately, Russia seems defensive on this issue because it feels it needs to be. Russia has learned to speak the language of international order, even as it defies that order in its actions. It is one more example of a mismatch between rhetoric and reality that pervades Russian political life.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/russia-cracks-down-on-foreign-threats/\">Russia Cracks Down on &#8216;Foreign Threats&#8217;</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}