{
  "title": "Ten Tips for Writing CS Papers, Part 1",
  "link": "",
  "published": "2015-11-29T21:00:00+00:00",
  "updated": "2015-11-29T21:00:00+00:00",
  "author": {
    "name": "Sebastian Nowozin"
  },
  "id": "tag:www.nowozin.net,2015-11-29:/sebastian/blog/ten-tips-for-writing-cs-papers-part-1.html",
  "summary": "<p>As a non-native English speaker I can relate to the challenge of writing\nconcise and clear English.\nScientific writing is particularly challenging because the audience is only\npartially known at the time of writing: at best, the paper will still …</p>",
  "content": "<p>As a non-native English speaker I can relate to the challenge of writing\nconcise and clear English.\nScientific writing is particularly challenging because the audience is only\npartially known at the time of writing: at best, the paper will still be read\nin 10 or 20 years from the time of writing by people from all over the world.</p>\n<p>Learning to write papers well takes a long time and is achieved mostly by\npractice, that is, writing and publishing papers.\nBut to improve your writing at a faster pace you can actively reflect on\ncertain patterns and writing habits you may have.</p>\n<p>Below I compiled a short list of some best practices from my own experience\nand preference, with more following in a second part.\nThis list is by no means exhaustive and has a certain bias towards computer\nscience publications.\nHowever, I hope it will serve as an inspiration to improve your writing.</p>\n<p>I provide some examples of poor writing from published papers.\nTo avoid offending anyone, I select the examples from my own published papers.</p>\n<h2>1. Use Simple Language</h2>\n<p>Concepts and ideas in scientific papers can at times be complex but the\nwriting used to describe them should remain simple.\nSimple writing has short sentences, a clear logical structure, and uses\nminimal jargon.  Writing papers is not poetry but still requires you to pay\nattention to the language you use.</p>\n<p>Computer science does not seem to have an overly large problem with complex\nwriting, possibly due to a large number of non-native English speakers.  Or\nperhaps there is a strong desire to be understood by the writers;\n<a href=\"http://www.theatlantic.com/education/archive/2015/10/complex-academic-writing/412255/\">other academic fields are more challenged</a>.</p>\n<p>Yet, I have frequently seen non-native English speaking junior authors,\nperhaps when writing their first paper, who attempt to copy style from their\nnative language.  At least for native German speakers (like me)\nthis would often lead to comparatively complex writing in terms of sentence\nlengths and less than optimal didactics in terms of presenting the abstract\nbefore the concrete.</p>\n<p>If still in doubt whether using simple language is a good idea, check this\n<a href=\"http://www.improbable.com/ig/winners/#ig2015\">Ig-Nobel-prize-winning</a> work:\n<a href=\"http://www.ucd.ie/artspgs/semantics/ConsequencesErudite.pdf\">(Oppenheimer, \"Consequences of Erudite Vernacular Utilized Irrespective of Necessity:\nProblems with Using Long Words\nNeedlessly\", Applied Cognitive Psychology, 2006)</a>.</p>\n<h2>2. State your Contribution</h2>\n<p>The key contribution of most published papers falls into exactly one out of\nthe following three categories.</p>\n<ol>\n<li><em>Insight</em>: you have an explanation for something that is already there.</li>\n<li><em>Performance</em>: you can do something better.</li>\n<li><em>Capability</em>: you can do something that could not be done before.</li>\n</ol>\n<p>If you know which category your paper falls into this, emphasize this aspect\nearly in the paper, ideally in the abstract.  This sets the tone and\nexpectations for the remainder of the paper.</p>\n<h2>3. See Everything as a Facet on the Contribution</h2>\n<p>Every scientific paper claims a contribution over previous work.\nOnce you have stated the contribution clearly, the rest of the paper is there\njust to support the contribution:\nThe <em>introduction</em> motivates the need for your contribution.\nThe <em>related work</em> section differentiates prior work against your claimed\ncontribution.\nThe <em>method</em> section typically provides a description of the contribution.\nThe <em>experiments</em> verifies that your contribution works as advertised.\nEtcetera.</p>\n<p>The point is: the contribution anchors everything else in the paper.\nIf the contribution is clear, every part of the paper should make sense and\nbecome a different facet or view onto the contribution.</p>\n<p>There are two common ways how this simple structure is violated, leading\nto a poorly written paper.\nThe first way is to not clearly state the contribution, leaving it ambiguous\nduring the whole paper.  In such papers some method may be described, some\nexperiments may be performed, but the higher goal does not emerge.  At the end\nof the paper, the reader may agree with all statements of the paper and still\nwonder what he should make of it.</p>\n<p>The second way to violate the structure is less severe: a long description of\nanother method or work is added to the paper.  I have seen this frequently\nwith junior authors who have just learned about a cool method and want to\nshowcase their understanding.  Such description may even be interesting to a\nreader of the paper, but it is orthogonal to the contribution of the paper thus \nhas negative value and is best removed.</p>\n<h2>4. Consider Using a Page-1 Figure</h2>\n<p>Consider using an explanatory figure on page one of the paper.\nThis was started in the SIGGRAPH community with the <a href=\"http://ivizlab.sfu.ca/arya/Papers/ACM/SIGGRAPH-96/Storytelling%20in%20VR.pdf\">work of Randy\nPausch</a>,\nbut has slowly spread to other communities.</p>\n<p>The main purpose of a page one figure is to provide a gist of the paper, much\nlike a \"visual abstract\".\nIt highlights what is important and sets the right expectations.\nIt is also visually engaging and whets the appetite of the reader.</p>\n<p>What makes a good page one figure?\n1. <em>Simplicity</em>: You need to be able to understand it in 20 seconds or less.\n2. <em>Being self-contained</em>: All relevant information should be in the figure or\nthe figure caption.  The figure caption should be short.</p>\n<p>Many papers benefit from the addition of a page one figure, but there are some\nexceptions, for example in theory papers it could appear out of place.</p>\n<h2>5. Avoid the Passive Voice</h2>\n<p>You can write clear English in both the active and passive voice.\nA historical note on this is available in <a href=\"http://www.biomedicaleditor.com/active-voice.html\">this essay on active vs passive\nvoice in scientific\nwriting</a>:</p>\n<blockquote>\n<p>\"More than a century ago, scientists typically wrote in an active style that\nincluded the first-person pronouns I and we. Beginning in about the 1920s,\nhowever, these pronouns became less common as scientists adopted a passive\nwriting style.</p>\n<p>Considered to be objective, impersonal, and well suited to science writing,\nthe passive voice became the standard style for medical and scientific\njournal publications for decades.</p>\n<p>...</p>\n<p>Nowadays, most medical and scientific style manuals support the active over\nthe passive voice.\"</p>\n</blockquote>\n<p>The reason for this change is simple: most people find text written in the\nactive voice easier to read and more engaging.\nDuke university published a guide on scientific writing that contains a <a href=\"https://cgi.duke.edu/web/sciwriting/index.php?action=passive_voice\">long\ndiscussion on the active versus passive\nvoice</a>.</p>\n<p>In my writing there are very few exceptions were a passive voice may be more\nappropriate, for example when discussing prior work (\"The relationship between\niron intake and lifespan of parrots was studied by Miller and Smith.\")\nor when discussing experimental results (\"The test error remained small even\nwhen the regularization strength was decreased.\"), but even for these two\nexamples we can find an alternative active formulation (\"Miller and Smith\nstudied the relationship between iron intake and lifespan of parrots.\") and\n(\"Even when we decreased the regularization strength the test error remained\nsmall.\").\nThe use of the passive voice in these two exceptions conveys an impersonal\nattitude that may be justified when discussing the work of others or reporting\n(as opposed to interpreting) experimental results.</p>\n<p>Here is a real example from a <a href=\"http://www.nowozin.net/sebastian/papers/nowozin2007actionclassification.pdf\">ICCV 2007 paper</a>\nof mine (page 4):</p>\n<blockquote>\n<p>The  dual problem has a limited number of variables,\nbut a huge number of constraints.  Such a linear program\n<em>can be solved</em> efficiently by the constraint generation\ntechnique: Starting with an empty hypothesis set, the hypothesis whose\nconstraint (6) <em>is violated</em> the most is identified and <em>added</em> iteratively.\nEach time a hypothesis <em>is added</em>, the optimal solution <em>is updated</em>\nby solving the restricted dual problem.</p>\n</blockquote>\n<p>I highlight all the passive formulations.\nHere is a rewrite of the paragraph using only the active voice:</p>\n<blockquote>\n<p>The dual problem has a limited number of variables,\nbut a huge number of constraints.\n<em>We can solve</em> such a linear program efficiently by the constraint generation\ntechnique: Starting with an empty hypothesis set,\n<em>we identify the hypothesis with the largest constraint violation in (6)</em>\nand <em>add the hypothesis to the hypothesis set</em>.\nEach time <em>we add</em> a hypothesis, <em>we also update</em> the optimal solution by\nsolving the restricted dual problem.</p>\n</blockquote>\n<p>I made a few minor changes such as changing the word order and adding the noun\n(\"to the hypothesis set\") for added clarity.  I hope you agree that the second\nversion is easier to read.</p>\n<p>The <a href=\"http://www.nowozin.net/sebastian/blog/ten-tips-for-writing-cs-papers-part-2.html\">next part</a> is available now.</p>",
  "category": ""
}