{
  "title": "White House deletes tweet about Social Security",
  "link": "https://www.rt.com/news/565837-biden-social-security-factcheck-inflation/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565837-biden-social-security-factcheck-inflation/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362d63185f54015db63a2c0.jpg\" /> The White House deleted a tweet about increased Social Security payments after apparently realizing it reflected poorly on Biden <br/><a href=\"https://www.rt.com/news/565837-biden-social-security-factcheck-inflation/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Twitter users had earlier fact-checked the text and claimed it was actually bragging about sky-high inflation</strong></p>\n            \n                        \n            <p>US President Joe Biden&rsquo;s administration has quietly deleted from the official White House account a tweet posted on Tuesday that praised a big increase in Social Security payments. &nbsp;</p>\n<p>The move came after users had appended a fact-check arguing the president was effectively boasting about the high inflation rate.&nbsp;</p>\n<p>&ldquo;<em>Seniors are getting the biggest increase in their Social Security checks in 10 years through President Biden&rsquo;s leadership</em>,&rdquo; the tweet read. A skeptical user had added a note clarifying that the size of the cost-of-living increase is calculated proportional to inflation, meaning a record increase in one reflects a record increase in the other.&nbsp;&nbsp;</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Biden social media geniuses are giving Biden credit for the biggest Social Security COLA in 10 years, but neglect to mention that SS COLA is an automatic formula based on government inflation metric (CPI). 🤦‍♂️ <a href=\"https://t.co/1trGTRI9iV\">pic.twitter.com/1trGTRI9iV</a></p>&mdash; Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1587790124045279233?ref_src=twsrc%5Etfw\">November 2, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>The text was deleted on Wednesday without explanation. An administration official later told Fox News the reason for the removal was that &ldquo;<em>the point was incomplete.</em>&rdquo; White House press secretary Karine Jean-Pierre responded similarly during a press conference on Wednesday afternoon, explaining the tweet had been posted &ldquo;<em>without context</em>&rdquo; before attempting to add that context. &nbsp;</p>\n<p>Because Medicare premiums will decline in 2023 for the first time in a decade, American seniors will have &ldquo;<em>a chance to get ahead of inflation</em>&rdquo; thanks to the &ldquo;rare combination of rising benefits and falling [Medicare] premiums,&rdquo; Jean-Pierre explained. &ldquo;<em>And let&rsquo;s not forget about MAGA Republicans in Congress and their continued threat to threaten Social Security and Medicare</em>,&rdquo; she added, insisting both would be &ldquo;<em>on the chopping block</em>&rdquo; under a Republican government.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/565831-twiitter-accurate-information-musk/\">\n            <span>READ MORE: </span>Elon Musk promises ‘most accurate source of information on Earth’\n        </a>\n    </p>\n\n    \n\n<p>Unlike official Twitter fact-checks, Wednesday&rsquo;s &lsquo;community note&rsquo; about the link between Social Security payment increases and inflation was added by ordinary users and voted up to the point where it appeared on the White House tweet. This is a relatively recent feature the platform&rsquo;s newly-minted owner Elon Musk had described earlier that day. &nbsp;</p>\n<p>Inflation has reached a 40-year high under the Biden administration, boosting the Social Security cost-of-living increase to 8.7% for 2023, the largest hike since 1981. With less than a week to go before the mid-term elections, nearly half of the respondents to a poll conducted last week said inflation (or &ldquo;<em>the economy</em>&rdquo; in general) was the most important issue they would consider when voting.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 20:51:01 +0000",
  "dc:creator": "RT"
}