{
  "title": "“Drawing Together” is awarded Norman B. Leventhal City Prize",
  "link": "https://news.mit.edu/2022/drawing-together-awarded-norman-b-leventhal-city-prize-1020",
  "description": "Winning project supports collaboration between public housing residents in New York City and a local nonprofit offering training for work in the digital economy.",
  "pubDate": "Thu, 20 Oct 2022 08:00:00 -0400",
  "guid": "https://news.mit.edu/2022/drawing-together-awarded-norman-b-leventhal-city-prize-1020",
  "dc:creator": "Maria Iacobo | School of Architecture and Planning",
  "content:encoded": "<p>“Drawing Together,” a social and ecological resilience project in New York City, has been awarded the 2022 Norman B. Leventhal City Prize.&nbsp;</p>\n\n<p>The project is a collaboration between MIT faculty, researchers, and students, and Green City Force (GCF), a nonprofit organization in New York City that trains young people for careers with a sustainability focus while they serve local public housing communities.</p>\n\n<p>The winning proposal was submitted by a team led by MIT’s Miho Mazereeuw, associate professor and director of the Urban Risk Lab; Nicholas de Monchaux, professor and head of the Department of Architecture; Carlos Sandoval Olascoaga PhD ’21, a postdoc in the Department of Architecture and the MIT Schwarzman College of Computing; and Tonya Gayle, executive director of Green City Force.</p>\n\n<p>Through their Service Corps (affiliated with the national AmeriCorps service and training program), GCF trains young residents of New York City Housing Authority public housing to participate in large-scale environmental and health initiatives in public housing and other local communities.</p>\n\n<p>The Drawing Together team will collaborate with GCF on its “Eco-Hubs,” an urban farms initiative. In a co-design effort, Drawing Together will create a new digital platform to support community-led planning and design processes for the siting, design, and operation of these spaces. This platform will also facilitate the scaling-up of community engagement with Eco-Hubs.</p>\n\n<p>The $100,000 triennial prize was established in 2019 by MIT’s Norman B. Leventhal Center for Advanced Urbanism (LCAU) to catalyze innovative interdisciplinary urban design and planning approaches worldwide to improve the environment as well as the quality of life for residents. The first awardee was “Malden River Works for Waterfront Equity and Resilience,” a project for a civic waterfront space in Malden, Massachusetts.</p>\n\n<p>The 2022 Leventhal City Prize call for submissions sought proposals that focused on digital urbanism — investigating how life in cities can be improved using digital tools that are equitable and responsive to social and environmental conditions. The jury reviewed proposals for projects that offered new urban design and planning solutions using evolving data sources and computational techniques that transform the quality of life in metropolitan environments.</p>\n\n<p>“Digital urbanism is the intersection between cities, design, and technology and how we can identify new ways to include technology and design in our cities,” says LCAU Director Sarah Williams. “Drawing Together perfectly exemplifies how digital urbanism can assist in the co-development of design solution and improve the quality of life for the public.”</p>\n\n<p>The team will expand the workforce training currently offered by GCF to incorporate digital skills, with the goal of developing and integrating a sustainability-focused data science curriculum that supports sustainable urban farming within the Eco-Hubs.</p>\n\n<p>“What is most inspiring about this project is that young people are the writers, rather than passive subjects of urban transformation,” says juror Garrett Dash Nelson, president and head curator of the Norman B. Leventhal Map and Education Center at the Boston Public Library. “By taking the information and design architectures and making them central to&nbsp;youth-driven decisions about environmental planning, this project has the potential to activate a new participatory paradigm that&nbsp;will resonate far beyond New York City.”</p>\n\n<p>“In addition to community-based digital methods for urban environmental design, this project has the potential to strengthen computational skills in green job opportunities for youth that the Green City Force Eco-Hubs serve,” says juror James Wescoat, MIT Aga Khan Professor Emeritus of Landscape Architecture and Geography.&nbsp;</p>\n\n<p>In addition to Nelson and Wescoat, the jury for this year’s competition included Lilian Coral, director of National Strategy and Technology Innovation at the Knight Foundation; Jose Castillo, principal at a|911 and&nbsp;professor of urbanism at CENTRO University; and Nigel Jacob,&nbsp;senior fellow at the Burnes Center for Global Impact at Northeastern University.</p>\n\n<p>The prize jury identified two finalists. Co-HATY Accelerator Team is a multidisciplinary project that helps provide housing and social support to Ukraine’s displaced residents. The team of urban planners, information technologists, architects, and sociologists are using digital technology to better connect residents across the country with housing opportunities. Team members include Brent D. Ryan, associate professor of urban design and public policy at MIT, and Anastasiya Ponomaryova, urban designer and co-founder of co-HATY.</p>\n\n<p>“The Ukraine’s team proposal makes a point of the relevance of architecture and planning in the context of humanitarian crises,” says Castillo. “It forces us to deploy techniques, methods, and knowledge to resolve issues ‘on demand.’ Different from a view of architecture and planning as ’slow practices,’ where design processes, research, pedagogies, and buildings take a long time to be deployed and finalized, this research shows an agile but thorough approach to the immediate and the contingent.”</p>\n\n<p>The second finalist is “Ozymandias: Using Artificial Intelligence to Map Urban Power Structures and Produce Fairer Results for All,” a project led by the Portland, Maine, Society for Architecture. The team behind this project seeks to encourage broader civic participation and positive change in municipal governments. By using emerging AI computation tools to illuminate patterns in power structures and decision-making, the team hopes to highlight correctable yet previously unrecognizable inequities. Principal investigator for the project is Jeff Levine, a lecturer in MIT’s Department of Urban Studies and Planning and a past director of planning and urban development for Portland.</p>\n\n<p>“The Ozymandias project recognizes an important truth about urban decision-making — that it is neither a bottom-up nor a top-down structure, but a tangled and often obscure network of formal and informal power systems,” says Nelson. “By bringing analytical methods to bear on a perennial question for civic action — who really governs in a democratic system? — the project offers a provocative methodology for examining why nominally participatory urban processes so often fail at producing inclusive and equitable outcomes.”</p>",
  "media:content": {
    "media:description": "Rendering of a \"resilience hub\" incorporating urban agriculture, from the project proposal of Leventhal City Prize winner Drawing Together.",
    "media:credit": "Image courtesy of Local Code Lab + modem + Green City Force."
  },
  "category": [
    "Awards, honors and fellowships",
    "Architecture",
    "Urban studies and planning",
    "Sustainability",
    "Environment",
    "Housing",
    "Community",
    "Urban planning",
    "Design",
    "Agriculture",
    "Labor and Jobs",
    "Digital technology",
    "Digital humanities",
    "School of Architecture and Planning",
    "MIT Schwarzman College of Computing"
  ]
}