{
  "id": "https://bibleinoneyear.org/en/youth/23",
  "title": "Day 23: You Have the Keys",
  "description": "Psalm 14:2, Genesis 45:4–15, Matthew 16:6–19.  You are not powerless  You have the immense privilege of having been given ‘the keys of the kingdom’",
  "pubDate": "Sun, 23 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/23/",
  "itunes:duration": "13:34",
  "guid": "enyouth23012022-23",
  "length": 814.34,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 23: You Have the Keys",
  "itunes:subtitle": "Psalm 14:2, Genesis 45:4–15, Matthew 16:6–19.  You are not powerless  You have the immense privilege of having been given ‘the keys of the kingdom’",
  "itunes:summary": "On 15 January 2009, US Airways flight 1549 hit a flock of geese. Both engines failed. The plane was flying over New York. Potential disaster loomed. Not only were the 155 occupants on board in danger, but thousands more could have been killed had the plane hit one of New York’s skyscrapers. Captain Chesley Burnett ‘Sully’ Sullenberger III guided the crippled US Airways plane with immense skill and courage. He performed a successful emergency landing on the Hudson River. Not a single passenger died, nor were there any serious injuries. The Mayor of New York City gave to the heroic pilot, who had saved them, the keys to the city.\nTo give someone the keys to a city is an immense privilege. They symbolise access and authority. Keys are usually given in recognition of some great service to the city. In the New Testament, we see that Jesus is the key holder. The risen Christ says, ‘I hold the keys of death and Hades’ (Revelation 1:18). Jesus has brought about a far greater salvation than any other person could achieve. The authority he holds is also the greatest there could ever be – he holds the keys of life and death.\nAmazingly, Jesus gives to Peter and the church (that is, to us) ‘the keys of the kingdom’ (Matthew 16:19). Many Christians feel powerless, lacking in any kind of spiritual authority. They do not seem to realise what Jesus has given to them. You are not powerless. You have the immense privilege of having been given ‘the keys of the kingdom’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 388
}