{
  "title": "No, Russia Didn’t Blow Up Their Own Pipeline",
  "itunes:title": "No, Russia Didn’t Blow Up Their Own Pipeline",
  "pubDate": "Fri, 30 Sep 2022 05:30:00 +0000",
  "guid": "baff0ecb-5c34-4ddb-9e4e-fc458c42bef8",
  "link": "https://thejimmydoreshow.libsyn.com/no-russia-didnt-blow-up-their-own-pipeline",
  "itunes:image": "",
  "description": "<p>On Tuesday it was revealed that the Nord Stream 1 & 2 pipelines that carry liquefied natural gas under Northern Europe’s Baltic Sea had been sabotaged, rendering them inoperable, possibly permanently. And almost as quickly the finger-pointing began, with many in the West alleging that Russia had intentionally damaged its own pipeline while others claimed that a more logical explanation would pin the blame on the U.S., likely acting to eliminate any possibility that European countries will revert to relying on Russia as a source of gas.<br /> <br /> Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the competing theories and possible motives behind the Nordstream attacks.<br /> <br /> Plus segments on how the mainstream media silences internal voices attempting to tell the truth about war and Bill Gates' ongoing effort to blame the pandemic's devastating impact on regular people instead of the oligarchs and their minions in the government who actually make all the decisions.<br /> <br /> Also featuring Stef Zamorano, Kit Cabello and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "content:encoded": "<p>On Tuesday it was revealed that the Nord Stream 1 & 2 pipelines that carry liquefied natural gas under Northern Europe’s Baltic Sea had been sabotaged, rendering them inoperable, possibly permanently. And almost as quickly the finger-pointing began, with many in the West alleging that Russia had intentionally damaged its own pipeline while others claimed that a more logical explanation would pin the blame on the U.S., likely acting to eliminate any possibility that European countries will revert to relying on Russia as a source of gas.  Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the competing theories and possible motives behind the Nordstream attacks.  Plus segments on how the mainstream media silences internal voices attempting to tell the truth about war and Bill Gates' ongoing effort to blame the pandemic's devastating impact on regular people instead of the oligarchs and their minions in the government who actually make all the decisions.  Also featuring Stef Zamorano, Kit Cabello and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!</p>",
  "enclosure": "",
  "itunes:duration": "59:35",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "On Tuesday it was revealed that the Nord Stream 1 & 2 pipelines that carry liquefied natural gas under Northern Europe’s Baltic Sea had been sabotaged, rendering them inoperable, possibly permanently. And almost as quickly the finger-pointing began,...",
  "itunes:episodeType": "full",
  "itunes:summary": "On Tuesday it was revealed that the Nord Stream 1 & 2 pipelines that carry liquefied natural gas under Northern Europe’s Baltic Sea had been sabotaged, rendering them inoperable, possibly permanently. And almost as quickly the finger-pointing began, with many in the West alleging that Russia had intentionally damaged its own pipeline while others claimed that a more logical explanation would pin the blame on the U.S., likely acting to eliminate any possibility that European countries will revert to relying on Russia as a source of gas. Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss the competing theories and possible motives behind the Nordstream attacks. Plus segments on how the mainstream media silences internal voices attempting to tell the truth about war and Bill Gates' ongoing effort to blame the pandemic's devastating impact on regular people instead of the oligarchs and their minions in the government who actually make all the decisions. Also featuring Stef Zamorano, Kit Cabello and Mike MacRae! And phone calls from Joe Biden and Vince Vaughn!"
}