{
  "id": "yt:video:gvQMNQlgu3s",
  "yt:videoId": "gvQMNQlgu3s",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Pole-Jumping for Red Coins - 0.5x A Presses",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-06-18T05:37:21+00:00",
  "updated": "2022-05-13T00:59:14+00:00",
  "media:group": {
    "media:title": "SM64 - Pole-Jumping for Red Coins - 0.5x A Presses",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I collect the star Pole-Jumping for Red Coins in Dire, Dire Docks using 0.5 A presses.\n\nThe A press is to swim with the shell in order to:\n(1) clone a pole\n(2) place the HOLP using a dummy clone\n(3) clone the whirlpool\n\nThis video is an improvement from my previous video in which I collected this star in 1.5 A presses. You can find that video here: https://youtu.be/2irYbgBSppU. Since then, I worked out a way to get to the red coin in the cage using a whirlpool clone and a new glitch known as \"no translation loading\".\n\nYou see, all red coins can be collected easily except for the two behind the red walls and the one in the cage. To collect the two red coins behind the red walls, I first placed the HOLP in a specific location using Whomp's Fortress. I then cloned a pole and released it at this HOLP using the hat in hand glitch. Consequently, I could use this cloned pole as an intermediate stopping point to help traverse the distance between two far apart poles.\n\nCollecting the red coin in the cage was an entirely separate and more complicated matter. Backstory: Kyman showed the ABC crew some odd behavior he observed upon releasing the whirlpool clone at the loading point. Specifically, he demonstrated that he ended up in different locations throughout the course, which peaked our interest since what if it could warp Mario directly to the red coin in the cage? Tyler then looked into the matter, and informed us that Mario continues to spiral around whatever object overwrites the whirlpool's slot. Thus, I tested and played around with this, but ultimately declared it to be impossible to use [https://youtu.be/NCCID9hHrlI]. All hope was lost, until I realized Kyman had one more clip that seemed to defy my model. In this clip, he ended up going around in a big spiral in the beginning area (what I show at 13:31). I then looked into this and meticulously mapped it out [http://imgur.com/Mn1ut23], and realized Mario actually evaded the translation that normally applies to him at the loading point. Hence, no translation loading was discovered. I then tested and played around with the new possibilities and came up with a theoretical route that worked, but again declared it to be impossible in practice [https://youtu.be/EHWitWBHzi4]. However, after even more testing and playing around, I discovered that we could use the original whirlpool clone to achieve no translation loading, IF we placed it out of bounds. And of course, we could achieve this by placing the HOLP using the OTHER area's coordinate system and then using the hat in hand glitch. Finally, the strat all came together and an A press was saved!\n\nTo learn more about object displacement and the HOLP, you can watch my video on them here: http://youtu.be/seQ-IL-eNqk\n\nIf you're wondering what a half A press is, read this before commenting to ask. I use a special notation that allows for half A presses. Specifically, if you enter a level already holding the A button, then that A press only counts as half. It's actually pretty important to distinguish between the A button being PRESSED and the A button being HELD. While pressing A allows Mario to execute several kinds of jumps, the holding of A allows Mario to swim in water, do little kicks up slopes, grab the owl, and twirl slowly. So if a star requires the A button to be held, the pressing of the A button could have been done at some point in the past, and just held until that moment. For instance, let's say there are two stars: one that requires the A button to be pressed (x1 A presses), and another that only requires the A button to be held (0.5 A presses). Individually, these stars would both require a full A press. But if these stars were collected one after the other, then the A button could be pressed during the former, and held all the way through to the next star to be used in the latter. In this manner, these stars together would only use 1 A press, whereas they would take 2 A presses if done individually. So during a 120 star run, you would round these half A presses down, but on a star-by-star basis you would round them up.\n\nNote: If it ever looks like I'm goofing around or stalling, it's because I'm waiting for the poles to get into position, and there's nothing I can do to speed it up. So just because I'm styling doesn't mean I'm wasting time!\n\n.m64 stats:\nRe-records (already on .m64): 13243\nRe-records (added to .m64): 4527\nRe-records (in total): 17770\nLength: 10 minutes and 53 seconds\n\nPicture of my calculations: http://imgur.com/PIeqSZk\n\nABC Playlist: https://www.youtube.com/playlist?list=PLmvvhlevqC2d6vis077yFHuLJHYtTtqe_\nABC Routes: https://docs.google.com/document/d/1ypRVVRyf4x-v8GqCSmKYnicrfKSIjao3Y1ZVl52RIyM/edit",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}