{
  "id": "yt:video:eXULfD94gho",
  "yt:videoId": "eXULfD94gho",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Compliant 6-Degree-of-Freedom Precision Motion Stage: The Hexblade Positioner",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2022-04-26T19:21:13+00:00",
  "updated": "2022-07-19T17:33:06+00:00",
  "media:group": {
    "media:title": "Compliant 6-Degree-of-Freedom Precision Motion Stage: The Hexblade Positioner",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video introduces a six-degree-of-freedom (6 DOF) flexure-based precision motion stage, called the Hexblade Positioner. It is a fully compliant version of a hexapod (i.e., Stewart Platform) that can be positioned and oriented as desired over relatively large ranges and speeds with nanometer repeatability (i.e., high precision) due to the deformation of its metal flexure bearings. To learn more about its applications and how it works, see the published Precision Engineering journal article at this link:\n\nhttps://www.sciencedirect.com/science/article/pii/S0141635922000770 \n\nThe reference for the paper is:\n[1] Yang, Z., Lee, R., Hopkins, J.B., 2022, “Hexblade Positioner: A Fast Large-range Six-axis Motion Stage,” Precision Engineering, 76: pp. 199-207\n\nPart files to fabricate this flexure system can be downloaded on Thingiverse at this link:\nhttps://www.thingiverse.com/thing:5436903\n\nAcknowledgements:\nSpecial thanks to my students Zhidi Yang and Ryan Lee for helping to fabricate and test the Hexblade Positioner. I’m also grateful to DARPA Program Officer Bill Carter for funding this work and to Prof. Rob Candler and Prof. Pirouz Kavehpour for their collaborative support with the funded effort. Also special thanks to Prof. Dannis Brouwer for allowing us to use a clip from his YouTube video:\n\nT-Flex: Fully flexure-based hexapod with motor current controller - YouTube\n\nAnd for the creative common’s images and animations used:\nhttps://commons.wikimedia.org/wiki/File:Simulator-flight-compartment.jpeg\nhttps://upload.wikimedia.org/wikipedia/commons/3/38/Simulator-flight-compartment.jpeg\nEthan Arnold, CC BY-SA 3.0 (https://creativecommons.org/licenses/by-sa/3.0), via Wikimedia Commons\n\nDisclaimer: \nResponsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}