{
  "id": "yt:video:IUR9dHxObm8",
  "yt:videoId": "IUR9dHxObm8",
  "yt:channelId": "UC9_beF3sqLK7mCOlPgSxoug",
  "title": "Sadie Adler is a Mary Sue",
  "link": "",
  "author": {
    "name": "Drummer Boy",
    "uri": "https://www.youtube.com/channel/UC9_beF3sqLK7mCOlPgSxoug"
  },
  "published": "2020-02-20T22:00:07+00:00",
  "updated": "2022-05-24T08:53:07+00:00",
  "media:group": {
    "media:title": "Sadie Adler is a Mary Sue",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The nicest thing I can say about Sadie is that she has a nice ass.\n\nContents:\nIntroduction - 00:00\nPreamble - 00:15\nSadie's Story - 6:42\nReflection - 45:52\nReal Life Female Outlaws - 50:21\nThe Video Will End Soon, I Swear! - 1:01:30\n\nBelow I will list various citations and thoughts in regard to the video in chronological order.\n\nRDR2 is a disappointment my almost every metric (I will confess that I think hunting is fun, but there’s never an actual incentive to do it because missions give you too much money.) My comment on the graphics will most likely get some pushback, so let me explain what I mean (based on my experience with the PC versions). RDR2 is most certainly a more striking game than GTA5, but after careful examination, I believe that GTA is a clear winner in terms of actual detail. RDR2 has excellent distant LODs, but both textures and geometric detail fail to surpass GTA5. Most effects that contribute to RDR2’s graphical makeup already existed in GTA5 (volumetric lighting, variable shadow softness, water reactiveness [yes, actually]), even though they were used more conservatively. I’m not saying that RDR2 is a bad looking game, but it’s disappointing compared to GTA5, especially when taking into note GTA5’s last gen roots.\n\nIt’s highly unlikely that a woman would somehow find herself at the top of the hierarchy of STEM-excelling, criminals in city like Los Angeles. Bellow are a few links that support my case, both are from Wikipedia, which unfortunately has some editorialization, but they’ll do:\nhttps://en.wikipedia.org/wiki/Sex_differences_in_crime\nhttps://en.wikipedia.org/wiki/Women_in_STEM_fields#North_America\n\nHere’s the rabbit hole to American Krogan’s video on RDR2’s politics:\nhttps://www.bitchute.com/video/5opFTQmh3cZ3/\nI disagree with a few things he says, such at his conclusion that ALL the blame for the failure of Dutch’s ideology is passed from Dutch to Micah (there’re a few instances where Thumby makes it clear that Dutch is the one to blame by having various characters refer to Dutch as having a ‘God Complex’). Also, there’s this one part where he shows a picture of the Wild Bunch Gang as a representation of the Pinkertons. I don’t support all American Krogan’s opinions, but I do support all of his facts.\n\nI don’t feel the need to post links I used for the 40%ers part. Just google ‘transgender woman wins at X sport’ and you’ll find something without too much trouble.\n\nHere’s a few links about Women’s suffrage:\nhttps://educationpost.org/the-suffragettes-were-not-allies-to-black-women-they-were-racist/\nhttps://www.telegraph.co.uk/women/womens-life/11914757/Racism-and-the-suffragettes-the-uncomfortable-truth.html\nI’m not entirely sure to what degree the suffragettes were more racists than the average white southerner, but my point is more so that intersectionality is a lie. It’s more than possible that the various ‘oppressed groups’ will end up oppressing each other given the chance.\n\nMy choice of music at any given moment reflects how seriously I take what’s going on.\n\nRandom site that conveys the commonly held knowledge than men are stronger than women:\nhttps://www.livestrong.com/article/509536-muscular-strength-in-women-compared-to-men/\n\nWhen Guys Hit Back:\nhttps://www.youtube.com/watch?v=bk5xYc09Mos&t=10s\n\nVideo I pulled cringey comments praising Sadie from:\nhttps://www.youtube.com/watch?v=vCyNwxwZTF4\n\nDr. Phil source:\nhttps://www.youtube.com/watch?v=-9omkdPGNmo\nHe obviously wasn’t (directly) referring to people who think that Sadie Adler is a real character.\n\nGood, the Bad, and the Ugly clip:\nhttps://www.youtube.com/watch?v=JrYtD7gSWsI\n\nFemale outlaws sources:\nhttps://owlcation.com/humanities/10-Notorious-Female-Outlaws-from-the-Wild-West\nhttps://en.wikipedia.org/wiki/Pearl_Hart\nhttps://en.wikipedia.org/wiki/Laura_Bullion\nhttp://shipwrecklibrary.com/deadlands/belle-siddons/\nhttps://en.wikipedia.org/wiki/Rose_Dunn\nhttps://tshaonline.org/handbook/online/articles/fsc33\nhttps://www.amazon.com/Sallie-Scull-Texas-frontier-Phantoms/dp/B0007EGU0I\nhttps://www.worldcat.org/title/sallie-scull-on-the-texas-frontier-phantoms-on-rio-turbio/oclc/2675135\nhttps://en.wikipedia.org/wiki/Big_Nose_Kate\nhttps://en.wikipedia.org/wiki/Belle_Starr\nhttps://en.wikipedia.org/wiki/Etta_Place\nhttps://en.wikipedia.org/wiki/Eleanor_Dumont\nhttps://en.wikipedia.org/wiki/Bonnie_and_Clyde\n\nCharles Murray’s Human Diversity : The Biology of Gender, Race, and Class:\nhttps://www.amazon.com/Human-Diversity-Biology-Gender-Class/dp/1538744015?SubscriptionId=AKIAILSHYYTFIVPWUY6Q&tag=duckduckgo-d-20&linkCode=xm2&camp=2025&creative=165953&creativeASIN=1538744015\nHighly recommended read. Another good source:\nhttps://sites.google.com/site/dianehalperncmc/books/sex-differences-in-cognitive-abilities\n\nCivil War casualties:\nhttps://www.battlefields.org/learn/articles/civil-war-casualties\n\nI don't hate women, I just hate poorly written female characters... and the federal government.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}