{
  "title": "PEMP: Leveraging Physics Properties to Enhance Molecular Property Prediction. (arXiv:2211.01978v1 [q-bio.BM])",
  "link": "http://arxiv.org/abs/2211.01978",
  "description": "<p>Molecular property prediction is essential for drug discovery. In recent\nyears, deep learning methods have been introduced to this area and achieved\nstate-of-the-art performances. However, most of existing methods ignore the\nintrinsic relations between molecular properties which can be utilized to\nimprove the performances of corresponding prediction tasks. In this paper, we\npropose a new approach, namely Physics properties Enhanced Molecular Property\nprediction (PEMP), to utilize relations between molecular properties revealed\nby previous physics theory and physical chemistry studies. Specifically, we\nenhance the training of the chemical and physiological property predictors with\nrelated physics property prediction tasks. We design two different methods for\nPEMP, respectively based on multi-task learning and transfer learning. Both\nmethods include a model-agnostic molecule representation module and a property\nprediction module. In our implementation, we adopt both the state-of-the-art\nmolecule embedding models under the supervised learning paradigm and the\npretraining paradigm as the molecule representation module of PEMP,\nrespectively. Experimental results on public benchmark MoleculeNet show that\nthe proposed methods have the ability to outperform corresponding\nstate-of-the-art models.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/q-bio/1/au:+Sun_Y/0/1/0/all/0/1\">Yuancheng Sun</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Chen_Y/0/1/0/all/0/1\">Yimeng Chen</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Ma_W/0/1/0/all/0/1\">Weizhi Ma</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Huang_W/0/1/0/all/0/1\">Wenhao Huang</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Liu_K/0/1/0/all/0/1\">Kang Liu</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Ma_Z/0/1/0/all/0/1\">Zhiming Ma</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Ma_W/0/1/0/all/0/1\">Wei-Ying Ma</a>, <a href=\"http://arxiv.org/find/q-bio/1/au:+Lan_Y/0/1/0/all/0/1\">Yanyan Lan</a>"
}