{
  "id": "yt:video:dhW4XFGQB4o",
  "yt:videoId": "dhW4XFGQB4o",
  "yt:channelId": "UCAL3JXZSzSm8AlZyD3nQdBA",
  "title": "Primitive Technology: Iron knife made from bacteria",
  "link": "",
  "author": {
    "name": "Primitive Technology",
    "uri": "https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA"
  },
  "published": "2022-06-30T21:15:14+00:00",
  "updated": "2022-09-19T13:55:41+00:00",
  "media:group": {
    "media:title": "Primitive Technology: Iron knife made from bacteria",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Iron knife made from bacteria\nSubscribe: http://bit.ly/subPT | Never miss a video! Enable ‘ALL’ Notifications!\nWatch my newsest content: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\n\nFollow Primitive Technology:\nWordpress: https://primitivetechnology.wordpress.com/\nPatreon: https://patreon.com/user?u=2945881\n\nWatch More Primitive Technology:\nNewest Uploads: https://youtube.com/playlist?list=PLGnWLXjIDnpBR4xqf3FO-xFFwE-ucq4Fj&playnext=1&index=2\nPyrotechnology: https://youtube.com/playlist?list=PLGnWLXjIDnpBVRqu5lz5JGaQxjPs7q3CJ&playnext=1&index=2\nShelter: https://youtube.com/playlist?list=PLGnWLXjIDnpBBsdKZb-vy30o88SIxItp2&playnext=1&index=2\nWeapons: https://youtube.com/playlist?list=PLGnWLXjIDnpA-XGDrrmVgBnSXx15i2Awp&playnext=1&index=2\nPopular Videos: https://youtube.com/playlist?list=PLGnWLXjIDnpAb29Lrdki5BPjTpMon8zla&playnext=1&index=2\n\nAbout This Video:\nI smelted iron from iron bacteria and then cast the iron in a mold to form a rudimentary knife, making this the first iron tool I've produced yet. The ore was a species of bacteria that lives by oxidizing iron dissolved in ground water. It appears as an orange/yellow cloudy precipitate in creeks and ponds. It's a very common natural occurrence and can be found on all continents. I collected the diluted ore and poured it into a large, porous ceramic pot I made. The water leaked out, leaving behind the concentrated iron bacteria \"mud\" like substance. I dried it out until it resembled rusty earth. It took a month to collect the ore for one 2 hour smelt, from a stretch of creek about 20 meters long. \n\nCharcoal was then made simply by burning a pile of wood in a small pit and then extinguishing it with just enough water once it had visibly carbonized. It was quicker to make than the charcoal I normally make in a mound (1hr vs 2.5hrs) and took less preparation time making than the mound from mud. A small furnace was made and the multiblade blower (made in the last episode) was attached to it for air supply. \n\nThe furnace was preheated for an hour with wood and filled with charcoal at the end, using the blower periodically but not full blast. Then over the next hour, 3 double handfuls of charcoal (about 500g) and 2 single handfuls or ore (about 200g) were added every 5 minutes while blowing air into the furnace to burn it at this rate. Then there was a 30 min burn down still using the blower till the charcoal reached the level of the air entry. The total operation took 2 hrs. A lump of slag was taken from the furnace and broken up. Iron prills up to about 1 cm in diameter were retrieved. For the sake of experiment I weighed the iron produced on modern scales= 40g iron from an estimated 1.2 kg of ore. Even though this is a low yield by modern standards it is a marked improvement over my previous smelts that produced much smaller and fewer prills over all. I did another smelt that almost exactly reproduced this result (80g of iron stored). The increase in efficiency is due to the much better blower design (8 blades vs the original 4). \n\nNext I cast the iron in a mold. The melting point of pure metalic iron is 1538 C. However, the iron prills I produced are cast iron, an alloy of iron and carbon where carbon is about 2-4% by weight. Cast iron has a relatively tepid melting point of 1150 C. Such a temperature is easily attainable in an open hearth with charcoal and a forced air supply. So, I put the prills into a triangular clay mold and put it into a simple pit forge that took very little time to make. Importantly, I made a special flat air pipe that spread the incoming air into a sheet that blew over the width of the mold to heat all of it evenly, a round one would only heat the middle of the mold and not melt it completely. Charcoal was then put on top of the mold about 12.5 cm deep and the air blast started. The fire became white hot, exceeding the 1150 C needed to melt the iron. The iron melted filling the mold and the iron triangle was taken from it. \n\nInitially, I was going to make it into an axe head, but decided it was too brittle (cast iron is actually harder than pure iron but brittle) so I sharpened it into a knife. It took many hours of sharpening to bring the end to a point. It's not a sharp blade it works well for drilling holes in timber (like for making fire drill sockets). This represents the first iron tool I've made completely from scratch in the wild. Future experiments will focus on obtaining greater yields of iron, exploiting richer sources of ore and ultimately making better iron tools.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}