{
  "title": "Elon Musk Confronts the Moderator’s Dilemma and Holds a Mirror to Users",
  "link": "https://www.aei.org/technology-and-innovation/elon-musk-confronts-the-moderators-dilemma-holds-mirror-to-users/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Tue, 01 Nov 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "big tech",
    "Censorship",
    "Elon Musk",
    "First Amendment",
    "Free speech",
    "Innovation",
    "internet",
    "Online Speech Project",
    "Social media",
    "twitter"
  ],
  "guid": "https://www.aei.org/?p=1008664191",
  "description": "<p>With Elon Musk’s Twitter acquisition finalized, what needs to happen next for the social media platform to become the digital town square that Musk envisions?</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/elon-musk-confronts-the-moderators-dilemma-holds-mirror-to-users/\">Elon Musk Confronts the Moderator’s Dilemma and Holds a Mirror to Users</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"1800\" height=\"250\" src=\"https://www.aei.org/wp-content/uploads/2022/05/AEIsection230banner.png?x91208\" alt=\"\" class=\"wp-image-1008627382\"/><figcaption>Note: This post and all affiliated content are part of AEI’s Online Speech Project. To learn more about the project, click <a href=\"https://www.aei.org/online-speech-project/\" target=\"_blank\" rel=\"noreferrer noopener\">here</a>.</figcaption></figure>\n\n\n\n<p>Last week, Elon Musk announced his acquisition of Twitter as only he could: with a triumphant entry into the company’s headquarters, beaming with the self-amusement of a man who knows he’s about to land the perfect dad joke. (Let that <a href=\"https://twitter.com/elonmusk/status/1585341984679469056\" target=\"_blank\" rel=\"noreferrer noopener\">sink</a> in.) Shortly thereafter, he adopted the moniker of Chief Twit and told the world “<a href=\"https://twitter.com/elonmusk/status/1585841080431321088\" target=\"_blank\" rel=\"noreferrer noopener\">the bird is freed</a>.”</p>\n\n\n\n<p>In an <a href=\"https://twitter.com/elonmusk/status/1585619322239561728\" target=\"_blank\" rel=\"noreferrer noopener\">open letter</a>, Musk reiterated the commitment to free speech that prompted his initial bid several months ago. “The reason I acquired Twitter,” he explained, “is because it is important to the future of civilization to have a common digital town square, where a range of beliefs can be debated in a healthy manner, without resorting to violence.” He hopes this new Twitter will break the cycle of promoting ever-more extreme content in the relentless pursuit of clicks—and the subsequent fracturing of society into political silos.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"3691\" height=\"2240\" src=\"https://www.aei.org/wp-content/uploads/2022/10/Elon-Musk-Chief-Twit.jpg?x91208\" alt=\"\" class=\"wp-image-1008664192\"/><figcaption>via Reuters</figcaption></figure>\n\n\n\n<p>Since then, the digital birdhouse has been atwitter about the ramifications of this vision. The fringe right <a href=\"https://twitter.com/ncri_io/status/1586007698910646272\" target=\"_blank\" rel=\"noreferrer noopener\">met Musk’s takeover</a> with the maturity of Bart Simpson, suddenly realizing the parents are gone and promptly shedding any remaining shred of decorum on the platform. (Twitter has <a href=\"https://twitter.com/yoyoel/status/1586542286342475776\" target=\"_blank\" rel=\"noreferrer noopener\">questioned the authenticity</a> of these accounts.) Meanwhile on the left, users posted screenshots of these offensive comments, thus spotlighting the very content they feared would spread. Later that weekend, Musk himself posted a since-deleted tweet linking to a conspiracy theory about the Paul Pelosi attack—a tweet immediately covered by none other than the <a href=\"https://www.nytimes.com/2022/10/30/business/musk-tweets-hillary-clinton-pelosi-husband.html\" target=\"_blank\" rel=\"noreferrer noopener\"><em>New York Times</em></a>, which dutifully explained the conspiracy to readers.</p>\n\n\n\n<p>Both vignettes display a bizarre permutation of the <a href=\"https://www.economist.com/the-economist-explains/2013/04/15/what-is-the-streisand-effect\" target=\"_blank\" rel=\"noreferrer noopener\">Streisand Effect</a>. But instead of an actor trying to hide information and unintentionally drawing attention to it, we see actors wanting to go viral and succeeding because of the efforts of those who want the message suppressed. One might call it the “outrage dilemma.”</p>\n\n\n\n<p>Accomplishing Musk’s vision of a shared digital space will involve developing more productive ways of navigating that shared space together. To do so, we might heed the advice of the late Supreme Court Justice Ruth Bader Ginsburg. When asked about traversing difficult relationships, including on the Court, <a href=\"https://www.nytimes.com/2016/10/02/opinion/sunday/ruth-bader-ginsburgs-advice-for-living.html\" target=\"_blank\" rel=\"noreferrer noopener\">she quoted her mother-in-law’s advice</a> on her wedding day: “In every good marriage . . . it helps sometimes to be a little deaf.” Twitter gives its users ample tools to do so, including options to block or mute users and words. In a sense, this is a conception of free speech that the left often touted in the net neutrality debates: Rather than relying on companies to regulate the flow of information to consumers, give users tools to customize and filter their internet experiences. Alternatively, users may simply choose not to engage with offensive content. Ginsburg continued, “When a thoughtless or unkind word is spoken, best tune out. Reacting in anger or annoyance will not advance one’s ability to persuade.”</p>\n\n\n\n<p>Musk is likely to find that some company-side content moderation is also necessary to achieve his vision of the digital public square. The right to speak freely means little if there’s no audience to listen. Even with robust user-side filtering tools in place, Twitter probably must continue policing the edges of the square to make sure it remains a space where users—and advertisers—want to be. Musk’s open letter acknowledges this, noting that “Twitter cannot become a free-for-all hellscape.” He has also <a href=\"https://twitter.com/elonmusk/status/1586149451348910081\" target=\"_blank\" rel=\"noreferrer noopener\">frozen</a> the company’s pre-acquisition moderation practices for the moment and hinted at forming a <a href=\"https://www.nytimes.com/2022/10/28/technology/twitter-elon-musk-content-moderation.html\" target=\"_blank\" rel=\"noreferrer noopener\">content moderation council</a> similar to Facebook’s <a href=\"https://oversightboard.com/\" target=\"_blank\" rel=\"noreferrer noopener\">Oversight Board</a>.</p>\n\n\n\n<p>As I’ve <a href=\"https://www.aei.org/technology-and-innovation/on-texas-social-media-law-its-the-fifth-circuit-versus-the-first-amendment/\" target=\"_blank\" rel=\"noreferrer noopener\">discussed</a> <a href=\"https://www.aei.org/technology-and-innovation/social-media-common-carriage-and-the-first-amendment/\" target=\"_blank\" rel=\"noreferrer noopener\">before</a>, the First Amendment protects Twitter’s right to moderate site content. But Musk will find it difficult to do so, as any moderation opens him to the charge of becoming the very thing he sought to avoid. As the Chief Twit, he must be willing to take criticism from those who feel silenced by moderation policies. He may take comfort from studies showing that most users <a href=\"https://www.pewresearch.org/fact-tank/2020/08/19/55-of-u-s-social-media-users-say-they-are-worn-out-by-political-posts-and-discussions/\" target=\"_blank\" rel=\"noreferrer noopener\">dislike</a> polarizing discussions online. Transparency can mitigate such conflicts; clear and consistent rules can reduce claims of pretextual takedowns and shadow bans that drive the right’s criticism of Big Tech.</p>\n\n\n\n<p>At the end of the day, moderation is how social media platforms compete for user attention. Each company develops complex algorithms designed to give users personalized content feeds that promote retention and interaction with others. Musk has shown a tendency to disrupt traditional industries by experimenting with new business models. Hopefully, he will innovate in this space, testing to find the right combination of moderation rules and user tools to attract and promote constructive dialogue on important issues. This innovation will be crucial to help Twitter achieve Musk’s dream of a digital salon and avoid critics’ fears that it will instead devolve into an online cesspool.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/on-texas-social-media-law-its-the-fifth-circuit-versus-the-first-amendment/\">On Texas Social Media Law, It’s the Fifth Circuit Versus the First Amendment</a> | <a href=\"https://www.aei.org/technology-and-innovation/social-media-common-carriage-and-the-first-amendment/\">Social Media, Common Carriage, and the First Amendment</a> | <a href=\"https://www.aei.org/events/separating-fact-from-fiction-election-disinformation-on-online-platforms/\">Separating Fact from Fiction: Election Disinformation on Online Platforms</a> | <a href=\"https://www.aei.org/technology-and-innovation/market-solutions-for-social-media-content-moderation/\">Market Solutions for Social Media Content Moderation</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/elon-musk-confronts-the-moderators-dilemma-holds-mirror-to-users/\">Elon Musk Confronts the Moderator’s Dilemma and Holds a Mirror to Users</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}