{
  "title": "Be Happier by Buying Time",
  "link": "https://esimoney.com/be-happier-by-buying-time/",
  "comments": "https://esimoney.com/be-happier-by-buying-time/#comments",
  "dc:creator": "ESI",
  "pubDate": "Fri, 14 Oct 2022 09:00:55 +0000",
  "category": [
    "Books",
    "Save"
  ],
  "guid": "https://esimoney.com/?p=8737",
  "description": "<p>Today we continue sharing from the book Happy Money: The Science of Happier Spending. We&#8217;ve already covered principles 1 and 2 of this book. In case you missed them, you can catch up by reading Be Happier by Buying Experiences Over Things and Be Happier by Making Your Spending a Treat Friday. In this post [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/be-happier-by-buying-time/\">Be Happier by Buying Time</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "content:encoded": "<p><a href=\"https://esimoney.com/wp-content/uploads/2022/05/Man-removing-snow-from-roof-new.jpg\"><img class=\"alignleft size-medium wp-image-8738\" src=\"https://esimoney.com/wp-content/uploads/2022/05/Man-removing-snow-from-roof-new-300x198.jpg\" alt=\"\" width=\"300\" height=\"198\" srcset=\"https://esimoney.com/wp-content/uploads/2022/05/Man-removing-snow-from-roof-new-300x198.jpg 300w, https://esimoney.com/wp-content/uploads/2022/05/Man-removing-snow-from-roof-new.jpg 750w\" sizes=\"(max-width: 300px) 100vw, 300px\" /></a>Today we continue sharing from the book <a href=\"https://amzn.to/3xYv1ft\">Happy Money: The Science of Happier Spending</a>.</p>\n<p>We&#8217;ve already covered principles 1 and 2 of this book. In case you missed them, you can catch up by reading <a href=\"https://esimoney.com/be-happier-by-buying-experiences-over-things/\">Be Happier by Buying Experiences Over Things</a> and <a href=\"https://esimoney.com/be-happier-by-making-your-spending-a-treat/\">Be Happier by Making Your Spending a Treat Friday</a>.</p>\n<p>In this post I&#8217;ll highlight principle 3 as well as give you my thoughts on it.</p>\n<p>Let&#8217;s get started&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>Principle 3: Buy Time</strong></span></h4>\n<p>Here&#8217;s how the book describes principle 3:</p>\n<p style=\"padding-left: 40px;\"><em><strong>By permitting us to outsource our most dreaded tasks, from scrubbing toilets to cleaning gutters, money can transform the way we spend our time, freeing us to pursue our passions. Yet wealthier individuals do not spend their time in happier ways on a daily basis; thus they fail to use their money to buy themselves happier time.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>We&#8217;ll show the wisdom of asking yourself a quick question before buying: How will this purchase change the way I use my time? When people focus on their time rather than their money, they act like scientists of happiness, choosing activities that promote their well-being.</strong></em></p>\n<p>Ugh. This was another area where I was pretty far behind when I was younger (my wife was even worse).</p>\n<p>Thankfully we have gotten better as we&#8217;ve gotten older.</p>\n<p>For my part, there are things I should have outsourced&#8230;the main ones being mowing the lawn and shoveling snow.</p>\n<p>I eventually did outsource the mowing once my son turned ten (hahahaha), but living in Michigan for 14 years and shoveling over 100 inches of snow a year was a BIG waste of time. Why didn&#8217;t I hire a service to manage it? (I did have snowblowers, but they don&#8217;t do everything &#8212; anyone ever used a roof rake?)</p>\n<p>For my wife, it was getting the best price. I can remember one time when we had hamburgers but we didn&#8217;t have ketchup because the store she had been to that day didn&#8217;t have it on sale. The store across town did have it on sale for something like 20 cents less, so she would get it there in 3-4 days. The problem was we had burgers NOW and no ketchup NOW just to save 20 cents. Not to mention, was 20 cents worth the 30 minutes and expense (like gas) to go to the other store? No, it was not.</p>\n<p>Nowadays we often buy something that we know is cheaper elsewhere simply because we are able to make the purchase now and save ourselves time.</p>\n<p>Another example of this was with our real estate rental units. I used a management service even though it cut into profits because I didn&#8217;t want to spend my limited time and energy to manage people&#8217;s issues (and where you have people, you have issues). But even that got to be too much (managing the manager), so I <a href=\"https://esimoney.com/why-and-how-i-sold-my-last-rental-property/\">sold our properties</a> and put the money into <a href=\"https://esimoney.com/how-to-get-started-investing-in-real-estate-syndications-part-1/\">real estate syndications</a>.</p>\n<p>These days, I like things even simpler and if that means spending money to save time, I&#8217;m all for it. One example: we belong to an expensive gym that is close enough we can walk to it (1,200 steps from my front door to theirs). Another example: I often pay for a dedicated pickleball court to play versus get one free at the local park because the paid version is two-hours of straight play while the park version is two-hours of play over a 3-4 hour time period (you take turns at the park, which is always crowded).</p>\n<h4><span style=\"text-decoration: underline;\"><strong>Retirement Helps with the Time/Money Balance</strong></span></h4>\n<p>The book elaborates on principle 3 with the following:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Whether driving for an hour to get gas that is five cents cheaper, waiting in endless lines to get a free sample of the latest PowerBar, or taking an entire afternoon to abscond with a cheap umbrella, we too often sacrifice our free time just to save a little money.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Many of us wish we had more free time to do more of what we love. For Liz, it&#8217;s working out; for Mike, playing guitar. In theory, it&#8217;s possible to use money to buy more of this kind of time. But research suggests that people with more money do not spend their time in more enjoyable ways on a day-to-day basis. Wealthier individuals tend to spend more of their time on activities associated with relatively high levels of tension and stress, such as shopping, working, and commuting.</strong></em></p>\n<p>This is a great thing about retirement&#8230;it takes two of the dreaded three out of the equation.</p>\n<p>I don&#8217;t commute, at least not to work. I do have a couple different pickleball courts I drive to, but that&#8217;s different. And it&#8217;s certainly not rush hour when I do. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></p>\n<p>I don&#8217;t &#8220;work&#8221; in the traditional sense, i.e. working for &#8220;the man&#8221; to make money at a job that is &#8220;fine&#8221; or &#8220;ok&#8221; because I have to. Now I work from the comfort of my home office, sipping a coffee, listening to Christmas music, having my cat nearby looking out the window, and writing and discussing a topic I love (personal finance). It&#8217;s pretty cool!</p>\n<p>And as for shopping, we make that as easy as possible. Step 1 of that is having things delivered at home. Amazon and Costco are frequent deliveries here. Step 2 is that we often pick some items up at the grocery store on our daily walks as it&#8217;s on our 5,000-step circuit. And Step 3 is shopping at Costco every two weeks or so, in the middle of the day when no one is there, to stock up on a ton of stuff.</p>\n<p>Again, I&#8217;ll say this is very much in contrast to how we did things in our 30&#8217;s and 40&#8217;s so I don&#8217;t want to come off like I&#8217;ve had this all together for decades &#8212; because I haven&#8217;t. It&#8217;s only recently with retirement as well as discussions on the Millionaire Money Mentors forums that I&#8217;ve gotten much better at trading money for time.</p>\n<h4><span style=\"text-decoration: underline;\"><strong>Three Areas to Outsource</strong></span></h4>\n<p>The book goes on:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Buying time isn&#8217;t always easy. Taking this principle seriously means rethinking many everyday expenditures and transforms decisions about money into decisions about time a kind of mental backflip that can make people more inclined toward happy choices.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>People who feel they have plenty of free time are more likely to exercise, do volunteer work, and participate in other activities that are linked to increased happiness. Although money can be used to buy &#8220;free time,&#8221; in part by outsourcing the demands of daily life such as cooking, cleaning, and even grocery shopping, wealthier individuals report elevated levels of time pressure.</strong></em></p>\n<p>Let&#8217;s pause for a moment and talk about &#8220;cooking, cleaning, and even grocery shopping.&#8221;</p>\n<p>We&#8217;ve done all of these and continue to do them even to this day, so let me comment on them one by one:</p>\n<ul>\n<li>Cooking. What are our choices here &#8212; either hiring a chef or eating out more? Both of these come with their own downsides that I&#8217;m not sure are better than just doing it ourselves. But we do something each week that does make cooking faster/better. Our kids come over for a cookout every Saturday and I almost always make way more than we need (steak, ribs, etc.) Then we have these foods again for 1-3 &#8220;new&#8221; meals within the next week. Same thing happens when we buy a &#8220;Costco chicken&#8221; &#8212; it&#8217;s always two meals. Cooking then is made very simple and fast.</li>\n<li>Cleaning. I hate it. My wife (who does most of it) hates it. For YEARS I have been trying to get her to hire a housekeeper, even every other week. But she will have none of it because &#8220;no one cleans my house like I do.&#8221; Okaaaaaaay&#8230;</li>\n<li>Grocery shopping. We try to minimize trips on one hand which makes this less of a chore. And, as I said above, our closest grocery store is within walking distance, so if we need something we will walk to the store and get it. This way we get in a few thousand steps or so plus get what we need. It&#8217;s a win-win!</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Big Time Suck 1: Commuting</strong></span></h4>\n<p>The book now moves on to the big three time sucks &#8212; and no, they aren&#8217;t cooking, cleaning, and grocery shopping.</p>\n<p>They are much, much worse:</p>\n<p style=\"padding-left: 40px;\"><em><strong>And while the Buy Time principle can be applied idiosyncratically, most people would benefit from using their money to change the amount of time they spend on three key activities: commuting, watching television, and hanging out with friends and family.</strong></em></p>\n<p>As you might imagine, the book is in favor of less commuting and TV and more time with friends and family.</p>\n<p>We&#8217;ll get to each of these in due course. Let&#8217;s begin with commuting:</p>\n<p style=\"padding-left: 40px;\"><em><strong>According to the U.S. Census Bureau, Americans spend more than two weeks of the year commuting, more than their typical annual vacation time. Transportation experts have suggested that developed countries are hitting &#8220;peak car,&#8221; rubbing up against the maximum amount of time that human beings are willing to spend traveling on a daily basis.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Taking a job that requires an hour-long commute each way has a negative effect on happiness similar in magnitude to not having a job at all. Although accepting a longer commute can provide access to both nicer houses and better jobs, people with longer commutes are no more satisfied with their homes, and they are less satisfied with their jobs. And individuals with long commutes are much less satisfied with their spare time. Commuting, it seems, undermines time affluence.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Most people consider the well-being of their families&#8211;not just their own&#8211;in deciding whether to take a job. Accepting a longer commute might make for a happier family. But there&#8217;s no evidence that this is the case. If anything, people report somewhat lower happiness when their spouse has a longer commute.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>To offset the happiness costs of going from no commute to a twenty-two-minute commute, the average person would need to see their income rise by over a third&#8211;and that&#8217;s just to break even. Rather than bugging the boss for a raise, you could get a similar happiness boost, research shows, by moving closer to work.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>When it comes to commuting, as with many things, length isn&#8217;t all that matters. David Mogolov took a new job with an even longer commute, but the location of the company makes it possible for him to take the train to work, rather than drive. &#8220;On the train,&#8221; David explains, &#8220;I don&#8217;t have to make decisions, or interact with other angry people before we&#8217;re properly caffeinated. I get where I&#8217;m going, I&#8217;m not angry, and I don&#8217;t endanger myself. Or others.&#8221;</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>In a 2011 study comparing almost three hundred commuters traveling from their homes in northern New Jersey to their jobs in New York City, people felt significantly less stressed and disgruntled after taking the train than after driving. Train travel was less effortful and more predictable than driving. &#8220;I&#8217;m not sure anyone would describe the commuter rail as a Zen garden, but David does arrive home considerably less stressed,&#8221; Lisa says.</strong></em></p>\n<p>Many thoughts on this one:</p>\n<ul>\n<li>Thankfully, I never had a long commute. The longest I ever traveled to work was 30 minutes one way but most of my career the trip was 20 minutes or less. It wasn&#8217;t a freebie by any stretch as 40 minutes a day still adds up over the years, but one hour each way would have been a killer. I got to see how terrible that was when we had bad snows and it took me an hour or two to fight my way into work. Who could do that every day for years and still live a fruitful life? Not me.</li>\n<li>I had a friend who lived in New Jersey and worked in New York City. It took him 2-3 hours (depending on traffic) EACH WAY, EVERY DAY to get to and from work. And he did this for YEARS. I about broke down crying when he told me what he had done for all that time. He left the house at 5 am and got home around 8 pm every night &#8212; if he was lucky. Ugh.</li>\n<li>I&#8217;m wondering if commuting was a big issue in the Great Resignation. My guess is that it was. People saw they could be as effective by working at home so they simply said &#8220;no, thank you&#8221; to the nasty commute. They then got jobs where it wasn&#8217;t needed. As stated above, people would be willing to trade a lot of money to eliminate their commute.</li>\n<li>This is one of the best things about being retired &#8212; no daily commute &#8212; especially during bad weather. Every time we have a snow storm in Colorado Springs (or used to have them &#8212; now we&#8217;re in Florida for most of them. Hahahaha), I think about my poor friends fighting their way into work and/or back home again &#8212; worried about whether they can make it or not, their safety, etc. I simply walk over to the gym (yes, I walk in cold weather &#8212; I lived in Michigan for 14 years so it&#8217;s no big deal). And no one is at the gym because they are all stressed out going into work. Of course this was pre-2022 as our trips to The Villages makes this a thing of the past (except for those once-a-year two-day snowstorms in May).</li>\n<li>My last employer was THE WORST about snow days. We would have a big snow storm and our boss (the owner) would still want people to come in. At first, our policy was that &#8220;when company X closed, we closed.&#8221; Except Company X actually cared for their employees so they would close when it was bad, something our boss didn&#8217;t want to do. So we abandoned that and basically went to an &#8220;everyone comes in no matter what unless the world is ending&#8221; policy. This forced people to risk a lot by driving in bad weather and be stressed just to get into work when the rest of the city was shut down. And this was usually only for a few hours as the office then closed early. Of course the boss &#8220;worked from home&#8221; so he didn&#8217;t have to deal with the weather. It was one of the main reasons I decided to retire &#8212; I couldn&#8217;t take this crap.</li>\n<li>&#8220;Americans spend more than two weeks of the year commuting more than their typical annual vacation time.&#8221; That is simply a brutal, brutal statement. Unfortunately it&#8217;s not (by far) the biggest time suck (as we&#8217;ll see in a moment) though it is the most hated (as we&#8217;ll also see in a moment).</li>\n<li>&#8220;Taking a job that requires an hour-long commute each way has a negative effect on happiness similar in magnitude to not having a job at all.&#8221; I know how stressed people are when they are unemployed. So being as bad as not having a job is a terrible thing.</li>\n<li>I always lived in cities where you had to drive to work (for the most part) as the public transportation wasn&#8217;t great. There were a couple exceptions to this. First, when I was an intern in D.C., I took the metro which was not bad at all. It&#8217;s true that riding is better than driving as you eliminate much of the stress and you can actually get something done while doing it. Second, I took the bus on and off for a year when we lived in Pittsburgh. Let me just say that taking a big city bus was not my cup of tea in any way, shape, or form. It was early in my career and I did it to save money, but it made my life worse. The exception was on snow days when someone else could worry about the driving.</li>\n<li>There is a way to redeem some of the commuting time &#8212; make it fun and/or educational with audio books. Listening to a great novel or a new book on business can be a great way to take unproductive time and turn it into something worthwhile. I did this for most of my career and learned a lot in the car (probably got my second, third, and fourth MBAs via audio) as well as had great times with the likes of Harry Potter and The Hunger Games &#8212; things I would never have read otherwise. Plus I probably got the equivalent of a another master&#8217;s degree or two in personal finance and writing based on the books and podcasts I listened to.</li>\n</ul>\n<h4><span style=\"text-decoration: underline;\"><strong>Big Time Suck 2: Television</strong></span></h4>\n<p>Let&#8217;s move on to the next time killer &#8212; television:</p>\n<p style=\"padding-left: 40px;\"><em><strong>In addition to spending two weeks per year commuting, the average American spends the equivalent of two months per year watching television. In many countries, people spend almost as much time watching TV as they do working.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>If our choices reveal what we like best, TV must be pretty much the most super-terrific thing ever. And yet, study after study shows that people experience less pleasure while watching TV than while engaging in more active forms of leisure, including walking the dog. More than any other activity, television appears responsible for the failure of the U-index to budge over the past four decades.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Although people today spend less time doing unpleasant activities such as household chores, television has sucked up much of this newly available time while providing little emotional payoff. In a sample of over one hundred thousand people from thirty-two European countries, individuals who watched more than thirty minutes of television per day were less satisfied with their lives than people who watched TV for under half an hour.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>Watching the occasional TV show may be genuinely enjoyable, but devoting two months of the year to the tube is too much.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>To be fair, watching TV has one big advantage: it&#8217;s cheap. Replacing some of the time you spend watching TV with other, more engaging activities (like going out for dinner with friends or taking an art class) will cost you money. But it is money well spent.</strong></em></p>\n<p>Ok, let&#8217;s get to my thoughts:</p>\n<ul>\n<li>TWO MONTHS PER YEAR? As Bugs Bunny said once, &#8220;<a href=\"https://youtu.be/Cy1SyXuWBt8\">Oooooooooooooo, I&#8217;m dying</a>!!!!&#8221; But seriously&#8230;that&#8217;s brutal. I was a big TV watcher at times, but never as big as most were (as we&#8217;ll see) &#8212; and certainly not as much time as I spent working. How is that even possible?</li>\n<li>My dad is a great example of the TV versus active lifestyle difference. In Iowa after my mom died, he watched 8-10 hours of TV a day and was pretty miserable (he would say it and we could hear it in his voice). Then, down in <a href=\"https://esimoney.com/review-of-the-villages-florida-part-1/\">The Villages</a>, we could see him come to life with all the activities. So when he bought a place there we were thrilled! And after a month or so of getting his new life set up (which is when I&#8217;m writing this), he&#8217;s now back at the activity smorgasbord at The Villages and loving it!</li>\n<li>Thirty minutes a day seems to be the breaking point where TV goes from adding value to life to sucking value from life. Which is way lower than what people actually do&#8230;</li>\n<li>Most people watch more than 30 minutes of TV a day. <a href=\"https://www.statista.com/statistics/186833/average-television-use-per-person-in-the-us-since-2002/\">The AVERAGE time spent watching TV per American per day is about three hours</a>. Ugh. This is a KILLER!</li>\n<li>The worst part of watching TV three hours a day IMO is wasted time. Here&#8217;s a quote I found that I&#8217;ve shared previously: &#8220;If you’re broke you should cancel Netflix. Not to save $15 per month but to save 40 hours per month.&#8221; The top excuse I get from people who don&#8217;t have a side hustle is &#8220;I don&#8217;t have the time for it.&#8221; Well, I&#8217;ve found your time. Cut your TV viewing down to &#8220;only&#8221; 1.5 hours per day and spend the other 1.5 hours on a <a href=\"https://esimoney.com/side-hustle-business-can-get-financial-independence-10-years/\">side hustle that can get you to financial independence in 10 years or less</a>.</li>\n<li>Even in retirement when I have &#8220;all the time in the world&#8221;, the most I watch TV is a couple hours a day &#8212; and some of that is while I&#8217;m eating dinner (so at least I&#8217;m accomplishing something else). I&#8217;m not sure what I&#8217;d do if I had to watch three hours a day every day (and remember, this is average &#8212; which means many people are OVER 3 hours a day). Is there really enough good stuff on TV anyway to suck up that much time?</li>\n</ul>\n<p>Ok, I&#8217;m beating a dead horse here so let&#8217;s move on&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>Big Time Suck 3: Time with Family and Friends</strong></span></h4>\n<p>Now we go in the opposite direction &#8212; something you should do more of &#8212; spend time with family and friends:</p>\n<p style=\"padding-left: 40px;\"><em><strong>If you awaken happiness researchers in the middle of the night and ask them to tell you (quick! what matters most for human well-being), you&#8217;ll get the same response: get the hell out of my house. After they calm down, though, we&#8217;re pretty sure they&#8217;ll agree on the answer: social relationships. People experience the most positive moods of the day while spending time with family and friends.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>In the past decade, the emotional benefits of parenthood have been much maligned, with media outlets from New York magazine to Slate featuring headlines such as WHY PARENTS HATE PARENTING and PARENTS ARE JUNKIES. Yet a recent study with a nationally representative sample of Americans revealed that playing with children produced more positive feelings than almost any other common daily activity.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>There&#8217;s a time trap that buying stuff springs on us. Our purchases can undermine the amount of time we have available to spend with friends and family, by compelling us to work more to afford the purchases we make to try to improve our family life. In a 2003 poll, over 80 percent of Americans–with and without children&#8211;reported wishing they had more time to spend with their families.</strong></em></p>\n<p style=\"padding-left: 40px;\"><em><strong>A substantial minority said they would be willing to accept a pay cut to have more time with family. But many respondents indicated that they couldn&#8217;t afford to do so, often citing the high costs of housing as the barrier. Yet, as we saw earlier, people who spend more money on housing reap few benefits in terms of happiness. Working long hours to earn more money to provide your children with fancier homes and shinier toys may represent a bad happiness trade-off- especially when doing so comes at the cost of actually spending time playing with them.</strong></em></p>\n<p>Thoughts on this:</p>\n<ul>\n<li>Not much new news on this. I think we all know that spending time with family ranks high on the happiness scale for most people.</li>\n<li>This is one reason we live where we do &#8212; our kids are here. And we see them at least a couple times a week. If they moved somewhere else, we&#8217;d probably cash out of Colorado and move to Florida (where my dad lives). But that&#8217;s a story for a different day.</li>\n<li>We also spend almost every vacation with our kids. It makes the vacation even better. Our last one was when we all went to The Villages together (and worked in Disney, trips to the beach, etc.) They are planning on coming down next winter as well. And by the time this posts, my daughter and I will have attended the Financial Blogger Conference in Orlando for a small, mini-vacation. Of course we live in Colorado, so the summers here are like one big vacation. <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f609.png\" alt=\"😉\" class=\"wp-smiley\" style=\"height: 1em; max-height: 1em;\" /></li>\n<li>I&#8217;m just going to leave this here as I&#8217;m sure someone needs to read it again: &#8220;Working long hours to earn more money to provide your children with fancier homes and shinier toys may represent a bad happiness trade-off- especially when doing so comes at the cost of actually spending time playing with them.&#8221;</li>\n</ul>\n<p>Let&#8217;s move on&#8230;</p>\n<h4><span style=\"text-decoration: underline;\"><strong>A Couple Key Thoughts</strong></span></h4>\n<p>Before we leave this subject (and chapter of the book), I want to share a couple quotes which were too good to let pass by.</p>\n<p>Here&#8217;s the first:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Aside from commuting, working is the only activity that produces unpleasant moods more than 25 percent of the time among both French and American women.</strong></em></p>\n<p>Hahaha. Commuting is hated activity #1 and working is #2. Notice how they are both associated with holding a job? No wonder people are generally unhappy with their jobs and want to retire asap.</p>\n<p>It&#8217;s probably much better now given that working from home has become more common, but it&#8217;s still a huge issue for those back in the office who have to fight their way through traffic every day just to get to work.</p>\n<p>Here&#8217;s the second &#8212; which is a fitting quote to end this subject on IMO:</p>\n<p style=\"padding-left: 40px;\"><em><strong>Transforming decisions about money into decisions about time has a surprising benefit. Thinking about time rather than money spurs people to engage in activities that promote well-being, like socializing and volunteering.</strong></em></p>\n<p>That&#8217;s what I&#8217;ll leave you with today &#8212; the challenge to think a bit more about time and how you&#8217;re spending it and a bit less about money.</p>\n<p>It&#8217;s something I wish I had done earlier in life because I think it would have made me even happier along the journey to financial freedom.</p>\n<p>To read the next post in this series and see what millionaires think about this topic, check out <a href=\"https://esimoney.com/millionaire-thoughts-on-buying-time/\">Millionaire Thoughts on Buying Time</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://esimoney.com/be-happier-by-buying-time/\">Be Happier by Buying Time</a> appeared first on <a rel=\"nofollow\" href=\"https://esimoney.com\">ESI Money</a>.</p>\n",
  "wfw:commentRss": "https://esimoney.com/be-happier-by-buying-time/feed/",
  "slash:comments": 5
}