{
  "guid": "d5952bdb6d394dd9ae26dbfeb29e8dab",
  "title": "Ep 29: Sounds from a Well Read Black Girl",
  "pubDate": "Thu, 09 May 2019 22:17:20 -0000",
  "link": "https://beta.prx.org/stories/364969",
  "description": "<p>What’s a sound that embodies blackness? In this episode we ask around and then get deeper into conversation with Glory Edim, the founder of Well Read Black Girl, a Brooklyn based book club and online community. What’s it mean to be well read? This special Stoop episode was recorded live at WNYC's The GreenSpace, and goes deeper into conversations about what it means to return to Africa, how to create inclusive community, and really, how black are we?</p>",
  "enclosure": "",
  "itunes:title": "Sounds from a Well Read Black Girl",
  "itunes:subtitle": "What’s a sound that embodies blackness? In this episode we ask around and then get deeper into conversation with Glory Edim, the founder of Well Read Black Girl, a Brooklyn based book club and online community. What’s it mean to be well read? This...",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:season": 3,
  "itunes:episode": 29,
  "itunes:duration": "41:52",
  "author": "hangout@thestoop.org (Hana Baba and Leila Day)",
  "itunes:author": "Hana Baba and Leila Day",
  "itunes:summary": "What’s a sound that embodies blackness? In this episode we ask around and then get deeper into conversation with Glory Edim, the founder of Well Read Black Girl, a Brooklyn based book club. What’s it mean to be well read? This special Stoop episode was recorded live at WNYC's The GreenSpace, and goes deeper into conversations about what it means to return to Africa, how to create inclusive community, and really, how black are we?",
  "itunes:image": "",
  "itunes:keywords": "writing,black,literature,american,girl,read,well,african,diaspora",
  "media:content": "",
  "content:encoded": "<p>What’s a sound that embodies blackness? In this episode we ask around and then get deeper into conversation with Glory Edim, the founder of Well Read Black Girl, a Brooklyn based book club and online community. What’s it mean to be well read? This special Stoop episode was recorded live at WNYC's The GreenSpace, and goes deeper into conversations about what it means to return to Africa, how to create inclusive community, and really, how black are we?</p>"
}