{
  "id": "yt:video:KbqrglVsCtI",
  "yt:videoId": "KbqrglVsCtI",
  "yt:channelId": "UCW39zufHfsuGgpLviKh297Q",
  "title": "Jewish life in Buenos Aires - Freitagnacht Jews | DW Documentary",
  "link": "",
  "author": {
    "name": "DW Documentary",
    "uri": "https://www.youtube.com/channel/UCW39zufHfsuGgpLviKh297Q"
  },
  "published": "2022-11-04T17:00:17+00:00",
  "updated": "2022-11-04T17:11:35+00:00",
  "media:group": {
    "media:title": "Jewish life in Buenos Aires - Freitagnacht Jews | DW Documentary",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Host Daniel Donskoy travels to different cities to meet exciting Jewish guests. Together they discuss and philosophize about the meaning of being Jewish. What is life like for Jews in London, Buenos Aires, Tel Aviv, and Istanbul?\n\nIn the evening, before hosting his guests, Daniel Donskoy explores the cities he visits: covered in oil from head to toe for a Turkish oil wrestling match in Istanbul, visiting Pride in Tel Aviv, or as the \"Leader” on a double-decker bus in London. It is all about Jewish identities and stories, where you often don't know whether to laugh or cry.\n \nAlways playful and charming, Donskoy provides his various guests for the late-night show with home-cooked food and engaging questions. From an author, comedian, all the way to a rabbi, they talk about the reality of their Jewish lives. With such an intimate atmosphere, they open up right away in front of the camera.\n\nIn this episode Daniel Donskoy is in Argentina's capital city, Buenos Aires.\n\nA production by Turbokultur Berlin on behalf of WDR. \nGerman versions can be found here: https://1.ard.de/YT_K_FNJ_2\nMore information on the series: https://www1.wdr.de/kultur/freitagnachtjews/index.html\n______\n\nDW Documentary gives you knowledge beyond the headlines. Watch top documentaries from German broadcasters and international production companies. Meet intriguing people, travel to distant lands, get a look behind the complexities of daily life and build a deeper understanding of current affairs and global events. Subscribe and explore the world around you with DW Documentary.\n\nSubscribe to: \n⮞ DW Documentary (English): https://www.youtube.com/dwdocumentary\n⮞ DW Documental (Spanish): https://www.youtube.com/dwdocumental\n⮞ DW Documentary وثائقية دي دبليو (Arabic): https://www.youtube.com/dwdocarabia\n⮞ DW Doku (German): https://www.youtube.com/dwdoku\n⮞ DW Documentary हिन्दी (Hindi): https://www.youtube.com/dwdochindi\n\nFor more visit: http://www.dw.com/en/tv/docfilm/s-3610\nFollow DW Documentary on Instagram: https://www.instagram.com/dwdocumentary/\nFollow DW Documental on Facebook: https://www.facebook.com/dwdocumental\n\nWe kindly ask viewers to read and stick to the DW netiquette policy on our channel: https://p.dw.com/p/MF1G",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}