{
  "id": "yt:video:FqwS7wdH2U8",
  "yt:videoId": "FqwS7wdH2U8",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "How Dream Became A Target - A Reflection On Stan Culture | TRO",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2022-01-25T21:00:04+00:00",
  "updated": "2022-02-28T23:03:30+00:00",
  "media:group": {
    "media:title": "How Dream Became A Target - A Reflection On Stan Culture | TRO",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get Surfshark VPN at https://surfshark.deals/opinion - Enter promo code OPINION for 83% off and 3 extra months for FREE!\n\nThe Right Opinion: How Dream Became A Target - A Reflection On Stan Culture | TRO\n\n0:00 - Surfshark Sponsorship\n1:58 - Introduction\n8:08 - Fever Dream\n14:05 - Parasociety\n22:16 - Loyalty\n27:56 - Influence\n34:02 - Timebomb\n41:43 - Countdown\n48:29 - $ell Out\n54:37 - Running Down A Dream\n1:02:40 - Bad Dream\n1:11:22 - Rinse and Repeat\n1:17:14 - The Mask\n1:24:15 - Human\n1:30:46 - Intentions\n1:36:11 - Provocative\n1:46:12 - Stan Culture\n1:53:38 - Dream Vs. The World\n2:02:20 - Finale\n2:09:39 - Conclusion & Credits\n\nDream is a Minecraft YouTuber, he started his channel in 2014, assuming the moniker of “DreamTraps”, and although it didn’t take him too long to hit 1,000 subs, his channel stagnated after that, and although he’s on record doing a little gaming with his friends, and interacting on Twitter, these few years seem pretty uneventful by a YouTuber’s standard. However, this all changed in 2019, where Minecraft was experiencing a bit of a renaissance amongst online communities, and creators alike.\n\nHowever, it was also a refreshed sense of interest, not necessarily based in nostalgia, and this created a gap for new creators to rise up and fill the increased demand for Minecraft based content. Dream was one of those eager creators, and he wasn’t just any old chump mooching off its popularity, he was a seasoned and experienced patron of the game, and his skills were regularly showcased in the content he produced, which often revolved around challenges that tested his in-game ability, as well as his rather popular Minecraft Manhunt series. Although he wasn’t regarded as a force of personality, his proficiency with the game at hand was highly admirable, and as more people tuned in, his channel picked up momentum, though I’m not sure anyone could have quite predicted where he would be today. \n\nYou see, in the space of two years, he went from a thousand subscribers or so to over twenty million, which I think is what some would call “blowing up”. He streams with a crew known as the “Dream Team”, which includes old and new friends alike, he uploads on a semi-regular basis, has various successful side hustles. It would be fair to take a glance at his channel and say he’s doing alright for himself, but is it the full story?\n\nSuch a great amount of success, in such a short amount of time is certainly a lot to adjust to, alongside the increased sense of influence and responsibility you hold. However, it’s nothing that creators online aren’t used to, is it? \n\nFor more... Watch the video!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}