{
  "title": "Cities, Markets, and Urban Planning with Alain Bertaud",
  "pubDate": "Fri, 23 Aug 2019 01:53:54 +0000",
  "guid": "44c7cd22e32a4a63ae47bb66efbde895",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP129Bertaud_EDR.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Order-without-Design-Markets-Cities-ebook/dp/B07L3DJVHP/ref=as_li_ss_il?keywords=Order+Without+Design:+How+Markets+Shape+Cities&qid=1566574864&s=gateway&sr=8-1&linkCode=li3&tag=economicsde0f-20&linkId=22ddeed98b3c8483ca515188e3f39486&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B07L3DJVHP&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=B07L3DJVHP\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Today's guest is <a href=\"http://alainbertaud.com/\" target= \"_blank\" rel=\"noopener\">Alain Bertaud</a>, author of <a href= \"https://amzn.to/2Zp27Qy\" target=\"_blank\" rel=\"noopener\">Order Without Design: How Markets Shape Cities</a>. Alain discusses his extensive experience in urban planning: When he was first trained as a planner, urban planning was thought of as an offshoot of architecture. In this conception, cities are just large buildings that need to be laid out and designed by a skilled architect.</p> <p>Through his experience, Alain came around to thinking of cities not as large buildings to be designed, but as markets. He argues that planners are too focused on what happens on private property and not focused enough on what happens on public streets and roadways. He argues that urban economics has many useful insights for urban planners and that economists should be integrated into urban planning teams.</p> <p>The publisher's description of the book follows:</p> <blockquote>Urban planning is a craft learned through practice. Planners make rapid decisions that have an immediate impact on the ground—the width of streets, the minimum size of land parcels, the heights of buildings. The language they use to describe their objectives is qualitative—“sustainable,” “livable,” “resilient”—often with no link to measurable outcomes. Urban economics, on the other hand, is a quantitative science, based on theories, models, and empirical evidence largely developed in academic settings. In this book, the eminent urban planner Alain Bertaud argues that applying the theories of urban economics to the practice of urban planning would greatly improve both the productivity of cities and the welfare of urban citizens.<br /> <br /> Bertaud explains that markets provide the indispensable mechanism for cities' development. He cites the experience of cities without markets for land or labor in pre-reform China and Russia; this “urban planners' dream” created inefficiencies and waste. Drawing on five decades of urban planning experience in forty cities around the world, Bertaud links cities' productivity to the size of their labor markets; argues that the design of infrastructure and markets can complement each other; examines the spatial distribution of land prices and densities; stresses the importance of mobility and affordability; and critiques the land use regulations in a number of cities that aim at redesigning existing cities instead of just trying to alleviate clear negative externalities. Bertaud concludes by describing the new role that joint teams of urban planners and economists could play to improve the way cities are managed.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Order-without-Design-Markets-Cities-ebook/dp/B07L3DJVHP/ref=as_li_ss_il?keywords=Order+Without+Design:+How+Markets+Shape+Cities&qid=1566574864&s=gateway&sr=8-1&linkCode=li3&tag=economicsde0f-20&linkId=22ddeed98b3c8483ca515188e3f39486&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Today's guest is <a href=\"http://alainbertaud.com/\" target= \"_blank\" rel=\"noopener\">Alain Bertaud</a>, author of <a href= \"https://amzn.to/2Zp27Qy\" target=\"_blank\" rel=\"noopener\">Order Without Design: How Markets Shape Cities</a>. Alain discusses his extensive experience in urban planning: When he was first trained as a planner, urban planning was thought of as an offshoot of architecture. In this conception, cities are just large buildings that need to be laid out and designed by a skilled architect.</p> <p>Through his experience, Alain came around to thinking of cities not as large buildings to be designed, but as markets. He argues that planners are too focused on what happens on private property and not focused enough on what happens on public streets and roadways. He argues that urban economics has many useful insights for urban planners and that economists should be integrated into urban planning teams.</p> <p>The publisher's description of the book follows:</p> Urban planning is a craft learned through practice. Planners make rapid decisions that have an immediate impact on the ground—the width of streets, the minimum size of land parcels, the heights of buildings. The language they use to describe their objectives is qualitative—“sustainable,” “livable,” “resilient”—often with no link to measurable outcomes. Urban economics, on the other hand, is a quantitative science, based on theories, models, and empirical evidence largely developed in academic settings. In this book, the eminent urban planner Alain Bertaud argues that applying the theories of urban economics to the practice of urban planning would greatly improve both the productivity of cities and the welfare of urban citizens.  Bertaud explains that markets provide the indispensable mechanism for cities' development. He cites the experience of cities without markets for land or labor in pre-reform China and Russia; this “urban planners' dream” created inefficiencies and waste. Drawing on five decades of urban planning experience in forty cities around the world, Bertaud links cities' productivity to the size of their labor markets; argues that the design of infrastructure and markets can complement each other; examines the spatial distribution of land prices and densities; stresses the importance of mobility and affordability; and critiques the land use regulations in a number of cities that aim at redesigning existing cities instead of just trying to alleviate clear negative externalities. Bertaud concludes by describing the new role that joint teams of urban planners and economists could play to improve the way cities are managed. ",
  "enclosure": "",
  "itunes:duration": "57:54",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is , author of . Alain discusses his extensive experience in urban planning: When he was first trained as a planner, urban planning was thought of as an offshoot of architecture. In this conception, cities are just large buildings that...",
  "itunes:episode": 129,
  "itunes:episodeType": "full"
}