{
  "title": "516: Can Draco Malfoy Ever Be Forgiven?",
  "link": "https://audioboom.com/posts/7882182",
  "itunes:episode": 516,
  "itunes:title": "Can Draco Malfoy Ever Be Forgiven?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5135,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>The Harry Potter Store in New York City is now open. Will Micah be going?</li>\n<li>In celebration of the character's birthday, today we are discussing all things Draco Malfoy.</li>\n<li>Malfoy's name implies he will act in bad faith, and his horoscope suggests a duality of character. Do the hosts agree?</li>\n<li>According to <em>LEGO Harry Potter: Years 1-4</em>, Malfoy's Boggart is Lord Voldemort. Is this canon? Are there any other things his Boggart might be?</li>\n<li>We all agree Tom Felton was an excellent choice for Draco, and we love how active he is in fandom today.</li>\n<li>Fun Segment: To kick off our in-depth character analysis, the hosts recap the Top 7 Moments Draco was a Jerk</li>\n<li>While the first four moments were concerning, the top three moments could have or did result in the loss of life!</li>\n<li>Can Draco Malfoy be redeemed? How much of his upbringing is to blame for his casual racism?</li>\n<li>Is there a \"sweet spot\" age where Draco can be held responsible for all of his actions, and if so, when?</li>\n<li>Drawing from <em>Cursed Child</em>, all the hosts strangely agree that Draco would be a good father as a result of his actions.</li>\n<li>Are there actions of Draco's that are truly unforgivable? What behavior would the hosts never forgive in their personal life?</li>\n<li>Which characters from <em>Harry Potter</em> would never forgive Draco? Which ones would?</li>\n<li>Finally, the hosts all try to say something nice about Draco!</li>\n<li>Quizzitch: The constellation Draco was so named for its appearance of being like a dragon.. Who first named the constellation Draco?Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week’s episode is sponsored by <a href=\"http://www.thirdlove.com/mugglecast\">ThirdLove</a> (Get 20% off your first purchase) and <a href=\"http://getquip.com/muggle5\">Quip</a> (Try their new mouthwash today!).</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 08 Jun 2021 09:00:00 +0000",
  "guid": "tag:audioboom.com,2021-06-07:/posts/7882182",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}