{
  "title": "Episode 63: &#8220;Susie Q&#8221; by Dale Hawkins",
  "link": "https://500songs.com/podcast/episode-63-susie-q-by-dale-hawkins/",
  "pubDate": "Mon, 30 Dec 2019 18:47:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=543",
  "description": "Episode sixty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Susie Q\" by Dale Hawkins, and at the difference between rockabilly and electric blues. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/32719116\">Shake a Hand\" by Faye Adams.</a>\n\n\n\n<strong>Errata</strong>\n\nI pronounce presage incorrectly in the episode, and the song \"Do it Again a Little Bit Slower\" doesn't have the word \"just\" in the title.\n\n<strong>Resources</strong>\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This time, for reasons to do with Mixcloud's terms of service, it's broken into two parts. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-63a-susie-q-part-1/\">Part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-63b-susie-q-part-2/\">part two</a>.\n\nThere are no books that I know of on Hawkins, but I relied heavily on three books with chapters on him -- <a href=\"https://amzn.to/35c9NIO\"><em>Hepcats and Rockabilly Boys </em>by Robert Reynolds</a>, <a href=\"https://amzn.to/358xAcD\">Dig That Beat! Interviews with Musicians at the Root of Rock and Roll by Sheree Homer,  </a>and <a href=\"https://amzn.to/368KEQx\"><em>Shreveport Sounds in Black and White</em> edited by Kip Lornell and Tracy E.W. Laird</a>.\n\n<a href=\"https://amzn.to/37jAfSn\">This compilation</a> of Hawkins' early singles is as good a set as any to start with, though the liner notes are perfunctory at best.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nWe're pretty much at the end of the true rockabilly era already -- all the major figures to come out of Sun studios have done so, and while 1957 saw several country-influenced white rock and rollers show up, like Buddy Holly and the Everly Brothers, and those singers will often get referred to as \"rockabilly\", they don't tend to get counted by aficionados of the subgenre, who think they don't sound enough like the music from Sun to count.\n\nBut there are still a few exceptions. And one of those is Dale Hawkins, the man whose recordings were to spark a whole new subgenre, the style of music that would later become known as \"swamp rock\".\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nDale Hawkins never liked being called a rockabilly, though that's the description that most people now use of him. We'll look later in the episode at how accurate that description actually is, but for the moment the important thing is that he thought of himself as a bluesman. When he was living in Shreveport, Louisiana, he lived in a shack in the black part of town, and inside the shack there was only a folding camp bed, a record player, and thousands of 78RPM blues records. Nothing else at all.\n\nIt's not that he didn't like country music, of course -- as a kid, he and his brother hitch-hiked to a nearby town to go to a Flatt and Scruggs gig, and he also loved Hank Williams and Jimmie Rodgers -- but it was the blues that called to him more, and so he never thought of himself as having the country elements that would normally be necessary for someone to call themselves a rockabilly.\n\nWhile he didn't have much direct country influence, he did come from a country music family. His father, Delmar Hawkins senior, was a country musician who was according to some sources one of the original members of the Sons of the Pioneers, the group that launched the career of Roy Rogers:\n\n[Excerpt: Sons of the Pioneers, \"Tumbling Tumbleweeds\"]\n\nWhile Hawkins Sr.'s name isn't in any of the official lists of group members, he might well have performed with them at some point in the early years of the group. And whether he did or didn't, he was definitely a bass player in many other hillbilly bands. However, it's unlikely that Delmar Hawkins Sr. had much influence on his son, as he left the family when Delmar Jr was three, and didn't reconnect until after “Susie Q” became a hit.\n\nDelmar Sr. wasn't the only family member to be a musician, either -- Dale's younger brother Jerry was a rockabilly who made a few singles in the fifties:\n\n[Excerpt: Jerry Hawkins, \"Swing Daddy Swing\"]\n\nAnother family member, Ronnie Hawkins, would later have his own musical career, which would intersect with several of the artists we're going to be looking at later in this series.\n\nDel Hawkins, as he was originally called, did a variety of jobs, including a short stint as a sailor, after dropping out of school, but he soon got the idea of becoming a musician, and started performing with Sonny Jones, a local guitarist whose sister was Hank Williams' widow. Jones had a lot of contacts in the local music industry, and helped Hawkins pull together the first lineup of his band, when he was nineteen.\n\nWhile Hawkins thought of himself as a blues musician, for a white singer in Shreveport, there was only one option open if you wanted to be a star, and that was performing on the Louisiana Hayride, the country show where Elvis, among many others, had made his name. And Jones had many contacts on the show, and performed on it himself.\n\nBut Hawkins' first job at the Louisiana Hayride wasn't as a performer, but working in the car park. He and his brother would go up to drivers heading into the car park for the show, and charge them fifty cents to park their cars for them -- when the car park filled up, they'd just park the cars on the street outside. What they didn't tell the drivers was that the car park was actually free to the public.\n\nAt the same time he was starting out as a musician, Del was working in a record shop, Stan's Record Shop, run by a man named Stan Lewis. Hawkins had been a regular customer for several years before working up the courage to ask for a job there, and by the time he got the job, he was familiar with almost every blues or R&B record that was available at the time. Customers would come into the shop, sing a snatch of a song they'd heard, and young Del would be able to tell them the title and the artist. It was through doing this job that Hawkins became friendly with customers like B.B. King, who would remain a lifelong friend. It was also while working at Stan's Record Shop that Hawkins became better acquainted with its owner.\n\nStan Lewis was, among other things, both a talent scout for Chess records and one of the biggest customers of the label -- if he got behind a record, Chess knew it would sell, at least in Louisiana, and so they would listen to him.\n\nIndeed, Lewis was one of the biggest record distributors, as well as a record shop owner, and he distributed records all across the region, to many other stores. Lewis also worked as a record producer -- the first record he ever produced was one of the biggest blues hits of all time, Lowell Fulson's \"Reconsider Baby\", which was released on the Chess subsidiary Checker:\n\n[Excerpt: Lowell Fulson, \"Reconsider Baby\"]\n\nLewis took an interest in his young employee's music career, and introduced Hawkins to his cousin, D.J. Fontana, another musician who played on the Louisiana Hayride. Fontana played with Hawkins for a while before taking on a better-paid job with Elvis Presley.\n\nAt Lewis' instigation, Hawkins went into the studio in 1956 with engineer Merle Kilgore (who would later become famous in his own right as a country songwriter, co-writing songs like \"Ring of Fire\"), his new guitarist James Burton, and several other musicians, to record a demo of what would become Hawkins' most famous song, \"Susie Q\":\n\n[Excerpt: Dale Hawkins, \"Susie Q\", demo version]\n\nListening to that, it's clear that they already had all the elements of the finished record nearly in place -- the main difference between that and the finished version that they cut later is that the demo has a saxophone solo, and that James Burton hasn't fully worked out his guitar part, although it's close to the final version.\n\nAt the time he cut that track, Hawkins intended it as a potential first single, but Stan Lewis had other ideas. While Chess records put out almost solely tracks by black artists, their subsidiary Checker *had* recently released a single by a white artist -- a song by Bobby Charles called \"Later, Alligator\", which a short while later had become a hit for Bill Haley, under the longer title \"See You Later, Alligator\":\n\n[Excerpt: Bobby Charles, \"Later Alligator\"]\n\nLewis thought that given that precedent, Checker might be willing to put out another record by a white act, if that record was an answer record to Bobby Charles'. So he persuaded Hawkins to write a soundalike song, which Hawkins and his band quickly demoed -- \"See You Soon, Baboon\":\n\n[Excerpt: Dale Hawkins, \"See You Soon, Baboon\"]\n\nLewis sent that off to Checker, who released Hawkins' demo, although they did make three small changes. The first was to add a Tarzan-style yodelling call at the beginning and end of the record:\n\n[Excerpt: Dale Hawkins, \"See You Soon, Baboon\"]\n\nThe second, which would have long-lasting consequences, was that they misspelled Hawkins' first name -- Leonard Chess misheard \"Del Hawkins\" over the phone, and the record came out as by \"Dale Hawkins\", which would be his name from that point on.\n\nThe last change was to remove Hawkins' songwriting credit, and give it instead to Stan Lewis and Eleanor Broadwater. Broadwater was the wife of Gene Nobles, a DJ to whom the Chess brothers owed money. Nobles is also the one who supplied the Tarzan cry.\n\nBoth Lewis and Broadwater would also get credited for Hawkins' follow-up single, a new version of \"Susie Q\":\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nOn that, at least, Hawkins was credited as one of the writers along with Lewis and Broadwater. But according to Hawkins, not only did the credit get split with the wrong people, but he didn't receive any of the royalties to which he was entitled until as late as 1985.\n\nAnd crucially, the other people who did cowrite the song -- notably James Burton -- didn't get any credit at all.\n\nIn general, there seems to be a great deal of disagreement about who contributed what to the song -- I've seen various other putative co-authors listed -- but everyone seems agreed that Hawkins came up with the lyrics, while Burton came up with the guitar riff. Presumably the song evolved from a jam session by the musicians -- it's the kind of song that musicians come up with when they're jamming together, and that would explain the discrepancies in the stories as to who wrote it. Well, that and the record company ripping the writers off.\n\nThe song came from a myriad musical sources. The most obvious influence for its overall sound -- both the melody and the way the melody interacts with the guitar riff -- is \"Baby Please Don't Go\" by Muddy Waters:\n\n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n\nBut the principal influence on the melody was, rather than Waters' song, a record by the Clovers which had a very similar melody -- \"I've Got My Eyes on You\":\n\n[Excerpt: The Clovers, \"I've Got My Eyes On You\"]\n\nHawkins and Burton took those melodic and arrangement ideas and coupled them with a riff inspired by Howlin' Wolf -- I've seen some people claim that the song was \"ripped off\" from Wolf. I don't believe, myself, that that is the case. Wolf certainly had several records with similar riffs, like \"Smokestack Lightnin'\":\n\n[Excerpt: Howlin' Wolf, \"Smokestack Lightnin'\"]\n\nAnd \"Spoonful\":\n\n[Excerpt: Howlin' Wolf, \"Spoonful\"]\n\nBut nothing with the exact same riff, and certainly nothing with the same melody.\n\nSome have also claimed that Wolf provided lyrical inspiration -- that Hawkins was inspired by seeing Wolf drop to his knees on stage yelling something about \"Suzy\". There are also claims that the song was named after Stan Lewis' daughter Suzie -- and notably Stan Lewis himself bolstered his claim to a co-writing credit for the song by pointing out that not only did he have a daughter named Susan, so did Leonard Chess. He claimed that he had mentioned this to Hawkins and suggested that the two of them write a song together with the name in it, because it would appeal to Chess.\n\nBoth of those tales of the song's lyrical inspiration may well be true, but I suspect that a more likely explanation is that the song is named after a dance move. We talked way back in episode four about the Lindy Hop, the popular dance from the late 1930s and forties. That dance was never a formalised dance, and one of its major characteristics was that it would incorporate dance moves from any other dance around.\n\nAnd one of the dances it incorporated into itself was one called the Suzie Q, which at the height of its popularity was promoted by a song performed by the pianist Lilian Hardin, who is now best known for having been the wife of Louis Armstrong, whose career she managed in its early years, but who at the time was a respected jazz musician in her own right:\n\n[Excerpt: Lil Hardin Armstrong, \"Doin' the Suzie Q\"]\n\nThe dance that that song was about was a simple dance step, involving crossing one's feet, swivelling. and stepping to one side. It got incorporated into the more complex Lindy Hop, but was still remembered as a step in itself.\n\nSo, it's likely that Hawkins was at least as inspired by that as he was by any of the other alleged inspirations for the song. Certainly at least one other Checker records artist thought so -- Jimmy McCracklin, in his song \"The Walk\", released the next year, starts his list of dances by singing \"I know you've heard of the Susie Q\":\n\n[Excerpt: Jimmy McCracklin, \"The Walk\"]\n\nAccording to the engineer on the session, Bob Sullivan, who was more used to recording Jim Reeves and Slim Whitman than raw rock and roll music, \"Susie Q\" was recorded in four takes, and Hawkins had the final choice of which take to use, but in Sullivan's opinion he chose the wrong one. The take chosen for release was an early take of the song, when Sullivan was still trying to get a balance, and he didn't notice at first that Hawkins was starting to sing, and had to quickly raise the volume on Hawkins' vocal just as he started. You can hear this if you listen to the finished recording:\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nThis new version of \"Susie Q\" was stripped right down -- it was just guitar, bass, and drums -- none of the saxophone that was present on the early version. But it kept the crucial ingredients of the earlier version -- that biting guitar riff played by James Burton, and the drum part, with its ear-catching cowbell. That drum part was played by Stan Lewis' fifteen-year-old brother Ronnie on the new version, but he's closely copying the part that A.J. Tuminello played on the demo -- Tuminello couldn't make the session, so Lewis just copied the part, which came about when Hawkins had heard Tuminello playing his drum and cowbell simultaneously during a soundcheck.\n\nNow that we've put the song in context, there's an interesting point we can make. As we discussed in the beginning, people usually refer to \"Susie Q\" as a rockabilly song. But there are a few criteria that generally apply to rockabilly but not to \"Susie Q\". And one of the most important of these ties back to something we were talking about last week -- the electric bass.\n\nThe demo version of \"Susie Q\" had, like almost all rock and roll records of the time, featured a double bass, played in the slapback style, and as we talked about back in the episodes on Bill Haley several months back, slapback bass is one of the defining features of the rockabilly genre. For this new recording, though, Sonny Trammell, a country player who played with Jim Reeves, played electric bass, as he was the only person in Shreveport who owned one.\n\nThis was a deliberate choice by Hawkins, who wanted to imitate the sound of electric blues records, rather than using the double bass, which he associated with country music -- though as it turns out, he would probably have been better off using a double bass if he wanted that sound, as Willie Dixon, who played bass on all the Chess blues records, actually didn't play an electric bass. Rather, he got a sound similar to an electric bass by actually placing the microphone inside the bottom of the bass' tailpiece.\n\nBut that points to something that \"Susie Q\" was doing that we've not seen before. One of the things people have asked me a few times is why I've not looked very much at the music that we now think of as \"the blues\", though at the time it was only a small part of the blues -- the guitar playing male solo artists who made up the Chicago sound, and the Delta bluesmen who inspired them. And that's because the common narrative, that rock and roll came from that kind of blues, is false -- as I hope the last year and a bit of podcasts have shown. Rock and roll came from a lot of different musics -- primarily Western swing, jump bands, and vocal group R&B -- and had relatively little influence in its early years from that branch of blues.\n\nBut over the next few years we will see a lot of musicians, primarily but not exclusively white British men, inspired by the first wave of rock and rollers to pick up a guitar, but rejecting the country music that inspired those early rock and rollers, and turning instead to Muddy Waters, Little Walter, and Howlin' Wolf.\n\nThere's never a first anything, and that's especially the case here where we're talking about musical ideas crossing racial lines, but one can make an argument that Dale Hawkins was the first white rock and roller to be inspired by people like Waters and Wolf, and for \"Susie Q\" as the record, more than any other, that presaged the white rock acts of the sixties, with its electric bass, Chess-style guitar riffs, and country-inflected vocals. Acts like the Rolling Stones or the Animals or Canned Heat were all following in Hawkins' footsteps, as you can hear in, for example, the Stones' own version of the song:\n\n[Excerpt: the Rolling Stones, “Susie Q”]\n\nWhat's surprising is how reluctant Chess were to release the single. The master was sent to Chess for release, but they kept hold of it for ten months without getting round to releasing it. Eventually, Hawkins became so frustrated that he sent a copy of the recording to Jerry Wexler at Atlantic Records. Wexler got excited, and told Leonard Chess that if Chess weren't going to put out the single, Atlantic would release it instead.\n\nAt that point, Chess realised that he might have something commercial on his hands, and decided to put the record out on Checker as it was originally intended.\n\nThe song went to number seven on the R&B charts, and number twenty-seven on the pop charts. Between the recording and release of the single, James Burton quit the band. He moved on first to work with another Louisiana musician, Bob Luman:\n\n[Excerpt: Bob Luman, \"All Night Long\"]\n\nBurton then went on to work first with Ricky Nelson and then as a session player with everyone from the Monkees to Elvis.\n\nHawkins had an ear for good guitarists, and after Burton went on to be one of the most important guitarists in rock music, Hawkins would continue to play with many other superb players, such as Roy Buchanan, who played on Hawkins' cover version of Little Walter's \"My Babe\":\n\n[Excerpt: Dale Hawkins, \"My Babe\"]\n\nAnd then there was the guitarist on the closest he came to a follow-up hit, “La-Do-Dada”:\n\n[Excerpt: Dale Hawkins, \"Lo-Do-Dada\"]\n\nThat guitarist was another young player, Joe Osborn, who would soon follow James Burton to LA and to the pool of session players that became known as the Wrecking Crew, though Osborn would switch his guitar for bass.\n\nHowever, none of Hawkins' follow-ups had anything more than very minor commercial success, and he would increasingly find himself chasing trends and trying to catch up with other people's styles, rather than continuing with the raw rock and roll sound he had found on \"Susie Q\". By the early sixties he was recording novelty live albums of twist songs, to try to cash in on the twist fad:\n\n[Excerpt: Dale Hawkins, \"Do the Twist\"]\n\nAfter his brief run of hits dried up, he used his connection with Dick Clark, the TV presenter whose American Bandstand had helped to break \"Susie Q\" on the national market, to get his own TV show, The Dale Hawkins Show, which ran for eighteen months and was a similar format to Bandstand. Once that show was over, he turned to record production.\n\nThere he once again worked for Stan Lewis, who by that point had started his own record labels. There seems to be some dispute as to which records Hawkins produced in his second career. I've seen claims, for example, that he produced \"Hey Baby\" by Bruce Channel:\n\n[Excerpt: Bruce Channel, \"Hey Baby\"]\n\nBut Hawkins is not the credited producer on that, or on \"Judy In Disguise With Glasses\" by John Fred and the Playboy Band, another record he's often credited with. On the other hand, he *is* the credited producer on the big hit \"Do it Again Just a Little Bit Slower\" by Jon and Robin:\n\n[Excerpt: Jon and Robin, \"Do it Again A Little Bit Slower\"]\n\nTowards the end of the sixties, he had a brief second attempt at a recording career for himself. Creedence Clearwater Revival had a hit in 1968 with their version of \"Susie Q\":\n\n[Excerpt: Creedence Clearwater Revival, \"Susie Q\"]\n\nAnd that was enough to draw Hawkins back into the studio, working once again with James Burton on guitar and Joe Osborn on bass, along with a few newer blues musicians like Taj Mahal and Ry Cooder, on an album full of the swamp-rock style he had created in the fifties, \"LA, Memphis, and Tyler, Texas\":\n\n[Excerpt: Dale Hawkins: \"LA, Memphis, Tyler, Texas\"]\n\nWhen that wasn't a success, he moved on to RCA Records to become head of A&R for their West Coast rock department -- a job he was apparently put forward for by Joe Osborn.\n\nBut after a successful few years, he spent much of the seventies suffering from an amphetamine addiction, having started taking speed back in the fifties. He finally got clean in the early eighties, and started touring the rockabilly revival circuit -- as well as finally getting his master's degree, which for a high school dropout was a major achievement, and something to be as proud of as any hit.\n\nIn 1998, he recorded his first album in thirty years, Wildcat Tamer:\n\n[Excerpt: Dale Hawkins, \"Wildcat Tamer\"]\n\nThat got some of the best reviews of his career, but his next album took nearly a decade to come out, and by that time he had been diagnosed with the colon cancer that eventually killed him in 2010.\n\nHawkins is in many ways a paradoxical figure -- he was someone who pointed the way to the future of rock and roll, but the future he pointed to was one of white men taking the ideas of black blues musicians and only slightly altering them. He was a byword for untutored, raw, instinctive rock and roll, and yet his biggest hit is carefully constructed out of bits of other people's records, melded together with a great deal of thought.\n\nAt the end of it all, what survives is that one glorious hit record -- a guitar, a bass, drums, a cowbell, and a teenage boy singing of how he loves Susie Q.",
  "itunes:subtitle": "Episode sixty-three of A History of Rock Music in Five Hundred Songs looks at Susie Q by Dale Hawkins, and at the difference between rockabilly and electric blues. Click the full post to read liner notes, links to more information, and a transcript of th",
  "itunes:keywords": "Chess Records,country and western,D.J. Fontana,Dale Hawkins,dance crazes,Dick Clark,Howlin&#039; Wolf,James Burton,Jerry Wexler,Joe Osborn,Leonard Chess,Lil Hardin,Lindy hop,Louisiana Hayride,Lowell Fulson,Merle Kilgore,rockabilly,Ronnie Hawkins,Stan Lewis,swamp rock,the blues",
  "itunes:episodeType": "full",
  "itunes:episode": 63,
  "content:encoded": "Episode sixty-three of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Susie Q\" by Dale Hawkins, and at the difference between rockabilly and electric blues. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/32719116\">Shake a Hand\" by Faye Adams.</a>\n\n\n\n<strong>Errata</strong>\n\nI pronounce presage incorrectly in the episode, and the song \"Do it Again a Little Bit Slower\" doesn't have the word \"just\" in the title.\n\n<strong>Resources</strong>\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This time, for reasons to do with Mixcloud's terms of service, it's broken into two parts. <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-63a-susie-q-part-1/\">Part one</a>, <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-63b-susie-q-part-2/\">part two</a>.\n\nThere are no books that I know of on Hawkins, but I relied heavily on three books with chapters on him -- <a href=\"https://amzn.to/35c9NIO\"><em>Hepcats and Rockabilly Boys </em>by Robert Reynolds</a>, <a href=\"https://amzn.to/358xAcD\">Dig That Beat! Interviews with Musicians at the Root of Rock and Roll by Sheree Homer,  </a>and <a href=\"https://amzn.to/368KEQx\"><em>Shreveport Sounds in Black and White</em> edited by Kip Lornell and Tracy E.W. Laird</a>.\n\n<a href=\"https://amzn.to/37jAfSn\">This compilation</a> of Hawkins' early singles is as good a set as any to start with, though the liner notes are perfunctory at best.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nWe're pretty much at the end of the true rockabilly era already -- all the major figures to come out of Sun studios have done so, and while 1957 saw several country-influenced white rock and rollers show up, like Buddy Holly and the Everly Brothers, and those singers will often get referred to as \"rockabilly\", they don't tend to get counted by aficionados of the subgenre, who think they don't sound enough like the music from Sun to count.\n\nBut there are still a few exceptions. And one of those is Dale Hawkins, the man whose recordings were to spark a whole new subgenre, the style of music that would later become known as \"swamp rock\".\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nDale Hawkins never liked being called a rockabilly, though that's the description that most people now use of him. We'll look later in the episode at how accurate that description actually is, but for the moment the important thing is that he thought of himself as a bluesman. When he was living in Shreveport, Louisiana, he lived in a shack in the black part of town, and inside the shack there was only a folding camp bed, a record player, and thousands of 78RPM blues records. Nothing else at all.\n\nIt's not that he didn't like country music, of course -- as a kid, he and his brother hitch-hiked to a nearby town to go to a Flatt and Scruggs gig, and he also loved Hank Williams and Jimmie Rodgers -- but it was the blues that called to him more, and so he never thought of himself as having the country elements that would normally be necessary for someone to call themselves a rockabilly.\n\nWhile he didn't have much direct country influence, he did come from a country music family. His father, Delmar Hawkins senior, was a country musician who was according to some sources one of the original members of the Sons of the Pioneers, the group that launched the career of Roy Rogers:\n\n[Excerpt: Sons of the Pioneers, \"Tumbling Tumbleweeds\"]\n\nWhile Hawkins Sr.'s name isn't in any of the official lists of group members, he might well have performed with them at some point in the early years of the group. And whether he did or didn't, he was definitely a bass player in many other hillbilly bands. However, it's unlikely that Delmar Hawkins Sr. had much influence on his son, as he left the family when Delmar Jr was three, and didn't reconnect until after “Susie Q” became a hit.\n\nDelmar Sr. wasn't the only family member to be a musician, either -- Dale's younger brother Jerry was a rockabilly who made a few singles in the fifties:\n\n[Excerpt: Jerry Hawkins, \"Swing Daddy Swing\"]\n\nAnother family member, Ronnie Hawkins, would later have his own musical career, which would intersect with several of the artists we're going to be looking at later in this series.\n\nDel Hawkins, as he was originally called, did a variety of jobs, including a short stint as a sailor, after dropping out of school, but he soon got the idea of becoming a musician, and started performing with Sonny Jones, a local guitarist whose sister was Hank Williams' widow. Jones had a lot of contacts in the local music industry, and helped Hawkins pull together the first lineup of his band, when he was nineteen.\n\nWhile Hawkins thought of himself as a blues musician, for a white singer in Shreveport, there was only one option open if you wanted to be a star, and that was performing on the Louisiana Hayride, the country show where Elvis, among many others, had made his name. And Jones had many contacts on the show, and performed on it himself.\n\nBut Hawkins' first job at the Louisiana Hayride wasn't as a performer, but working in the car park. He and his brother would go up to drivers heading into the car park for the show, and charge them fifty cents to park their cars for them -- when the car park filled up, they'd just park the cars on the street outside. What they didn't tell the drivers was that the car park was actually free to the public.\n\nAt the same time he was starting out as a musician, Del was working in a record shop, Stan's Record Shop, run by a man named Stan Lewis. Hawkins had been a regular customer for several years before working up the courage to ask for a job there, and by the time he got the job, he was familiar with almost every blues or R&B record that was available at the time. Customers would come into the shop, sing a snatch of a song they'd heard, and young Del would be able to tell them the title and the artist. It was through doing this job that Hawkins became friendly with customers like B.B. King, who would remain a lifelong friend. It was also while working at Stan's Record Shop that Hawkins became better acquainted with its owner.\n\nStan Lewis was, among other things, both a talent scout for Chess records and one of the biggest customers of the label -- if he got behind a record, Chess knew it would sell, at least in Louisiana, and so they would listen to him.\n\nIndeed, Lewis was one of the biggest record distributors, as well as a record shop owner, and he distributed records all across the region, to many other stores. Lewis also worked as a record producer -- the first record he ever produced was one of the biggest blues hits of all time, Lowell Fulson's \"Reconsider Baby\", which was released on the Chess subsidiary Checker:\n\n[Excerpt: Lowell Fulson, \"Reconsider Baby\"]\n\nLewis took an interest in his young employee's music career, and introduced Hawkins to his cousin, D.J. Fontana, another musician who played on the Louisiana Hayride. Fontana played with Hawkins for a while before taking on a better-paid job with Elvis Presley.\n\nAt Lewis' instigation, Hawkins went into the studio in 1956 with engineer Merle Kilgore (who would later become famous in his own right as a country songwriter, co-writing songs like \"Ring of Fire\"), his new guitarist James Burton, and several other musicians, to record a demo of what would become Hawkins' most famous song, \"Susie Q\":\n\n[Excerpt: Dale Hawkins, \"Susie Q\", demo version]\n\nListening to that, it's clear that they already had all the elements of the finished record nearly in place -- the main difference between that and the finished version that they cut later is that the demo has a saxophone solo, and that James Burton hasn't fully worked out his guitar part, although it's close to the final version.\n\nAt the time he cut that track, Hawkins intended it as a potential first single, but Stan Lewis had other ideas. While Chess records put out almost solely tracks by black artists, their subsidiary Checker *had* recently released a single by a white artist -- a song by Bobby Charles called \"Later, Alligator\", which a short while later had become a hit for Bill Haley, under the longer title \"See You Later, Alligator\":\n\n[Excerpt: Bobby Charles, \"Later Alligator\"]\n\nLewis thought that given that precedent, Checker might be willing to put out another record by a white act, if that record was an answer record to Bobby Charles'. So he persuaded Hawkins to write a soundalike song, which Hawkins and his band quickly demoed -- \"See You Soon, Baboon\":\n\n[Excerpt: Dale Hawkins, \"See You Soon, Baboon\"]\n\nLewis sent that off to Checker, who released Hawkins' demo, although they did make three small changes. The first was to add a Tarzan-style yodelling call at the beginning and end of the record:\n\n[Excerpt: Dale Hawkins, \"See You Soon, Baboon\"]\n\nThe second, which would have long-lasting consequences, was that they misspelled Hawkins' first name -- Leonard Chess misheard \"Del Hawkins\" over the phone, and the record came out as by \"Dale Hawkins\", which would be his name from that point on.\n\nThe last change was to remove Hawkins' songwriting credit, and give it instead to Stan Lewis and Eleanor Broadwater. Broadwater was the wife of Gene Nobles, a DJ to whom the Chess brothers owed money. Nobles is also the one who supplied the Tarzan cry.\n\nBoth Lewis and Broadwater would also get credited for Hawkins' follow-up single, a new version of \"Susie Q\":\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nOn that, at least, Hawkins was credited as one of the writers along with Lewis and Broadwater. But according to Hawkins, not only did the credit get split with the wrong people, but he didn't receive any of the royalties to which he was entitled until as late as 1985.\n\nAnd crucially, the other people who did cowrite the song -- notably James Burton -- didn't get any credit at all.\n\nIn general, there seems to be a great deal of disagreement about who contributed what to the song -- I've seen various other putative co-authors listed -- but everyone seems agreed that Hawkins came up with the lyrics, while Burton came up with the guitar riff. Presumably the song evolved from a jam session by the musicians -- it's the kind of song that musicians come up with when they're jamming together, and that would explain the discrepancies in the stories as to who wrote it. Well, that and the record company ripping the writers off.\n\nThe song came from a myriad musical sources. The most obvious influence for its overall sound -- both the melody and the way the melody interacts with the guitar riff -- is \"Baby Please Don't Go\" by Muddy Waters:\n\n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n\nBut the principal influence on the melody was, rather than Waters' song, a record by the Clovers which had a very similar melody -- \"I've Got My Eyes on You\":\n\n[Excerpt: The Clovers, \"I've Got My Eyes On You\"]\n\nHawkins and Burton took those melodic and arrangement ideas and coupled them with a riff inspired by Howlin' Wolf -- I've seen some people claim that the song was \"ripped off\" from Wolf. I don't believe, myself, that that is the case. Wolf certainly had several records with similar riffs, like \"Smokestack Lightnin'\":\n\n[Excerpt: Howlin' Wolf, \"Smokestack Lightnin'\"]\n\nAnd \"Spoonful\":\n\n[Excerpt: Howlin' Wolf, \"Spoonful\"]\n\nBut nothing with the exact same riff, and certainly nothing with the same melody.\n\nSome have also claimed that Wolf provided lyrical inspiration -- that Hawkins was inspired by seeing Wolf drop to his knees on stage yelling something about \"Suzy\". There are also claims that the song was named after Stan Lewis' daughter Suzie -- and notably Stan Lewis himself bolstered his claim to a co-writing credit for the song by pointing out that not only did he have a daughter named Susan, so did Leonard Chess. He claimed that he had mentioned this to Hawkins and suggested that the two of them write a song together with the name in it, because it would appeal to Chess.\n\nBoth of those tales of the song's lyrical inspiration may well be true, but I suspect that a more likely explanation is that the song is named after a dance move. We talked way back in episode four about the Lindy Hop, the popular dance from the late 1930s and forties. That dance was never a formalised dance, and one of its major characteristics was that it would incorporate dance moves from any other dance around.\n\nAnd one of the dances it incorporated into itself was one called the Suzie Q, which at the height of its popularity was promoted by a song performed by the pianist Lilian Hardin, who is now best known for having been the wife of Louis Armstrong, whose career she managed in its early years, but who at the time was a respected jazz musician in her own right:\n\n[Excerpt: Lil Hardin Armstrong, \"Doin' the Suzie Q\"]\n\nThe dance that that song was about was a simple dance step, involving crossing one's feet, swivelling. and stepping to one side. It got incorporated into the more complex Lindy Hop, but was still remembered as a step in itself.\n\nSo, it's likely that Hawkins was at least as inspired by that as he was by any of the other alleged inspirations for the song. Certainly at least one other Checker records artist thought so -- Jimmy McCracklin, in his song \"The Walk\", released the next year, starts his list of dances by singing \"I know you've heard of the Susie Q\":\n\n[Excerpt: Jimmy McCracklin, \"The Walk\"]\n\nAccording to the engineer on the session, Bob Sullivan, who was more used to recording Jim Reeves and Slim Whitman than raw rock and roll music, \"Susie Q\" was recorded in four takes, and Hawkins had the final choice of which take to use, but in Sullivan's opinion he chose the wrong one. The take chosen for release was an early take of the song, when Sullivan was still trying to get a balance, and he didn't notice at first that Hawkins was starting to sing, and had to quickly raise the volume on Hawkins' vocal just as he started. You can hear this if you listen to the finished recording:\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nThis new version of \"Susie Q\" was stripped right down -- it was just guitar, bass, and drums -- none of the saxophone that was present on the early version. But it kept the crucial ingredients of the earlier version -- that biting guitar riff played by James Burton, and the drum part, with its ear-catching cowbell. That drum part was played by Stan Lewis' fifteen-year-old brother Ronnie on the new version, but he's closely copying the part that A.J. Tuminello played on the demo -- Tuminello couldn't make the session, so Lewis just copied the part, which came about when Hawkins had heard Tuminello playing his drum and cowbell simultaneously during a soundcheck.\n\nNow that we've put the song in context, there's an interesting point we can make. As we discussed in the beginning, people usually refer to \"Susie Q\" as a rockabilly song. But there are a few criteria that generally apply to rockabilly but not to \"Susie Q\". And one of the most important of these ties back to something we were talking about last week -- the electric bass.\n\nThe demo version of \"Susie Q\" had, like almost all rock and roll records of the time, featured a double bass, played in the slapback style, and as we talked about back in the episodes on Bill Haley several months back, slapback bass is one of the defining features of the rockabilly genre. For this new recording, though, Sonny Trammell, a country player who played with Jim Reeves, played electric bass, as he was the only person in Shreveport who owned one.\n\nThis was a deliberate choice by Hawkins, who wanted to imitate the sound of electric blues records, rather than using the double bass, which he associated with country music -- though as it turns out, he would probably have been better off using a double bass if he wanted that sound, as Willie Dixon, who played bass on all the Chess blues records, actually didn't play an electric bass. Rather, he got a sound similar to an electric bass by actually placing the microphone inside the bottom of the bass' tailpiece.\n\nBut that points to something that \"Susie Q\" was doing that we've not seen before. One of the things people have asked me a few times is why I've not looked very much at the music that we now think of as \"the blues\", though at the time it was only a small part of the blues -- the guitar playing male solo artists who made up the Chicago sound, and the Delta bluesmen who inspired them. And that's because the common narrative, that rock and roll came from that kind of blues, is false -- as I hope the last year and a bit of podcasts have shown. Rock and roll came from a lot of different musics -- primarily Western swing, jump bands, and vocal group R&B -- and had relatively little influence in its early years from that branch of blues.\n\nBut over the next few years we will see a lot of musicians, primarily but not exclusively white British men, inspired by the first wave of rock and rollers to pick up a guitar, but rejecting the country music that inspired those early rock and rollers, and turning instead to Muddy Waters, Little Walter, and Howlin' Wolf.\n\nThere's never a first anything, and that's especially the case here where we're talking about musical ideas crossing racial lines, but one can make an argument that Dale Hawkins was the first white rock and roller to be inspired by people like Waters and Wolf, and for \"Susie Q\" as the record, more than any other, that presaged the white rock acts of the sixties, with its electric bass, Chess-style guitar riffs, and country-inflected vocals. Acts like the Rolling Stones or the Animals or Canned Heat were all following in Hawkins' footsteps, as you can hear in, for example, the Stones' own version of the song:\n\n[Excerpt: the Rolling Stones, “Susie Q”]\n\nWhat's surprising is how reluctant Chess were to release the single. The master was sent to Chess for release, but they kept hold of it for ten months without getting round to releasing it. Eventually, Hawkins became so frustrated that he sent a copy of the recording to Jerry Wexler at Atlantic Records. Wexler got excited, and told Leonard Chess that if Chess weren't going to put out the single, Atlantic would release it instead.\n\nAt that point, Chess realised that he might have something commercial on his hands, and decided to put the record out on Checker as it was originally intended.\n\nThe song went to number seven on the R&B charts, and number twenty-seven on the pop charts. Between the recording and release of the single, James Burton quit the band. He moved on first to work with another Louisiana musician, Bob Luman:\n\n[Excerpt: Bob Luman, \"All Night Long\"]\n\nBurton then went on to work first with Ricky Nelson and then as a session player with everyone from the Monkees to Elvis.\n\nHawkins had an ear for good guitarists, and after Burton went on to be one of the most important guitarists in rock music, Hawkins would continue to play with many other superb players, such as Roy Buchanan, who played on Hawkins' cover version of Little Walter's \"My Babe\":\n\n[Excerpt: Dale Hawkins, \"My Babe\"]\n\nAnd then there was the guitarist on the closest he came to a follow-up hit, “La-Do-Dada”:\n\n[Excerpt: Dale Hawkins, \"Lo-Do-Dada\"]\n\nThat guitarist was another young player, Joe Osborn, who would soon follow James Burton to LA and to the pool of session players that became known as the Wrecking Crew, though Osborn would switch his guitar for bass.\n\nHowever, none of Hawkins' follow-ups had anything more than very minor commercial success, and he would increasingly find himself chasing trends and trying to catch up with other people's styles, rather than continuing with the raw rock and roll sound he had found on \"Susie Q\". By the early sixties he was recording novelty live albums of twist songs, to try to cash in on the twist fad:\n\n[Excerpt: Dale Hawkins, \"Do the Twist\"]\n\nAfter his brief run of hits dried up, he used his connection with Dick Clark, the TV presenter whose American Bandstand had helped to break \"Susie Q\" on the national market, to get his own TV show, The Dale Hawkins Show, which ran for eighteen months and was a similar format to Bandstand. Once that show was over, he turned to record production.\n\nThere he once again worked for Stan Lewis, who by that point had started his own record labels. There seems to be some dispute as to which records Hawkins produced in his second career. I've seen claims, for example, that he produced \"Hey Baby\" by Bruce Channel:\n\n[Excerpt: Bruce Channel, \"Hey Baby\"]\n\nBut Hawkins is not the credited producer on that, or on \"Judy In Disguise With Glasses\" by John Fred and the Playboy Band, another record he's often credited with. On the other hand, he *is* the credited producer on the big hit \"Do it Again Just a Little Bit Slower\" by Jon and Robin:\n\n[Excerpt: Jon and Robin, \"Do it Again A Little Bit Slower\"]\n\nTowards the end of the sixties, he had a brief second attempt at a recording career for himself. Creedence Clearwater Revival had a hit in 1968 with their version of \"Susie Q\":\n\n[Excerpt: Creedence Clearwater Revival, \"Susie Q\"]\n\nAnd that was enough to draw Hawkins back into the studio, working once again with James Burton on guitar and Joe Osborn on bass, along with a few newer blues musicians like Taj Mahal and Ry Cooder, on an album full of the swamp-rock style he had created in the fifties, \"LA, Memphis, and Tyler, Texas\":\n\n[Excerpt: Dale Hawkins: \"LA, Memphis, Tyler, Texas\"]\n\nWhen that wasn't a success, he moved on to RCA Records to become head of A&R for their West Coast rock department -- a job he was apparently put forward for by Joe Osborn.\n\nBut after a successful few years, he spent much of the seventies suffering from an amphetamine addiction, having started taking speed back in the fifties. He finally got clean in the early eighties, and started touring the rockabilly revival circuit -- as well as finally getting his master's degree, which for a high school dropout was a major achievement, and something to be as proud of as any hit.\n\nIn 1998, he recorded his first album in thirty years, Wildcat Tamer:\n\n[Excerpt: Dale Hawkins, \"Wildcat Tamer\"]\n\nThat got some of the best reviews of his career, but his next album took nearly a decade to come out, and by that time he had been diagnosed with the colon cancer that eventually killed him in 2010.\n\nHawkins is in many ways a paradoxical figure -- he was someone who pointed the way to the future of rock and roll, but the future he pointed to was one of white men taking the ideas of black blues musicians and only slightly altering them. He was a byword for untutored, raw, instinctive rock and roll, and yet his biggest hit is carefully constructed out of bits of other people's records, melded together with a great deal of thought.\n\nAt the end of it all, what survives is that one glorious hit record -- a guitar, a bass, drums, a cowbell, and a teenage boy singing of how he loves Susie Q.",
  "enclosure": "",
  "itunes:summary": "Episode sixty-three of A History of Rock Music in Five Hundred Songs looks at \"Susie Q\" by Dale Hawkins, and at the difference between rockabilly and electric blues. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Shake a Hand\" by Faye Adams.\n\n\n\nErrata\n\nI pronounce presage incorrectly in the episode, and the song \"Do it Again a Little Bit Slower\" doesn't have the word \"just\" in the title.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This time, for reasons to do with Mixcloud's terms of service, it's broken into two parts. Part one, part two.\n\nThere are no books that I know of on Hawkins, but I relied heavily on three books with chapters on him -- Hepcats and Rockabilly Boys by Robert Reynolds, Dig That Beat! Interviews with Musicians at the Root of Rock and Roll by Sheree Homer,  and Shreveport Sounds in Black and White edited by Kip Lornell and Tracy E.W. Laird.\n\nThis compilation of Hawkins' early singles is as good a set as any to start with, though the liner notes are perfunctory at best.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWe're pretty much at the end of the true rockabilly era already -- all the major figures to come out of Sun studios have done so, and while 1957 saw several country-influenced white rock and rollers show up, like Buddy Holly and the Everly Brothers, and those singers will often get referred to as \"rockabilly\", they don't tend to get counted by aficionados of the subgenre, who think they don't sound enough like the music from Sun to count.\n\nBut there are still a few exceptions. And one of those is Dale Hawkins, the man whose recordings were to spark a whole new subgenre, the style of music that would later become known as \"swamp rock\".\n\n[Excerpt: Dale Hawkins, \"Susie Q\"]\n\nDale Hawkins never liked being called a rockabilly, though that's the description that most people now use of him. We'll look later in the episode at how accurate that description actually is, but for the moment the important thing is that he thought of himself as a bluesman. When he was living in Shreveport, Louisiana, he lived in a shack in the black part of town, and inside the shack there was only a folding camp bed, a record player, and thousands of 78RPM blues records. Nothing else at all.\n\nIt's not that he didn't like country music, of course -- as a kid, he and his brother hitch-hiked to a nearby town to go to a Flatt and Scruggs gig, and he also loved Hank Williams and Jimmie Rodgers -- but it was the blues that called to him more, and so he never thought of himself as having the country elements that would normally be necessary for someone to call themselves a rockabilly.\n\nWhile he didn't have much direct country influence, he did come from a country music family. His father, Delmar Hawkins senior, was a country musician who was according to some sources one of the original members of the Sons of the Pioneers, the group that launched the career of Roy Rogers:\n\n[Excerpt: Sons of the Pioneers, \"Tumbling Tumbleweeds\"]\n\nWhile Hawkins Sr.'s name isn't in any of the official lists of group members, he might well have performed with them at some point in the early years of the group. And whether he did or didn't, he was definitely a bass player in many other hillbilly bands. However, it's unlikely that Delmar Hawkins Sr. had much influence on his son, as he left the family when Delmar Jr was three, and didn't reconnect until after “Susie Q” became a hit.\n\nDelmar Sr. wasn't the only family member to be a musician, either -- Dale's younger brother Jerry was a rockabilly who made a few singles in the fifties:\n\n[Excerpt: Jerry Hawkins, \"Swing Daddy Swing\"]\n\nAnother family member, Ronnie Hawkins, would later have his own musical career, which would intersect with seve",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-three of A History of Rock Music in Five Hundred Songs looks at \"Susie Q\" by Dale Hawkins, and at the difference between rockabilly and electric blues. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Shake a Hand\" by Faye Adams.\n\n\n\nErrata\n\nI pronounce presage incorrectly in the episode, and the song \"Do it Again a Little Bit Slower\" doesn't have the word \"just\" in the title.\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This time, for reasons to do with Mixcloud's terms of service, it's broken into two parts. Part one, part two.\n\nThere are no books that I know of on Hawkins, but I relied heavily on three books with chapters on him -- Hepcats and Rockabilly Boys by Robert Reynolds, Dig That Beat! Interviews with Musicians at the Root of Rock and Roll by Sheree Homer,  and Shrevepor",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}