{
  "title": "Ten Tips for Writing CS Papers, Part 2",
  "link": "",
  "published": "2015-12-10T22:30:00+00:00",
  "updated": "2015-12-10T22:30:00+00:00",
  "author": {
    "name": "Sebastian Nowozin"
  },
  "id": "tag:www.nowozin.net,2015-12-10:/sebastian/blog/ten-tips-for-writing-cs-papers-part-2.html",
  "summary": "<p>This continues the <a href=\"http://www.nowozin.net/sebastian/blog/ten-tips-for-writing-cs-papers-part-1.html\">first part</a> on tips to write\ncomputer science papers.</p>\n<h2>6. Ideal Structure of a Paragraph</h2>\n<p>A paper has different levels of formal structure:\nsections, subsections, paragraphs, sentences.\nIt is important to ensure that the structure of the …</p>",
  "content": "<p>This continues the <a href=\"http://www.nowozin.net/sebastian/blog/ten-tips-for-writing-cs-papers-part-1.html\">first part</a> on tips to write\ncomputer science papers.</p>\n<h2>6. Ideal Structure of a Paragraph</h2>\n<p>A paper has different levels of formal structure:\nsections, subsections, paragraphs, sentences.\nIt is important to ensure that the structure of the content aligns well with\nthe formal structure because the formal structure is readily perceived by the\nreader, whereas the structure of the content is not.\nWith a good alignment we make it easy for the reader to have the right mental\nmodel for the organization of the content; this enables a better navigation\nand memory of the content.</p>\n<p>An important consequence of a well organized paper is to minimize the possible\nsurprise for the reader.\nIn general you may want to surprise readers with how amazing your method or\nachievements are, but not through the organization of the paper.</p>\n<p>How to align the content with the formal structure?\nThere is more to say about this and I recommend the references at the end of\nthis article, but here I want to focus on the structure of one or multiple <em>paragraphs</em>.\nThe basic rules are:</p>\n<ol>\n<li>One paragraph should contain only a single idea or a single point of\nargumentation.</li>\n<li>The <em>beginning</em> and the <em>end</em> of a paragraph glue the paragraph into the\nsurrounding content.</li>\n</ol>\n<p>There is an ambiguity as to what constitutes a separate idea and indeed\nparagraphs may be of quite different lengths.</p>\n<p>To achieve a good structure, here is a recipe that works for me.\nFor a section I would like to write I make a list of\nbullet points of things I want to say, with one bullet point being a single\nidea or important point.  Each point may have one or more dependencies on\nother points and I use the dependencies to order the list.\nFinally, I write one paragraph for each item on the list and I may add an\nadditional paragraph at the beginning and end of the section to connect the\nsection to the surrounding content.</p>\n<p>I found that this recipe also makes my job as a writer easier because it\novercomes my writing inhibition in two ways.\nFirst, I can start by simply making a list and this does not feel like\nwriting.\nSecond, once the ordering of ideas is clear, the actual writing becomes a lot\nsimpler.</p>\n<p>Here is an example of a less-than-ideal paragraph from Section 2.3 in <a href=\"http://www.nowozin.net/sebastian/papers/gehler2008ikl-tr.pdf\">(Gehler\nand Nowozin,\n2008)</a>.</p>\n<blockquote>\n<p>\"As already mentioned to our knowledge (Argyriou et al., 2006) were the\nfirst to note the possibility of an infinite set of base kernels and they\nalso stated the subproblem (Problem 1).  We will defer the discussion of the\nsubproblem to the next section and shortly comment on the differences of the\nAlgorithm of (Argyriou et al., 2006) and the IKL Algorithm.  We denote with\n<span class=\"math\">\\(g\\)</span> the objective value of a standard SVM classifier with loss function\n<span class=\"math\">\\(L\\)</span>.\"</p>\n</blockquote>\n<p>Let us reverse engineer the content of this paragraph, then restructure it.\nThe paragraph makes two points:\nfirst, a connection to the work of (Argyriou et al., 2006).\nSecond, it establishes some notation.\nSo it should perhaps be split into two paragraphs.</p>\n<p>For the first point, the beginning is also less than ideal: \"as already\nmentioned to our knowledge\"; it is a bit redundant and apologetic to point out\nthat we already mentioned it and that we may not know better.\nThe second point, the notation, is okay by itself, but it is unclear why it\nfollows the first: is it done in order to enable the comparison between\napproaches?  We would need to read ahead to find out.  (This is indeed the\ncase.)\nHere is a proposed improvement:</p>\n<blockquote>\n<p>(Argyriou et al., 2006) first recognized the possibility of an infinite set\nof base kernels and we now discuss the connection to our work.</p>\n<p>To make the connection explicit we first establish the notation we will use\nthroughout the paper.  We use <span class=\"math\">\\(g\\)</span> to denote the objective value of a\nstandard SVM classifier, where <span class=\"math\">\\(L\\)</span> is the loss function.</p>\n</blockquote>\n<p>It is simpler to read and makes it clear why we introduce the notation.\nAlso note the end and beginning of the two short paragraphs: the end of the\nfirst paragraph tells you what comes next (\"the connection to our work\"), the\nbeginning of the second paragraph tells you how this is done (through\nnotation).\nThe flow between the two paragraphs is natural now and they could almost be\nmerged into one again with the single point of the resulting paragraph being\n\"the connection between (Argyriou et al.) and our work\".</p>\n<h2>7. Avoid Ambiguous Relative Pronouns (This, These, That, Which)</h2>\n<p>When used properly, a relative pronoun, such as \"this\", \"these\", \"that\",\n\"which\", can effectively refer to a previously mentioned noun,\nand <em>that</em> has to be remembered by the reader.</p>\n<p>In the previous sentence, which entity did \"<em>that</em>\" refer to?\nIs it \"a previously mentioned noun\"?  Or is it \"a relative pronoun\"?\nOr is it the proper use?</p>\n<p>Ambiguities of relative pronouns are common because the writer does not\nexperience the ambiguity.  After all, it is clear to the writer what he refers\nto.\nTrain yourself to recognize any potentially ambiguous relative pronoun,\nideally by using a highlighter to mark them in a printout.</p>\n<p>To resolve the ambiguity the easiest solution is simply to add the noun it\nrefers to.  For the above example, \"that\" would become \"that noun\".</p>\n<p>(Another issue I ran into frequently is in deciding between \"which\" in cases\nwhere \"that\" should have been used, such as in \"We use an algorithm which is\nefficient.\" I remember annoying a former American colleague of mine by using\n\"which\" a bit too often.  <a href=\"http://www.dailywritingtips.com/when-to-use-that-which-and-who/\">Some advice is\navailable.</a>)</p>\n<p>Here is a real example from an <a href=\"http://www.nowozin.net/sebastian/papers/nowozin2008freqgeo.pdf\">ICDM 2008\npaper</a> of\nmine.  I highlight all relative pronouns.</p>\n<blockquote>\n<p>Extracting such geometric patterns from molecular 3D\nstructures is one of the central topic in computational biology, and\nnumerous approaches have been proposed.  Most of them are optimization\nmethods, <em>which</em> detect one pattern at a time by minimizing a loss function\n(e.g., [14, 15, 6]).\n<em>They</em> are different from our approach enumerating all patterns satisfying a\ncertain geometric criterion.  In particular, <em>they</em> do not have a minimum\nsupport  constraint.  Instead <em>they</em> try to find a motif that matches all\ngraphs.</p>\n</blockquote>\n<p>This is not the worst example but can be improved nevertheless.  The first\n\"which\" is best removed, the other relative pronouns are best clarified.  Here\nis a proposed improvement:</p>\n<blockquote>\n<p>Extracting such geometric patterns from molecular 3D\nstructures is one of the central topic in computational biology, and\nnumerous approaches have been proposed.  Most of them are optimization\nmethods, <em>detecting</em> one pattern at a time by minimizing a loss function\n(e.g., [14, 15, 6]).\n<em>These optimization methods</em> are different from our approach enumerating all\npatterns satisfying a certain geometric criterion.  In particular, <em>other\nmethods</em> do not have a minimum support constraint <em>and instead</em> try to find a\nmotif that matches all graphs.</p>\n</blockquote>\n<h2>8. Provide Continuation Markers</h2>\n<p><em>Continuation markers</em> are sentences or paragraphs, typically at the beginning\nof sections, to tell the reader what will be presented next and to tell the\nreader how it is relevant or how it relates to what has been presented\nalready.  It provides structure and flow, connecting the different parts of\nthe paper.</p>\n<p>Here is an example, from an <a href=\"http://www.nowozin.net/sebastian/papers/stuehmer2015toftracking.pdf\">ICCV 2015\npaper</a>:</p>\n<blockquote>\n<p>\"3. Method</p>\n<p>We now describe our model for tracking fast moving objects.  While the\nmotion model is standard, the observation model for raw ToF captures is a\nnovel contribution.\"</p>\n</blockquote>\n<p>Note two elements here: first, there is an explicit statement of what will be\npresented next (the model for tracking fast moving objects).  Second, we\nestablish relevance with respect to the contribution.</p>\n<p>There are two reasons why thinking about natural continuation markers for\nreading the paper is important.\nFirst, it enables navigation through the paper by allowing the reader to skip\nsections more efficiently.\nSecond, without the necessary background it may take a reader multiple\nrepeated readings to fully understand the paper.  If you lost the reader,\nproviding a natural re-entry point makes it easier to continue reading the\npaper despite a lack of understanding of some parts.</p>\n<p>Both reasons are especially important for reviewers, a special type of reader.\nIdeally the reviewer is an expert in the field already, so we would like to\nmake it easy for him to quickly navigate to relevant parts of the paper.\nLess ideally, the reviewer is working under time pressure or without keen\ninterest in the work; in this case we would like to minimize misunderstanding\nor missing important points during reading.</p>\n<p>It is important to co-locate the continuation markers with the actual text\nitself.  It is not sufficient to provide a mini table-of-contents as part of\nthe introduction (\"In Section 2 we present related work. In Section 3 we\npresent our method. etc.\").</p>\n<h2>9. Multiple Authors</h2>\n<p>It is a reality that most computer science papers are authored by multiple\nauthors.\nCoordinating the writing between multiple authors can be challenging on both\nthe level of content and in terms of technology.</p>\n<p><em>In terms of content</em>, in my experience a recipe for disaster is to divide the\npaper into parts and agree that \"Author A will write the introduction, author\nB will write the method, etcetera\".  The resulting draft will be incoherent\nand everyone has an excuse for delaying their part due to perceived\ndependencies (\"I will write the method once the notation is defined in the\nintroduction\", \"I will write the introduction when we have results\").</p>\n<p>Also, when dividing up work this way the draft can be poorly balanced in terms\nof relevant parts, as sub-authors tend to be assigned to the parts they have\ncontributed to the most, which provides an incentive to describe their own\ncontribution in too much detail (for example senior authors writing the\nintroduction will fill it discussing their past research agenda that led to\nthis work; the author writing about the implementation will want to go into\ndetail because it was really difficult to get it to work and people may miss\njust how difficult it was, etcetera).</p>\n<p>It is better to assign responsibility to a single author to write a full\ndraft, then iterate together over this draft.\nThere are two reasons why it is better: <em>first</em>, clear responsibility gets\nstuff done; <em>second</em>, the draft will be more coherent with a more linear\nflow of arguments.</p>\n<p>The single author draft works best if the draft writer is an experienced\nauthor because iterating on a poorly organized draft may take more effort than\na complete rewrite.\nWhen iterating on a draft it is important to distinguish substantial from\nminor changes.\n<em>Minor changes</em> are changes that fix issues locally, such as adding a\nsentence for clarification, changes of word order, typos, etc.  These changes\nare important but not urgent.  Most accomplished authors I know prefer to\nmake these changes in passes through the full paper, much like <em>polishing</em>\nthe paper with each reading.</p>\n<p><em>Substantial changes</em> are things like addition or removal of sections,\nchanging the order of the presentation, enlarging or shrinking the claimed\ncontribution, etcetera.  Such changes can have large implications on the other\nparts of the paper which need to be addressed and therefore such changes are\nimportant and urgent because they require less time if made early.</p>\n<p><em>In terms of technology</em>, I frequently experienced problems due to the\ndiversity of authors and their working style.  Often some authors will be\nsenior authors with a proven but dated work setup, for example, not using\nbasic version control systems and being stuck in an unflexible editor that\nmangles LaTeX every time it opens a file.\nTo be fair, these authors are often most essential in terms of providing\nfeedback on the content of the paper and they may have little time available to\nstay up to date with the latest tools.  For addressing this problem with\ntechnology, my recommendations are the following:</p>\n<ol>\n<li>Use a version control system: this should almost go without saying and even\nif you are the sole author of a paper it is best to use a version control\nsystem because it provides a simple method to back your work up.\nBut for multiple authors coordinating the writing of a paper without a version\ncontrol system is simply a waste of time and nerves of everyone involved.</li>\n<li>Use a <em>friendly</em> version control system that provides a simple web\ninterface; <a href=\"http://bitbucket.org/\">Bitbucket</a> is my favorite for paper\nwriting because it offers free private git repositories and allows you to\nview changes in a neat timeline in the browser.  While hardly surprising to\nany git user, this feature is readily appreciated by everyone.\nAlso, for minor changes Bitbucket actually allows editing from within the\nbrowser.</li>\n<li>For yourself: when writing LaTeX write one sentence in a line and use\na line break after each sentence.  This makes merging conflicts easier and\nleads to fewer surprises with strange editors breaking long lines.\n(I also found that this helps me to improve the organization of a paragraph\nbecause every sentence now starts at the beginning of a line.)</li>\n<li>When you need only high level feedback from your coauthors, sending them a\nPDF for annotation via email may still be the most efficient way.</li>\n</ol>\n<h2>10. Authorship and Author Ordering</h2>\n<p>Except for the writing itself, another common problem with multiple authors is\ndiscussions about authorship and author ordering.  While not related to\nwriting papers per se, I do want to share some remarks on this topic.\nThere are only a few common situations where debates about author ordering\narise.  Here are a few common examples, with the more common cases first:</p>\n<ol>\n<li>A small contributor or someone involved in early discussions wants to be a\nco-author, but other authors disagree based on the amount of time they\ncontributed.</li>\n<li>There is a PhD student, a post-doc, and a faculty author and in most\ncomputer science venues the recognition is strongest for the first and last\nauthor position.  The post-doc feels he guided the student the most so\ndeserves to be recognized, but the faculty member may feel different based\non seniority or being the source of funding.</li>\n<li>Two or more students contributed to a piece of work and see their\ncontribution as the strongest; this happens sometimes when a student\npostpones a line of work and another student is continuing with the work,\ndirected by a joint supervisor.</li>\n<li>Two or more senior authors feel that they started or guided the project the\nmost.</li>\n</ol>\n<p>Obviously there is no \"right way\" to handle all circumstances, and indeed\ncomputer science handles authorship differently to, say, mathematics, for\nexample.\nOf course everyone agrees that scientific authorship should imply substantial\ncontributions to the work, but that is about as ambiguous a statement as can\nbe made.\nTo be more concrete, here are some observations.</p>\n<p><em>First</em>, some conflicts can be anticipated, for example the case of two\nstudents.  Here, it is best to discuss a possible publication and authorship\nas soon as the second student gets involved.  This discussion should be\nsummarized via email for future reference.  Likewise for the case of the small\ncontributor, as soon as it is clear the work will end up in a publication a\ndiscussion should help to set expectations, for example to offer authorship\nonly if additional work is invested.</p>\n<p><em>Second</em>, as a young PhD student one naturally underestimates the implicit\nfuture benefits that arise from co-authorship.  For example the senior\nco-authors may present the work at venues otherwise inaccessible, or the work\nwill lead to substantial future collaborations with the original co-authors.</p>\n<p><em>Third</em>, when considering whether to include a small contributor as co-author,\nthe problem is most often not the co-authorship itself, but possible future\nactions by the contributor after the paper is published (for example, giving\nseminar talks about the paper).  The other authors may then feel that the\ncredit and opportunities are taken away from them.\nBy discussing not just the co-authorship itself early but instead also what\nfuture paper-related actions are done by whom these problems can be avoided.\nFor example, all authors may agree that seminar and job talks about the work\nshould only be presented by the lead author.</p>\n<h1>Recommended Reading</h1>\n<p>I have bought many books on writing, especially when I started my PhD.\nBut there is one that stands above all others, and if you are writing papers I\ncan recommend this to you, no matter whether you just start out or have been\nwriting since decades.</p>\n<p>This book is <a href=\"http://www.scientific-writing.com/cos/o.x?c=/wbn/pagetree&amp;func=view&amp;rid=10476\">\"Scientific Writing: A Reader and Writer's\nGuide\"</a>\nby <a href=\"http://www.scientific-writing.com/\">Jean-Luc Lebrun</a>.</p>\n<p><em>Acknowledgements</em>.  Thanks to Jonathan Strahl for corrections to the article.\n<a href=\"http://www.cs.cmu.edu/~andrewgw/\">Andrew Wilson</a> was kind enough to point out\nGeorge Orwell's essay <a href=\"http://georgeorwellnovels.com/essays/politics-and-the-english-language/\"><em>Politics and the English\nLanguage</em></a>\nas timeless advice on writing in English.</p>\n<script type=\"text/javascript\">if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) {\n    var align = \"center\",\n        indent = \"0em\",\n        linebreak = \"false\";\n\n    if (false) {\n        align = (screen.width < 768) ? \"left\" : align;\n        indent = (screen.width < 768) ? \"0em\" : indent;\n        linebreak = (screen.width < 768) ? 'true' : linebreak;\n    }\n\n    var mathjaxscript = document.createElement('script');\n    mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#';\n    mathjaxscript.type = 'text/javascript';\n    mathjaxscript.src = 'https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.3/latest.js?config=TeX-AMS-MML_HTMLorMML';\n\n    var configscript = document.createElement('script');\n    configscript.type = 'text/x-mathjax-config';\n    configscript[(window.opera ? \"innerHTML\" : \"text\")] =\n        \"MathJax.Hub.Config({\" +\n        \"    config: ['MMLorHTML.js'],\" +\n        \"    TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'none' } },\" +\n        \"    jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" +\n        \"    extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" +\n        \"    displayAlign: '\"+ align +\"',\" +\n        \"    displayIndent: '\"+ indent +\"',\" +\n        \"    showMathMenu: true,\" +\n        \"    messageStyle: 'normal',\" +\n        \"    tex2jax: { \" +\n        \"        inlineMath: [ ['\\\\\\\\(','\\\\\\\\)'] ], \" +\n        \"        displayMath: [ ['$$','$$'] ],\" +\n        \"        processEscapes: true,\" +\n        \"        preview: 'TeX',\" +\n        \"    }, \" +\n        \"    'HTML-CSS': { \" +\n        \"        availableFonts: ['STIX', 'TeX'],\" +\n        \"        preferredFont: 'STIX',\" +\n        \"        styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'inherit ! important'} },\" +\n        \"        linebreaks: { automatic: \"+ linebreak +\", width: '90% container' },\" +\n        \"    }, \" +\n        \"}); \" +\n        \"if ('default' !== 'default') {\" +\n            \"MathJax.Hub.Register.StartupHook('HTML-CSS Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax['HTML-CSS'].FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n            \"MathJax.Hub.Register.StartupHook('SVG Jax Ready',function () {\" +\n                \"var VARIANT = MathJax.OutputJax.SVG.FONTDATA.VARIANT;\" +\n                \"VARIANT['normal'].fonts.unshift('MathJax_default');\" +\n                \"VARIANT['bold'].fonts.unshift('MathJax_default-bold');\" +\n                \"VARIANT['italic'].fonts.unshift('MathJax_default-italic');\" +\n                \"VARIANT['-tex-mathit'].fonts.unshift('MathJax_default-italic');\" +\n            \"});\" +\n        \"}\";\n\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(configscript);\n    (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript);\n}\n</script>",
  "category": ""
}