{
  "id": "yt:video:UZpbz4053mo",
  "yt:videoId": "UZpbz4053mo",
  "yt:channelId": "UCJZ94qp4dtCw0Q5UQqAkg7w",
  "title": "Anyone can shoot through armor, the invention that would have changed history!",
  "link": "",
  "author": {
    "name": "larsandersen23",
    "uri": "https://www.youtube.com/channel/UCJZ94qp4dtCw0Q5UQqAkg7w"
  },
  "published": "2022-06-22T14:23:00+00:00",
  "updated": "2022-08-19T15:38:37+00:00",
  "media:group": {
    "media:title": "Anyone can shoot through armor, the invention that would have changed history!",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "There would have been no knight in armor, if this bow and arrow had been invented in history!!\n\nTod's workshop did an test where a historic longbow could not shoot through armor: https://youtu.be/DBxdTkddHaE\nArmin Hirmer had tested this modern Oneida Osprey 30-50 pound bow: https://youtu.be/E1xHX-vJHRE\nArmin sent the bow to me and since I only otherwise shoot historical bows I immediately started changing it to something I could use.\nAfter the bow was rebuilt it now works pretty well for me and the way I do archery and with amazingly much power.\nThen I began to consider: what if this modern technological and powerful bow had existed in history?\n\nThis is of course not a historical test:\nThis bow did not exist in history (that type of materials and fine mechanics did not exist)\nArmor is of unknown quality and without ring armor or gambeson underneath \nI used a rather random metal armor, since this test could not be historical anyway, I did not think it made sense to spend large resources on an authentically made historical armor.\nWith my traditional bows and arrows I can not shoot through this armor.\n\nThis test only shows that it is surprisingly easy for this rebuilt bow and these metal arrows to shoot through metal plate.\nIt seems that the arrows very easily go through helmet and plate so I think that with thicker or stronger armor the arrow would also go through, but can not know.\n\nI have done several tests with these metal arrows and it is only with the modern rebuilt bow that it works well against this armor, not with my traditional bows.\n\nThanks to:\nArmin Hirmer for sending me the bow.\nTod from todsworkshop.com to allow me to show some of his tests.\n\n\nSincerely\nLars Andersen",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}