{
  "title": "Episode 90: The Learning Styles Myth: An Interview with Daniel Willingham",
  "pubDate": "Sun, 29 Mar 2009 11:36:31 +0000",
  "guid": "episode-90-the-learning-styles-myth-an-interview",
  "link": "http://www.thepsychfiles.com/2009/03/29/episode-90-the-learning-styles-myth-an-interview-with-daniel-willingham/",
  "itunes:image": "",
  "description": "Guess what?  There's no such thing as a learning style!  Don't believe it?  Listen to this interview with professor and author Daniel Willingham as he and I discuss the topic of learning styles.  If there is no scientific support for learning styles then whey do we believe they must exist?  We also discuss the multiple intelligence.  While there is support for this idea, many people are confused as to what Howard Gardner really says about his own theory.  Let's see if we can set the record straight about learning styles, abilities, and intelligences in this episode of The Psych Files.",
  "content:encoded": "Guess what?  There's no such thing as a learning style!  Don't believe it?  Listen to this interview with professor and author Daniel Willingham as he and I discuss the topic of learning styles.  If there is no scientific support for learning styles then whey do we believe they must exist?  We also discuss the multiple intelligence.  While there is support for this idea, many people are confused as to what Howard Gardner really says about his own theory.  Let's see if we can set the record straight about learning styles, abilities, and intelligences in this episode of The Psych Files.",
  "enclosure": "",
  "itunes:duration": "39:43",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,Learning,styles",
  "itunes:subtitle": "Guess what? There's no such thing as learning style! Listen to this interview with professor and author Daniel Willingham as he and I discuss the topic of learning styles. We set the record straight about learning styles, abilities, and intelligences.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Guess what? There's no such thing as a learning style! Don't believe it? Listen to this interview with professor and author Daniel Willingham as he and I discuss the topic of learning styles. If there is no scientific support for learning styles then whey do we believe they must exist? We also discuss the multiple intelligence. While there is support for this idea, many people are confused as to what Howard Gardner really says about his own theory. Let's see if we can set the record straight about learning styles, abilities, and intelligences in this episode of The Psych Files."
}