{
  "id": "yt:video:O0NYaO_OnH4",
  "yt:videoId": "O0NYaO_OnH4",
  "yt:channelId": "UCP3alkHEJhoxTpy3iVON-lg",
  "title": "Symmetries & Conservation Laws: A (Physics) Love Story",
  "link": "",
  "author": {
    "name": "Physics with Elliot",
    "uri": "https://www.youtube.com/channel/UCP3alkHEJhoxTpy3iVON-lg"
  },
  "published": "2021-12-02T23:24:46+00:00",
  "updated": "2022-06-27T22:58:02+00:00",
  "media:group": {
    "media:title": "Symmetries & Conservation Laws: A (Physics) Love Story",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "There is a deep connection in physics between symmetries of nature and conservation laws, called Noether's theorem. In this physics lesson I'll show you how it works. Get the notes for free here: https://courses.physicswithelliot.com/notes-sign-up\n\nThe relationship between symmetries and conservation laws is one of the most profound and far-reaching connections in physics. The central result is called Noether's theorem, and it says that for every continuous symmetry of the Lagrangian or action for a system, you'll find a corresponding conserved quantity. Momentum conservation, for example, follows from a symmetry called spatial translation invariance, meaning that you can pick up your system and slide it over without changing anything about the physics. Likewise, angular momentum conservation follows from rotation invariance, and energy conservation from time translation invariance.\n\nGet all the links here: https://www.physicswithelliot.com/noether-mini\n\nIntroduction to the principle of least action: https://youtu.be/sUk9y23FPHk\n\nIntro to Lagrangian (and Hamiltonian) mechanics: https://youtu.be/0DHNGtsmmH8\n\nThe Hamiltonian version of Noether's theorem: https://youtu.be/uncm8DChdhc\n\nTutoring  inquiries: https://www.physicswithelliot.com/tutoring\n\nIf you find the content I’m creating valuable and would like to help make it possible for me to continue sharing more, please consider supporting me! You can make a recurring contribution at https://www.Patreon.com/PhysicsWithElliot, or make a one time contribution at https://www.physicswithelliot.com/support-me. Thank you so much!\n\nAbout physics mini lessons:\nIn these intermediate-level physics lessons, I'll try to give you a self-contained introduction to some fascinating physics topics. If you're just getting started on your physics journey, you might not understand every single detail in every video---that's totally fine! What I'm really hoping is that you'll be inspired to go off and keep learning more on your own.\n\nAbout me:\nI’m Dr. Elliot Schneider. I love physics, and I want to help others learn (and learn to love) physics, too. Whether you’re a beginner just starting out with your physics studies, a more advanced student, or a lifelong learner, I hope you’ll find resources here that enable you to deepen your understanding of the laws of nature. For more cool physics stuff, visit me at https://www.physicswithelliot.com.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}