{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-264956136700939289",
  "published": "2018-07-29T13:47:00.001-07:00",
  "updated": "2018-07-29T13:50:07.216-07:00",
  "title": "Should You Be As Excited About GDP Growth As Donald Trump Claims to Be?",
  "content": "In Friday's report on <a href=\"https://www.bea.gov/iTable/iTable.cfm?reqid=19&step=2#reqid=19&step=3&isuri=1&1921=survey&1903=1\">real GDP growth in the second quarter,</a> the BEA reported a quarterly growth rate of 4.1%, which exceeds both the post-WWII US average growth rate of about 3%, and the average growth rate since the end of the last recession of about 2.2%. Trump <a href=\"https://twitter.com/realDonaldTrump/status/1022877332858650624\">seems to be claiming that recent GDP performance has been better than it was,</a> and is hoping for future growth of 3% or more in real GDP. This seems more modest than <a href=\"https://www.businessinsider.com/trump-4-gdp-growth-promise-2017-1\">his early 2017 claim</a> that growth would proceed at 4% or more. What should we make of this?<br /><br />It's always useful in these circumstances to remind yourself what is being reported. GDP is a flow - output per unit time - but the BEA reports a number which is seasonally adjusted at annual rates. That is, it's reported as if the seasonally adjusted flow had continued for a year, instead of just for a quarter. So, what we're supposed to get excited about is that real GDP for the second quarter is measured to be about 1% higher (seasonally adjusted) than it was in the first quarter. The average quarterly growth rate since the end of the last recession has been 0.55%, so we got an extra 0.45 percentage points in growth relative to the recent average, which might not seem so exciting.<br /><br />Further, quarterly real GDP growth rates are quite noisy. There's substantial measurement error, due to imperfect raw data, and imperfect seasonal adjustment. Here are the quarterly growth rates since the end of the last recession - seasonally adjusted at annual rates:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-O_FRutA96zw/W1zUlGPr74I/AAAAAAAADJE/ueIhqYaSXLg7QMMJnM7rro2oaDArqreKwCLcBGAs/s1600/quarterly.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-O_FRutA96zw/W1zUlGPr74I/AAAAAAAADJE/ueIhqYaSXLg7QMMJnM7rro2oaDArqreKwCLcBGAs/s640/quarterly.png\" width=\"640\" height=\"452\" data-original-width=\"897\" data-original-height=\"634\" /></a></div>The noise is obvious, I think. Over the last 36 quarters, growth rates have exceeded 4% on five occasions. With one observation exceeding 4% in his 6 quarters in office, Trump is doing about average in post-recession excess-of-4% terms.<br /><br />We might look at year-over-year growth rates, which will smooth out some of the noise. Here's what that looks like:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-hDKNnp73CFg/W1zWVa-jJ4I/AAAAAAAADJQ/rLwXXUsxN98v-n8Ff3m10EfTKEDlol7LwCLcBGAs/s1600/yoy.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-hDKNnp73CFg/W1zWVa-jJ4I/AAAAAAAADJQ/rLwXXUsxN98v-n8Ff3m10EfTKEDlol7LwCLcBGAs/s640/yoy.png\" width=\"640\" height=\"452\" data-original-width=\"895\" data-original-height=\"632\" /></a></div>Current year-over-year growth is 2.8%, which exceeds the post-recession average of 2.2%, but 2.8% isn't unusual in the second chart.<br /><br />Finally, just to cover all the bases, we could look at the whole post-recession time series of real GDP, and the 2.2% trend:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-9-CYlYeXIK0/W1zXA3XTpAI/AAAAAAAADJY/w6zZXuyC-5Q3-v4_MVe1hM4_qxIBfIlIwCLcBGAs/s1600/GDPtrend.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-9-CYlYeXIK0/W1zXA3XTpAI/AAAAAAAADJY/w6zZXuyC-5Q3-v4_MVe1hM4_qxIBfIlIwCLcBGAs/s640/GDPtrend.png\" width=\"640\" height=\"521\" data-original-width=\"1031\" data-original-height=\"839\" /></a></div>So, real GDP is a little above trend, but there's nothing in the behavior of the time series to indicate a sustained upside departure from the 2.2% trend.<br /><br />Thus, any hope that Trump has of seeing 3+% sustained real GDP growth is yet to be realized. What would we tell the Donald about the future, if he asked, and had the attention span required to take in the information? This is where we get into measures of potential GDP <a href=\"https://www.nytimes.com/2018/07/28/opinion/why-one-quarters-growth-tells-us-nothing.html\">(see also this piece by Paul Krugman)</a>. What's potential GDP? Depends who you're asking. The OECD, in its <a href=\"https://stats.oecd.org/glossary/detail.asp?ID=2094\">\"Glossary of Statistical Terms,\"</a> defines potential GDP to be: <blockquote>Potential gross domestic product (GDP) is defined in the OECD’s Economic Outlook publication as the level of output that an economy can produce at a constant inflation rate. Although an economy can temporarily produce more than its potential level of output, that comes at the cost of rising inflation. Potential output depends on the capital stock, the potential labour force (which depends on demographic factors and on participation rates), the non-accelerating inflation rate of unemployment (NAIRU), and the level of labour efficiency.</blockquote>Whatever good reputation the OECD has, it didn't earn it by writing definitions, apparently. The OECD says that, if inflation is constant for an unspecified period of time, then we're observing potential output, whether the inflation rate is 5,000% per annum or 2%. That can't be right.<br /><br />What's the goal here? The idea is to make a long-term forecast for the growth path of real GDP, over the next two to five years. Further, this forecast is going to be made under the assumption that there are no events that will happen over this future period that would cause a major disruption - no financial crisis, no recession. A crude approach would be to observe what is going on in the last chart, and forecast that real GDP will follow a 2.2% growth path. In the past, sometimes that approach would have worked well. For example, in first quarter 1960, we would have observed that average real GDP growth over the last 10 years was 4.1%. If we took that as a forecast growth path for the next 5 years, here's how we would have done:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-h8evIDFqlL0/W14FLFKfI5I/AAAAAAAADJk/4NfhjAR8dIcyfhIoWiA7lRCYa7aJE8CkgCLcBGAs/s1600/1960fore.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-h8evIDFqlL0/W14FLFKfI5I/AAAAAAAADJk/4NfhjAR8dIcyfhIoWiA7lRCYa7aJE8CkgCLcBGAs/s640/1960fore.png\" width=\"640\" height=\"525\" data-original-width=\"1031\" data-original-height=\"845\" /></a></div>Excellent! Dish out the advice in 1960, and in 1965 everyone's calling you a genius. Unfortunately, that won't work every time. In fourth quarter 2007, average real GDP growth over the previous 10 years was 3.0%. Forecast a 3% growth path five years ahead, and here's what it looks like:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-ovFF5q2iCYc/W14HRsrbSOI/AAAAAAAADJw/JAwT4PGbNw0kEIRAKtya5G3jgMFZRd1tACLcBGAs/s1600/2007.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-ovFF5q2iCYc/W14HRsrbSOI/AAAAAAAADJw/JAwT4PGbNw0kEIRAKtya5G3jgMFZRd1tACLcBGAs/s640/2007.png\" width=\"640\" height=\"521\" data-original-width=\"1031\" data-original-height=\"839\" /></a></div>Dish out that advice in 2007, and by 2012 people are laughing at you.<br /><br />Potential GDP measures, such as the <a href=\"https://www.cbo.gov/about/products/budget-economic-data#6\">CBO's potential GDP measures,</a> aren't so different from that, and the CBO made errors on the order of what is in the last chart in forecasting the recovery from the recession. The CBO's approach to long-term forecasting is more or less consistent with what conventional models of economic growth predict. In a neoclassical growth model with exogenous labor force growth, exogenous total factor productivity (TFP) growth, and constant returns to scale, the economy converges to a steady state in which output grows at the TFP growth rate plus the growth rate in the labor force. So, the CBO makes long-run forecasts based on an assumption about the aggregate production function, and projections for TFP growth and labor force growth. Here's actual year-over-year real GDP growth, and year-over-year growth in the current CBO potential GDP measure.<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-OTfWJxwKj08/W14M9rC6LmI/AAAAAAAADJ8/_O2TjqAHyAIXRRsSrwx1WhgIkF5-Hz8hgCLcBGAs/s1600/cbo.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-OTfWJxwKj08/W14M9rC6LmI/AAAAAAAADJ8/_O2TjqAHyAIXRRsSrwx1WhgIkF5-Hz8hgCLcBGAs/s640/cbo.png\" width=\"640\" height=\"447\" data-original-width=\"897\" data-original-height=\"627\" /></a></div>Currently the CBO potential year-over-year growth rate is 1.9%, and the potential growth rate is lower than actual growth has been, on average, as the CBO does not think that 2.2% growth can be sustained. Presumably that's mainly because unemployment has been falling as employment has been growing, since the end of the recession. Employment growth is ultimately bounded by growth in the labor force (employment plus unemployment), and labor force growth in turn is bounded by growth in the working age population.<br /><br />To see what has been going on, let's look at employment growth (establishment and household survey measures) and labor force growth:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-l4wMwUd46E0/W14Pon0MrII/AAAAAAAADKI/ZrZGqRREFe42oVLauyvE7iAUNny-P4AOQCLcBGAs/s1600/labor%2Bmarket.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-l4wMwUd46E0/W14Pon0MrII/AAAAAAAADKI/ZrZGqRREFe42oVLauyvE7iAUNny-P4AOQCLcBGAs/s640/labor%2Bmarket.png\" width=\"640\" height=\"443\" data-original-width=\"902\" data-original-height=\"624\" /></a></div>Since the last recession, payroll employment (establishment survey) grew on average at 1.5%, household survey employment grew on average at 1.2%, and the average labor force growth rate was 0.6%. Labor force growth (year over year) and growth in working-age population (also year over year) look like this:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-gbUG2JoBJTI/W14RM85lCMI/AAAAAAAADKU/A8jvncchrL4-HK5K6fInNd4-eTbICK0uQCLcBGAs/s1600/population.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-gbUG2JoBJTI/W14RM85lCMI/AAAAAAAADKU/A8jvncchrL4-HK5K6fInNd4-eTbICK0uQCLcBGAs/s640/population.png\" width=\"640\" height=\"454\" data-original-width=\"889\" data-original-height=\"631\" /></a></div>Recently, labor force growth has increased somewhat to around 1%, while working-age population growth (no idea exactly how these numbers are constructed - growth rates look a little odd) has been on a secular decline and is currently in the neighborhood of 0.5%.<br /><br />What about productivity? <a href=\"https://www.frbsf.org/economic-research/publications/working-papers/2012/19/\">John Fernald,</a> at the San Francisco Fed, has constructed TFP series for the United States that are adjusted for capacity utilization. As far as I know, this is the state of the art, though I know people get in heated arguments about this. Here's the growth rate in Fernald's annual TFP series, 1948-2017:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-0ENrIeWVW7s/W14UYvnrhmI/AAAAAAAADKg/vqSlq9JPhlovFtKe0jH5mGYF7UjD_rg7ACLcBGAs/s1600/tfp.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-0ENrIeWVW7s/W14UYvnrhmI/AAAAAAAADKg/vqSlq9JPhlovFtKe0jH5mGYF7UjD_rg7ACLcBGAs/s640/tfp.png\" width=\"640\" height=\"531\" data-original-width=\"1012\" data-original-height=\"839\" /></a></div>That's somewhat depressing. Since the recession, TFP growth has mostly been lower than the post-WWII average growth rate of 1.3%. The average since the last recession is 0.3%.<br /><br />So, the most pessimistic scenario is that TFP continues to grow at 0.3% per year, employment grows at the working-age population growth rate of 0.5%, and we get sustained growth of 0.8% per year in real GDP. TFP growth, as we know from growth economics, is key though. Higher TFP growth means higher growth in real wages, which means higher growth in the labor force (labor supply effect - provided the substitution effect is large on the extensive and intensive margins). And then higher TFP growth and higher labor force growth both contribute to output growth. But, optimistically, supposing TFP grows at 1% (just short of the post-WWII average) and the labor force grows at 1%, that only gives us 2% growth in real GDP. To get to 3% or, more outlandishly, 4%, requires a serious miracle.<br /><br />So, where could a miracle come from? Well, people are always inventing things, and the miracle could be the implementation of a new technology. There's plenty of debate about this, <a href=\"https://www.wsj.com/articles/economists-duel-over-idea-that-technology-will-save-the-world-1402886301\">indicating that economists aren't much better at predicting technological innovations five or ten years hence than your average person.</a> Are we going to get a government-induced economic miracle? From the current US government, that would be another kind of miracle altogether. Some people think that regulation is a big deal - excessive regulation leads to inefficiency and lowers TFP. But regulation can cut both ways. Remember the financial crisis? If we unwind financial regulation that was introduced to prevent crises, that of course won't help the average rate of economic growth. Some people think that taxation is a big deal. The US tax code could in principle be redesigned to collect the same amount of revenue in a far more efficient way, potentially increasing TFP and the size of the labor force. But it's hard to argue the the tax changes recently passed by Congress would do much in this respect. Further, tariffs are indeed taxes, and the way these ones work isn't going to grease the wheels of the US economy.<br /><br />Governments can potentially increase productivity through policies related to public education. But apparently the US Secretary of Education thinks public education is a waste of resources. Governments can provide public infrastructure that makes the private sector more productive. Haven't seen much of that. Donald Trump likes to spend on the military and keeping people out of the country, neither of which is going to contribute to measured GDP.<br /><br />It would be nice to be more optimistic, but it looks like what you see is what you get.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}