{
  "id": "https://bibleinoneyear.org/en/youth/196",
  "title": "Day 196: Soften Your Heart and Harden Your Feet",
  "description": "Proverbs 17:9, Amos 2:6–7, Romans 2:17–29.  God wants us to have soft hearts – hearts of love and compassion  But if we are to make any difference to the world, this will lead to hard feet as we travel along tough paths and face challenges",
  "pubDate": "Fri, 15 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/196/",
  "itunes:duration": "13:53",
  "guid": "enyouth15072022-196",
  "length": 833.52,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 196: Soften Your Heart and Harden Your Feet",
  "itunes:subtitle": "Proverbs 17:9, Amos 2:6–7, Romans 2:17–29.  God wants us to have soft hearts – hearts of love and compassion  But if we are to make any difference to the world, this will lead to hard feet as we travel along tough paths and face challenges",
  "itunes:summary": "A twenty-one-year-old music college student took the cheapest ship she could find, calling at the greatest number of countries, and prayed to know where to disembark. She arrived in Hong Kong in 1966 and came to a place called the Walled City. It was a small, densely populated, lawless area controlled neither by China nor Hong Kong. It was a high-rise slum for drug addicts, gangs and sex-workers. She wrote:\nI loved this dark place. I hated what was happening in it but I wanted to be nowhere else. It was almost as if I could already see another city in its place and that city was ablaze with light. It was my dream. There was no more crying, no more death or pain. The sick were healed, addicts set free, the hungry filled. There were families for orphans, homes for the homeless, and new dignity for those who had lived in shame. I had no idea of how to bring this about but with ‘visionary zeal’ imagined introducing the Walled City people to the one who could change it all: Jesus.\nJackie Pullinger has spent over half a century working with heroin addicts, gang members and sex-workers. I remember so well a talk she gave some years ago. She began by saying, ‘God wants us to have soft hearts and hard feet. The trouble with so many of us is that we have hard hearts and soft feet.’\nJackie is a glowing example of this; going without sleep, food and comfort to serve others. God wants us to have soft hearts – hearts of love and compassion. But if we are to make any difference to the world, this will lead to hard feet as we travel along tough paths and face challenges.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 561
}