{
  "title": "Europe: Geopolitics and the ECB",
  "description": "<p>As the European Central Bank prepares to meet, the war in Ukraine continues to add to uncertainty, forcing investors in Europe to adjust their expectations for the remainder of the year. Chief Cross Asset Strategist Andrew Sheets and Chief Europe Economist Jens Eisenschmidt discuss.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly incidental to general coverage of the issuing entity/sector as germane to its overall financial outlook, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.&nbsp;</em></p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Morgan Stanley's Chief Cross Asset Strategist.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>And I'm Jens Eisenschmidt. Morgan Stanley's Chief Europe Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And today on the podcast we'll be talking about the outlook for Europe's economy amid possible rate hikes, business reopenings and the war in Ukraine. It's Thursday, April 7th at 3 p.m. in London.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, clearly we're dealing with a lot in Europe right now amid the Ukraine conflict and I want to get into that situation and the impacts on the economy. But given that the European Central Bank is meeting in just a few days and there is speculation about possible rate hikes, let's start there. Maybe you could give a bit of a background on what we expect the ECB is going to do.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>Thanks a lot, Andrew. First of all, let me say that we don't expect any change at next week's meeting relative to what the ECB has been saying in March at their last meeting. They're essentially keeping all options open. They have started on a gradual exit from their very accommodative monetary policy. They have increased the pace of policy normalization at their last meeting, and we do not expect the ECB to change that roadmap now. Just as a reminder, the roadmap is asset purchases could end in Q3 and any interest rate hike would come sometime thereafter. And any decision on ending asset purchases and rate hikes is highly data dependent. And that really it takes us to the current situation. Inflation continues to surprise to the upside. We just had a 7.5 percentage point print in March, and this undoubtedly does increase the pressure on the ECB to act. At the same time, there are significant downside risks to the outlook for growth in the Euro area stemming essentially from the Ukraine-Russia conflict, and this puts a premium on treading very carefully with any changes to the monetary policy configuration, hence the emphasis on optionality, flexibility and gradualism by the ECB.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, when you talk about gradualism, that implies that the inflation that we're seeing in Europe is more temporary, is more transitory, isn't going to get out of hand. Can you talk a little bit about what is different at the moment between inflation in Europe and inflation in the U.S.?</p><p><br></p><p><strong>Jens Eisenschmidt</strong> I think there are a lot of technical aspects that indeed you could be looking at on that question, but I think it's sufficient for our purposes here really to focus on the key difference. In the U.S. there's a huge internal demand component to inflation. While the same is not true for the euro area, where most of the inflation, you could argue, largest part is imported through energy. Another difference is that the outlook for the economy is slightly different. While you would say that in the U.S., if you're talking about an overheated economy, you have a very tight labor market, it's very difficult to see, you know, some sort of self-correcting forces bringing down inflation, which is why the Fed is embarking on a relatively aggressive tightening cycle. Here in the euro area, there is, of course, growth we see in '22 in our base case but at the same time, we are far away from such an overheating situation and even we are here now relying increasingly on fiscal stimulus to keep the growth momentum going given the high energy prices that are coming, dampening growth. So I think the situation is fundamentally a different one.</p><p><br></p><p><strong>Andrew Sheets </strong>And so Jens, maybe digging more into that growth outlook. You mentioned this rise in energy prices. There is uncertainty over the war in Ukraine. And yet in your team's base case, we see GDP growth in Europe growing about 3% this year, which would be pretty good by the standards of the last decade. What's behind that overall outlook?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>You're right. our base case has the euro area economy growing by 3% in '22 on the back of the ongoing recovery from the pandemic, 'reopening' in one word, which has lagged here relative to, say, the U.S., as well as due to the fiscal stimulus. But we see increasing headwinds emerging as you were just also referencing. We had this series of consumer confidence prints clearly affected by high inflation and the ongoing conflict, and we are watching attentively how this develops. Energy prices have skyrocketed. So, while we stick to our base call for now, we think that the balance of risks is slowly migrating to the downside. As for the ECB, the projections presented at their last meeting in March are more optimistic in terms of growth than ours. Now, clearly, if the ECB's view of the world prevails, so growth comes in better than we expect, we think the ECB will start to raise rates as early as September this year. Contrary to that, we think that incoming data will disappoint the ECB and this is why we have the first rate hike only in December. In any case, you can see the ECB is clearly on the path of policy normalization, the need for which is driven by the high inflation regime we are in and even the less favorable growth outlook won't change that fundamentally.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, given that we were discussing the ECB, I'd also like to talk about what higher interest rates mean in Europe. How do you think about that debate and do you see a scenario where the ECB might be quicker to take rates from negative to zero, but then pause at zero for a more extended period of time?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>I think this is a fair question, given that the negative rate experiment, if you want to call it, is really unique in its scope in the Euro area. And there has been a lot of debate about the effect of negative rates on banks, and you can probably argue that revising or returning from negative to zero is a little bit of a different journey than just raising rates in positive territory like what the what the Fed is going to do or is about to do now. So I'd say while there are some merits in the argument that probably, you know, getting rid of negative rates in the front end will help banks and may be good for lending in some sense, I think overall, our assessment would be increasing rates is something that detracts from economic activity.</p><p><br></p><p><strong>Andrew Sheets </strong>So Jens, you know, you mentioned some of the risks around energy supply, and I think it's safe to say this is the single biggest area of questions for investors who are in Europe or are looking at Europe is, how would the region respond to either cutting off its imports of gas and oil from Russia voluntarily or this disruption happening involuntarily? What would a complete cut off of Russian oil and gas mean for Europe's economy? And how does somebody in your position even go about trying to model that sort of outcome?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>So we have, of course, tried to get our head around this question and we we have published last week a note on exactly that issue. The typical approaches or the approaches that we have as economists here is really you look at the sectoral dependencies on on these flows of gas and oil, say. You make some assumptions and of course, it gives rise to ranges which are relatively wide. What we can say with certainty is that in a scenario of a complete cut off of Russian supplies in terms of oil and gas, we we are very, very likely in a recession in 22 in the euro area. And we are really talking about a significant recession risk. While only through higher energy prices, so oil going the direction of 150, but you know, other than that supply still flowing, we also see huge dampening impact on the economy with a shallow recession emerging not as bad as we would see in a total cutoff scenario. But I have to admit there's huge uncertainty.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>But Andrew, I was going to ask you a similar question as a strategist looking at different asset classes around the world. What's your team's view on Europe?</p><p><br></p><p><strong>Andrew Sheets </strong>Well thanks, Jens. So I think, unfortunately, the outlook for Europe, as you mentioned, has deteriorated since the start of the year. This terrible conflict in Ukraine has introduced additional uncertainty and binary risks to Europe around energy security that are difficult for investors to price and to discount. So, we've lowered our price target for European equities, which now leaves very limited upside versus current prices. And I think the region is now less attractive than something like Japan, for example, where I think you still have some of the same positive arguments that apply to Europe. The valuations are low. The currency is weak. Investors, I do not think are overly positioned in the region, but with less risk around aggressive central bank policy and with less risk around energy security. So for those reasons, we now think Japan is going to be outperforming market on a on a global basis.</p><p><br></p><p><strong>Andrew Sheets </strong>So Jens, all that said, the war in Ukraine is a wild card for our forecasts. What are the developments or indicators that you and your team are going to be watching?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>We are really dependent on what's happening in the political sphere, given that the cut off of energy supplies will be either a decision by Russia or by the EU to no longer accept delivery of any gas or oil or coal. And obviously, this is a political process for which you have many ingredients, so you would want to watch these ingredients and some of which are essentially in the conflict itself. So I think we are attentively watching the developments that the conflict is taking. And there for instance, the news flow coming out of potential war crimes that certainly has not helped the case of energy supplies flowing freely. So there is a discussion right now in the European Union to restrict import of coal. And I think it's exactly these sort of developments that you have to be watching. Another space that we attentively watch is energy markets because high energy prices are so detrimental for the growth outlook. And might remind you, we have one scenario, our so-called bear scenario, which sees energy prices almost as high as we have seen them or higher a little bit maybe as we have seen them in early March. That is a scenario which would get us very, very close to recessionary territory. So, in some sense, it's a situation where we have to watch the energy markets as much as we have to watch the political scene and see how this conflict evolves.</p><p><br></p><p><strong>Andrew Sheets </strong>Well, clearly a lot that we'll need to follow. Jens, thanks for taking the time to talk.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>Great speaking with you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "itunes:title": "Europe: Geopolitics and the ECB",
  "itunes:episodeType": "full",
  "itunes:episode": 591,
  "itunes:summary": "As the European Central Bank prepares to meet, the war in Ukraine continues to add to uncertainty, forcing investors in Europe to adjust their expectations for the remainder of the year.",
  "content:encoded": "<p>As the European Central Bank prepares to meet, the war in Ukraine continues to add to uncertainty, forcing investors in Europe to adjust their expectations for the remainder of the year. Chief Cross Asset Strategist Andrew Sheets and Chief Europe Economist Jens Eisenschmidt discuss.</p><p><br></p><p><em>Important note regarding economic sanctions. This research references country/ies which are generally the subject of selective sanctions programs administered or enforced by the U.S. Department of the Treasury’s Office of Foreign Assets Control (“OFAC”), the European Union and/or by other countries and multi-national bodies. Any references in this report to entities, debt or equity instruments, projects or persons that may be covered by such sanctions are strictly incidental to general coverage of the issuing entity/sector as germane to its overall financial outlook, and should not be read as recommending or advising as to any investment activities in relation to such entities, instruments or projects. Users of this report are solely responsible for ensuring that their investment activities in relation to any sanctioned country/ies are carried out in compliance with applicable sanctions.&nbsp;</em></p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, Morgan Stanley's Chief Cross Asset Strategist.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>And I'm Jens Eisenschmidt. Morgan Stanley's Chief Europe Economist.</p><p><br></p><p><strong>Andrew Sheets </strong>And today on the podcast we'll be talking about the outlook for Europe's economy amid possible rate hikes, business reopenings and the war in Ukraine. It's Thursday, April 7th at 3 p.m. in London.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, clearly we're dealing with a lot in Europe right now amid the Ukraine conflict and I want to get into that situation and the impacts on the economy. But given that the European Central Bank is meeting in just a few days and there is speculation about possible rate hikes, let's start there. Maybe you could give a bit of a background on what we expect the ECB is going to do.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>Thanks a lot, Andrew. First of all, let me say that we don't expect any change at next week's meeting relative to what the ECB has been saying in March at their last meeting. They're essentially keeping all options open. They have started on a gradual exit from their very accommodative monetary policy. They have increased the pace of policy normalization at their last meeting, and we do not expect the ECB to change that roadmap now. Just as a reminder, the roadmap is asset purchases could end in Q3 and any interest rate hike would come sometime thereafter. And any decision on ending asset purchases and rate hikes is highly data dependent. And that really it takes us to the current situation. Inflation continues to surprise to the upside. We just had a 7.5 percentage point print in March, and this undoubtedly does increase the pressure on the ECB to act. At the same time, there are significant downside risks to the outlook for growth in the Euro area stemming essentially from the Ukraine-Russia conflict, and this puts a premium on treading very carefully with any changes to the monetary policy configuration, hence the emphasis on optionality, flexibility and gradualism by the ECB.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, when you talk about gradualism, that implies that the inflation that we're seeing in Europe is more temporary, is more transitory, isn't going to get out of hand. Can you talk a little bit about what is different at the moment between inflation in Europe and inflation in the U.S.?</p><p><br></p><p><strong>Jens Eisenschmidt</strong> I think there are a lot of technical aspects that indeed you could be looking at on that question, but I think it's sufficient for our purposes here really to focus on the key difference. In the U.S. there's a huge internal demand component to inflation. While the same is not true for the euro area, where most of the inflation, you could argue, largest part is imported through energy. Another difference is that the outlook for the economy is slightly different. While you would say that in the U.S., if you're talking about an overheated economy, you have a very tight labor market, it's very difficult to see, you know, some sort of self-correcting forces bringing down inflation, which is why the Fed is embarking on a relatively aggressive tightening cycle. Here in the euro area, there is, of course, growth we see in '22 in our base case but at the same time, we are far away from such an overheating situation and even we are here now relying increasingly on fiscal stimulus to keep the growth momentum going given the high energy prices that are coming, dampening growth. So I think the situation is fundamentally a different one.</p><p><br></p><p><strong>Andrew Sheets </strong>And so Jens, maybe digging more into that growth outlook. You mentioned this rise in energy prices. There is uncertainty over the war in Ukraine. And yet in your team's base case, we see GDP growth in Europe growing about 3% this year, which would be pretty good by the standards of the last decade. What's behind that overall outlook?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>You're right. our base case has the euro area economy growing by 3% in '22 on the back of the ongoing recovery from the pandemic, 'reopening' in one word, which has lagged here relative to, say, the U.S., as well as due to the fiscal stimulus. But we see increasing headwinds emerging as you were just also referencing. We had this series of consumer confidence prints clearly affected by high inflation and the ongoing conflict, and we are watching attentively how this develops. Energy prices have skyrocketed. So, while we stick to our base call for now, we think that the balance of risks is slowly migrating to the downside. As for the ECB, the projections presented at their last meeting in March are more optimistic in terms of growth than ours. Now, clearly, if the ECB's view of the world prevails, so growth comes in better than we expect, we think the ECB will start to raise rates as early as September this year. Contrary to that, we think that incoming data will disappoint the ECB and this is why we have the first rate hike only in December. In any case, you can see the ECB is clearly on the path of policy normalization, the need for which is driven by the high inflation regime we are in and even the less favorable growth outlook won't change that fundamentally.</p><p><br></p><p><strong>Andrew Sheets </strong>Jens, given that we were discussing the ECB, I'd also like to talk about what higher interest rates mean in Europe. How do you think about that debate and do you see a scenario where the ECB might be quicker to take rates from negative to zero, but then pause at zero for a more extended period of time?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>I think this is a fair question, given that the negative rate experiment, if you want to call it, is really unique in its scope in the Euro area. And there has been a lot of debate about the effect of negative rates on banks, and you can probably argue that revising or returning from negative to zero is a little bit of a different journey than just raising rates in positive territory like what the what the Fed is going to do or is about to do now. So I'd say while there are some merits in the argument that probably, you know, getting rid of negative rates in the front end will help banks and may be good for lending in some sense, I think overall, our assessment would be increasing rates is something that detracts from economic activity.</p><p><br></p><p><strong>Andrew Sheets </strong>So Jens, you know, you mentioned some of the risks around energy supply, and I think it's safe to say this is the single biggest area of questions for investors who are in Europe or are looking at Europe is, how would the region respond to either cutting off its imports of gas and oil from Russia voluntarily or this disruption happening involuntarily? What would a complete cut off of Russian oil and gas mean for Europe's economy? And how does somebody in your position even go about trying to model that sort of outcome?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>So we have, of course, tried to get our head around this question and we we have published last week a note on exactly that issue. The typical approaches or the approaches that we have as economists here is really you look at the sectoral dependencies on on these flows of gas and oil, say. You make some assumptions and of course, it gives rise to ranges which are relatively wide. What we can say with certainty is that in a scenario of a complete cut off of Russian supplies in terms of oil and gas, we we are very, very likely in a recession in 22 in the euro area. And we are really talking about a significant recession risk. While only through higher energy prices, so oil going the direction of 150, but you know, other than that supply still flowing, we also see huge dampening impact on the economy with a shallow recession emerging not as bad as we would see in a total cutoff scenario. But I have to admit there's huge uncertainty.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>But Andrew, I was going to ask you a similar question as a strategist looking at different asset classes around the world. What's your team's view on Europe?</p><p><br></p><p><strong>Andrew Sheets </strong>Well thanks, Jens. So I think, unfortunately, the outlook for Europe, as you mentioned, has deteriorated since the start of the year. This terrible conflict in Ukraine has introduced additional uncertainty and binary risks to Europe around energy security that are difficult for investors to price and to discount. So, we've lowered our price target for European equities, which now leaves very limited upside versus current prices. And I think the region is now less attractive than something like Japan, for example, where I think you still have some of the same positive arguments that apply to Europe. The valuations are low. The currency is weak. Investors, I do not think are overly positioned in the region, but with less risk around aggressive central bank policy and with less risk around energy security. So for those reasons, we now think Japan is going to be outperforming market on a on a global basis.</p><p><br></p><p><strong>Andrew Sheets </strong>So Jens, all that said, the war in Ukraine is a wild card for our forecasts. What are the developments or indicators that you and your team are going to be watching?</p><p><br></p><p><strong>Jens Eisenschmidt </strong>We are really dependent on what's happening in the political sphere, given that the cut off of energy supplies will be either a decision by Russia or by the EU to no longer accept delivery of any gas or oil or coal. And obviously, this is a political process for which you have many ingredients, so you would want to watch these ingredients and some of which are essentially in the conflict itself. So I think we are attentively watching the developments that the conflict is taking. And there for instance, the news flow coming out of potential war crimes that certainly has not helped the case of energy supplies flowing freely. So there is a discussion right now in the European Union to restrict import of coal. And I think it's exactly these sort of developments that you have to be watching. Another space that we attentively watch is energy markets because high energy prices are so detrimental for the growth outlook. And might remind you, we have one scenario, our so-called bear scenario, which sees energy prices almost as high as we have seen them or higher a little bit maybe as we have seen them in early March. That is a scenario which would get us very, very close to recessionary territory. So, in some sense, it's a situation where we have to watch the energy markets as much as we have to watch the political scene and see how this conflict evolves.</p><p><br></p><p><strong>Andrew Sheets </strong>Well, clearly a lot that we'll need to follow. Jens, thanks for taking the time to talk.</p><p><br></p><p><strong>Jens Eisenschmidt </strong>Great speaking with you, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>And thanks for listening. If you enjoy Thoughts on the Market, please leave us a review on Apple Podcasts and share the podcast with a friend or colleague today.</p>",
  "guid": "gid://art19-episode-locator/V0/QgX6qgHIcTCQEimyFmCsKVcEeXZO1_5t46BLNtw2dkA",
  "pubDate": "Thu, 07 Apr 2022 22:40:47 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:keywords": "market-trends",
  "itunes:duration": "00:11:15",
  "enclosure": ""
}