{
  "title": "494 - Beyond “Drill and Fill”—Oral Health Is Critical to Overall Health, So Why Isn’t It Considered Part of Medicine?",
  "itunes:title": "494 - Beyond “Drill and Fill”—Oral Health Is Critical to Overall Health, So Why Isn’t It Considered Part of Medicine?",
  "pubDate": "Wed, 20 Jul 2022 10:00:00 +0000",
  "guid": "d174cfce-3db1-4e3a-bcec-5b604613d909",
  "link": "https://johnshopkinssph.libsyn.com/494-beyond-drill-and-filloral-health-is-critical-to-overall-health-so-why-isnt-it-considered-part-of-medicine",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Oral health extends far beyond cleanings and cavities, but coverage schemes are often considered an extra “benefit” and not a necessity. Dentists <strong>Leah Leinbach</strong> and <strong>Sujay Mehta</strong> talk with</span> <strong>Stephanie Desmon</strong> <span style= \"font-weight: 400;\">about why oral health goes way beyond “drill and fill” to impacting overall health, the history behind oral health’s divorce from medicine, and how the importance of including dental care as part of health care is being discussed at a global level.</span></p>",
  "content:encoded": "<p>Oral health extends far beyond cleanings and cavities, but coverage schemes are often considered an extra “benefit” and not a necessity. Dentists Leah Leinbach and Sujay Mehta talk with Stephanie Desmon about why oral health goes way beyond “drill and fill” to impacting overall health, the history behind oral health’s divorce from medicine, and how the importance of including dental care as part of health care is being discussed at a global level.</p>",
  "enclosure": "",
  "itunes:duration": "13:56",
  "itunes:explicit": false,
  "itunes:keywords": "health,dentistry,dentist,medicine,oral,teeth",
  "itunes:subtitle": "Oral health extends far beyond cleanings and cavities, but coverage schemes are often considered an extra “benefit” and not a necessity. Dentists Leah Leinbach and Sujay Mehta talk with Stephanie Desmon about why oral health goes way beyond...",
  "itunes:season": 6,
  "itunes:episode": 494,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}