{
  "title": "76: The Ted Bundy Tapes: Part 2",
  "link": "https://audioboom.com/posts/7192218",
  "itunes:episode": 76,
  "itunes:title": "The Ted Bundy Tapes: Part 2",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3465,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p><strong>This podcast episode covers episodes 3 &  4 of the Netflix series</strong>. <a href=\"https://www.truecrimeobsessed.com/episodes/75-conversations-with-a-killer-the-ted-bundy-tapes\">Listen to Part 1 (covering episodes 1 & 2 of the Netflix series) HERE.</a></p>\n\n\n<p>In this episode, Ted Bundy breaks out of prison TWICE. He terrorizes south Florida where he takes at least 6 more victims. When he's finally caught, he decides to represent himself in court--in America's first-ever televised murder trial--and the shenanigans that ensue are almost too bizarre to be believed.</p>\n\n\n<p>On the 30th anniversary of his Florida execution, CONVERSATIONS WITH A KILLER: THE TED BUNDY TAPES brings the infamously twisted mind of serial killer Ted Bundy into the light for the very first time in a fresh yet terrifying way through exclusive, never-before-heard interviews from the \"Jack the Ripper of the United States,\" himself. This unique and gripping doc series, focuses on the man whose personality, good looks and social graces defied the serial-killer stereotype, allowing him to hide in plain sight as he committed the brutal sex-crime slayings of more than 30 women before being caught in 1978.   </p>\n\n\n<p><strong>LOOKING FOR MORE TCO?</strong> <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Binge our 50+ bonus episodes via Patreon!</a> When you join our Patreon fam, you not only support us, you also <strong>INSTANTLY</strong> get our entire catalog of bonus episodes, including our episode-by-episode coverage of <strong>\"SERIAL,\" \"THE JINX,\" \"THE STAIRCASE,\" and \"MAKING A MURDERER.\"</strong> New FULL EPISODES are added each week AND IT'S ALL COMMERCIAL FREE! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Join here!</a></p>\n\n\n<p><strong>WANT TO SEE US LIVE?</strong> <a href=\"https://www.truecrimeobsessed.com/see-us-live\">Go Here</a> for information and tickets to our upcoming live events and appearances like <strong>PODX, CRIMECON</strong> and our <strong>PRIDE SHOW</strong> in June!  </p>\n\n\n<p><strong>LOOKING FOR OUR ADVERTISERS / PROMO CODES?</strong> <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">Go Here!</a> We now have a whole page of our site for you to check out and <a href=\"https://www.truecrimeobsessed.com/get-our-promo-codes\">GET. THOSE. DISCOUNTS!</a></p>\n\n\n<p><strong>THIS WEEK'S PALATE CLEANSER</strong> is called \"Beautiful\" and is from the 2018 Original Broadway Cast Recording of \"Head Over Heels.\"</p>\n",
  "pubDate": "Tue, 05 Mar 2019 05:01:00 +0000",
  "guid": "tag:audioboom.com,2019-03-05:/posts/7192218",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}