{
  "title": "Episode 120: &#8220;A Hard Day&#8217;s Night&#8221; by the Beatles",
  "link": "https://500songs.com/podcast/episode-120-a-hard-days-night-by-the-beatles/",
  "pubDate": "Tue, 27 Apr 2021 16:43:05 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=733",
  "description": "<p>This week's episode, the first on the new host, looks at \"A Hard Day's Night\", and the making of the film that would define music cinema for decades to come. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/50544168\">on \"Tobacco Road\" by the Nashville Teens.</a></p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As usual, I have created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-120-a-hard-days-night/\">a Mixcloud playlist</a> containing every song heard in this episode (though not the Goon Show, Bridge Over the River Wye, or A Show Called Fred recordings, all of which would take up half an hour each)</p>\n\n\n\n<p>I have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>,&nbsp;<a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>,&nbsp;<a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;</em>by Steve Lambley</a>,&nbsp;<a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>,&nbsp;<a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and&nbsp;<a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a></p>\n\n\n\n<p>For material on the making of the film, I referred to <em><a href=\"https://amzn.to/3dVUjAn\">A Hard Day's Night</a></em> by Ray Morton, and <em><a href=\"https://amzn.to/3tXKWpv\">Getting Away With It</a></em><a href=\"https://amzn.to/3tXKWpv\"> by Steven Soderbergh</a>, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.</p>\n\n\n\n<p>Information on the Goons came from various sources, but mostly from <a href=\"https://amzn.to/3xztOsn\"><em>The Goon Show Companion</em> by Roger Wilmut and Jimmy Grafton.</a></p>\n\n\n\n<p>A Hard Day's Night is available <a href=\"https://amzn.to/3vt6ElD\">on DVD</a>, while the music is of course on <a href=\"https://amzn.to/32SiNEl\">this album</a>.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Today, we're going to look at a song that has one of the most striking opening chords of any song ever recorded, the title song to a film that was described on its release as \"the Citizen Kane of jukebox musicals\", and which captured the Beatles at the height of their early success. We're going to look at how Beatlemania hit America, and at how the Beatles went from being merely a very popular pop group to being a cultural phenomenon that changed the world. And most importantly, we're going to look at how they changed how music is portrayed on screen forever. We're going to look at \"A Hard Day's Night\":</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\"]</p>\n\n\n\n<p>The sixteenth of January, 1964, seemed at first to be the first misstep in the Beatles' career. After their run of Christmas shows, they'd travelled to Paris to play the Olympia -- the same venue where, a little over two years earlier, John and Paul had seen Vince Taylor play and tried unsuccessfully to blag their own way on to the stage.&nbsp;</p>\n\n\n\n<p>This time, they were topping the bill, for the first of eighteen nights in a row -- or at least they were equally billed with Sylvie Vartan and Trini Lopez, with none of the promotional material actually saying who was highest billed. But they went down something like a lead balloon, with the audience, mostly made up of VIPs there for opening night, not responding to them, and with their amps failing three times during the show (George Harrison apparently suspected sabotage). It was the first time in almost three years that they'd faced an unappreciative audience, and they were apparently despondent after the show.</p>\n\n\n\n<p>They were despondent, at least, until they got a telegram after the show, giving them the good news -- \"I Want To Hold Your Hand\" had jumped up forty-three places on the Cashbox chart. They were number one in America. It was already planned, of course, that they would be going to the US in February to make three appearances on the Ed Sullivan Show, but now they knew they were big over there.</p>\n\n\n\n<p>After that, the shows in Paris became somewhat easier for the group, and while the press for the first night was fairly awful, once they started playing to their own audiences rather than VIPs they won the French crowds over as well as any other audience they'd had.</p>\n\n\n\n<p>While they were in France, they also made what would be their only studio recordings outside London. They'd been asked by the German branch of EMI to record German-language versions of \"She Loves You\" and \"I Want to Hold Your Hand\", as at the time it was felt that they didn't have much chance of selling in Germany with English-language recordings. While in the studio, they also recorded a song of Paul's, which became their next single -- the first to only feature a single voice:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"Can't Buy Me Love\"]</p>\n\n\n\n<p>But while Paul took the lead on that single, John was dominating in the writing for the duo, who were also working on writing their next album while they were in Paris. That album would be their first to consist entirely of original songs, and the only one to consist entirely of Lennon/McCartney songs, but of its thirteen tracks, ten would be primarily or solely John's work, and only three written mainly by Paul.</p>\n\n\n\n<p>But before they could record it, they had a trip to the US to make.</p>\n\n\n\n<p>The Beatles' first trip to the US has had a huge amount of coverage over the years, but it involved a surprisingly small amount of actual work for them -- they made three appearances on the Ed Sullivan Show, plus two live performances, one in Washington -- filmed for a closed-circuit cinema broadcast along with shows by the Beach Boys and Lesley Gore -- and one at Carnegie Hall.&nbsp;</p>\n\n\n\n<p>But it was those Ed Sullivan show performances that became legendary. Sullivan's show was always the most popular thing on American TV, and always featured a variety of acts. February the ninth 1964 was no exception, as he featured among others the comedian and impressionist Frank Gorshin (who is now best known for his later role as the Riddler in the Batman TV series) and the cast of Lionel Bart's musical Oliver!:</p>\n\n\n\n<p>[Excerpt: Davy Jones and Georgia Brown: \"I'd Do Anything\"]</p>\n\n\n\n<p>The young man playing the Artful Dodger there said later&nbsp;\"I watched the Beatles from the side of the stage, I saw the girls going crazy, and I said to myself, this is it, I want a piece of that.\" But it would be two years before Davy Jones would become famous as one of the Monkees.</p>\n\n\n\n<p>But, of course, it wasn't songs from the musicals sung in fake Cockney accents, or the impersonation skills of Frank Gorshin, that had people tuning in that night. And there were a <em>lot</em> of people tuning in -- seventy-three million of them, the highest audience figure for any TV show in US history to that point. And they were tuning in to see this:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on the Ed Sullivan Show)\"]</p>\n\n\n\n<p>It is impossible to explain or even really comprehend just how big the Beatles were in America after their Ed Sullivan appearances. They may not even have fully realised it themselves, as they were only over there for two weeks at that point and made relatively few appearances -- though they were soon booked in for a full-length tour that summer. But almost every American rock musician who came to prominence in the ten years after those appearances has said that it was seeing the Beatles on Ed Sullivan -- and the reaction to them from the girls in the audience -- that made them want to become musicians.&nbsp;</p>\n\n\n\n<p>Guitar-based rock and roll had basically been dead in the US since 1957, with the only real exceptions being surf bands and Duane Eddy. Now, as a result of one TV show, it was back with a vengeance, and the guitar would dominate American music for a generation.&nbsp;</p>\n\n\n\n<p>The Beatles became even bigger after their return to the UK, though. In the first week of April, they actually had the whole top five of the Billboard charts to themselves, and seven more records in the hot one hundred -- and not only that, but there were two songs <em>about</em> the Beatles also in the hot one hundred. They also had the number one and two spots in the album charts. The week after that, while they no longer had all five top spots, they did have two more singles in the hot one hundred, making fourteen in total.</p>\n\n\n\n<p>The reason they had so many records in the charts was that Capitol hadn't licensed their early recordings, and so they had been licensed to a couple of small labels, who were releasing everything they could from their small stockpile, and VeeJay, the label that had licensed their first album, were putting out album tracks as singles in the hope of getting as much of the market as they could.&nbsp;</p>\n\n\n\n<p>And the three companies putting out their records were soon going to be joined by a fourth.&nbsp;</p>\n\n\n\n<p>Because in an echo of how the Beatles had only been signed to EMI because of their publishing subsidiary, United Artists Records wanted to put out Beatles records, and had realised that there was probably no provision in their contract with EMI for film soundtracks. If their film division signed the Beatles to make a film, and they made it quickly and cheaply enough, they could get a soundtrack album out of it that would more than cover the cost of making the film, and would hopefully be pure profit for them.</p>\n\n\n\n<p>EMI turned out to have other opinions about this, after the contracts were signed, and United Artists ended up only getting the rights to the soundtrack album in America, but that was the thinking at least when United Artists approached Brian Epstein with a proposal in the autumn of 1963, for a film to be made as early as possible in 1964, to be released before the bubble burst and this Beatle fad was over.</p>\n\n\n\n<p>The Beatles had actually had multiple proposals to appear in films before, but these had all been for jukebox musicals -- the kind of film we've talked about earlier, where some kids put on a benefit show to save the local youth centre, and twenty different bands mime to one or two songs each. They didn't like that kind of film, and didn't want to be in one, and so those proposals had not gone anywhere.</p>\n\n\n\n<p>But they became interested when they were told who UA had in mind to direct -- Richard Lester.</p>\n\n\n\n<p>Much as George Martin had been, Richard Lester was a serendipitous choice, the one person in Britain who could have made the Beatles' film on a low budget and still make it a genuinely worthwhile film. Lester was an American former child prodigy, who had gone to university when he was only fifteen, and had paid his way through university by playing jazz piano, which made him able to work well with musicians.</p>\n\n\n\n<p>After getting his degree, he had started working in TV in the US in 1950, working his way up from being a stage hand to directing in under a year, as the TV industry was so new then that there were no experienced directors in the industry.</p>\n\n\n\n<p>He moved to the UK in 1953, and started directing over here, where again the industry was still in its infancy. He'd directed several episodes of a low-budget detective series called Mark Saber, and had also tried his hand at performance -- he starred in a variety show called The Dick Lester Show, which featured himself and another performer, Alun Owen. The show was live, and never recorded, so we have no idea what it was like, but we do know that the show was cancelled after one episode due to it being apparently miserably amateurish.</p>\n\n\n\n<p>But we also know that the next day Lester received a call from Peter Sellers, who told him \"Either that’s the worst television programme that I have ever, ever seen or I think you’re on to something that we are aspiring to.\" Lester's reply was that if there was a choice, it was definitely the latter.</p>\n\n\n\n<p>Sellers was, at this time, one of the biggest stars in Britain, but was not yet the major film star he later became. Rather he was primarily known for his work on a radio programme, the Goon Show.</p>\n\n\n\n<p>We've mentioned the Goon Show in passing before, but never really looked at it in any detail, but it was probably the single most important cultural influence in Britain in the 1950s. It was a series of surreal half-hour comedy shows starring Harry Secombe, Sellers, and Spike Milligan, and written by Milligan, often with the assistance of other writers like Eric Sykes and Larry Stephens. Its style is impossible to summarise in words, and so it's best to give an example -- here's a portion of 1985, their episode about life under the Big Brother Corporation, or BBC for short:</p>\n\n\n\n<p>[Excerpt: The Goon Show, \"1985\" 25:20-26:25]</p>\n\n\n\n<p>The Goons were, through most of the 1950s, the most inventive and creative comedy team on the radio, and they had a huge fanbase which included all four of the Beatles, with John Lennon being the biggest fan of the show.&nbsp;</p>\n\n\n\n<p>As well as working as the Goons, though, both Milligan and Sellers did other comedy work. Most notably for our purposes, they made many comedy records, together and separately, often with production by George Martin -- it's often said that Martin produced the Goons, but he only produced one or two Goon records, but he produced a lot of work by Sellers and Milligan, like this with Sellers as the skiffle singer Lenny Goonigan:</p>\n\n\n\n<p>[Excerpt: Peter Sellers, \"Putting on the Smile\"]</p>\n\n\n\n<p>or the 1962 album \"Bridge Over the River Wye\", by MIlligan, Sellers, Peter Cook, and Jonathan Miller, which was meant to be called \"Bridge Over the River Kwai\", until the film's makers threatened to sue, so George Martin had to go and edit out the \"k\"s from every \"Kwai\" in the record:</p>\n\n\n\n<p>[Excerpt: Bridge Over the River Wye]</p>\n\n\n\n<p>So Sellers and Milligan were branching out into other areas throughout the late fifties and early sixties, and Sellers wanted to do a Goon Show for TV, and thought that Lester would be the perfect person to direct it. The show couldn't be called The Goon Show, because it was being made for ITV rather than the BBC, and so they named it The Idiot Weekly, Price 2d. At first, Milligan didn't want to be involved, saying that his kind of comedy wouldn't translate to the TV, as images would make it too concrete, and so the first episode only involved Sellers, and was written by other members of Associated London Scripts, the writer's co-operative that Milligan and Sykes worked for.</p>\n\n\n\n<p>Shortly after the first episode was broadcast, Milligan called Lester and told him that he'd got most of the script for the second episode done -- he never admitted to having changed his mind, but from that point on Milligan was the main writer and co-star of The Idiot Weekly, Price 2d, though other writers from ALS continued to contribute, including Sykes, Terry Nation, and a young writer named John Junkin, who had to start a performing career at no notice when Sykes became ill and Junkin had to step in and play a role written for him.</p>\n\n\n\n<p>The show ran for three series, all in 1956, all under different names -- the first series was&nbsp;The Idiot Weekly, Price 2d; a month after that finished it came back for six more episodes as A Show Called Fred, and then later in the year it returned again as Son Of Fred. Only one episode survives, but from that episode it seems a quite remarkable programme:</p>\n\n\n\n<p>[Excerpt: A Show Called Fred, 05:40-06:29]</p>\n\n\n\n<p>As well as parodying other TV formats, it also has characters from one sketch wander into another, sketches ending without a punchline, and at one point has characters riding into shot, as if on horseback, but clopping two coconuts together to make the sound of hooves. The Monty Python team have often said that Milligan's 1969 series, Q5, did everything they were going to do a few months before them, but as it happens it seems that Milligan was doing everything they were going to do thirteen years before them.</p>\n\n\n\n<p>After their work on these three series, Lester, Milligan, and Sellers had gone off to do other things, but a couple of years later Sellers had bought a 16mm film camera, and asked Lester if he wanted to make a film with it. Over the course of two weekends, Sellers, Milligan, and Lester, plus various performer friends of theirs such as Norman Rossington and Leo McKern, put together an eleven-minute silent comedy, The Running, Jumping, and Standing Still Film, for which Lester was credited as co-director with Sellers, and for which Lester also wrote and performed the music and co-wrote the script, such as it was.</p>\n\n\n\n<p>The Running, Jumping, and Standing Still Film, which only cost seventy pounds to make in total, ended up being nominated for an Academy Award, and gave Lester a valuable credit as a film director, though he spent the next couple of years mostly making commercials.</p>\n\n\n\n<p>His first feature film, though, was one we've talked about briefly before. A couple of years back we looked briefly at the film Rock! Rock! Rock!, a film starring Alan Freed and featuring several musicians we've dealt with. The writer and producer of that film, Milton Subotsky, had since moved to the UK and started up a new company, Amicus Films, which would soon become known for making horror films starring people like Peter Cushing. But Amicus' first film was going to be one of those cheap, quick, jukebox musicals, It's Trad, Dad!</p>\n\n\n\n<p>It's Trad, Dad! was written by Subotsky -- or at least Subotsky is the credited writer -- and is clearly intended to be exactly along the lines of Subotsky's earlier films. When the Mayor of a small town tries to ban jazz music from his town, two teenagers, played by the pop stars Craig Douglas and Helen Shapiro, decide to persuade the DJs Pete Murray, Alan Freeman, and David Jacobs to put on a concert to convince the crotchety old people that this trad jazz thing isn't as bad as it sounds. They gather up Mr. Acker Bilk and His Paramount Jazz Band,&nbsp;Terry Lightfoot and His New Orleans Jazz Band, the Dukes of Dixieland, Chris Barber, and The Temperance Seven to perform the exciting hits of the day:</p>\n\n\n\n<p>[Excerpt: The Temperance Seven, \"Everybody Loves My Baby\"]</p>\n\n\n\n<p>As well as the trad performances, the film also features several people we've looked at previously in this series -- John Leyton singing one of his Joe Meek hits, Chubby Checker performing \"The Lose Your Inhibitions Twist\", Del Shannon singing&nbsp;\"You Never Talked About Me\", and Gene Vincent, just before he went to Hamburg to appear at the Star Club with the Beatles, singing \"Spaceshp to Mars\":</p>\n\n\n\n<p>[Excerpt: Gene Vincent, \"Spaceship to Mars\"]</p>\n\n\n\n<p>This was clearly intended to be a cheap film with no attention paid whatsoever to the quality of the film, and Richard Lester was picked to direct it as his first feature. He later recalled that when he was given the script that Subotsky had written, it was only eighteen pages long, and that seems like it is if anything a generous estimate based on Subotsky's script for Rock! Rock! Rock!</p>\n\n\n\n<p>Lester absolutely transformed it. The result is a bizarre film. It's not quite a good film -- it's still the exact same structure that Subotsky used for Rock! Rock! Rock!, right down to scenes of the kids watching musicians on TV as an excuse for musical numbers, and Shapiro and Douglas can't act at all. But Lester included a lot of additional visual jokes, and I strongly suspect he rewrote the script a great deal. There's now a cartoonlike quality to it -- characters repeatedly argue with the omniscient narrator, and also ask the narrator for favours. At one point, the two main characters want to get to the city from their small town, and ask the narrator to help them. There's a sped-up noise, we see film sprockets behind the characters as the film moves behind them, and they end up in their new location.</p>\n\n\n\n<p>But more than that, Lester and his cinematographer Gilbert Taylor created a whole new visual language for how to present pop music in that film. Taylor was one of the most innovative cinematographers in the business -- he would go on to be a crucial part of the look of such visually striking films as Dr. Strangelove, Repulsion, and Star Wars -- and he and Lester came up with a way of filming musicians that is now the standard for musical performances, but at the time was unlike anything seen before. There were lots of deep-focus shots with one musician's face in the foreground while the rest of the group were visible in the background, lots of close-ups on instruments, and a lot of quick cutting.</p>\n\n\n\n<p>I won't go on about this too much in what is, after all, an audio medium, but in the same way Jack Good had revolutionised the TV presentation of rock and roll music in a way that would influence every music TV show since, so Lester and Taylor revolutionised the way musical performances were filmed, and created a language in It's Trad Dad! that is now the absolute standard way to show musicians on the big screen, so much so that it's only if you watch any rock and roll film made before it that you realise how astonishingly imaginative it is, because all its innovations have been so thoroughly incorporated into standard technique.</p>\n\n\n\n<p>But they weren't incorporated because of It's Trad, Dad!, which nobody paid any attention to. It was a cheap quickie that wasn't meant to be studied or reviewed, and was just an excuse to have Helen Shapiro sing her latest single:</p>\n\n\n\n<p>[Excerpt: Helen Shapiro, \"Let's Talk About Love\"]</p>\n\n\n\n<p>But this meant that Richard Lester was someone who had worked with the Beatles' very favourite comedians and understood their sense of humour, who was a musician himself and knew how to talk to musicians, who had a visually innovative way of presenting music on screen that nobody else was doing, and who could make films quickly on a shoestring budget. He'd managed to turn the sow's ear of a script that Subotsky had given him for It's Trad, Dad! into, if not a silk purse, at least a sturdy carrier bag.</p>\n\n\n\n<p>He was perfect, in short, to make a British music film on the cheap, but make it just that little bit better than it needed to be. But of course, a film requires more than just a director. And Lester had an idea who he wanted to write the script, as well.</p>\n\n\n\n<p>After Alun Owen had acted with Lester in The Dick Lester Show he'd moved from acting into writing, and he had a particular interest in writing about Liverpool -- he was born in Wales, but moved to Liverpool as a small child, and Lester would later joke that Owen would be Irish, Liverpudlian, or Welsh depending on what he thought you wanted him to be. He'd written a TV play set in Liverpool, Last Tram to Lime Street, and he was currently working with Lionel Bart on a musical based on \"Maggie May\", the old folk song about a sex worker in Liverpool.</p>\n\n\n\n<p>That musical, when it hit the stage, featured another old colleague of Lester's, John Junkin. It wasn't a massive success, but it did lead to an EP of songs from the musical by Judy Garland, with a delightfully bizarre performance of a song that uses the trades union congress as a not so subtle metaphor for other kinds of congress:</p>\n\n\n\n<p>[Excerpt: Judy Garland, \"There's Only One Union\"]</p>\n\n\n\n<p>However, there were delays in staging Maggie May, and that meant that Owen was free to write the script. Owen was a less universally-acclaimed choice among the Beatles, but acceptable -- McCartney had enjoyed Last Tram to Lime Street, but Lennon thought of Owen as a professional Liverpudlian, a species of person he despised.</p>\n\n\n\n<p>Owen followed the group around while they were on tour in the latter part of 1963, including the trip to Paris, and took notes about their personalities -- though he later admitted that he'd had to exaggerate the differences between the group's personalities significantly, because at this time they were so close that they acted almost like a single individual.&nbsp;</p>\n\n\n\n<p>While Owen took these notes and wrote the script, though, the basic idea for the film came from a comment Lennon made to Lester. When asked about how he'd liked Sweden after the group performed there, he made a comment which Lester has paraphrased a few different ways over the years, but amounted to \"it was a plane and a room and a car and a room\".&nbsp; This comment was given in the script to the fictional character of Paul's grandfather:</p>\n\n\n\n<p>[Excerpt: \"A Hard Day's Night\" film soundtrack]</p>\n\n\n\n<p>It became the structuring principle for the whole film. Other than brief moments where they escape, the group are constantly shown as being indoors, in tight enclosed spaces, prisoners of their fame, and responding to it mostly in sarcastic one-liners -- responses that also meant that none of the group had to learn more than a line or two per shot, with most of the dialogue being taken up by the supporting cast, like Wilfred Bramble, Norman Rossington, and John Junkin, who had made the opposite journey from Alun Owen and had moved into performance from scriptwriting. Junkin put on a fake Liverpool accent for the film, and kept it up off-camera, as apparently the Beatles wanted real Liverpudlians around them, and so Junkin attempted to fool them for the duration of the shoot.</p>\n\n\n\n<p>The film's title actually has two different sources. The phrase \"a hard day's night\" actually turned up in a short-short story John had written, \"Sad Michael\", which had recently been published in his first book, \"In His Own Write\", a collection of nonsense poetry and stories inspired by the Goons and Lewis Carroll. There's no recording of Lennon reading much of the book, but he did appear on Peter Cook and Dudley Moore's TV show Not Only But Also, reading one of the stories, \"The Wrestling Dog\", with interjections from Norman Rossington:</p>\n\n\n\n<p>[Excerpt: John Lennon, \"The Wrestling Dog\"]</p>\n\n\n\n<p>\"A hard day's night\" turned up in the story of Sad Michael, a night watchman, or \"cocky watchtower\" in Lennon's phrasing, but the phrase only came to the group's attention as a possible title when Ringo independently reinvented the phrase as a malapropism on the set of the film. Ringo had a habit of this kind of thing -- saying things slightly wrongly and coming up with a phrase that was rather more interesting than what he'd meant to say -- and this wouldn't be the only song whose title he provided that way.</p>\n\n\n\n<p>Lennon wrote the song the night after Ringo made his slip-up, and finished it off with McCartney the next day, and later said it was inspired by Bob Dylan, though Dylan's inspiration is hard to hear. It is, though, a slightly more sophisticated lyric than the group's previous singles. It's still a love song, but about a more adult relationship -- the protagonist has a job, and comes home at night to his love. It's not \"I Want to Hold Your Hand\", but a song about the relief of getting home at the end of a hard day at work:</p>\n\n\n\n<p>[Excerpt: The Beatles, “A Hard Day's Night” second verse]</p>\n\n\n\n<p>But what really made the record special was something that they created in the studio -- that chord.</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\", opening chord]</p>\n\n\n\n<p>17) The opening chord of \"A Hard Day's Night\" has been analysed in a million different ways, but it seems to have been made up of three elements. First, there is the chord that George is playing on his twelve-string, and which John is also playing on six-string acoustic. That chord is an Fadd9 -- an F chord with a G on top, the notes F, A, C, G:</p>\n\n\n\n\n\n<p>Paul, meanwhile, is playing a D in the bass:</p>\n\n\n\n<p>[D bass note]</p>\n\n\n\n<p>And George Martin, on piano, is playing D, G, D, G, and C:</p>\n\n\n\n\n\n<p>Put them all together, and you have this:</p>\n\n\n\n\n\n<p>Or, of course, this:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\"]</p>\n\n\n\n<p>The song, of course, went to number one, and the film also became one of the most successful films of the year, both commercially and critically. It was nominated for two Academy Awards, for the screenplay and for George Martin's score, and received almost universal praise from critics -- for example when the Village Voice did its end-of-year roundup of the best films of 1964, it came in second, after Dr. Strangelove, a film whose cinematographer, Gilbert Taylor, had done the same job on A Hard Day's Night, and which starred George Martin and Richard Lester's old colleague, Peter Sellers.</p>\n\n\n\n<p>Sellers would himself later record his own version of \"A Hard Day's Night\", produced by Martin:</p>\n\n\n\n<p>[Excerpt: Peter Sellers, \"A Hard Day's Night\"]</p>\n\n\n\n<p>A Hard Day's Night was a pivotal moment in film, and is now generally regarded as one of the finest examples of British cinema taking cues from the French New Wave, and to have invented a whole new visual language for music in the cinema and on TV. It's also a film that inspired thousands of other people to form rock bands -- it defined the band as gang mentality for millions, and despite being an attempt to show how oppressive the Beatles' life already felt, it made many, many people envy that life and want it for themselves. Over the next month or two we'll see how that worked out for a whole host of musicians, and when we next return to the Beatles themselves we'll see how they coped with a level of fame that had never been experienced by anyone else in the world --&nbsp; and how you follow up that level of success in both music and film.&nbsp;</p>",
  "itunes:subtitle": "This weeks episode, the first on the new host, looks at A Hard Days Night, and the making of the film that would define music cinema for decades to come. Click the full post to read liner notes, links to more information, and a transcript of the episode.",
  "itunes:keywords": "Carnegie Hall,Davy Jones,Ed Sullivan,Eric Sykes,Gene Vincent,George Harrison,George Martin,Helen Shapiro,It&#039;s Trad Dad,John Lennon,Lionel Bart,Milton Subotsky,Paul McCartney,Peter Sellers,Richard Lester,Ringo Starr,Spike Milligan,The Beatles,The Goon Show",
  "itunes:episodeType": "full",
  "itunes:episode": 120,
  "content:encoded": "<p>This week's episode, the first on the new host, looks at \"A Hard Day's Night\", and the making of the film that would define music cinema for decades to come. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/50544168\">on \"Tobacco Road\" by the Nashville Teens.</a></p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As usual, I have created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-120-a-hard-days-night/\">a Mixcloud playlist</a> containing every song heard in this episode (though not the Goon Show, Bridge Over the River Wye, or A Show Called Fred recordings, all of which would take up half an hour each)</p>\n\n\n\n<p>I have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: <a href=\"https://amzn.to/3tc1YzZ\"><em>The Complete Beatles Chronicle</em> by Mark Lewisohn</a>,&nbsp;<a href=\"https://amzn.to/3r70SUA\"><em>All The Songs: The Stories Behind Every Beatles Release</em> by Jean-Michel Guesdon</a>,&nbsp;<a href=\"https://amzn.to/3oyiWVN\"><em>And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;</em>by Steve Lambley</a>,&nbsp;<a href=\"https://amzn.to/3r5ACd3\"><em>The Beatles By Ear</em> by Kevin Moore</a>,&nbsp;<a href=\"https://amzn.to/3j20800\"><em>Revolution in the Head</em> by Ian MacDonald</a>, and&nbsp;<a href=\"https://amzn.to/3tbphu4\"><em>The Beatles Anthology</em>.</a></p>\n\n\n\n<p>For material on the making of the film, I referred to <em><a href=\"https://amzn.to/3dVUjAn\">A Hard Day's Night</a></em> by Ray Morton, and <em><a href=\"https://amzn.to/3tXKWpv\">Getting Away With It</a></em><a href=\"https://amzn.to/3tXKWpv\"> by Steven Soderbergh</a>, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.</p>\n\n\n\n<p>Information on the Goons came from various sources, but mostly from <a href=\"https://amzn.to/3xztOsn\"><em>The Goon Show Companion</em> by Roger Wilmut and Jimmy Grafton.</a></p>\n\n\n\n<p>A Hard Day's Night is available <a href=\"https://amzn.to/3vt6ElD\">on DVD</a>, while the music is of course on <a href=\"https://amzn.to/32SiNEl\">this album</a>.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Today, we're going to look at a song that has one of the most striking opening chords of any song ever recorded, the title song to a film that was described on its release as \"the Citizen Kane of jukebox musicals\", and which captured the Beatles at the height of their early success. We're going to look at how Beatlemania hit America, and at how the Beatles went from being merely a very popular pop group to being a cultural phenomenon that changed the world. And most importantly, we're going to look at how they changed how music is portrayed on screen forever. We're going to look at \"A Hard Day's Night\":</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\"]</p>\n\n\n\n<p>The sixteenth of January, 1964, seemed at first to be the first misstep in the Beatles' career. After their run of Christmas shows, they'd travelled to Paris to play the Olympia -- the same venue where, a little over two years earlier, John and Paul had seen Vince Taylor play and tried unsuccessfully to blag their own way on to the stage.&nbsp;</p>\n\n\n\n<p>This time, they were topping the bill, for the first of eighteen nights in a row -- or at least they were equally billed with Sylvie Vartan and Trini Lopez, with none of the promotional material actually saying who was highest billed. But they went down something like a lead balloon, with the audience, mostly made up of VIPs there for opening night, not responding to them, and with their amps failing three times during the show (George Harrison apparently suspected sabotage). It was the first time in almost three years that they'd faced an unappreciative audience, and they were apparently despondent after the show.</p>\n\n\n\n<p>They were despondent, at least, until they got a telegram after the show, giving them the good news -- \"I Want To Hold Your Hand\" had jumped up forty-three places on the Cashbox chart. They were number one in America. It was already planned, of course, that they would be going to the US in February to make three appearances on the Ed Sullivan Show, but now they knew they were big over there.</p>\n\n\n\n<p>After that, the shows in Paris became somewhat easier for the group, and while the press for the first night was fairly awful, once they started playing to their own audiences rather than VIPs they won the French crowds over as well as any other audience they'd had.</p>\n\n\n\n<p>While they were in France, they also made what would be their only studio recordings outside London. They'd been asked by the German branch of EMI to record German-language versions of \"She Loves You\" and \"I Want to Hold Your Hand\", as at the time it was felt that they didn't have much chance of selling in Germany with English-language recordings. While in the studio, they also recorded a song of Paul's, which became their next single -- the first to only feature a single voice:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"Can't Buy Me Love\"]</p>\n\n\n\n<p>But while Paul took the lead on that single, John was dominating in the writing for the duo, who were also working on writing their next album while they were in Paris. That album would be their first to consist entirely of original songs, and the only one to consist entirely of Lennon/McCartney songs, but of its thirteen tracks, ten would be primarily or solely John's work, and only three written mainly by Paul.</p>\n\n\n\n<p>But before they could record it, they had a trip to the US to make.</p>\n\n\n\n<p>The Beatles' first trip to the US has had a huge amount of coverage over the years, but it involved a surprisingly small amount of actual work for them -- they made three appearances on the Ed Sullivan Show, plus two live performances, one in Washington -- filmed for a closed-circuit cinema broadcast along with shows by the Beach Boys and Lesley Gore -- and one at Carnegie Hall.&nbsp;</p>\n\n\n\n<p>But it was those Ed Sullivan show performances that became legendary. Sullivan's show was always the most popular thing on American TV, and always featured a variety of acts. February the ninth 1964 was no exception, as he featured among others the comedian and impressionist Frank Gorshin (who is now best known for his later role as the Riddler in the Batman TV series) and the cast of Lionel Bart's musical Oliver!:</p>\n\n\n\n<p>[Excerpt: Davy Jones and Georgia Brown: \"I'd Do Anything\"]</p>\n\n\n\n<p>The young man playing the Artful Dodger there said later&nbsp;\"I watched the Beatles from the side of the stage, I saw the girls going crazy, and I said to myself, this is it, I want a piece of that.\" But it would be two years before Davy Jones would become famous as one of the Monkees.</p>\n\n\n\n<p>But, of course, it wasn't songs from the musicals sung in fake Cockney accents, or the impersonation skills of Frank Gorshin, that had people tuning in that night. And there were a <em>lot</em> of people tuning in -- seventy-three million of them, the highest audience figure for any TV show in US history to that point. And they were tuning in to see this:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on the Ed Sullivan Show)\"]</p>\n\n\n\n<p>It is impossible to explain or even really comprehend just how big the Beatles were in America after their Ed Sullivan appearances. They may not even have fully realised it themselves, as they were only over there for two weeks at that point and made relatively few appearances -- though they were soon booked in for a full-length tour that summer. But almost every American rock musician who came to prominence in the ten years after those appearances has said that it was seeing the Beatles on Ed Sullivan -- and the reaction to them from the girls in the audience -- that made them want to become musicians.&nbsp;</p>\n\n\n\n<p>Guitar-based rock and roll had basically been dead in the US since 1957, with the only real exceptions being surf bands and Duane Eddy. Now, as a result of one TV show, it was back with a vengeance, and the guitar would dominate American music for a generation.&nbsp;</p>\n\n\n\n<p>The Beatles became even bigger after their return to the UK, though. In the first week of April, they actually had the whole top five of the Billboard charts to themselves, and seven more records in the hot one hundred -- and not only that, but there were two songs <em>about</em> the Beatles also in the hot one hundred. They also had the number one and two spots in the album charts. The week after that, while they no longer had all five top spots, they did have two more singles in the hot one hundred, making fourteen in total.</p>\n\n\n\n<p>The reason they had so many records in the charts was that Capitol hadn't licensed their early recordings, and so they had been licensed to a couple of small labels, who were releasing everything they could from their small stockpile, and VeeJay, the label that had licensed their first album, were putting out album tracks as singles in the hope of getting as much of the market as they could.&nbsp;</p>\n\n\n\n<p>And the three companies putting out their records were soon going to be joined by a fourth.&nbsp;</p>\n\n\n\n<p>Because in an echo of how the Beatles had only been signed to EMI because of their publishing subsidiary, United Artists Records wanted to put out Beatles records, and had realised that there was probably no provision in their contract with EMI for film soundtracks. If their film division signed the Beatles to make a film, and they made it quickly and cheaply enough, they could get a soundtrack album out of it that would more than cover the cost of making the film, and would hopefully be pure profit for them.</p>\n\n\n\n<p>EMI turned out to have other opinions about this, after the contracts were signed, and United Artists ended up only getting the rights to the soundtrack album in America, but that was the thinking at least when United Artists approached Brian Epstein with a proposal in the autumn of 1963, for a film to be made as early as possible in 1964, to be released before the bubble burst and this Beatle fad was over.</p>\n\n\n\n<p>The Beatles had actually had multiple proposals to appear in films before, but these had all been for jukebox musicals -- the kind of film we've talked about earlier, where some kids put on a benefit show to save the local youth centre, and twenty different bands mime to one or two songs each. They didn't like that kind of film, and didn't want to be in one, and so those proposals had not gone anywhere.</p>\n\n\n\n<p>But they became interested when they were told who UA had in mind to direct -- Richard Lester.</p>\n\n\n\n<p>Much as George Martin had been, Richard Lester was a serendipitous choice, the one person in Britain who could have made the Beatles' film on a low budget and still make it a genuinely worthwhile film. Lester was an American former child prodigy, who had gone to university when he was only fifteen, and had paid his way through university by playing jazz piano, which made him able to work well with musicians.</p>\n\n\n\n<p>After getting his degree, he had started working in TV in the US in 1950, working his way up from being a stage hand to directing in under a year, as the TV industry was so new then that there were no experienced directors in the industry.</p>\n\n\n\n<p>He moved to the UK in 1953, and started directing over here, where again the industry was still in its infancy. He'd directed several episodes of a low-budget detective series called Mark Saber, and had also tried his hand at performance -- he starred in a variety show called The Dick Lester Show, which featured himself and another performer, Alun Owen. The show was live, and never recorded, so we have no idea what it was like, but we do know that the show was cancelled after one episode due to it being apparently miserably amateurish.</p>\n\n\n\n<p>But we also know that the next day Lester received a call from Peter Sellers, who told him \"Either that’s the worst television programme that I have ever, ever seen or I think you’re on to something that we are aspiring to.\" Lester's reply was that if there was a choice, it was definitely the latter.</p>\n\n\n\n<p>Sellers was, at this time, one of the biggest stars in Britain, but was not yet the major film star he later became. Rather he was primarily known for his work on a radio programme, the Goon Show.</p>\n\n\n\n<p>We've mentioned the Goon Show in passing before, but never really looked at it in any detail, but it was probably the single most important cultural influence in Britain in the 1950s. It was a series of surreal half-hour comedy shows starring Harry Secombe, Sellers, and Spike Milligan, and written by Milligan, often with the assistance of other writers like Eric Sykes and Larry Stephens. Its style is impossible to summarise in words, and so it's best to give an example -- here's a portion of 1985, their episode about life under the Big Brother Corporation, or BBC for short:</p>\n\n\n\n<p>[Excerpt: The Goon Show, \"1985\" 25:20-26:25]</p>\n\n\n\n<p>The Goons were, through most of the 1950s, the most inventive and creative comedy team on the radio, and they had a huge fanbase which included all four of the Beatles, with John Lennon being the biggest fan of the show.&nbsp;</p>\n\n\n\n<p>As well as working as the Goons, though, both Milligan and Sellers did other comedy work. Most notably for our purposes, they made many comedy records, together and separately, often with production by George Martin -- it's often said that Martin produced the Goons, but he only produced one or two Goon records, but he produced a lot of work by Sellers and Milligan, like this with Sellers as the skiffle singer Lenny Goonigan:</p>\n\n\n\n<p>[Excerpt: Peter Sellers, \"Putting on the Smile\"]</p>\n\n\n\n<p>or the 1962 album \"Bridge Over the River Wye\", by MIlligan, Sellers, Peter Cook, and Jonathan Miller, which was meant to be called \"Bridge Over the River Kwai\", until the film's makers threatened to sue, so George Martin had to go and edit out the \"k\"s from every \"Kwai\" in the record:</p>\n\n\n\n<p>[Excerpt: Bridge Over the River Wye]</p>\n\n\n\n<p>So Sellers and Milligan were branching out into other areas throughout the late fifties and early sixties, and Sellers wanted to do a Goon Show for TV, and thought that Lester would be the perfect person to direct it. The show couldn't be called The Goon Show, because it was being made for ITV rather than the BBC, and so they named it The Idiot Weekly, Price 2d. At first, Milligan didn't want to be involved, saying that his kind of comedy wouldn't translate to the TV, as images would make it too concrete, and so the first episode only involved Sellers, and was written by other members of Associated London Scripts, the writer's co-operative that Milligan and Sykes worked for.</p>\n\n\n\n<p>Shortly after the first episode was broadcast, Milligan called Lester and told him that he'd got most of the script for the second episode done -- he never admitted to having changed his mind, but from that point on Milligan was the main writer and co-star of The Idiot Weekly, Price 2d, though other writers from ALS continued to contribute, including Sykes, Terry Nation, and a young writer named John Junkin, who had to start a performing career at no notice when Sykes became ill and Junkin had to step in and play a role written for him.</p>\n\n\n\n<p>The show ran for three series, all in 1956, all under different names -- the first series was&nbsp;The Idiot Weekly, Price 2d; a month after that finished it came back for six more episodes as A Show Called Fred, and then later in the year it returned again as Son Of Fred. Only one episode survives, but from that episode it seems a quite remarkable programme:</p>\n\n\n\n<p>[Excerpt: A Show Called Fred, 05:40-06:29]</p>\n\n\n\n<p>As well as parodying other TV formats, it also has characters from one sketch wander into another, sketches ending without a punchline, and at one point has characters riding into shot, as if on horseback, but clopping two coconuts together to make the sound of hooves. The Monty Python team have often said that Milligan's 1969 series, Q5, did everything they were going to do a few months before them, but as it happens it seems that Milligan was doing everything they were going to do thirteen years before them.</p>\n\n\n\n<p>After their work on these three series, Lester, Milligan, and Sellers had gone off to do other things, but a couple of years later Sellers had bought a 16mm film camera, and asked Lester if he wanted to make a film with it. Over the course of two weekends, Sellers, Milligan, and Lester, plus various performer friends of theirs such as Norman Rossington and Leo McKern, put together an eleven-minute silent comedy, The Running, Jumping, and Standing Still Film, for which Lester was credited as co-director with Sellers, and for which Lester also wrote and performed the music and co-wrote the script, such as it was.</p>\n\n\n\n<p>The Running, Jumping, and Standing Still Film, which only cost seventy pounds to make in total, ended up being nominated for an Academy Award, and gave Lester a valuable credit as a film director, though he spent the next couple of years mostly making commercials.</p>\n\n\n\n<p>His first feature film, though, was one we've talked about briefly before. A couple of years back we looked briefly at the film Rock! Rock! Rock!, a film starring Alan Freed and featuring several musicians we've dealt with. The writer and producer of that film, Milton Subotsky, had since moved to the UK and started up a new company, Amicus Films, which would soon become known for making horror films starring people like Peter Cushing. But Amicus' first film was going to be one of those cheap, quick, jukebox musicals, It's Trad, Dad!</p>\n\n\n\n<p>It's Trad, Dad! was written by Subotsky -- or at least Subotsky is the credited writer -- and is clearly intended to be exactly along the lines of Subotsky's earlier films. When the Mayor of a small town tries to ban jazz music from his town, two teenagers, played by the pop stars Craig Douglas and Helen Shapiro, decide to persuade the DJs Pete Murray, Alan Freeman, and David Jacobs to put on a concert to convince the crotchety old people that this trad jazz thing isn't as bad as it sounds. They gather up Mr. Acker Bilk and His Paramount Jazz Band,&nbsp;Terry Lightfoot and His New Orleans Jazz Band, the Dukes of Dixieland, Chris Barber, and The Temperance Seven to perform the exciting hits of the day:</p>\n\n\n\n<p>[Excerpt: The Temperance Seven, \"Everybody Loves My Baby\"]</p>\n\n\n\n<p>As well as the trad performances, the film also features several people we've looked at previously in this series -- John Leyton singing one of his Joe Meek hits, Chubby Checker performing \"The Lose Your Inhibitions Twist\", Del Shannon singing&nbsp;\"You Never Talked About Me\", and Gene Vincent, just before he went to Hamburg to appear at the Star Club with the Beatles, singing \"Spaceshp to Mars\":</p>\n\n\n\n<p>[Excerpt: Gene Vincent, \"Spaceship to Mars\"]</p>\n\n\n\n<p>This was clearly intended to be a cheap film with no attention paid whatsoever to the quality of the film, and Richard Lester was picked to direct it as his first feature. He later recalled that when he was given the script that Subotsky had written, it was only eighteen pages long, and that seems like it is if anything a generous estimate based on Subotsky's script for Rock! Rock! Rock!</p>\n\n\n\n<p>Lester absolutely transformed it. The result is a bizarre film. It's not quite a good film -- it's still the exact same structure that Subotsky used for Rock! Rock! Rock!, right down to scenes of the kids watching musicians on TV as an excuse for musical numbers, and Shapiro and Douglas can't act at all. But Lester included a lot of additional visual jokes, and I strongly suspect he rewrote the script a great deal. There's now a cartoonlike quality to it -- characters repeatedly argue with the omniscient narrator, and also ask the narrator for favours. At one point, the two main characters want to get to the city from their small town, and ask the narrator to help them. There's a sped-up noise, we see film sprockets behind the characters as the film moves behind them, and they end up in their new location.</p>\n\n\n\n<p>But more than that, Lester and his cinematographer Gilbert Taylor created a whole new visual language for how to present pop music in that film. Taylor was one of the most innovative cinematographers in the business -- he would go on to be a crucial part of the look of such visually striking films as Dr. Strangelove, Repulsion, and Star Wars -- and he and Lester came up with a way of filming musicians that is now the standard for musical performances, but at the time was unlike anything seen before. There were lots of deep-focus shots with one musician's face in the foreground while the rest of the group were visible in the background, lots of close-ups on instruments, and a lot of quick cutting.</p>\n\n\n\n<p>I won't go on about this too much in what is, after all, an audio medium, but in the same way Jack Good had revolutionised the TV presentation of rock and roll music in a way that would influence every music TV show since, so Lester and Taylor revolutionised the way musical performances were filmed, and created a language in It's Trad Dad! that is now the absolute standard way to show musicians on the big screen, so much so that it's only if you watch any rock and roll film made before it that you realise how astonishingly imaginative it is, because all its innovations have been so thoroughly incorporated into standard technique.</p>\n\n\n\n<p>But they weren't incorporated because of It's Trad, Dad!, which nobody paid any attention to. It was a cheap quickie that wasn't meant to be studied or reviewed, and was just an excuse to have Helen Shapiro sing her latest single:</p>\n\n\n\n<p>[Excerpt: Helen Shapiro, \"Let's Talk About Love\"]</p>\n\n\n\n<p>But this meant that Richard Lester was someone who had worked with the Beatles' very favourite comedians and understood their sense of humour, who was a musician himself and knew how to talk to musicians, who had a visually innovative way of presenting music on screen that nobody else was doing, and who could make films quickly on a shoestring budget. He'd managed to turn the sow's ear of a script that Subotsky had given him for It's Trad, Dad! into, if not a silk purse, at least a sturdy carrier bag.</p>\n\n\n\n<p>He was perfect, in short, to make a British music film on the cheap, but make it just that little bit better than it needed to be. But of course, a film requires more than just a director. And Lester had an idea who he wanted to write the script, as well.</p>\n\n\n\n<p>After Alun Owen had acted with Lester in The Dick Lester Show he'd moved from acting into writing, and he had a particular interest in writing about Liverpool -- he was born in Wales, but moved to Liverpool as a small child, and Lester would later joke that Owen would be Irish, Liverpudlian, or Welsh depending on what he thought you wanted him to be. He'd written a TV play set in Liverpool, Last Tram to Lime Street, and he was currently working with Lionel Bart on a musical based on \"Maggie May\", the old folk song about a sex worker in Liverpool.</p>\n\n\n\n<p>That musical, when it hit the stage, featured another old colleague of Lester's, John Junkin. It wasn't a massive success, but it did lead to an EP of songs from the musical by Judy Garland, with a delightfully bizarre performance of a song that uses the trades union congress as a not so subtle metaphor for other kinds of congress:</p>\n\n\n\n<p>[Excerpt: Judy Garland, \"There's Only One Union\"]</p>\n\n\n\n<p>However, there were delays in staging Maggie May, and that meant that Owen was free to write the script. Owen was a less universally-acclaimed choice among the Beatles, but acceptable -- McCartney had enjoyed Last Tram to Lime Street, but Lennon thought of Owen as a professional Liverpudlian, a species of person he despised.</p>\n\n\n\n<p>Owen followed the group around while they were on tour in the latter part of 1963, including the trip to Paris, and took notes about their personalities -- though he later admitted that he'd had to exaggerate the differences between the group's personalities significantly, because at this time they were so close that they acted almost like a single individual.&nbsp;</p>\n\n\n\n<p>While Owen took these notes and wrote the script, though, the basic idea for the film came from a comment Lennon made to Lester. When asked about how he'd liked Sweden after the group performed there, he made a comment which Lester has paraphrased a few different ways over the years, but amounted to \"it was a plane and a room and a car and a room\".&nbsp; This comment was given in the script to the fictional character of Paul's grandfather:</p>\n\n\n\n<p>[Excerpt: \"A Hard Day's Night\" film soundtrack]</p>\n\n\n\n<p>It became the structuring principle for the whole film. Other than brief moments where they escape, the group are constantly shown as being indoors, in tight enclosed spaces, prisoners of their fame, and responding to it mostly in sarcastic one-liners -- responses that also meant that none of the group had to learn more than a line or two per shot, with most of the dialogue being taken up by the supporting cast, like Wilfred Bramble, Norman Rossington, and John Junkin, who had made the opposite journey from Alun Owen and had moved into performance from scriptwriting. Junkin put on a fake Liverpool accent for the film, and kept it up off-camera, as apparently the Beatles wanted real Liverpudlians around them, and so Junkin attempted to fool them for the duration of the shoot.</p>\n\n\n\n<p>The film's title actually has two different sources. The phrase \"a hard day's night\" actually turned up in a short-short story John had written, \"Sad Michael\", which had recently been published in his first book, \"In His Own Write\", a collection of nonsense poetry and stories inspired by the Goons and Lewis Carroll. There's no recording of Lennon reading much of the book, but he did appear on Peter Cook and Dudley Moore's TV show Not Only But Also, reading one of the stories, \"The Wrestling Dog\", with interjections from Norman Rossington:</p>\n\n\n\n<p>[Excerpt: John Lennon, \"The Wrestling Dog\"]</p>\n\n\n\n<p>\"A hard day's night\" turned up in the story of Sad Michael, a night watchman, or \"cocky watchtower\" in Lennon's phrasing, but the phrase only came to the group's attention as a possible title when Ringo independently reinvented the phrase as a malapropism on the set of the film. Ringo had a habit of this kind of thing -- saying things slightly wrongly and coming up with a phrase that was rather more interesting than what he'd meant to say -- and this wouldn't be the only song whose title he provided that way.</p>\n\n\n\n<p>Lennon wrote the song the night after Ringo made his slip-up, and finished it off with McCartney the next day, and later said it was inspired by Bob Dylan, though Dylan's inspiration is hard to hear. It is, though, a slightly more sophisticated lyric than the group's previous singles. It's still a love song, but about a more adult relationship -- the protagonist has a job, and comes home at night to his love. It's not \"I Want to Hold Your Hand\", but a song about the relief of getting home at the end of a hard day at work:</p>\n\n\n\n<p>[Excerpt: The Beatles, “A Hard Day's Night” second verse]</p>\n\n\n\n<p>But what really made the record special was something that they created in the studio -- that chord.</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\", opening chord]</p>\n\n\n\n<p>17) The opening chord of \"A Hard Day's Night\" has been analysed in a million different ways, but it seems to have been made up of three elements. First, there is the chord that George is playing on his twelve-string, and which John is also playing on six-string acoustic. That chord is an Fadd9 -- an F chord with a G on top, the notes F, A, C, G:</p>\n\n\n\n\n\n<p>Paul, meanwhile, is playing a D in the bass:</p>\n\n\n\n<p>[D bass note]</p>\n\n\n\n<p>And George Martin, on piano, is playing D, G, D, G, and C:</p>\n\n\n\n\n\n<p>Put them all together, and you have this:</p>\n\n\n\n\n\n<p>Or, of course, this:</p>\n\n\n\n<p>[Excerpt: The Beatles, \"A Hard Day's Night\"]</p>\n\n\n\n<p>The song, of course, went to number one, and the film also became one of the most successful films of the year, both commercially and critically. It was nominated for two Academy Awards, for the screenplay and for George Martin's score, and received almost universal praise from critics -- for example when the Village Voice did its end-of-year roundup of the best films of 1964, it came in second, after Dr. Strangelove, a film whose cinematographer, Gilbert Taylor, had done the same job on A Hard Day's Night, and which starred George Martin and Richard Lester's old colleague, Peter Sellers.</p>\n\n\n\n<p>Sellers would himself later record his own version of \"A Hard Day's Night\", produced by Martin:</p>\n\n\n\n<p>[Excerpt: Peter Sellers, \"A Hard Day's Night\"]</p>\n\n\n\n<p>A Hard Day's Night was a pivotal moment in film, and is now generally regarded as one of the finest examples of British cinema taking cues from the French New Wave, and to have invented a whole new visual language for music in the cinema and on TV. It's also a film that inspired thousands of other people to form rock bands -- it defined the band as gang mentality for millions, and despite being an attempt to show how oppressive the Beatles' life already felt, it made many, many people envy that life and want it for themselves. Over the next month or two we'll see how that worked out for a whole host of musicians, and when we next return to the Beatles themselves we'll see how they coped with a level of fame that had never been experienced by anyone else in the world --&nbsp; and how you follow up that level of success in both music and film.&nbsp;</p>",
  "enclosure": "",
  "itunes:summary": "This week's episode, the first on the new host, looks at \"A Hard Day's Night\", and the making of the film that would define music cinema for decades to come. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tobacco Road\" by the Nashville Teens.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nAs usual, I have created a Mixcloud playlist containing every song heard in this episode (though not the Goon Show, Bridge Over the River Wye, or A Show Called Fred recordings, all of which would take up half an hour each)\n\n\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while writing this episode were: The Complete Beatles Chronicle by Mark Lewisohn,&nbsp;All The Songs: The Stories Behind Every Beatles Release by Jean-Michel Guesdon,&nbsp;And The Band Begins To Play: The Definitive Guide To The Songs of The Beatles&nbsp;by Steve Lambley,&nbsp;The Beatles By Ear by Kevin Moore,&nbsp;Revolution in the Head by Ian MacDonald, and&nbsp;The Beatles Anthology.\n\n\n\nFor material on the making of the film, I referred to A Hard Day's Night by Ray Morton, and Getting Away With It by Steven Soderbergh, a book which is in part a lengthy set of conversations between Soderbergh and Richard Lester.\n\n\n\nInformation on the Goons came from various sources, but mostly from The Goon Show Companion by Roger Wilmut and Jimmy Grafton.\n\n\n\nA Hard Day's Night is available on DVD, while the music is of course on this album.\n\n\n\nPatreon\n\n\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\n\n\nTranscript\n\n\n\nToday, we're going to look at a song that has one of the most striking opening chords of any song ever recorded, the title song to a film that was described on its release as \"the Citizen Kane of jukebox musicals\", and which captured the Beatles at the height of their early success. We're going to look at how Beatlemania hit America, and at how the Beatles went from being merely a very popular pop group to being a cultural phenomenon that changed the world. And most importantly, we're going to look at how they changed how music is portrayed on screen forever. We're going to look at \"A Hard Day's Night\":\n\n\n\n[Excerpt: The Beatles, \"A Hard Day's Night\"]\n\n\n\nThe sixteenth of January, 1964, seemed at first to be the first misstep in the Beatles' career. After their run of Christmas shows, they'd travelled to Paris to play the Olympia -- the same venue where, a little over two years earlier, John and Paul had seen Vince Taylor play and tried unsuccessfully to blag their own way on to the stage.&nbsp;\n\n\n\nThis time, they were topping the bill, for the first of eighteen nights in a row -- or at least they were equally billed with Sylvie Vartan and Trini Lopez, with none of the promotional material actually saying who was highest billed. But they went down something like a lead balloon, with the audience, mostly made up of VIPs there for opening night, not responding to them, and with their amps failing three times during the show (George Harrison apparently suspected sabotage). It was the first time in almost three years that they'd faced an unappreciative audience, and they were apparently despondent after the show.\n\n\n\nThey were despondent, at least, until they got a telegram after the show, giving them the good news -- \"I Want To Hold Your Hand\" had jumped up forty-three places on the Cashbox chart. They were number one in America. It was already planned, of course, that they would be going to the US in February to make three appearances on the Ed Sullivan Show, but now they knew they were big over there.\n\n\n\nA",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode, the first on the new host, looks at \"A Hard Day's Night\", and the making of the film that would define music cinema for decades to come. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Tobacco Road\" by the Nashville Teens.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nAs usual, I have created a Mixcloud playlist containing every song heard in this episode (though not the Goon Show, Bridge Over the River Wye, or A Show Called Fred recordings, all of which would take up half an hour each)\n\n\n\nI have read literally dozens of books on the Beatles, and used bits of information from many of them, but the ones I specifically referred to while w",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}