{
  "id": "yt:video:bqalB7NywqU",
  "yt:videoId": "bqalB7NywqU",
  "yt:channelId": "UCMTk_R_Y49jvq-HQXDmKI0Q",
  "title": "What Happened To Club Penguin? The End Of A Childhood Gem | TRO (ft. Internet Historian)",
  "link": "",
  "author": {
    "name": "The Right Opinion",
    "uri": "https://www.youtube.com/channel/UCMTk_R_Y49jvq-HQXDmKI0Q"
  },
  "published": "2020-10-04T22:04:27+00:00",
  "updated": "2022-04-17T02:23:26+00:00",
  "media:group": {
    "media:title": "What Happened To Club Penguin? The End Of A Childhood Gem | TRO (ft. Internet Historian)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What Happened To Club Penguin? The End Of A Childhood Gem | TRO (ft. Internet Historian)\n\n0:00 - Intro\n8:56 - Disney\n15:46 - Cast Away\n23:19 - Rewritten\n31:17 - Online\n41:10 - End Of Days\n51:42 - The Fall Of Club Penguin\n\nToday, we are going back to the gaming corner of YouTube, because as I have proven time and time again, I am a gamer, and today we are looking at an online MMO which some would argue is unrivalled in the gamer spirit that it has fostered.\n\nNow, you may have suspected an undertone of irony there, but don’t be fooled my friends, because back in the golden days when The Right Opinion was a young lad, full of zest and zeal, there were three games which shaped his online experience: those being, Runescape, Neopets, and the topic of interest today: Club Penguin. \n\nI can’t remember which order I played them in exactly, though I could take an educated guess, but I still remember them fondly for being able to capture sentiments of wide-eyed wonder and imagination that seem far beyond my grasp these days, and I know this wasn’t just a personal experience, I’m sure many of you similarly reminisce to a time where such avenues felt like a genuine escape to a different world.\n\nHowever, as time has progressed, so have we, and such memories fade into the background of a distant past. Nonetheless, I find some consolation in the thought that if I ever wanted to attempt to emulate that escapism again, those sites are, as of right now, ready and waiting to welcome me home… well, all except Club Penguin.\n\nYes, Club Penguin, an abandoned abode. Their tragic demise seemed intangible to many, for a site which had once boasted over 200 million registered accounts, and 30 million active users, however, its last few years have been plagued by drama and conflict, eventually culminating in a rather cataclysmic fashion. \n\nFor those who are unfamiliar, Club Penguin was an online game in which your character could take the form of a penguin, and participate in various activities all over this online world, full of many other colourful fluffy characters controlled by very real people. As a child it taught you the ropes of online safety, and interpersonal friendship. It had some pretty fun games too, and for the young mind, Club Penguin helped prepare individuals for what the internet was going to throw at us, which is an ever more important learning curve in today’s society. Yet, in spite of its relevance, it no longer plays this part in the online sphere, and today, we’ll be finding out how that happened.\n\nHowever, to understand its end, we need to go back to the beginning, and maybe provide a little background for anyone who never had the privilege to roleplay online as a virtual bird, unless you’re one of those avians, of course. However, I think it’s time to bring in a friend. Now, if you’re familiar with today’s guest you may have recently seen me pull off a legendary voice performance on one of his newest videos.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}