{
  "title": "Episode 25: &#8220;Earth Angel&#8221; by the Penguins",
  "link": "https://500songs.com/podcast/episode-25-earth-angel-by-the-penguins/",
  "pubDate": "Tue, 26 Mar 2019 10:44:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=683",
  "description": "Welcome to episode twenty-five of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Earth Angel\" by the Penguins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-25-earth-angel/\"> a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information here comes from various articles on <a href=\"http://uncamarvy.com/\">Marv Goldberg's site</a>, which is an essential resource for 50s vocal group information.\n\nThe quotes from Dootsie Williams are from <a href=\"https://amzn.to/2CBH5pq\"><em>Upside Your Head!: Rhythm and Blues on Central Ave</em></a> by Johnny Otis.\n\nAnd <a href=\"https://amzn.to/2TAMS4e\">this CD</a> contains all the Penguins' releases up to the point that they became just a name for Cleve Duncan.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen you're dealing with music whose power lies in its simplicity, as early rock and roll's does, you end up with music that relies on a variety of formulae, and whose novelty relies on using those formulae in ever-so-slightly different ways.\n\nThis is not to say that such music can't be original -- but that its originality relies on using the formulae in original ways, rather than in doing something completely unexpected.\n\nAnd one of the ways in which early rock and roll was formulaic was in the choice of chord sequence. When writing a fifties rock and roll song, you basically had four choices for chord sequence, and those four choices would cover more than ninety percent of all records in the genre. There was the twelve-bar blues -- songs like \"Hound Dog\" or \"Roll Over Beethoven\" or \"Shake, Rattle, and Roll\" are all based around the twelve-bar blues. There's the variant eight-bar blues, which most of the R&B we've talked about uses -- that's not actually one chord sequence but a bunch of related ones.\n\nThen there's the three-chord trick, which is similar to the twelve bar blues but just cycles through the chords I IV V IV I IV V IV -- this is the chord sequence for \"La Bamba\" and \"Louie Louie\" and \"Twist and Shout\" and \"Hang On Sloopy\". And finally, there's the doo-wop chord sequence.\n\nThis is actually two very slightly different chord sequences -- I , minor sixth, minor second, fifth:\n\n[demonstrates on guitar]\n\nand I, minor sixth, fourth, fifth:\n\n[demonstrates on guitar]\n\nBut those two sequences are so similar that we'll just lump them both in under the single heading of \"the doo-wop chord sequence\" from now on. When I talk about that in future episodes, that's the chord sequence I mean.\n\nAnd that may be the most important chord sequence ever, just in terms of the number of songs which use it. It's the progression that lies behind thirties songs like \"Blue Moon\", and the version of \"Heart and Soul\" most people can play on the piano (the original song is slightly different), but it's also in \"Oliver's Army\" by Elvis Costello, \"Enola Gay\" by Orchestral Manoeuvres in the Dark, \"Million Reasons\" by Lady Gaga, \"I'm the One\" by DJ Khaled... whatever genre of music you like, you almost certainly know and love dozens of songs based on that progression. (And you almost certainly hate dozens more. It's also been used in a *lot* of big ballads that get overplayed to death, and if you're not the kind of person who likes those records, you might end up massively sick of them.)\n\n[Excerpt: \"Blue Moon\", Elvis Presley, going into \"I Will Always Love You\" by Dolly Parton, going into \"I'm the One\" by DJ Khaled]\n\nBut while it has been used in almost every genre of music, the reason why we call this progression the doo-wop progression is that it's behind almost every doo-wop song of the fifties and early sixties. \"Duke of Earl\", \"Why Do Fools Fall In Love\", \"In The Still of the Night\", \"Sh'boom\" -- it forms the basis of more hit records in that genre than I could name even if I spent the whole of this podcast naming them.\n\nAnd today we're going to talk about a song that cemented that sequence as the doo-wop standard, imitated by everyone, and which managed to become a massive hit despite containing almost nothing at all original.\n\nThe Penguins were a vocal group, that formed out of the maelstrom of vocal groups in LA in the fifties, in the scene around Central Ave.\n\nOne thing you'll notice when we talk about vocal groups, especially in LA, is that it gets very confusing very fast with all the different bands swapping members and taking each others' names. So for clarity, the Hollywood Flames, featuring Bobby Byrd, were different from the Famous Flames, who also featured Bobby Byrd, who wasn't the same Bobby Byrd as the Bobby Byrd who was a Hollywood Flame. And when we talk about bird groups, we're talking about groups named after birds, not groups featuring Bobby Byrd. And the two members of the Hollywood Flames who were previously in a bird group called the Flamingoes weren't in the bird group called the Flamingoes that people normally mean when they talk about the Flamingoes, they were in a different band called the Flamingoes that went on to become the Platters. Got that?\n\nI'm sorry. I'll now try to take you slowly through the convoluted history of the Penguins, in a way that will hopefully make sense to you. But if it doesn't, just remember, not what I actually just said, but how hard it was to follow. Even the sources I'm consulting for this, written by experts who've spent decades trying to figure out who was in what band, often admit to being very unsure of their facts. Vocal groups on the West Coast in the US were far more fluid than on the East Coast, and membership could change from day to day and hour to hour.\n\nWe'll start with the Hollywood Flames. The Hollywood Flames initially formed in 1948, at one of the talent shows that were such important incubators of black musical talent in the 1950s. In this case, they all separately attended a talent show at the Largo Theatre in Los Angeles, where so many different singers turned up that instead of putting them all on separately, the theatre owner told them to split into a few vocal groups.\n\nShortly after forming, the Hollywood Flames started performing at the Barrelhouse Club, owned by Johnny Otis, and started recording under a variety of different names. Their first release was as \"The Flames\", and came out in January 1950:\n\n[excerpt: \"Please Tell Me Now\", the Flames]\n\nAnother track they recorded early on was this song by an aspiring songwriter named Murry Wilson:\n\n[excerpt \"Tabarin\", the Hollywood Flames]\n\nMurry Wilson would never have much success as a songwriter, but we'll be hearing about him a lot when we talk about his three sons, Brian, Carl, and Dennis, once we hit the 1960s and they form the Beach Boys.\n\nAt some point in late 1954, Curtis Williams, one of the Hollywood Flames, left the group. It seems likely, in fact, that the Hollywood Flames split up in late 1954 or early 55, and reformed later -- throughout 1955 there were a ton of records released featuring various vocalists from the Hollywood Flames in various combinations, under other band names, but in the crucial years of 1955 and 1956, when rock and roll broke out, the Hollywood Flames were not active, even though later on they would go on to have quite a few minor hits.\n\nBut while the band wasn't active, the individuals were, and Curtis Williams took with him a song he had been working on with another member, Gaynel Hodge. That song was called \"Earth Angel\", and when he bumped into his old friend Cleve Duncan, Williams asked Duncan if he'd help him with it. Duncan agreed, and they worked out an arrangement for the song, and decided to form a new vocal group, each bringing in one old friend from their respective high schools. Duncan brought in Dexter Tisby, while Williams brought in Bruce Tate. They decided to call themselves The Penguins, after the mascot on Kool cigarettes.\n\nWilliams and Tate had both attended Jefferson High School, and now is as good a time as any to talk about that school. Because Jefferson High School produced more great jazz and R&B musicians than you'd expect from a school ten times its size, or even a hundred. Etta James, Dexter Gordon, Art Farmer, Johnny \"Guitar\" Watson, Barry White, Richard Berry… The great jazz trumpeter Don Cherry actually got in trouble with his own school because he would play truant – in order to go and play with the music students at Jefferson High.\n\nAnd this abundance of talent was down to one good teacher -- the music teacher Samuel Browne, who along with Hazel Whittaker and Marjorie Bright was one of the first three black teachers to be employed to teach secondary school classes in LA.\n\nSeveral of the white faculty at Jefferson asked to be transferred when he started working at Jefferson High, but Browne put together an astonishing programme of music lessons at the school, teaching the children about the music that they cared about -- jazz and blues -- while also teaching them to play classical music. He would have masterclasses taught by popular musicians like Lionel Hampton or Nat \"King\" Cole, and art musicians like William Grant Still, the most important black composer and conductor in the classical world in the mid-twentieth century. It was, quite simply, the greatest musical education it was possible to have at that time, and certainly an education far beyond anything that most poor black kids of the time could dream of. Half the great black musicians in California in the forties and fifties learned in Browne's lessons.\n\nAnd that meant that there was a whole culture at Jefferson High of taking music seriously, which meant that even those who weren't Browne's star pupils knew it was possible for them to become successful singers and songwriters.\n\nJesse Belvin, who had been a classmate of Curtis Williams and Gaynell Hodge when they were in the Hollywood Flames, was himself a minor R&B star already, and he would soon become a major one. He helped Williams and Hodge with their song “Earth Angel”, and you can see the resemblance to his first hit; a song called \"Dream Girl\":\n\n[Excerpt: \"Dream Girl\", Jesse and Marvin]\n\nNote how much that melody line sounds like this bit of \"Earth Angel\":\n\n[Excerpt: \"Earth Angel\", the Penguins]\n\nBut that's not the only part of “Earth Angel” that was borrowed. There's the line \"Will you be mine?\", which had been the title of a hit record by the Swallows:\n\n[Excerpt: \"Will You Be Mine?\": The Swallows]\n\nThen there's this song by the Hollywood Flames, recorded when Williams was still in the band with Hodge:\n\n[Excerpt: The Hollywood Flames, \"I Know\"]\n\nThat sounds like a generic doo-wop song now, but that's because every generic doo-wop song patterned itself after \"Earth Angel\". It wasn't generic when the Hollywood Flames recorded that.\n\nAnd finally, the Hollywood Flames had, a while earlier, been asked to record a demo for a local songwriter, Jessie Mae Robinson. That song, \"I Went to Your Wedding\", later became a hit for the country singer Patti Page. Listen to the middle eight of that song:\n\n[Excerpt: \"I Went to Your Wedding\", Patti Page]\n\nNow listen to the middle eight of \"Earth Angel\":\n\n[Excerpt: \"Earth Angel\", the Penguins]\n\nThe song was a Frankenstein's monster, bolted together out of bits of spare parts from other songs, But like the monster, it took on a life of its own. And the spark that gave it life came from Dootsie Williams.\n\nDootsie Williams was the owner of Doo-Tone Records, and was a former musician, who had played trumpet in jazz and R&B bands for several years before realising that he could make more money by putting out records by other people.\n\nHis first commercial successes came not from music at all, but from comedy. Williams was a fan of the comedian Red Foxx, and wanted to put out albums of Foxx's live set. Foxx initially refused, because he thought that if he recorded anything then people wouldn't pay to come and see his live shows. However, he became short of cash and agreed to make a record of his then-current live set. Laff of the Party became a massive hit, and more or less started the trend for comedy albums:\n\n[excerpt: Red Foxx: Laff of the Party]\n\nWilliams wasn't, primarily, a record-company owner, though. He was like Sam Phillips -- someone who provided recording services -- but his recordings were songwriters' demos, and so meant to be for professionals, unlike the amateurs Phillips recorded.\n\nThe Penguins would record some of those demos for him, performing the songs for the songwriters who couldn't sing themselves, and as he put it \"I had the Penguins doing some vocals and they begged me 'Please record us so we can get a release and go on the road and get famous' and all that. They kept buggin' me 'til I said, 'Okay, what have you got?'\"\n\nTheir first single, credited to \"The Dootsie Williams Orchestra, with Vocal by The Penguins\" didn't even feature the Penguins on the other side. The song itself, \"There Ain't No News Today\", wasn't an original to the band, and it bore more than a slight resemblance to records like Wynonie Harris' \"Who Threw the Whisky in the Well?\"\n\n[Excerpt: The Dootsie Williams Orchestra with the Penguins, \"There Ain't No News Today\"]\n\nBut the \"what have you got?\" question had also been about songs. Williams was also a music publisher, and he was interested in finding songs he could exploit, not just recordings. As he put it, talking to Johnny Otis:\n\n\"They said, 'We got a song called 'Earth Angel' and a song called 'Hey Senorita'.' Of course, 'Earth Angel' was all messed up, you know how they come to you. So I straightened it out here and straightened it out there, and doggone, it sounded pretty good.\"\n\n\"Earth Angel\" was not even intended to be an A-side, originally. It was tossed off as a demo, and a demo for what was expected to be a B-side. The intended A-side was \"Hey Senorita\":\n\n[excerpt: The Penguins, \"Hey Senorita\"]\n\nBoth tracks were only meant to be demos, not the finished recordings, and several takes had to be scrapped because of a neighbour's dog barking.\n\nBut almost straight away, it became obvious that there was something special about \"Earth Angel\". Dootsie Williams took the demo recording to Dolphin's of Hollywood, the most important R&B record shop on the West Coast.\n\nWe've talked about Dolphin's last episode, but as a reminder, as well as being a record shop and the headquarters of a record label, Dolphin's also broadcast R&B radio shows from the shop. And Dolphin's radio station and record shop were aimed, not at the black adult buyers of R&B generally, but at teenagers.\n\nAnd this is something that needs to be noted about \"Earth Angel\" -- it's a song where the emphasis is definitely on the \"Angel\" rather than on the \"Earth\". Most R&B songs at the time were rooted in the real world -- they were aimed at adults and had adult concerns like sex, or paying the rent, or your partner cheating on you, or your partner cheating on you because you couldn't pay the rent and so now you had no-one to have sex with. There were, of course, other topics covered, and we've talked about many of them, but the presumed audience was someone who had real problems in their life -- and who therefore also needed escapist music to give them some relief from their problems.\n\nOn the other hand, the romance being dealt with in \"Earth Angel\" is one that is absolutely based in teenage romantic idealisations rather than in anything like real world relationships.\n\n(This is, incidentally, one of the ways in which the song resembles \"Dream Girl\", which again is about a fantasy of a woman rather than about a real woman).\n\nThe girl in the song only exists in her effects on the male singer -- she's not described physically, or in terms of her personality, only in the emotional effect she has on the vocalist.\n\nBut this non-specificity works well for this kind of song, as it allows the listener to project the song onto their own crush without having to deal with inconvenient differences in detail -- and as the song is about longing for someone, rather than being in a relationship with someone, it's likely that many of the adolescents who found themselves moved by the song knew almost as little about their crush as they did about the character in the song.\n\nThe DJ who was on the air when Dootsie Williams showed up was Dick \"Huggy Boy\" Hugg, possibly the most popular DJ on the station. Huggy Boy played \"Earth Angel\" and \"Hey Senorita\", and requests started to come in for the songs almost straight away. Williams didn't want to waste time rerecording the songs when they'd gone down so well, and released it as the final record.\n\nOf course, as with all black records at this point in time, the big question was which white people would have the bigger hit with it? Would Georgia Gibbs get in with a bland white cover, or would it be Pat Boone? As it turns out, it was the Crew Cuts, who went to number one (or number three, I've seen different reports in different sources) on the pop charts with their version.\n\nAfter \"Sh'Boom\", the Crew Cuts had briefly tried to go back to barbershop harmony with a version of \"The Whiffenpoof Song\", but when that did nothing, in quick succession they knocked out hit, bland, covers first of \"Earth Angel\" and then of \"Ko Ko Mo\", which restored them to the top of the charts at the expense of the black originals.\n\n[excerpt: The Crew Cuts, \"Earth Angel\"]\n\nBut it shows how times were slowly changing that the Penguins' version also made the top ten on the pop charts, as Johnny Ace had before them. The practice of white artists covering black artists' songs would continue for a while, but within a couple of years it would have more-or-less disappeared, only to come back in a new form in the sixties.\n\nThe Penguins recorded a follow-up single, \"Ookey Ook\":\n\n[excerpt: the Penguins, \"Ookey Ook\"]\n\nThat, however, wasn't a hit. Dootsie Williams had been refusing to pay the band any advances on royalties, even as \"Earth Angel\" rose to number one on the R&B charts, and the Penguins were annoyed enough that they signed with Buck Ram, the songwriter and manager who also looked after the Platters, and got a new contract with Mercury. Williams warned them that they wouldn't see a penny from him if they broke their contract, but they reasoned that they weren't seeing any money from him anyway, and so decided it didn't matter. They'd be big stars on Mercury, after all. They went into the studio to do the same thing that Gene and Eunice had done, rerecording their two singles and the B-sides, although these recordings didn't end up getting released at the time.\n\nUnfortunately for the Penguins, they weren't really the band that Ram was interested in. Ram had used the Penguins' current success as a way to get a deal both for them *and* for the Platters, the group he really cared about. And once the Platters had a hit of their own -- a hit written by Buck Ram -- he stopped bothering with the Penguins. They made several records for Mercury, but with no lasting commercial success. And since they'd broken their contract with Dootone, they made no money at all from having sung \"Earth Angel”.\n\nAt the same time, the band started to fracture. Bruce Tate became mentally ill from the stress of fame, quit the band, and then killed someone in a hit-and-run accident while driving a stolen car. He was replaced by Randy Jones. Within a year Jones had left the band, as had Dexter Tisby. They returned a few months after that, and their replacements were sacked, but then Curtis Williams left to rejoin the Hollywood Flames, and Teddy Harper, who had been Dexter Tisby's replacement, replaced Williams. The Penguins had basically become Cleve Duncan, who had sung lead on \"Earth Angel\", and any selection of three other singers, and at one point there seem to have been two rival sets of Penguins recording.\n\nBy 1963, Dexter Tisby, Randy Jones, and Teddy Harper were touring together as a fake version of the Coasters, along with Cornell Gunter who was actually a member of the Coasters who'd split from the other three members of *his* group. You perhaps see now why I said that stuff at the beginning about the vocal group lineups being confusing.\n\nAt the same time, Cleve Duncan was singing with a whole other group of Penguins, recording a song that would never be a huge hit but would appear on many doo-wop compilations -- so many that it's as well known as many of the big hits:\n\n[excerpt: \"Memories of El Monte\", the Penguins]\n\nIt's fascinating to listen to that song, and to realise that by the very early sixties, pre-British Invasion, the doo-wop and rock-and-roll eras were *already* the subject of nostalgia records. Pop not only will eat itself, but it has been doing almost since its inception. We'll be talking about the co-writer of that song, Frank Zappa, a lot more when he starts making his own records.\n\nAnd meanwhile, there were lawsuits to contend with. \"Earth Angel\" had originally been credited to Curtis WIlliams and Gaynel Hodge, but they'd been helped out in the early stages of writing it by Jesse Belvin, and then Cleve Duncan had adjusted the melody, and Dootsie Williams claimed to have helped them fix up the song.\n\nBelvin had been drafted into the army when \"Earth Angel\" had hit, and when he got out he was broke, and he was persuaded by Dootsie Williams, who still seems to have held a grudge about the Penguins breaking their contract, to sue over the songwriting royalties. Belvin won sole credit in the lawsuit, and then signed over that sole credit to Dootsie Williams, so (according to Marv Goldberg) for a while Dootsie Williams was credited as the only writer.\n\nLuckily, for once, that injustice was eventually rectified. These days, thankfully, the writing credits are split between Curtis Williams, Jesse Belvin, and Gaynel Hodge, and in 2013 Hodge, the last surviving co-writer of the song, was given an award by BMI for the song having been played on the radio a million times, and Hodge and the estates of his co-writers receive royalties for its continued popularity.\n\nCurtis Williams and Bruce Tate both died in the 1970s. Jesse Belvin died earlier than that, but his story is for another podcast. Dexter Tisby seems to be still alive, as is Gaynell Hodge. And Cleve Duncan continued performing with various lineups of Penguins until his death in 2012, making a living as a performer from a song that sold twenty million copies but never paid its performers a penny. He always said that he was always happy to sing his hit, so long as the audiences were happy to hear it, and they always were.",
  "itunes:subtitle": "Welcome to episode twenty-five of A History of Rock Music in Five Hundred Songs. Today were looking at Earth Angel by the Penguins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs alwa",
  "itunes:keywords": "bird groups,Buck Ram,Cleve Duncan,Cornell Gunter,Curtis Williams,doo wop,Dootsie Williams,Gaynel Hodge,Hollywood Flames,Jefferson High School,Jesse and Marvin,Jesse Belvin,John Dolphin,Johnny Otis,lawsuits,Mercury Records,Murry Wilson,racism,Samuel Browne,The Coasters,The Crew Cuts,The Penguins,vocal groups,white cover versions",
  "itunes:episodeType": "full",
  "itunes:episode": 25,
  "content:encoded": "Welcome to episode twenty-five of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at \"Earth Angel\" by the Penguins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-25-earth-angel/\"> a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMuch of the information here comes from various articles on <a href=\"http://uncamarvy.com/\">Marv Goldberg's site</a>, which is an essential resource for 50s vocal group information.\n\nThe quotes from Dootsie Williams are from <a href=\"https://amzn.to/2CBH5pq\"><em>Upside Your Head!: Rhythm and Blues on Central Ave</em></a> by Johnny Otis.\n\nAnd <a href=\"https://amzn.to/2TAMS4e\">this CD</a> contains all the Penguins' releases up to the point that they became just a name for Cleve Duncan.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nWhen you're dealing with music whose power lies in its simplicity, as early rock and roll's does, you end up with music that relies on a variety of formulae, and whose novelty relies on using those formulae in ever-so-slightly different ways.\n\nThis is not to say that such music can't be original -- but that its originality relies on using the formulae in original ways, rather than in doing something completely unexpected.\n\nAnd one of the ways in which early rock and roll was formulaic was in the choice of chord sequence. When writing a fifties rock and roll song, you basically had four choices for chord sequence, and those four choices would cover more than ninety percent of all records in the genre. There was the twelve-bar blues -- songs like \"Hound Dog\" or \"Roll Over Beethoven\" or \"Shake, Rattle, and Roll\" are all based around the twelve-bar blues. There's the variant eight-bar blues, which most of the R&B we've talked about uses -- that's not actually one chord sequence but a bunch of related ones.\n\nThen there's the three-chord trick, which is similar to the twelve bar blues but just cycles through the chords I IV V IV I IV V IV -- this is the chord sequence for \"La Bamba\" and \"Louie Louie\" and \"Twist and Shout\" and \"Hang On Sloopy\". And finally, there's the doo-wop chord sequence.\n\nThis is actually two very slightly different chord sequences -- I , minor sixth, minor second, fifth:\n\n[demonstrates on guitar]\n\nand I, minor sixth, fourth, fifth:\n\n[demonstrates on guitar]\n\nBut those two sequences are so similar that we'll just lump them both in under the single heading of \"the doo-wop chord sequence\" from now on. When I talk about that in future episodes, that's the chord sequence I mean.\n\nAnd that may be the most important chord sequence ever, just in terms of the number of songs which use it. It's the progression that lies behind thirties songs like \"Blue Moon\", and the version of \"Heart and Soul\" most people can play on the piano (the original song is slightly different), but it's also in \"Oliver's Army\" by Elvis Costello, \"Enola Gay\" by Orchestral Manoeuvres in the Dark, \"Million Reasons\" by Lady Gaga, \"I'm the One\" by DJ Khaled... whatever genre of music you like, you almost certainly know and love dozens of songs based on that progression. (And you almost certainly hate dozens more. It's also been used in a *lot* of big ballads that get overplayed to death, and if you're not the kind of person who likes those records, you might end up massively sick of them.)\n\n[Excerpt: \"Blue Moon\", Elvis Presley, going into \"I Will Always Love You\" by Dolly Parton, going into \"I'm the One\" by DJ Khaled]\n\nBut while it has been used in almost every genre of music, the reason why we call this progression the doo-wop progression is that it's behind almost every doo-wop song of the fifties and early sixties. \"Duke of Earl\", \"Why Do Fools Fall In Love\", \"In The Still of the Night\", \"Sh'boom\" -- it forms the basis of more hit records in that genre than I could name even if I spent the whole of this podcast naming them.\n\nAnd today we're going to talk about a song that cemented that sequence as the doo-wop standard, imitated by everyone, and which managed to become a massive hit despite containing almost nothing at all original.\n\nThe Penguins were a vocal group, that formed out of the maelstrom of vocal groups in LA in the fifties, in the scene around Central Ave.\n\nOne thing you'll notice when we talk about vocal groups, especially in LA, is that it gets very confusing very fast with all the different bands swapping members and taking each others' names. So for clarity, the Hollywood Flames, featuring Bobby Byrd, were different from the Famous Flames, who also featured Bobby Byrd, who wasn't the same Bobby Byrd as the Bobby Byrd who was a Hollywood Flame. And when we talk about bird groups, we're talking about groups named after birds, not groups featuring Bobby Byrd. And the two members of the Hollywood Flames who were previously in a bird group called the Flamingoes weren't in the bird group called the Flamingoes that people normally mean when they talk about the Flamingoes, they were in a different band called the Flamingoes that went on to become the Platters. Got that?\n\nI'm sorry. I'll now try to take you slowly through the convoluted history of the Penguins, in a way that will hopefully make sense to you. But if it doesn't, just remember, not what I actually just said, but how hard it was to follow. Even the sources I'm consulting for this, written by experts who've spent decades trying to figure out who was in what band, often admit to being very unsure of their facts. Vocal groups on the West Coast in the US were far more fluid than on the East Coast, and membership could change from day to day and hour to hour.\n\nWe'll start with the Hollywood Flames. The Hollywood Flames initially formed in 1948, at one of the talent shows that were such important incubators of black musical talent in the 1950s. In this case, they all separately attended a talent show at the Largo Theatre in Los Angeles, where so many different singers turned up that instead of putting them all on separately, the theatre owner told them to split into a few vocal groups.\n\nShortly after forming, the Hollywood Flames started performing at the Barrelhouse Club, owned by Johnny Otis, and started recording under a variety of different names. Their first release was as \"The Flames\", and came out in January 1950:\n\n[excerpt: \"Please Tell Me Now\", the Flames]\n\nAnother track they recorded early on was this song by an aspiring songwriter named Murry Wilson:\n\n[excerpt \"Tabarin\", the Hollywood Flames]\n\nMurry Wilson would never have much success as a songwriter, but we'll be hearing about him a lot when we talk about his three sons, Brian, Carl, and Dennis, once we hit the 1960s and they form the Beach Boys.\n\nAt some point in late 1954, Curtis Williams, one of the Hollywood Flames, left the group. It seems likely, in fact, that the Hollywood Flames split up in late 1954 or early 55, and reformed later -- throughout 1955 there were a ton of records released featuring various vocalists from the Hollywood Flames in various combinations, under other band names, but in the crucial years of 1955 and 1956, when rock and roll broke out, the Hollywood Flames were not active, even though later on they would go on to have quite a few minor hits.\n\nBut while the band wasn't active, the individuals were, and Curtis Williams took with him a song he had been working on with another member, Gaynel Hodge. That song was called \"Earth Angel\", and when he bumped into his old friend Cleve Duncan, Williams asked Duncan if he'd help him with it. Duncan agreed, and they worked out an arrangement for the song, and decided to form a new vocal group, each bringing in one old friend from their respective high schools. Duncan brought in Dexter Tisby, while Williams brought in Bruce Tate. They decided to call themselves The Penguins, after the mascot on Kool cigarettes.\n\nWilliams and Tate had both attended Jefferson High School, and now is as good a time as any to talk about that school. Because Jefferson High School produced more great jazz and R&B musicians than you'd expect from a school ten times its size, or even a hundred. Etta James, Dexter Gordon, Art Farmer, Johnny \"Guitar\" Watson, Barry White, Richard Berry… The great jazz trumpeter Don Cherry actually got in trouble with his own school because he would play truant – in order to go and play with the music students at Jefferson High.\n\nAnd this abundance of talent was down to one good teacher -- the music teacher Samuel Browne, who along with Hazel Whittaker and Marjorie Bright was one of the first three black teachers to be employed to teach secondary school classes in LA.\n\nSeveral of the white faculty at Jefferson asked to be transferred when he started working at Jefferson High, but Browne put together an astonishing programme of music lessons at the school, teaching the children about the music that they cared about -- jazz and blues -- while also teaching them to play classical music. He would have masterclasses taught by popular musicians like Lionel Hampton or Nat \"King\" Cole, and art musicians like William Grant Still, the most important black composer and conductor in the classical world in the mid-twentieth century. It was, quite simply, the greatest musical education it was possible to have at that time, and certainly an education far beyond anything that most poor black kids of the time could dream of. Half the great black musicians in California in the forties and fifties learned in Browne's lessons.\n\nAnd that meant that there was a whole culture at Jefferson High of taking music seriously, which meant that even those who weren't Browne's star pupils knew it was possible for them to become successful singers and songwriters.\n\nJesse Belvin, who had been a classmate of Curtis Williams and Gaynell Hodge when they were in the Hollywood Flames, was himself a minor R&B star already, and he would soon become a major one. He helped Williams and Hodge with their song “Earth Angel”, and you can see the resemblance to his first hit; a song called \"Dream Girl\":\n\n[Excerpt: \"Dream Girl\", Jesse and Marvin]\n\nNote how much that melody line sounds like this bit of \"Earth Angel\":\n\n[Excerpt: \"Earth Angel\", the Penguins]\n\nBut that's not the only part of “Earth Angel” that was borrowed. There's the line \"Will you be mine?\", which had been the title of a hit record by the Swallows:\n\n[Excerpt: \"Will You Be Mine?\": The Swallows]\n\nThen there's this song by the Hollywood Flames, recorded when Williams was still in the band with Hodge:\n\n[Excerpt: The Hollywood Flames, \"I Know\"]\n\nThat sounds like a generic doo-wop song now, but that's because every generic doo-wop song patterned itself after \"Earth Angel\". It wasn't generic when the Hollywood Flames recorded that.\n\nAnd finally, the Hollywood Flames had, a while earlier, been asked to record a demo for a local songwriter, Jessie Mae Robinson. That song, \"I Went to Your Wedding\", later became a hit for the country singer Patti Page. Listen to the middle eight of that song:\n\n[Excerpt: \"I Went to Your Wedding\", Patti Page]\n\nNow listen to the middle eight of \"Earth Angel\":\n\n[Excerpt: \"Earth Angel\", the Penguins]\n\nThe song was a Frankenstein's monster, bolted together out of bits of spare parts from other songs, But like the monster, it took on a life of its own. And the spark that gave it life came from Dootsie Williams.\n\nDootsie Williams was the owner of Doo-Tone Records, and was a former musician, who had played trumpet in jazz and R&B bands for several years before realising that he could make more money by putting out records by other people.\n\nHis first commercial successes came not from music at all, but from comedy. Williams was a fan of the comedian Red Foxx, and wanted to put out albums of Foxx's live set. Foxx initially refused, because he thought that if he recorded anything then people wouldn't pay to come and see his live shows. However, he became short of cash and agreed to make a record of his then-current live set. Laff of the Party became a massive hit, and more or less started the trend for comedy albums:\n\n[excerpt: Red Foxx: Laff of the Party]\n\nWilliams wasn't, primarily, a record-company owner, though. He was like Sam Phillips -- someone who provided recording services -- but his recordings were songwriters' demos, and so meant to be for professionals, unlike the amateurs Phillips recorded.\n\nThe Penguins would record some of those demos for him, performing the songs for the songwriters who couldn't sing themselves, and as he put it \"I had the Penguins doing some vocals and they begged me 'Please record us so we can get a release and go on the road and get famous' and all that. They kept buggin' me 'til I said, 'Okay, what have you got?'\"\n\nTheir first single, credited to \"The Dootsie Williams Orchestra, with Vocal by The Penguins\" didn't even feature the Penguins on the other side. The song itself, \"There Ain't No News Today\", wasn't an original to the band, and it bore more than a slight resemblance to records like Wynonie Harris' \"Who Threw the Whisky in the Well?\"\n\n[Excerpt: The Dootsie Williams Orchestra with the Penguins, \"There Ain't No News Today\"]\n\nBut the \"what have you got?\" question had also been about songs. Williams was also a music publisher, and he was interested in finding songs he could exploit, not just recordings. As he put it, talking to Johnny Otis:\n\n\"They said, 'We got a song called 'Earth Angel' and a song called 'Hey Senorita'.' Of course, 'Earth Angel' was all messed up, you know how they come to you. So I straightened it out here and straightened it out there, and doggone, it sounded pretty good.\"\n\n\"Earth Angel\" was not even intended to be an A-side, originally. It was tossed off as a demo, and a demo for what was expected to be a B-side. The intended A-side was \"Hey Senorita\":\n\n[excerpt: The Penguins, \"Hey Senorita\"]\n\nBoth tracks were only meant to be demos, not the finished recordings, and several takes had to be scrapped because of a neighbour's dog barking.\n\nBut almost straight away, it became obvious that there was something special about \"Earth Angel\". Dootsie Williams took the demo recording to Dolphin's of Hollywood, the most important R&B record shop on the West Coast.\n\nWe've talked about Dolphin's last episode, but as a reminder, as well as being a record shop and the headquarters of a record label, Dolphin's also broadcast R&B radio shows from the shop. And Dolphin's radio station and record shop were aimed, not at the black adult buyers of R&B generally, but at teenagers.\n\nAnd this is something that needs to be noted about \"Earth Angel\" -- it's a song where the emphasis is definitely on the \"Angel\" rather than on the \"Earth\". Most R&B songs at the time were rooted in the real world -- they were aimed at adults and had adult concerns like sex, or paying the rent, or your partner cheating on you, or your partner cheating on you because you couldn't pay the rent and so now you had no-one to have sex with. There were, of course, other topics covered, and we've talked about many of them, but the presumed audience was someone who had real problems in their life -- and who therefore also needed escapist music to give them some relief from their problems.\n\nOn the other hand, the romance being dealt with in \"Earth Angel\" is one that is absolutely based in teenage romantic idealisations rather than in anything like real world relationships.\n\n(This is, incidentally, one of the ways in which the song resembles \"Dream Girl\", which again is about a fantasy of a woman rather than about a real woman).\n\nThe girl in the song only exists in her effects on the male singer -- she's not described physically, or in terms of her personality, only in the emotional effect she has on the vocalist.\n\nBut this non-specificity works well for this kind of song, as it allows the listener to project the song onto their own crush without having to deal with inconvenient differences in detail -- and as the song is about longing for someone, rather than being in a relationship with someone, it's likely that many of the adolescents who found themselves moved by the song knew almost as little about their crush as they did about the character in the song.\n\nThe DJ who was on the air when Dootsie Williams showed up was Dick \"Huggy Boy\" Hugg, possibly the most popular DJ on the station. Huggy Boy played \"Earth Angel\" and \"Hey Senorita\", and requests started to come in for the songs almost straight away. Williams didn't want to waste time rerecording the songs when they'd gone down so well, and released it as the final record.\n\nOf course, as with all black records at this point in time, the big question was which white people would have the bigger hit with it? Would Georgia Gibbs get in with a bland white cover, or would it be Pat Boone? As it turns out, it was the Crew Cuts, who went to number one (or number three, I've seen different reports in different sources) on the pop charts with their version.\n\nAfter \"Sh'Boom\", the Crew Cuts had briefly tried to go back to barbershop harmony with a version of \"The Whiffenpoof Song\", but when that did nothing, in quick succession they knocked out hit, bland, covers first of \"Earth Angel\" and then of \"Ko Ko Mo\", which restored them to the top of the charts at the expense of the black originals.\n\n[excerpt: The Crew Cuts, \"Earth Angel\"]\n\nBut it shows how times were slowly changing that the Penguins' version also made the top ten on the pop charts, as Johnny Ace had before them. The practice of white artists covering black artists' songs would continue for a while, but within a couple of years it would have more-or-less disappeared, only to come back in a new form in the sixties.\n\nThe Penguins recorded a follow-up single, \"Ookey Ook\":\n\n[excerpt: the Penguins, \"Ookey Ook\"]\n\nThat, however, wasn't a hit. Dootsie Williams had been refusing to pay the band any advances on royalties, even as \"Earth Angel\" rose to number one on the R&B charts, and the Penguins were annoyed enough that they signed with Buck Ram, the songwriter and manager who also looked after the Platters, and got a new contract with Mercury. Williams warned them that they wouldn't see a penny from him if they broke their contract, but they reasoned that they weren't seeing any money from him anyway, and so decided it didn't matter. They'd be big stars on Mercury, after all. They went into the studio to do the same thing that Gene and Eunice had done, rerecording their two singles and the B-sides, although these recordings didn't end up getting released at the time.\n\nUnfortunately for the Penguins, they weren't really the band that Ram was interested in. Ram had used the Penguins' current success as a way to get a deal both for them *and* for the Platters, the group he really cared about. And once the Platters had a hit of their own -- a hit written by Buck Ram -- he stopped bothering with the Penguins. They made several records for Mercury, but with no lasting commercial success. And since they'd broken their contract with Dootone, they made no money at all from having sung \"Earth Angel”.\n\nAt the same time, the band started to fracture. Bruce Tate became mentally ill from the stress of fame, quit the band, and then killed someone in a hit-and-run accident while driving a stolen car. He was replaced by Randy Jones. Within a year Jones had left the band, as had Dexter Tisby. They returned a few months after that, and their replacements were sacked, but then Curtis Williams left to rejoin the Hollywood Flames, and Teddy Harper, who had been Dexter Tisby's replacement, replaced Williams. The Penguins had basically become Cleve Duncan, who had sung lead on \"Earth Angel\", and any selection of three other singers, and at one point there seem to have been two rival sets of Penguins recording.\n\nBy 1963, Dexter Tisby, Randy Jones, and Teddy Harper were touring together as a fake version of the Coasters, along with Cornell Gunter who was actually a member of the Coasters who'd split from the other three members of *his* group. You perhaps see now why I said that stuff at the beginning about the vocal group lineups being confusing.\n\nAt the same time, Cleve Duncan was singing with a whole other group of Penguins, recording a song that would never be a huge hit but would appear on many doo-wop compilations -- so many that it's as well known as many of the big hits:\n\n[excerpt: \"Memories of El Monte\", the Penguins]\n\nIt's fascinating to listen to that song, and to realise that by the very early sixties, pre-British Invasion, the doo-wop and rock-and-roll eras were *already* the subject of nostalgia records. Pop not only will eat itself, but it has been doing almost since its inception. We'll be talking about the co-writer of that song, Frank Zappa, a lot more when he starts making his own records.\n\nAnd meanwhile, there were lawsuits to contend with. \"Earth Angel\" had originally been credited to Curtis WIlliams and Gaynel Hodge, but they'd been helped out in the early stages of writing it by Jesse Belvin, and then Cleve Duncan had adjusted the melody, and Dootsie Williams claimed to have helped them fix up the song.\n\nBelvin had been drafted into the army when \"Earth Angel\" had hit, and when he got out he was broke, and he was persuaded by Dootsie Williams, who still seems to have held a grudge about the Penguins breaking their contract, to sue over the songwriting royalties. Belvin won sole credit in the lawsuit, and then signed over that sole credit to Dootsie Williams, so (according to Marv Goldberg) for a while Dootsie Williams was credited as the only writer.\n\nLuckily, for once, that injustice was eventually rectified. These days, thankfully, the writing credits are split between Curtis Williams, Jesse Belvin, and Gaynel Hodge, and in 2013 Hodge, the last surviving co-writer of the song, was given an award by BMI for the song having been played on the radio a million times, and Hodge and the estates of his co-writers receive royalties for its continued popularity.\n\nCurtis Williams and Bruce Tate both died in the 1970s. Jesse Belvin died earlier than that, but his story is for another podcast. Dexter Tisby seems to be still alive, as is Gaynell Hodge. And Cleve Duncan continued performing with various lineups of Penguins until his death in 2012, making a living as a performer from a song that sold twenty million copies but never paid its performers a penny. He always said that he was always happy to sing his hit, so long as the audiences were happy to hear it, and they always were.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode twenty-five of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Earth Angel\" by the Penguins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMuch of the information here comes from various articles on Marv Goldberg's site, which is an essential resource for 50s vocal group information.\n\nThe quotes from Dootsie Williams are from Upside Your Head!: Rhythm and Blues on Central Ave by Johnny Otis.\n\nAnd this CD contains all the Penguins' releases up to the point that they became just a name for Cleve Duncan.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWhen you're dealing with music whose power lies in its simplicity, as early rock and roll's does, you end up with music that relies on a variety of formulae, and whose novelty relies on using those formulae in ever-so-slightly different ways.\n\nThis is not to say that such music can't be original -- but that its originality relies on using the formulae in original ways, rather than in doing something completely unexpected.\n\nAnd one of the ways in which early rock and roll was formulaic was in the choice of chord sequence. When writing a fifties rock and roll song, you basically had four choices for chord sequence, and those four choices would cover more than ninety percent of all records in the genre. There was the twelve-bar blues -- songs like \"Hound Dog\" or \"Roll Over Beethoven\" or \"Shake, Rattle, and Roll\" are all based around the twelve-bar blues. There's the variant eight-bar blues, which most of the R&B we've talked about uses -- that's not actually one chord sequence but a bunch of related ones.\n\nThen there's the three-chord trick, which is similar to the twelve bar blues but just cycles through the chords I IV V IV I IV V IV -- this is the chord sequence for \"La Bamba\" and \"Louie Louie\" and \"Twist and Shout\" and \"Hang On Sloopy\". And finally, there's the doo-wop chord sequence.\n\nThis is actually two very slightly different chord sequences -- I , minor sixth, minor second, fifth:\n\n[demonstrates on guitar]\n\nand I, minor sixth, fourth, fifth:\n\n[demonstrates on guitar]\n\nBut those two sequences are so similar that we'll just lump them both in under the single heading of \"the doo-wop chord sequence\" from now on. When I talk about that in future episodes, that's the chord sequence I mean.\n\nAnd that may be the most important chord sequence ever, just in terms of the number of songs which use it. It's the progression that lies behind thirties songs like \"Blue Moon\", and the version of \"Heart and Soul\" most people can play on the piano (the original song is slightly different), but it's also in \"Oliver's Army\" by Elvis Costello, \"Enola Gay\" by Orchestral Manoeuvres in the Dark, \"Million Reasons\" by Lady Gaga, \"I'm the One\" by DJ Khaled... whatever genre of music you like, you almost certainly know and love dozens of songs based on that progression. (And you almost certainly hate dozens more. It's also been used in a *lot* of big ballads that get overplayed to death, and if you're not the kind of person who likes those records, you might end up massively sick of them.)\n\n[Excerpt: \"Blue Moon\", Elvis Presley, going into \"I Will Always Love You\" by Dolly Parton, going into \"I'm the One\" by DJ Khaled]\n\nBut while it has been used in almost every genre of music, the reason why we call this progression the doo-wop progression is that it's behind almost every doo-wop song of the fifties and early sixties. \"Duke of Earl\", \"Why Do Fools Fall In Love\", \"In The Still of the Night\", \"Sh'boom\" -- it forms the basis of more hit records in that genre than I could name even if I spent the whole of this podcast naming them.\n\nAnd today we're going to talk about a song that cemented that sequence as the doo-wop standar",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode twenty-five of A History of Rock Music in Five Hundred Songs. Today we're looking at \"Earth Angel\" by the Penguins. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMuch of the information here comes from various articles on Marv Goldberg's site, which is an essential resource for 50s vocal group information.\n\nThe quotes from Dootsie Williams are from Upside Your Head!: Rhythm and Blues on Central Ave by Johnny Otis.\n\nAnd this CD contains all the Penguins' releases up to the point that they became just a name for Cleve Duncan.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWhen you're dealing with music whose power lies in its simplicity, as early rock and roll's does, you end up with music that relies on a variety of formulae,",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}