{
  "title": "45: The Wild and Wonderful Whites of West Virginia",
  "link": "https://audioboom.com/posts/6874528",
  "itunes:episode": 45,
  "itunes:title": "The Wild and Wonderful Whites of West Virginia",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3940,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>You guys, Gillian HATED this one, so, you know, buckle up this one is frikin' great. <br>\n<br>\n\n</div>\n<div>Meet the White family--the most notorious pill popping, gun slinging, bad-tattoo-giving-while-hammered-in-the-kitchen, clan in all of West Virginia. For one year, the hot dummies behind MTV's \"Jackass\" followed them around with cameras to see what would happen. And Guess What Happens???!!!......really nothing. But somehow it's awesome. Drugs are done, dances are tapped (which should be super gay and fabulous, but definitely isn't), kids are removed by child protective services (thank God), attempted murders are admitted to, people go to jail, and one pair of sisters have an EPIC EXPERIENCE at the Taco Bell drive thru. This one is not to be missed.<br>\n<br>\n\n</div>\n<div>ALSO! Check out <a href=\"https://www.patreon.com/TrueCrimeObsessed\">our Patreon</a> for our weekly bonus content! We're covering \"Serial\" episode-by-episode. We're currently up to Episode 7 and honestly we're pretty over Sarah Koenig and her self righteous nonsense. But in this episode, we meet Diedre Enright of The Innocence Project AND THERE'S FINALLY AN ADULT IN THE ROOM. Via our Patreon feed, you can also check out our weekly extended outtakes (the ones from this week are epic), as well as our other Full Bonus Episodes, and mini-episodes. <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Subscribe right now and immediately get like 22 new episodes in your Patreon podcast feed.</a>\n</div>\n",
  "pubDate": "Tue, 29 May 2018 04:01:00 +0000",
  "guid": "tag:audioboom.com,2018-05-29:/posts/6874528",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}