{
  "title": "Joy Behar's Mask Is NEVER Coming Off!",
  "itunes:title": "Joy Behar's Mask Is NEVER Coming Off!",
  "pubDate": "Sat, 19 Feb 2022 04:18:32 +0000",
  "guid": "ecf4b369-c7a1-4c34-bd73-6098aa6c92df",
  "link": "https://thejimmydoreshow.libsyn.com/joy-behars-mask-is-never-coming-off",
  "itunes:image": "",
  "description": "<p>The View host Joy Behar has revealed that she plans to continue wearing a mask in public and indoors whenever away from home for, well, the rest of her life, it seems. So that's it, just masked up forever for Joy Behar.</p> <p>Plus segments on Canadian Prime Minister Justin Trudeau telling a Jewish MP she's supporting Nazis and the hacker who admitted to exposing the names of donors to the fundraising campaign for Canadian truckers.</p> <p>Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from Jake Tapper and Joe Biden!</p>",
  "content:encoded": "<p>The View host Joy Behar has revealed that she plans to continue wearing a mask in public and indoors whenever away from home for, well, the rest of her life, it seems. So that's it, just masked up forever for Joy Behar.</p> <p>Plus segments on Canadian Prime Minister Justin Trudeau telling a Jewish MP she's supporting Nazis and the hacker who admitted to exposing the names of donors to the fundraising campaign for Canadian truckers.</p> <p>Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from Jake Tapper and Joe Biden!</p>",
  "enclosure": "",
  "itunes:duration": "01:06:29",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The View host Joy Behar has revealed that she plans to continue wearing a mask in public and indoors whenever away from home for, well, the rest of her life, it seems. So that's it, just masked up forever for Joy Behar. Plus segments on Canadian Prime...",
  "itunes:episodeType": "full",
  "itunes:summary": "The View host Joy Behar has revealed that she plans to continue wearing a mask in public and indoors whenever away from home for, well, the rest of her life, it seems. So that's it, just masked up forever for Joy Behar. Plus segments on Canadian Prime Minister Justin Trudeau telling a Jewish MP she's supporting Nazis and the hacker who admitted to exposing the names of donors to the fundraising campaign for Canadian truckers. Also featuring Stef Zamorano, Kurt Metzger, Jackson Hinkle and Mike MacRae! And phone calls from Jake Tapper and Joe Biden!"
}