{
  "title": "BONUS: Question and Answer Episode 1",
  "link": "https://500songs.com/podcast/bonus-question-and-answer-episode-1/",
  "pubDate": "Mon, 23 Sep 2019 03:58:20 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/bonus-question-and-answer-episode-1/",
  "description": "This week's episode of <em>A History of Rock Music in Five Hundred Songs</em> is the first of two bonus episodes answering listener questions at the end of the first year of the podcast.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-supplemental-for-bonus-qa/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nPatreon backers can ask questions for next episode <a href=\"https://www.patreon.com/posts/q-post-29979005\">at this link</a>.\n\nBooks mentioned -- <a href=\"https://amzn.to/2LFsfD8\">Last Train to Memphis</a> by Peter Guralnick, <a href=\"https://amzn.to/2NsiM4k\">Before Elvis</a> by Larry Birnbaum, <a href=\"https://amzn.to/2Qnsjfb\">Roots, Radicals and Rockers</a> by Billy Bragg, <a href=\"https://amzn.to/2QmAgRW\">Honkers and Shouters</a> by Arnold Shaw.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my <a href=\"https://www.patreon.com/join/AndrewHickey\">backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nHello, and welcome to the first of our two-part question and answer session.\n\nFor those who didn't hear the little admin podcast I did last week, this week and next week are not regular episodes of the podcast -- I'm taking two weeks out to get the book version of the first fifty episodes edited and published, and to get a bit of a backlog in writing future episodes. I'm planning on doing this every year from now on, and doing it this way will mean that the podcast will take exactly ten years, rather than the nine years and eight months it would otherwise take,\n\nBut to fill in the gaps while you wait, I asked for any questions from my Patreon backers, about anything to do with the podcast. This week and next week I'm going to be answering those questions.\n\nNow, I'll be honest, I wasn't even sure that anyone would have any questions at all, and I was worried I'd have to think of something else to do next week, but it turns out there are loads of them. I've actually had so many questions, some of them requiring quite long answers, that I'll probably have enough to not only do this week and next week's episodes based on questions, but to do a bonus backer-only half-hour podcast of more questions next week.\n\nAnyway, to start with, a question that I've been asked quite a bit, and that both Melissa Williams and Claire Boothby asked -- what's the theme music for the podcast, and how does it fit in with the show?\n\n[Excerpt: Boswell Sisters, “Rock and Roll”]\n\nThe song is called \"Rock and Roll\", and it's from 1934. It is, I believe, the very first song to use the phrase \"rock and roll\" in those words -- there was an earlier song called \"rocking and rolling\", but I think it's the first one to use the phrase \"rock and roll\".\n\nIt's performed by the Boswell Sisters, a jazz vocal trio from the thirties whose lead singer, Connee Boswell, influenced Ella Fitzgerald among others, and it was written by Richard Whiting and Sidney Clare.\n\nThey actually wrote it for Shirley Temple -- they're the people who wrote \"On the Good Ship Lollipop\" -- but it was turned down for use in one of her films so the Boswells did it instead.\n\nThe version I'm using is actually the version the Boswells sang in a film, Transatlantic Merry-Go-Round, rather than the proper studio recording. That's just because the film version was easier for me to obtain.\n\nAs for why I'm using it, a few reasons. One is that it's of historical note, as I said, because it's the first song to use the phrase, and that seemed appropriate for a podcast on the history of rock music. The other main reason is that it's in the public domain, and I try wherever possible to keep to copyright laws. I think all the uses of music in the podcast fall under fair use or fair dealing, because they're short excerpts used for educational purposes and I link to legal versions of the full thing, but using a recording as the theme music doesn't, so I had to choose something that was in the public domain.\n\nNext we have a question from David Gerard: \"piece of trivia from waaaaay back: in \"Choo Choo Ch'Boogie\", why \"*democratic* fellows named Mack\"? what's that line about?\"\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nWell, I've never actually seen an interview with the writers of the song, but I can hazard two educated guesses. One of them is boring and probably right, the other one is more interesting and probably wrong.\n\nThe boring and probably right one is very simple -- the word \"democratic\" scans, and there aren't that many words that fit that syllable pattern. There are some -- \"existential\", \"sympathetic\", \"diuretic\" -- but not that many, and \"democratic\" happens to be assonant with the song's rhyme scheme, too -- the \"cratic\" doesn't actually rhyme with all those \"alack\", \"track\" \"jack\", and so on, but it sounds good in combination with them. I suspect that the solution is as simple as that.\n\nThe more interesting one is probably not the case, and I say this because the songwriters who wrote \"Choo Choo Ch'Boogie\" were white. BUT, Milt Gabler, one of the three credited writers, was familiar enough with black culture that this might be the case.\n\nNow, the character in \"Choo Choo Ch'Boogie\" is a soldier returning from the second world war -- we know this from the first two lines, \"Heading for the station with a pack on my back/I'm tired of transportation in the back of a hack\", plus the date the song was recorded, 1946. So we've got someone who's recently been discharged from the army and has no job.\n\nBUT, given it's Louis Jordan singing, we can presume this someone is black. And that puts the song in a rather different light. Because 1946 is slap in the middle of what's known as the second great migration -- the second big wave of black people moving from the rural deep south to the urban north and (in the case of the second migration, but not really the first) the west. This is something we've touched on a bit in the podcast, because it was the second great migration that was, in large part, responsible for the popularity of the urban jump blues that became R&B -- and separately, it was also the cause of the creation of the electric blues in Chicago.\nAnd Chicago is an interesting one here. Because Chicago was one of the biggest destinations -- possibly the single biggest destination -- for black people looking to move around this time.\n\nAnd so we recontextualise a bit. Our black soldier has returned to the US, but he's travelling by train to somewhere where there's no job waiting for him, and there's no mention of going to see his friends or his wife or anything like that. So maybe, he's someone who grew up in the rural deep south, but has decided to use the opportunity of his discharge from the military to go and build himself a new life in one of the big cities, quite probably Chicago. And he's looking for work and doesn't have many contacts there. We can tell that because in the second verse he's looking at the classified ads for jobs in the paper.\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nNow, at this time, especially during and immediately after the Second World War, the single biggest employer in the US in the big cities was the government, and in the big cities there was a *lot* of patronage being handed out by the party in charge -- basically, in most of the big cities, the political parties, especially the Democrats at this time, were an arm of organised crime, with the mayor of the city acting much as a Mafia don would. And the only way to get a job, if you didn't have any special qualifications, if you weren't a \"man with a knack\" as the song puts it -- especially a sinecure where you didn't have to work very hard -- the only way to get such a job was to be owed a favour by the local Democratic Party.\n\nNow, in Chicago -- again, Chicago is not named in the song, but it would seem the most logical place for our protagonist to be travelling, and this was true of other big Northern cities like New York, too -- the Democratic Party was run at this time almost entirely by Irish-Americans. The Mayor of Chicago, at the time was Edward Kelly, and he was the head of a formidable electoral machine, a coalition of several different ethnic groups, but dominated by Irish people.\n\nSo, if you wanted one of those jobs that were being handed out, you'd have to do favours for Kelly's Irish Democrats -- you'd have to pal around with Democratic fellows named Mac.\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nNow I come to a few questions that I'm going to treat as one -- questions from Jeff Stanzler, Steven Hinkle, and Matthew Elmslie. They ask, between them, how I plan out what songs I'm going to include, and if I have to make difficult choices about what to include and what not to include, and who the most significant performer I don't plan to include at all is. Jeremy Wilson also asks if I've got all five hundred songs planned out and how close to the current day I plan to get.\n\nThese are all, actually, very different questions, but they all centre around the same thing, and so I'm going to address them all together here. If any of you don't think I've addressed your question sufficiently, please say and I'll come back to it next week.\n\nNow, I don't have the whole five hundred songs mapped out. To do that would be for me to assume that in the next nine years none of my research will cause me to revise my opinions on what's important. So far, in the first fifty, I've not really had to make any difficult choices at all -- the only things I've wished I could include have either been things where there's just not enough information out there to put together an interesting episode, or where my own self-imposed restrictions like the starting point cut them off. Like if I'd decided to start a few years earlier, I *would* have included Jimmie Rodgers, but you have to have a cut-off point, and if I hadn't set 1938 and the Goodman Carnegie Hall concerts as a good starting point I could have gone all the way back at least to the mid nineteenth century, and it would have been more the prehistory of rock.\n\nMaybe I'll do that as a project when I've finished this one.\n\nBut even those people I've excluded, I've ended up being able to cover as bonus episodes, so I've not really had to leave anything out.\n\nBut that means so far, since we're still really at the very beginning of rock and roll, there have been no difficult choices. That will change as the story goes on -- in the sixties there are so many important records that I'm going to have to cut out a lot, and by the mid-seventies rock has diversified so much that there will be *tons* of things I'll just have to gloss over. But right now I've had to make no tough decisions.\n\nNow, the way I do this -- I have a list of about two hundred or so songs that I'm pretty sure are going to make the final list. Like I'm sure nobody will be surprised to find that I'll be covering, say, \"Peggy Sue\", \"Satisfaction\", \"Stairway to Heaven\", \"God Save the Queen\" and \"Walk This Way\". You can't leave those things out of the story and still have it be anything like an actual history of rock music. That's my sort of master list, but I don't consult that all that often.\n\nWhat I do, is at any given point I'm working on the next ten scripts simultaneously -- I do things that way because I use the same research materials for multiple episodes, so for example I was writing the Chess episodes all at the same time, and the rockabilly episodes all at the same time, so I might be reading a biography of Carl Perkins, see an interesting fact about Johnny Cash, and stick the fact in the Johnny Cash episode or whatever. I have another list of about twenty probables, just titles, that I'm planning to work on soon after. Every time I finish a script, I look through the list of probables, pull out a good one to work on next, and add that to the ten I'm writing. I'll also, when I'm doing that, add any more titles I've thought of to the list. So I know exactly what I'm going to be doing in the next two and a half months, have a pretty good idea of what I'm doing for the next six, and only a basic outline after that.\n\nThat means that I can't necessarily say for certain who I *won't* be including. There will, undoubtedly, be some significant performers who don't get included, but I can't say who until we get past their part in the story.\nSteven also asked as part of this if I've determined an end point. Yes I have. That may change over the next nine years, but when I was planning out the podcast -- even before it became a podcast, when I was thinking of it as just a series of books -- I thought of what I think would make the perfect ending for the series -- a song from 1999 -- and I'm going to use that.\n\nRelated to that, William Maybury asked \"Why 1999?\"\n\nWell, a few reasons -- partly because it's a nice cut-off point -- the end of the nineties and so on. Partly because it's about the time that I disengaged totally from popular culture -- I like plenty of music from the last couple of decades, but not really much that has made any impact on the wider world. Partly because, when I finish the podcast, 1999 will be thirty years ago, which seems like about the right sort of length of time to have a decent historical perspective on things; partly because one of the inspirations for this was Richard Thompson's 1000 Years of Popular Music and that cut off -- well, it cut off in 2001, but close enough; and partly because the final song I'm going to cover came out then, and it's a good ending song.\n\nWilliam also asked \"What's the bottom standard for notability to be covered? (We heard about \"Ooby Dooby\" before \"Crying,\" are we going to hear about \"Take My Tip\" before \"Space Oddity\"? Bootlegs beyond the Million Dollar Band that you mentioned on Twitter? Archival groundbreakers like Parson Sound?)\"\n\n[Excerpt: Roy Orbison, “Ooby Dooby”]\n\nThat's an interesting question... there's no bottom standard for notability *as such*. It's more that notability is just one of a number of factors I'm using to decide on the songs I cover. So the question I ask myself when I'm choosing one to include isn't just \"is this song influential or important?\" though that's a primary one. There's also \"is there a particularly fascinating story behind the recording of this track?\" \"Does this illustrate something important about music or about cultural history?\", “Is this just a song I really like and want to talk about?” And also, \"does this provide a link between otherwise disconnected strands of the story?\" There are also things like \"have I not covered anything by a woman or a black person or whatever in a while?\" because one of the things I want to do is make sure that this isn't just the story of white men, however much they dominate the narrative, and I know I will have to consciously correct for my own biases, so I pay attention to that.\n\nAnd there's *also* the question of mixing the stuff everyone knows about with the stuff they'll be hearing about for the first time -- you have to cover \"Satisfaction\" because everyone would notice it's missing, but if you just do Beatles-Stones-Led Zep-Pink Floyd-whoever's-on-the-cover-of-Mojo-this-month, nobody's going to hear anything they can't get in a million different places.\n\nSo to take the example of \"Ooby Dooby\", it's only a relatively important track in itself, though it is notable for being the start of Roy Orbison's career. But it also ties Orbison in to the story of Sam Phillips and Sun Records, and thus into the stories of Carl Perkins, Elvis Presley, Johnny Cash, and so on. It allows me to set up something for the future while tying the story together and moving the stories of multiple people forward a bit.\n\nSo... as a tiny bit of a spoiler, though this won't be too much of a surprise to those who've read my book California Dreaming, I am almost certainly going to cover the GTOs, who are almost a footnote to a footnote. I'll cover them because their one album was co-produced by Frank Zappa and Lowell George, later of Little Feat, it featured the Jeff Beck Group, including Rod Stewart, and it had songs co-written by Davy Jones of the Monkees -- and the songs Davy Jones co-wrote were about Captain Beefheart and about Nick St Nicholas of Steppenwolf. That's an enormous nexus of otherwise unconnected musicians, and it allows me to move several strands of the story forwards at the same time -- and it also allows me to talk about groupie culture and misogyny in the rock world from the perspective of the women who were involved.\n\n[Excerpt: GTOs, “The Captain's Fat Theresa Shoes”]\n\nI'm not *definitely* going to cover that, but I'm likely to -- and I'm likely to cover it rather than covering some more well-known but less interesting track.\n\nDean Mattson asks what my favourite three books are on the music I've covered so far. That's a good question. I'm actually going to name more than three, though...\n\nThe book that has been of most value in terms of sheer information density is Before Elvis, by Larry Birnbaum. This is a book that covers the prehistory of rock and roll to an absurd level of detail, and it's absolutely wonderful, but it's also absolutely hard going. Birnbaum seems to have heard, without exaggeration, every record released before 1954, and he'll do things like trace a musical motif from a Chuck Berry solo to a Louis Jordan record, and from the Louis Jordan record to one by Count Basie, and from that to Blind Blake, to Blind Lemon Jefferson, to Jelly Roll Morton, to a 1918 recording by Wilbur Sweatman's Jazz Orchestra. And he does that kind of thing in every single paragraph of a 474-page book. He must reference, at a very conservative estimate, five thousand different recordings.\n\nNow this is information density at the expense of everything else, and Birnbaum's book has something of the air of those dense 18th and 19th century omnium gatherum type books like Origin of Species or Capital or The Golden Bough, or The Decline and Fall of the Roman Empire, where there are a million examples provided to prove a point in the most exhaustive detail possible. I've done entire episodes of the podcast which are just expanding on a single paragraph of Birnbaum and providing enough context and narrative for a lay audience to appreciate it. It's not a book you read for fun. It's a book you read a paragraph at a time, with a notepad, looking up recordings of all the songs he covers as he gets to them. But if you're willing to put that time in, the book will reward you with a truly comprehensive understanding of American popular music of the period up to 1954.\n\nThe book that surprised me the most with its quality was Billy Bragg's Roots, Radicals and Rockers: How Skiffle Changed the World. I've always quite liked Bragg as a songwriter, but I'd never expected him to be much good at writing a work of non-fiction. I only actually got hold of a copy because it had just come out when I started the podcast, and it had a certain amount of publicity behind it. I thought if I didn't read it I would then get people asking questions like, \"But Billy Bragg says X, why do you say Y?\"\n\nBut in fact, if you want a book on the skiffle movement and early British rock and roll, you could not do better than this one. It's exhaustively researched, and it's written in a staggeringly readable prose style, by someone who has spent his life as both a folk musician and a political activist, and so understands the culture of the skiffle movement on a bone-deep level. If there was one book I was to urge people to read just to read a really good, entertaining, book, it would be that one.\n\nThe book that's been the most use to me is Honkers and Shouters by Arnold Shaw -- an account of the 50s R&B scene from someone who was part of it. Shaw worked for a music publisher at the time, and had a lot of contacts in the industry. When he came to write the book in the 70s, he was able to call upon those contacts and interview a huge number of people -- many of whom gave him their last interviews before they died. The podcast wouldn't be as good without some of the other books, but it wouldn't exist at all without this one, because Shaw added so much to our knowledge of 50s R&B.\n\nBut I also want to recommend all of Peter Guralnick's books, but especially Last Train to Memphis, the first of his two-volume biography of Elvis Presley. Guralnick's written a lot of books on Southern US music, including ones on Sam Phillips and Sam Cooke which have also been important resources. But the thing that sets Guralnick apart as a writer is his ability to make the reader thoroughly understand why people admired extraordinarily flawed individuals, but without minimising their flaws. With all Guralnick's biographies, I've come away both thinking less of his subjects as people *and* admiring them more as creators. He doesn't flinch from showing the men he writes about as egocentric, often misogynist, manipulators who damaged the people around him, but nor does he turn his books into Albert Goldman style denunciations of his subjects.\nIndeed, in the case of Elvis, I've got more understanding of who Elvis was from Guralnick than from any of the hundreds of thousands of other words I've read on the subject. Elvis as he turns up in this podcast is the Elvis that Guralnick wrote about, rather than anything else.\n\nMagic at Mungos asked what the best song I've discovered, that I hadn't heard before doing the podcast, is.\n\nWell, I've discovered very little doing the podcast, really. The only song I've covered that I didn't know before starting work on the podcast was \"Ko Ko Mo\", and I can't say that one was a favourite of mine -- it's not a bad record by any means, but it's not one that changed my life or anything. But there have been a few things that I've heard that I didn't do full episodes about but which made an impression -- the McHouston Baker album I talked about towards the end of the “Love is Strange” episode, for example, is well worth a listen.\n\n[Excerpt: McHouston Baker, “Alabama March”]\n\nWhat the podcast *has* done, though, is make me reevaluate a few people I already knew about. In particular I'd been very dismissive of Lonnie Donegan previously -- I just hadn't got him -- but having to cover him for the podcast meant listening to all his fifties and early sixties work, and I came out of that hugely impressed.\n\nI had a similar experience with Bo Diddley, who I *did* admire beforehand, and whose music I knew fairly well, but listening to his work as a body of work, rather than as isolated tracks and albums, made me think of him as a far more subtle, interesting, musician and songwriter than I'd given him the credit for previously.\n\nAnother one from William Maybury, who wants to know about my recording setup. I actually don't have very good recording equipment -- I just use a thirty-pound USB condenser mic plugged into my laptop on my dining room table. This is partly because I don't have a huge budget for the podcast, but also because there's only so much that can be done with the sound quality anyway. I live in an acoustically... fairly horrible... house, which has a weird reverb to a lot of the rooms. It's a terraced house with relatively thin walls, so you can hear the neighbours, and I live underneath a major flight path and by a main road in a major city, often driven on by people with the kind of in-car sound systems that inflict themselves on everyone nearby.\n\nWhile I would like better equipment, at a certain point all it would be doing is giving a really clear recording of the neighbours' arguments or the TV shows they're watching, and the sound systems in the cars driving past – like today, I was woken at 3AM by someone driving by, playing “Hold On” by Wilson Phillips in their car so loud it woke me up. Acoustic perfection when recording somewhere like here would just be wasted.\n\nSo I make up for this by doing a *LOT* of editing on the podcast. I've not done so much on this episode, because these are specifically designed to be low-stress episodes for me, but I've been known to spend literally twenty hours on editing some individual episodes, cutting out extraneous noises, fixing sound quality issues, and so on.\n\nAnd finally for this week, Russell Stallings asks, \"my son Pete wants to know if you are a musician? And , who is your favorite beatle?\"\n\nThe answer to whether I'm a musician is \"yes and no\", I'm afraid. I can play a lot of instruments badly. I'm dyspraxic, so I have natural limits to my dexterity, and so no matter how much I practiced I never became more than a competent rhythm guitarist at best. But I manage to be not very good on a whole variety of instruments -- I've been in bands before, and played guitar, keyboards, bass, mandolin, ukulele, and banjo on recordings -- and I can, more or less, get a tune out of a clarinet or saxophone with a good run-up.\n\nWhere I think my own musical skills lie is as a songwriter, arranger, and producer. I've not done much of that in over a decade, as I don't really have the personality for collaboration, but I did a lot of it in my twenties and thirties. Here's an example, from a band I used to be in called The National Pep.\n\n[Excerpt: The National Pep, \"Think Carefully For Victory\"]\n\nIn the section you just heard, I wrote the music, co-produced, and played all the instruments except the drums. Tilt -- who does a podcast called The Sitcom Club I know some of you listen to -- sang lead, wrote the lyrics, played drums, and co-produced.\n\nSo, sort of a musician, sort of not.\n\nAs to the question about my favourite Beatle, John Lennon has always been my favourite, though as I grow older I'm growing more and more to appreciate Paul McCartney. I'm also, though, someone who thinks the whole is much greater than the sum of the parts in that particular case. All four of them did solo work I like a lot, but also the group was immensely better than any of the solo work. It's very, very, rare that every member of a band is utterly irreplaceable -- normally, even when every member of a band is talented, you can imagine them carrying on with one or more members swapped out for other, equally competent, people. But in the case of the Beatles, I don't think you can.\n\nAnyway, that's all for this week. I'll be answering more questions next week, then the podcast will be back to normal on October the sixth with an episode on Carl Perkins. If you have any questions you'd like to ask, you can still ask by signing up on patreon.com/andrewhickey – and if you've not signed up for that, you can do so for as little as a dollar a month. Patreon backers also get a ten minute bonus podcast every week I do a regular podcast, and when the book version of the podcast comes out, backers at the $5 or higher level will be getting free copies of that. They also get copies of my other books.\n\nThanks for listening.",
  "itunes:subtitle": "This weeks episode of A History of Rock Music in Five Hundred Songs is the first of two bonus episodes answering listener questions at the end of the first year of the podcast.. Click the full post to read liner notes, links to more information, and a tr",
  "itunes:keywords": "bonus episodes",
  "itunes:episodeType": "bonus",
  "content:encoded": "This week's episode of <em>A History of Rock Music in Five Hundred Songs</em> is the first of two bonus episodes answering listener questions at the end of the first year of the podcast.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-supplemental-for-bonus-qa/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nPatreon backers can ask questions for next episode <a href=\"https://www.patreon.com/posts/q-post-29979005\">at this link</a>.\n\nBooks mentioned -- <a href=\"https://amzn.to/2LFsfD8\">Last Train to Memphis</a> by Peter Guralnick, <a href=\"https://amzn.to/2NsiM4k\">Before Elvis</a> by Larry Birnbaum, <a href=\"https://amzn.to/2Qnsjfb\">Roots, Radicals and Rockers</a> by Billy Bragg, <a href=\"https://amzn.to/2QmAgRW\">Honkers and Shouters</a> by Arnold Shaw.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my <a href=\"https://www.patreon.com/join/AndrewHickey\">backers on Patreon.</a> Why not join them?\n\n<strong>Transcript</strong>\n\nHello, and welcome to the first of our two-part question and answer session.\n\nFor those who didn't hear the little admin podcast I did last week, this week and next week are not regular episodes of the podcast -- I'm taking two weeks out to get the book version of the first fifty episodes edited and published, and to get a bit of a backlog in writing future episodes. I'm planning on doing this every year from now on, and doing it this way will mean that the podcast will take exactly ten years, rather than the nine years and eight months it would otherwise take,\n\nBut to fill in the gaps while you wait, I asked for any questions from my Patreon backers, about anything to do with the podcast. This week and next week I'm going to be answering those questions.\n\nNow, I'll be honest, I wasn't even sure that anyone would have any questions at all, and I was worried I'd have to think of something else to do next week, but it turns out there are loads of them. I've actually had so many questions, some of them requiring quite long answers, that I'll probably have enough to not only do this week and next week's episodes based on questions, but to do a bonus backer-only half-hour podcast of more questions next week.\n\nAnyway, to start with, a question that I've been asked quite a bit, and that both Melissa Williams and Claire Boothby asked -- what's the theme music for the podcast, and how does it fit in with the show?\n\n[Excerpt: Boswell Sisters, “Rock and Roll”]\n\nThe song is called \"Rock and Roll\", and it's from 1934. It is, I believe, the very first song to use the phrase \"rock and roll\" in those words -- there was an earlier song called \"rocking and rolling\", but I think it's the first one to use the phrase \"rock and roll\".\n\nIt's performed by the Boswell Sisters, a jazz vocal trio from the thirties whose lead singer, Connee Boswell, influenced Ella Fitzgerald among others, and it was written by Richard Whiting and Sidney Clare.\n\nThey actually wrote it for Shirley Temple -- they're the people who wrote \"On the Good Ship Lollipop\" -- but it was turned down for use in one of her films so the Boswells did it instead.\n\nThe version I'm using is actually the version the Boswells sang in a film, Transatlantic Merry-Go-Round, rather than the proper studio recording. That's just because the film version was easier for me to obtain.\n\nAs for why I'm using it, a few reasons. One is that it's of historical note, as I said, because it's the first song to use the phrase, and that seemed appropriate for a podcast on the history of rock music. The other main reason is that it's in the public domain, and I try wherever possible to keep to copyright laws. I think all the uses of music in the podcast fall under fair use or fair dealing, because they're short excerpts used for educational purposes and I link to legal versions of the full thing, but using a recording as the theme music doesn't, so I had to choose something that was in the public domain.\n\nNext we have a question from David Gerard: \"piece of trivia from waaaaay back: in \"Choo Choo Ch'Boogie\", why \"*democratic* fellows named Mack\"? what's that line about?\"\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nWell, I've never actually seen an interview with the writers of the song, but I can hazard two educated guesses. One of them is boring and probably right, the other one is more interesting and probably wrong.\n\nThe boring and probably right one is very simple -- the word \"democratic\" scans, and there aren't that many words that fit that syllable pattern. There are some -- \"existential\", \"sympathetic\", \"diuretic\" -- but not that many, and \"democratic\" happens to be assonant with the song's rhyme scheme, too -- the \"cratic\" doesn't actually rhyme with all those \"alack\", \"track\" \"jack\", and so on, but it sounds good in combination with them. I suspect that the solution is as simple as that.\n\nThe more interesting one is probably not the case, and I say this because the songwriters who wrote \"Choo Choo Ch'Boogie\" were white. BUT, Milt Gabler, one of the three credited writers, was familiar enough with black culture that this might be the case.\n\nNow, the character in \"Choo Choo Ch'Boogie\" is a soldier returning from the second world war -- we know this from the first two lines, \"Heading for the station with a pack on my back/I'm tired of transportation in the back of a hack\", plus the date the song was recorded, 1946. So we've got someone who's recently been discharged from the army and has no job.\n\nBUT, given it's Louis Jordan singing, we can presume this someone is black. And that puts the song in a rather different light. Because 1946 is slap in the middle of what's known as the second great migration -- the second big wave of black people moving from the rural deep south to the urban north and (in the case of the second migration, but not really the first) the west. This is something we've touched on a bit in the podcast, because it was the second great migration that was, in large part, responsible for the popularity of the urban jump blues that became R&B -- and separately, it was also the cause of the creation of the electric blues in Chicago.\nAnd Chicago is an interesting one here. Because Chicago was one of the biggest destinations -- possibly the single biggest destination -- for black people looking to move around this time.\n\nAnd so we recontextualise a bit. Our black soldier has returned to the US, but he's travelling by train to somewhere where there's no job waiting for him, and there's no mention of going to see his friends or his wife or anything like that. So maybe, he's someone who grew up in the rural deep south, but has decided to use the opportunity of his discharge from the military to go and build himself a new life in one of the big cities, quite probably Chicago. And he's looking for work and doesn't have many contacts there. We can tell that because in the second verse he's looking at the classified ads for jobs in the paper.\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nNow, at this time, especially during and immediately after the Second World War, the single biggest employer in the US in the big cities was the government, and in the big cities there was a *lot* of patronage being handed out by the party in charge -- basically, in most of the big cities, the political parties, especially the Democrats at this time, were an arm of organised crime, with the mayor of the city acting much as a Mafia don would. And the only way to get a job, if you didn't have any special qualifications, if you weren't a \"man with a knack\" as the song puts it -- especially a sinecure where you didn't have to work very hard -- the only way to get such a job was to be owed a favour by the local Democratic Party.\n\nNow, in Chicago -- again, Chicago is not named in the song, but it would seem the most logical place for our protagonist to be travelling, and this was true of other big Northern cities like New York, too -- the Democratic Party was run at this time almost entirely by Irish-Americans. The Mayor of Chicago, at the time was Edward Kelly, and he was the head of a formidable electoral machine, a coalition of several different ethnic groups, but dominated by Irish people.\n\nSo, if you wanted one of those jobs that were being handed out, you'd have to do favours for Kelly's Irish Democrats -- you'd have to pal around with Democratic fellows named Mac.\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nNow I come to a few questions that I'm going to treat as one -- questions from Jeff Stanzler, Steven Hinkle, and Matthew Elmslie. They ask, between them, how I plan out what songs I'm going to include, and if I have to make difficult choices about what to include and what not to include, and who the most significant performer I don't plan to include at all is. Jeremy Wilson also asks if I've got all five hundred songs planned out and how close to the current day I plan to get.\n\nThese are all, actually, very different questions, but they all centre around the same thing, and so I'm going to address them all together here. If any of you don't think I've addressed your question sufficiently, please say and I'll come back to it next week.\n\nNow, I don't have the whole five hundred songs mapped out. To do that would be for me to assume that in the next nine years none of my research will cause me to revise my opinions on what's important. So far, in the first fifty, I've not really had to make any difficult choices at all -- the only things I've wished I could include have either been things where there's just not enough information out there to put together an interesting episode, or where my own self-imposed restrictions like the starting point cut them off. Like if I'd decided to start a few years earlier, I *would* have included Jimmie Rodgers, but you have to have a cut-off point, and if I hadn't set 1938 and the Goodman Carnegie Hall concerts as a good starting point I could have gone all the way back at least to the mid nineteenth century, and it would have been more the prehistory of rock.\n\nMaybe I'll do that as a project when I've finished this one.\n\nBut even those people I've excluded, I've ended up being able to cover as bonus episodes, so I've not really had to leave anything out.\n\nBut that means so far, since we're still really at the very beginning of rock and roll, there have been no difficult choices. That will change as the story goes on -- in the sixties there are so many important records that I'm going to have to cut out a lot, and by the mid-seventies rock has diversified so much that there will be *tons* of things I'll just have to gloss over. But right now I've had to make no tough decisions.\n\nNow, the way I do this -- I have a list of about two hundred or so songs that I'm pretty sure are going to make the final list. Like I'm sure nobody will be surprised to find that I'll be covering, say, \"Peggy Sue\", \"Satisfaction\", \"Stairway to Heaven\", \"God Save the Queen\" and \"Walk This Way\". You can't leave those things out of the story and still have it be anything like an actual history of rock music. That's my sort of master list, but I don't consult that all that often.\n\nWhat I do, is at any given point I'm working on the next ten scripts simultaneously -- I do things that way because I use the same research materials for multiple episodes, so for example I was writing the Chess episodes all at the same time, and the rockabilly episodes all at the same time, so I might be reading a biography of Carl Perkins, see an interesting fact about Johnny Cash, and stick the fact in the Johnny Cash episode or whatever. I have another list of about twenty probables, just titles, that I'm planning to work on soon after. Every time I finish a script, I look through the list of probables, pull out a good one to work on next, and add that to the ten I'm writing. I'll also, when I'm doing that, add any more titles I've thought of to the list. So I know exactly what I'm going to be doing in the next two and a half months, have a pretty good idea of what I'm doing for the next six, and only a basic outline after that.\n\nThat means that I can't necessarily say for certain who I *won't* be including. There will, undoubtedly, be some significant performers who don't get included, but I can't say who until we get past their part in the story.\nSteven also asked as part of this if I've determined an end point. Yes I have. That may change over the next nine years, but when I was planning out the podcast -- even before it became a podcast, when I was thinking of it as just a series of books -- I thought of what I think would make the perfect ending for the series -- a song from 1999 -- and I'm going to use that.\n\nRelated to that, William Maybury asked \"Why 1999?\"\n\nWell, a few reasons -- partly because it's a nice cut-off point -- the end of the nineties and so on. Partly because it's about the time that I disengaged totally from popular culture -- I like plenty of music from the last couple of decades, but not really much that has made any impact on the wider world. Partly because, when I finish the podcast, 1999 will be thirty years ago, which seems like about the right sort of length of time to have a decent historical perspective on things; partly because one of the inspirations for this was Richard Thompson's 1000 Years of Popular Music and that cut off -- well, it cut off in 2001, but close enough; and partly because the final song I'm going to cover came out then, and it's a good ending song.\n\nWilliam also asked \"What's the bottom standard for notability to be covered? (We heard about \"Ooby Dooby\" before \"Crying,\" are we going to hear about \"Take My Tip\" before \"Space Oddity\"? Bootlegs beyond the Million Dollar Band that you mentioned on Twitter? Archival groundbreakers like Parson Sound?)\"\n\n[Excerpt: Roy Orbison, “Ooby Dooby”]\n\nThat's an interesting question... there's no bottom standard for notability *as such*. It's more that notability is just one of a number of factors I'm using to decide on the songs I cover. So the question I ask myself when I'm choosing one to include isn't just \"is this song influential or important?\" though that's a primary one. There's also \"is there a particularly fascinating story behind the recording of this track?\" \"Does this illustrate something important about music or about cultural history?\", “Is this just a song I really like and want to talk about?” And also, \"does this provide a link between otherwise disconnected strands of the story?\" There are also things like \"have I not covered anything by a woman or a black person or whatever in a while?\" because one of the things I want to do is make sure that this isn't just the story of white men, however much they dominate the narrative, and I know I will have to consciously correct for my own biases, so I pay attention to that.\n\nAnd there's *also* the question of mixing the stuff everyone knows about with the stuff they'll be hearing about for the first time -- you have to cover \"Satisfaction\" because everyone would notice it's missing, but if you just do Beatles-Stones-Led Zep-Pink Floyd-whoever's-on-the-cover-of-Mojo-this-month, nobody's going to hear anything they can't get in a million different places.\n\nSo to take the example of \"Ooby Dooby\", it's only a relatively important track in itself, though it is notable for being the start of Roy Orbison's career. But it also ties Orbison in to the story of Sam Phillips and Sun Records, and thus into the stories of Carl Perkins, Elvis Presley, Johnny Cash, and so on. It allows me to set up something for the future while tying the story together and moving the stories of multiple people forward a bit.\n\nSo... as a tiny bit of a spoiler, though this won't be too much of a surprise to those who've read my book California Dreaming, I am almost certainly going to cover the GTOs, who are almost a footnote to a footnote. I'll cover them because their one album was co-produced by Frank Zappa and Lowell George, later of Little Feat, it featured the Jeff Beck Group, including Rod Stewart, and it had songs co-written by Davy Jones of the Monkees -- and the songs Davy Jones co-wrote were about Captain Beefheart and about Nick St Nicholas of Steppenwolf. That's an enormous nexus of otherwise unconnected musicians, and it allows me to move several strands of the story forwards at the same time -- and it also allows me to talk about groupie culture and misogyny in the rock world from the perspective of the women who were involved.\n\n[Excerpt: GTOs, “The Captain's Fat Theresa Shoes”]\n\nI'm not *definitely* going to cover that, but I'm likely to -- and I'm likely to cover it rather than covering some more well-known but less interesting track.\n\nDean Mattson asks what my favourite three books are on the music I've covered so far. That's a good question. I'm actually going to name more than three, though...\n\nThe book that has been of most value in terms of sheer information density is Before Elvis, by Larry Birnbaum. This is a book that covers the prehistory of rock and roll to an absurd level of detail, and it's absolutely wonderful, but it's also absolutely hard going. Birnbaum seems to have heard, without exaggeration, every record released before 1954, and he'll do things like trace a musical motif from a Chuck Berry solo to a Louis Jordan record, and from the Louis Jordan record to one by Count Basie, and from that to Blind Blake, to Blind Lemon Jefferson, to Jelly Roll Morton, to a 1918 recording by Wilbur Sweatman's Jazz Orchestra. And he does that kind of thing in every single paragraph of a 474-page book. He must reference, at a very conservative estimate, five thousand different recordings.\n\nNow this is information density at the expense of everything else, and Birnbaum's book has something of the air of those dense 18th and 19th century omnium gatherum type books like Origin of Species or Capital or The Golden Bough, or The Decline and Fall of the Roman Empire, where there are a million examples provided to prove a point in the most exhaustive detail possible. I've done entire episodes of the podcast which are just expanding on a single paragraph of Birnbaum and providing enough context and narrative for a lay audience to appreciate it. It's not a book you read for fun. It's a book you read a paragraph at a time, with a notepad, looking up recordings of all the songs he covers as he gets to them. But if you're willing to put that time in, the book will reward you with a truly comprehensive understanding of American popular music of the period up to 1954.\n\nThe book that surprised me the most with its quality was Billy Bragg's Roots, Radicals and Rockers: How Skiffle Changed the World. I've always quite liked Bragg as a songwriter, but I'd never expected him to be much good at writing a work of non-fiction. I only actually got hold of a copy because it had just come out when I started the podcast, and it had a certain amount of publicity behind it. I thought if I didn't read it I would then get people asking questions like, \"But Billy Bragg says X, why do you say Y?\"\n\nBut in fact, if you want a book on the skiffle movement and early British rock and roll, you could not do better than this one. It's exhaustively researched, and it's written in a staggeringly readable prose style, by someone who has spent his life as both a folk musician and a political activist, and so understands the culture of the skiffle movement on a bone-deep level. If there was one book I was to urge people to read just to read a really good, entertaining, book, it would be that one.\n\nThe book that's been the most use to me is Honkers and Shouters by Arnold Shaw -- an account of the 50s R&B scene from someone who was part of it. Shaw worked for a music publisher at the time, and had a lot of contacts in the industry. When he came to write the book in the 70s, he was able to call upon those contacts and interview a huge number of people -- many of whom gave him their last interviews before they died. The podcast wouldn't be as good without some of the other books, but it wouldn't exist at all without this one, because Shaw added so much to our knowledge of 50s R&B.\n\nBut I also want to recommend all of Peter Guralnick's books, but especially Last Train to Memphis, the first of his two-volume biography of Elvis Presley. Guralnick's written a lot of books on Southern US music, including ones on Sam Phillips and Sam Cooke which have also been important resources. But the thing that sets Guralnick apart as a writer is his ability to make the reader thoroughly understand why people admired extraordinarily flawed individuals, but without minimising their flaws. With all Guralnick's biographies, I've come away both thinking less of his subjects as people *and* admiring them more as creators. He doesn't flinch from showing the men he writes about as egocentric, often misogynist, manipulators who damaged the people around him, but nor does he turn his books into Albert Goldman style denunciations of his subjects.\nIndeed, in the case of Elvis, I've got more understanding of who Elvis was from Guralnick than from any of the hundreds of thousands of other words I've read on the subject. Elvis as he turns up in this podcast is the Elvis that Guralnick wrote about, rather than anything else.\n\nMagic at Mungos asked what the best song I've discovered, that I hadn't heard before doing the podcast, is.\n\nWell, I've discovered very little doing the podcast, really. The only song I've covered that I didn't know before starting work on the podcast was \"Ko Ko Mo\", and I can't say that one was a favourite of mine -- it's not a bad record by any means, but it's not one that changed my life or anything. But there have been a few things that I've heard that I didn't do full episodes about but which made an impression -- the McHouston Baker album I talked about towards the end of the “Love is Strange” episode, for example, is well worth a listen.\n\n[Excerpt: McHouston Baker, “Alabama March”]\n\nWhat the podcast *has* done, though, is make me reevaluate a few people I already knew about. In particular I'd been very dismissive of Lonnie Donegan previously -- I just hadn't got him -- but having to cover him for the podcast meant listening to all his fifties and early sixties work, and I came out of that hugely impressed.\n\nI had a similar experience with Bo Diddley, who I *did* admire beforehand, and whose music I knew fairly well, but listening to his work as a body of work, rather than as isolated tracks and albums, made me think of him as a far more subtle, interesting, musician and songwriter than I'd given him the credit for previously.\n\nAnother one from William Maybury, who wants to know about my recording setup. I actually don't have very good recording equipment -- I just use a thirty-pound USB condenser mic plugged into my laptop on my dining room table. This is partly because I don't have a huge budget for the podcast, but also because there's only so much that can be done with the sound quality anyway. I live in an acoustically... fairly horrible... house, which has a weird reverb to a lot of the rooms. It's a terraced house with relatively thin walls, so you can hear the neighbours, and I live underneath a major flight path and by a main road in a major city, often driven on by people with the kind of in-car sound systems that inflict themselves on everyone nearby.\n\nWhile I would like better equipment, at a certain point all it would be doing is giving a really clear recording of the neighbours' arguments or the TV shows they're watching, and the sound systems in the cars driving past – like today, I was woken at 3AM by someone driving by, playing “Hold On” by Wilson Phillips in their car so loud it woke me up. Acoustic perfection when recording somewhere like here would just be wasted.\n\nSo I make up for this by doing a *LOT* of editing on the podcast. I've not done so much on this episode, because these are specifically designed to be low-stress episodes for me, but I've been known to spend literally twenty hours on editing some individual episodes, cutting out extraneous noises, fixing sound quality issues, and so on.\n\nAnd finally for this week, Russell Stallings asks, \"my son Pete wants to know if you are a musician? And , who is your favorite beatle?\"\n\nThe answer to whether I'm a musician is \"yes and no\", I'm afraid. I can play a lot of instruments badly. I'm dyspraxic, so I have natural limits to my dexterity, and so no matter how much I practiced I never became more than a competent rhythm guitarist at best. But I manage to be not very good on a whole variety of instruments -- I've been in bands before, and played guitar, keyboards, bass, mandolin, ukulele, and banjo on recordings -- and I can, more or less, get a tune out of a clarinet or saxophone with a good run-up.\n\nWhere I think my own musical skills lie is as a songwriter, arranger, and producer. I've not done much of that in over a decade, as I don't really have the personality for collaboration, but I did a lot of it in my twenties and thirties. Here's an example, from a band I used to be in called The National Pep.\n\n[Excerpt: The National Pep, \"Think Carefully For Victory\"]\n\nIn the section you just heard, I wrote the music, co-produced, and played all the instruments except the drums. Tilt -- who does a podcast called The Sitcom Club I know some of you listen to -- sang lead, wrote the lyrics, played drums, and co-produced.\n\nSo, sort of a musician, sort of not.\n\nAs to the question about my favourite Beatle, John Lennon has always been my favourite, though as I grow older I'm growing more and more to appreciate Paul McCartney. I'm also, though, someone who thinks the whole is much greater than the sum of the parts in that particular case. All four of them did solo work I like a lot, but also the group was immensely better than any of the solo work. It's very, very, rare that every member of a band is utterly irreplaceable -- normally, even when every member of a band is talented, you can imagine them carrying on with one or more members swapped out for other, equally competent, people. But in the case of the Beatles, I don't think you can.\n\nAnyway, that's all for this week. I'll be answering more questions next week, then the podcast will be back to normal on October the sixth with an episode on Carl Perkins. If you have any questions you'd like to ask, you can still ask by signing up on patreon.com/andrewhickey – and if you've not signed up for that, you can do so for as little as a dollar a month. Patreon backers also get a ten minute bonus podcast every week I do a regular podcast, and when the book version of the podcast comes out, backers at the $5 or higher level will be getting free copies of that. They also get copies of my other books.\n\nThanks for listening.",
  "enclosure": "",
  "itunes:summary": "This week's episode of A History of Rock Music in Five Hundred Songs is the first of two bonus episodes answering listener questions at the end of the first year of the podcast.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nPatreon backers can ask questions for next episode at this link.\n\nBooks mentioned -- Last Train to Memphis by Peter Guralnick, Before Elvis by Larry Birnbaum, Roots, Radicals and Rockers by Billy Bragg, Honkers and Shouters by Arnold Shaw.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nHello, and welcome to the first of our two-part question and answer session.\n\nFor those who didn't hear the little admin podcast I did last week, this week and next week are not regular episodes of the podcast -- I'm taking two weeks out to get the book version of the first fifty episodes edited and published, and to get a bit of a backlog in writing future episodes. I'm planning on doing this every year from now on, and doing it this way will mean that the podcast will take exactly ten years, rather than the nine years and eight months it would otherwise take,\n\nBut to fill in the gaps while you wait, I asked for any questions from my Patreon backers, about anything to do with the podcast. This week and next week I'm going to be answering those questions.\n\nNow, I'll be honest, I wasn't even sure that anyone would have any questions at all, and I was worried I'd have to think of something else to do next week, but it turns out there are loads of them. I've actually had so many questions, some of them requiring quite long answers, that I'll probably have enough to not only do this week and next week's episodes based on questions, but to do a bonus backer-only half-hour podcast of more questions next week.\n\nAnyway, to start with, a question that I've been asked quite a bit, and that both Melissa Williams and Claire Boothby asked -- what's the theme music for the podcast, and how does it fit in with the show?\n\n[Excerpt: Boswell Sisters, “Rock and Roll”]\n\nThe song is called \"Rock and Roll\", and it's from 1934. It is, I believe, the very first song to use the phrase \"rock and roll\" in those words -- there was an earlier song called \"rocking and rolling\", but I think it's the first one to use the phrase \"rock and roll\".\n\nIt's performed by the Boswell Sisters, a jazz vocal trio from the thirties whose lead singer, Connee Boswell, influenced Ella Fitzgerald among others, and it was written by Richard Whiting and Sidney Clare.\n\nThey actually wrote it for Shirley Temple -- they're the people who wrote \"On the Good Ship Lollipop\" -- but it was turned down for use in one of her films so the Boswells did it instead.\n\nThe version I'm using is actually the version the Boswells sang in a film, Transatlantic Merry-Go-Round, rather than the proper studio recording. That's just because the film version was easier for me to obtain.\n\nAs for why I'm using it, a few reasons. One is that it's of historical note, as I said, because it's the first song to use the phrase, and that seemed appropriate for a podcast on the history of rock music. The other main reason is that it's in the public domain, and I try wherever possible to keep to copyright laws. I think all the uses of music in the podcast fall under fair use or fair dealing, because they're short excerpts used for educational purposes and I link to legal versions of the full thing, but using a recording as the theme music doesn't, so I had to choose something that was in the public domain.\n\nNext we have a question from David Gerard: \"piece of trivia from waaaaay back: in \"Choo Choo Ch'Boogie\", why \"*democratic* fellows named Mack\"? what's that line about?\"\n\n[Excerpt: Louis Jordan, “Choo Choo Ch'Boogie”]\n\nWell, I've never actually seen an interview with",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode of A History of Rock Music in Five Hundred Songs is the first of two bonus episodes answering listener questions at the end of the first year of the podcast.. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nPatreon backers can ask questions for next episode at this link.\n\nBooks mentioned -- Last Train to Memphis by Peter Guralnick, Before Elvis by Larry Birnbaum, Roots, Radicals and Rockers by Billy Bragg, Honkers and Shouters by Arnold Shaw.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nHello, and welcome to the first of our two-part question and answer session.\n\nFor those who didn't hear the little admin podcast I did last week, this week and next week are not regular episodes of the podcast -- I'm taking two weeks out to ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}