{
  "title": "MBA to Data Science: Career Transition",
  "link": "https://dimensionless.in/career-transition-data-science-mba/",
  "comments": "https://dimensionless.in/career-transition-data-science-mba/#respond",
  "dc:creator": "Pooja Sahatiya",
  "pubDate": "Thu, 07 Nov 2019 15:23:17 +0000",
  "category": [
    "Career Transitions",
    "Data Science",
    "Career Switch Data Science",
    "Career Transition",
    "data science careers",
    "data science job",
    "data science professional",
    "data science skillset",
    "Data Science Success Story",
    "future ready careers",
    "Hardware Engineer",
    "Learn Data Science and Business Analytics",
    "Machine Learning",
    "Network Engineer",
    "Research Associate"
  ],
  "guid": "https://dimensionless.in/?p=216526",
  "description": "Dimensionless ensured that my journey from MBA to Data Science was a succcessful one.",
  "content:encoded": "\n<h2>Career Jump from MBA to Data Science Success Story</h2>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>Knowledge is what matters the most in the industry. </p>\n<cite><a href=\"https://www.linkedin.com/in/karthik-sripati-686370129/\">&#8211; Karthik Sripati</a></cite></blockquote>\n\n\n\n<h3>Background</h3>\n\n\n\n<p><strong>Education:</strong> Masters in Business Administration</p>\n\n\n\n<table class=\"wp-block-table is-style-stripes\">\n<tbody>\n<tr>\n<td><strong>Previous Profile  >>></strong></td>\n<td><strong>Current Profile</strong></td>\n</tr>\n<tr>\n<td>Company: Amazon State Street Syntel<br />Profile: <strong>Operations </strong><br />Designation: Deputy Manager<br />Domain: BFSI<br />Experience: 2.2 years</td>\n<td>Company: Google<br />Profile: Data Analysis<br />Designation: <strong>Deputy Manager</strong><br />Domain: KPO (IT) Software</td>\n</tr>\n</tbody>\n</table>\n\n\n\n<div class=\"wp-block-spacer\" style=\"height: 32px\" aria-hidden=\"true\"> </div>\n\n\n\n<h3>My journey into Data Science<br /><br /></h3>\n\n\n\n<h4>Why Data Science?</h4>\n\n\n\n<p>During my MBA days, or even when I was working at Amazon State Street Syntel, I kept hearing about AI & Data Science and the new projects that were coming up. Everyone always got excited when they spoke about Data Science. I was always good at Maths. Coming from a background of Business Studies, data crunching and data analysis always fascinated me. I wanted to have a holistic point of view of the business trends and future forecasting.</p>\n\n\n\n<p>I understood that Data Science focuses on Problem Solving, Analytical Skills and Domain Knowledge. In my job also, I was working on Reporting and business analysis. So, that’s where my liking to Data Science began.</p>\n\n\n\n<h4>Why Dimensionless?</h4>\n\n\n\n<p>I did a lot of research to find the perfect classes. I checked their reviews and contacted a couple of students who had done their course to be doubly sure and they all verified that the teachers would deep dive into the subjects and give individual attention to all students.</p>\n\n\n\n<p>After a discussion based on my profile with the mentors, I was able to get beyond my fears of programming.</p>\n\n\n\n<p>In the Demo sessions, I liked their teaching method and the teacher’s knowledge. And, that’s what mattered the most for me.</p>\n\n\n\n<h4>Experience with Dimensionless?</h4>\n\n\n\n<p>I was never into any technical role, never even had any technical subjects. Really, I didn’t know how I was going to cope with the coding bit. It was difficult at the start. The classes progressed and I found it easier to understand Python and Machine Learning. By the end of the course, I got quite good at coding. I asked a lot of doubts in the classes and the teachers were always ready to help.</p>\n\n\n\n<h3>Career Transition to Data Science</h3>\n\n\n\n<p>With the help of project mentoring and resume-building activities at Dimensionless, I updated my profile. They suggested the apt projects and skills for adding to my profile, which made it a bit relevant to my domain knowledge too. <br />Frankly, I thought I will have to give a lot of interviews before I crack one. After a walk-in interview, I got the idea about the kind of questions asked in Data Science interviews. I nailed it in the next interview and got placed to a position similar to my previous one.</p>\n\n\n\n<figure class=\"wp-block-pullquote\">\n<blockquote>\n<p>I’ve learnt from my personal experience that most businesses look for capable people and not certifications.</p>\n</blockquote>\n</figure>\n\n\n\n<p>Do you also want a career transition like Karthik? <br /><strong>Follow this </strong><a href=\"http://dimensionless.in/\"><strong>link</strong></a>, and make it possible with Dimensionless Techademy!</p>\n\n\n\n<p>Furthermore, if you want to read more about data science, you can <strong>read our blogs </strong><a href=\"http://dimensionless.in/blog\"><strong>here</strong></a><strong>.</strong></p>\n\n\n\n<p>&nbsp;</p>\n",
  "wfw:commentRss": "https://dimensionless.in/career-transition-data-science-mba/feed/",
  "slash:comments": 0
}