{
  "id": "https://bibleinoneyear.org/en/youth/244",
  "title": "Day 244: Find Your Purpose in Life",
  "description": "Proverbs 21:17,21,25–26, Micah 6:8b, 2 Corinthians 5:1-10. *It has been said that ‘the two greatest days of your life are the day you were born and the day you find out why’  God created you with a purpose in mind (2 Corinthians 5:5)",
  "pubDate": "Wed, 01 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/244/?ignore",
  "itunes:duration": "14:26",
  "guid": "enyouth01092021-244",
  "length": 866.48,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 244: Find Your Purpose in Life",
  "itunes:subtitle": "Proverbs 21:17,21,25–26, Micah 6:8b, 2 Corinthians 5:1-10. *It has been said that ‘the two greatest days of your life are the day you were born and the day you find out why’  God created you with a purpose in mind (2 Corinthians 5:5)",
  "itunes:summary": "‘What a waste!’ said a woman to my friend. This woman was talking about Bishop Sandy Millar, who had practised very successfully as a lawyer for ten years, before leaving it all behind to become an ordained minister in the church.\n‘A waste?’ exclaimed my outraged friend. ‘Yes,’ said the woman, ‘Such a waste! He could have made a fortune and been at the very top of the legal profession. Think of what he could have achieved!’\n‘Think of what he has achieved!’ replied my friend – who was thinking of the impact of Sandy’s ministry on thousands of people around the world whose lives had been changed, marriages enriched and churches renewed; those who found faith, love, hope and peace through encountering Jesus Christ as a result of Sandy’s ministry.\nMany have given up a successful career, a high salary and – in the eyes of the world – all their prospects, in order to serve God in ‘full-time ministry’ with little or no pay. They know that theirs is a high calling and purpose that far exceeds what the world can promise them.\nOf course, those called to serve God in their secular places of work have an equally high purpose and calling, if they are doing what they are doing in order to please God and for the sake of his kingdom. The key is not the job or career – but the goal you pursue.\nSo many people waste their lives. They have no purpose, meaning or goal. Other people do have a goal, but it is the wrong one. They end up chasing something that is ultimately meaningless. Many reach the top of the ladder of success only to find that it is leaning against the wrong wall. Purpose in life is far more important than property or possessions. Having more to live with is no substitute for having more to live for.\nIt has been said that ‘the two greatest days of your life are the day you were born and the day you find out why’. God created you with a purpose in mind (2 Corinthians 5:5).",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 244
}