{
  "id": "yt:video:prKS4YsSnmE",
  "yt:videoId": "prKS4YsSnmE",
  "yt:channelId": "UCX6b17PVsYBQ0ip5gyeme-Q",
  "title": "Los Angeles Uprisings: Crash Course Black American History #45",
  "link": "",
  "author": {
    "name": "CrashCourse",
    "uri": "https://www.youtube.com/channel/UCX6b17PVsYBQ0ip5gyeme-Q"
  },
  "published": "2022-08-26T18:00:19+00:00",
  "updated": "2022-08-29T19:30:28+00:00",
  "media:group": {
    "media:title": "Los Angeles Uprisings: Crash Course Black American History #45",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In this episode of Black American History, Clint Smith teaches you about the complicated history of racial tension in South Central Los Angeles. You'll learn about the Watts Rebellion of 1965, a 6-day uprising in response to police brutality that shaped the landscape of racial tension in southern California for years to come. This tension culminated in two major events -- the murder of Latasha Harlins and the beating of Rodney King in 1991 -- which incited the L.A. Uprisings of 1992. \n\nClint's book, How the Word is Passed is available now! https://bookshop.org/books/how-the-word-is-passed-a-reckoning-with-the-history-of-slavery-across-america/9780316492935 \n\nVIDEO SOURCES\nOxford Language Dictionary\nhttps://supreme.justia.com/cases/federal/us/261/204/\nLynn M. Itagaki, Civil Racism: The 1992 Los Angeles Rebellion and the Crisis of Racial Burnout (Minneapolis: University of Minnesota Press, 2016).\nRobert Gooding-Williams, ed., Reading Rodney King/Reading Urban Uprising (New York & London: Routledge, 1993).\nBrenda Stevenson, The Contested Murder of Latasha Harlins: Justice, Gender, and the Origins of the LA Riots (New York: Oxford University Press, 2013). \n\nWatch our videos and review your learning with the Crash Course App! \nDownload here for Apple Devices: https://apple.co/3d4eyZo\nDownload here for Android Devices: https://bit.ly/2SrDulJ\n\nCrash Course is on Patreon! You can support us directly by signing up at http://www.patreon.com/crashcourse\n\nThanks to the following patrons for their generous monthly contributions that help keep Crash Course free for everyone forever:\nKatie, Hilary Sturges, Austin Zielman, Tori Thomas, Justin Snyder, daniel blankstein, Hasan Jamal, DL Singfield, Amelia Ryczek, Ken Davidian, Stephen Akuffo, Toni Miles, Steve Segreto, Michael M. Varughese, Kyle & Katherine Callahan, Laurel Stevens, Michael Wang, Stacey Gillespie (Stacey J), Burt Humburg, Allyson Martin, Aziz Y, Shanta, DAVID MORTON HUDSON, Perry Joyce, Scott Harrison, Mark & Susan Billian, Junrong Eric Zhu, Alan Bridgeman, Rachel Creager, Breanna Bosso, Matt Curls, Tim Kwist, Jonathan Zbikowski, Jennifer Killen, Sarah & Nathan Catchings, team dorsey, Trevin Beattie, Divonne Holmes à Court, Eric Koslow, Jennifer Dineen, Indika Siriwardena, Jason Rostoker, Shawn Arnold, Siobhán, Ken Penttinen, Nathan Taylor, Les Aker, William McGraw, ClareG, Rizwan Kassim, Constance Urist, Alex Hackman, Jirat, Pineapples of Solidarity, Katie Dean, NileMatotle, Wai Jack Sin, Ian Dundore, Justin, Mark, Caleb Weeks\n__\n\nWant to find Crash Course elsewhere on the internet?\nFacebook - http://www.facebook.com/YouTubeCrashCourse\nTwitter - http://www.twitter.com/TheCrashCourse\nInstagram - https://www.instagram.com/thecrashcourse/\n\nCC Kids: http://www.youtube.com/crashcoursekids",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}