{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-267735805391818044",
  "published": "2019-11-21T09:41:00.000-08:00",
  "updated": "2019-12-20T18:19:55.359-08:00",
  "title": "Hispanic Heritage Month Pay It Forward Challenge 2019: Recognizing students making a difference (Part 2 of 3)",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">In honor of Hispanic Heritage Month, Google hosted a&nbsp;<a href=\"https://events.withgoogle.com/2019-pay-it-forward-challenge-hispanic-heritage-month/\">Pay It Forward Challenge</a>&nbsp;to recognize Hispanic and Latinx student leaders who are advancing opportunities for their local communities. After receiving many submissions we’re excited to share the work of the students below and hope you’ll be inspired by their stories.<br /><br /><div><b>Gerardo Gamiño</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-e1eUftIW-8U/XdbKfP_yh6I/AAAAAAAAAvs/TL4413l89cMbY-zxilvvpzzjktTtlgzkwCEwYBhgL/s1600/unnamed%2B%252841%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"341\" data-original-width=\"512\" height=\"425\" src=\"https://1.bp.blogspot.com/-e1eUftIW-8U/XdbKfP_yh6I/AAAAAAAAAvs/TL4413l89cMbY-zxilvvpzzjktTtlgzkwCEwYBhgL/s640/unnamed%2B%252841%2529.jpg\" width=\"640\" /></a></div><div>Gerardo is a student at Brigham Young University. Last year he founded a non-profit called&nbsp;<a href=\"http://www.mipuente.org/\">Puente</a>&nbsp;with the mission, “to teach Latino parents how to help their children access higher education.” Puente members host workshops on several topics including: getting ready for college, the application process, financial aid, and transitioning to college. They also provide a mentoring program where each individual family is paired up with a mentor who guides them through the college readiness process according to their specific needs. They are currently working with eight high schools in Utah.</div><div><br /></div><div><u>Gerardo’s advice to others</u>:</div><div>“Start today! The difference between where you are now with your idea and where you could be, is that first leap of faith and confidence. When you have a desire to help your community, you will quickly recognize that there are many around you who feel the same. Your courageous first step to make an impact will inspire others to take their first steps. ¡Vamos Adelante!”</div><div><br /></div><div><u>On Gerardo’s mind during Hispanic Heritage Month</u>:</div>“My mind is focused on the struggles of those who came before me. The Hispanic community is vibrant, beautiful, and full of life. This is thanks to those who didn’t have many opportunities available, but were determined to fight for me to have them now. Although we must continue to work toward the dreams of our parents, I am filled with deep gratitude for their sacrifice. The long hours in the picking fields, the countless tears in response to prejudice, the selfless work to provide for a needy family all fill my heart with gratitude.”<br /><div><br /></div><div><div><b>Veronica Alvarez&nbsp;</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-fwA551LK1pU/XdbKh5IgxHI/AAAAAAAAAwI/AMRYjScSsDUlSCujRVW44RbtWX4up_lIQCEwYBhgL/s1600/unnamed%2B%25286%2529.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" height=\"640\" src=\"https://1.bp.blogspot.com/-fwA551LK1pU/XdbKh5IgxHI/AAAAAAAAAwI/AMRYjScSsDUlSCujRVW44RbtWX4up_lIQCEwYBhgL/s640/unnamed%2B%25286%2529.png\" width=\"480\" /></a></div><div>Veronica is an officer for the Hispanic Business Student Association at the C.T. Bauer College of Business at the University of Houston.&nbsp; The HBSA’s mission is to empower Hispanic and Latinx students through events and workshops that encompass their five pillars: academics, leadership, service, professionalism, and familia. As an officer, Veronica establishes relationships and secures sponsorships from STEM based companies — empowering members in believing they can pursue careers in STEM. She is&nbsp; also actively mentoring another HBSA chapter with their professional development and exposure to the STEM industry.</div><div><br /></div><div><u>Veronica’s advice to others</u>:</div><div>“Start where you are now — no matter how big or small. You never know whose lives you’ll be impacting and how important your actions are to them as you advocate for change. Always remember why you started and let it be your fuel. There will be ups and downs and moments of self-reflection, but ask yourself, ‘if not now, when?,’ and, ‘If not me, who?’”</div><div><br /></div><div><u>On Veronica’s mind during Hispanic Heritage Month</u>:</div><div>“I think of my parents, and their sacrifice everyday. It’s what fuels me to keep going during this time we are in. This is our time, our time to learn, advocate and empower one another. Learn about our communities’ contributions, like Latina trailblazers that have paved the way, and how we can continuously improve ourselves and be more inclusive of others. We need to unify as a Latinx/Hispanic community and look less upon our differences but rather more on what brings us together.”</div><div><br /></div><div><b>Calvin Duran&nbsp;</b><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-oHTTmhgBxw0/XdbKhQQybVI/AAAAAAAAAwE/Q0aR0zltYkoeMhNc28kOke6kJha8pRjDACLcBGAsYHQ/s1600/unnamed%2B%25285%2529.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"398\" height=\"640\" src=\"https://1.bp.blogspot.com/-oHTTmhgBxw0/XdbKhQQybVI/AAAAAAAAAwE/Q0aR0zltYkoeMhNc28kOke6kJha8pRjDACLcBGAsYHQ/s640/unnamed%2B%25285%2529.png\" width=\"496\" /></a></div>Calvin is a student at Harvard University. After noticing the lack of a professional platform for Harvard’s Latinx community, Calvin began conversations with alumni and students, and identified a need for a space where Latinx students could motivate and empower one another. As a result, he founded&nbsp;<a href=\"https://www.harvardlift.org/\">Latinxs in Finance &amp; Technology (LiFT)</a>, Harvard’s first pre-professional network driven to prepare and support Latinx students. In less than a year, LiFT amassed over 120 members, and has partnered with multiple companies to promote diversity in the workplace.<br /><br /><u>Calvin’s advice to others</u>:<br />“Once you have identified a potential problem, don’t be afraid to take initiative and step up to the plate to solve it. Although embarking on a new initiative may be daunting at first, the opportunity to positively impact a community outweighs this cost. One way to mitigate feelings of fear is to mobilize peers who support your mission.”<br /><br /><u>On Calvin’s mind during Hispanic Heritage Month</u>:<br /><div>“I try to be mindful of the complexities behind the Hispanic/Latinx identity. Instead of focusing on distinctions, I view this month as a celebration of our community's differences and highlighting the diversity of the Latinx experience as a collective strength.”</div><div><b><br /></b></div><div><b>Christian Porras&nbsp;</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-R-FpjQs3MHM/XdbKf8jfLuI/AAAAAAAAAv4/wd9egI-GU_sCl5PABuh_UXPB74QKYz-twCEwYBhgL/s1600/unnamed%2B%252842%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"280\" data-original-width=\"278\" height=\"640\" src=\"https://1.bp.blogspot.com/-R-FpjQs3MHM/XdbKf8jfLuI/AAAAAAAAAv4/wd9egI-GU_sCl5PABuh_UXPB74QKYz-twCEwYBhgL/s640/unnamed%2B%252842%2529.jpg\" width=\"635\" /></a></div><div>As an undergraduate at The University of Chicago, Christian founded a chapter of the&nbsp;<a href=\"https://www.sacnas.org/\">Society for the Advancement of Chicanos/Hispanics and Native Americans in STEM (SACNAS)</a>. In his&nbsp; three years as president, he and his leadership team have worked to serve their Midwest community of scientific leaders. They’ve led three research conferences that collectively supported more than 500 students from 30 different schools. He also founded a computational STEM lab to get Chicago public school students excited about pursuing computational science in college.&nbsp;</div><div><br /></div><div><u>Christian’s advice to others</u>:</div><div>“Dream big, but know it’s okay to start small. I’ve learned that I’m more successful when I’ve tried running a new program as a pilot before expanding beyond my neighborhood.”&nbsp;</div><div><br /></div><div><u>On Christian’s mind during Hispanic Heritage Month</u>:</div><div>“I’m proud of the many Hispanic families, including my own, that have often sacrificed so much to come to America and provide opportunities to their children. As a first-generation college student from an immigrant household, I value the courage and determination of my parents and grandparents.”&nbsp;</div><div><br /></div></div><div><div><b>Uribe Valverde</b>&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-JLyFBRYCvKU/XdbKgWpcINI/AAAAAAAAAv8/ZZlKEapDKgkrr8UqYlCj5ob8jXM9MQRdwCEwYBhgL/s1600/unnamed%2B%252843%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"384\" height=\"640\" src=\"https://1.bp.blogspot.com/-JLyFBRYCvKU/XdbKgWpcINI/AAAAAAAAAv8/ZZlKEapDKgkrr8UqYlCj5ob8jXM9MQRdwCEwYBhgL/s640/unnamed%2B%252843%2529.jpg\" width=\"480\" /></a></div><div>Uribe is a student at Georgia State University. He is the President/Co-founder of the PrimX Mentor Program — a mentorship program for the Latinx community at Georgia State. He also takes part in organizations to unite the Latinx community on campus. He is the head of events and PR for the Latin American Student Association (and the only freshman on the executive board). In his spare time he is the head fundraiser for&nbsp;<a href=\"https://www.facebook.com/gsuhsfchapter/\">Avanzando Un Sueño</a>, a student led organization dedicated to giving scholarships to DACA students in Atlanta.</div><div><br /></div><div><u>Uribe’s advice to others</u>:</div><div>“Don’t be afraid to change your community or the world around you. Speak up and share your ideas with others — the people around you could have the resources, background, or experiences you need. Don’t be afraid to ask for help and give help to others. Nothing is too little in the spirit of giving.”&nbsp;</div><div><u><br /></u></div><div><u>On Uribe’s mind during Hispanic Heritage Month</u>:</div><div>“It is the time for my organizations and I to speak to the diversity, culture, memories, and traditions of the community. This year I want to make sure there is an emphasis on the different identities present all across continents, small towns, and the larger society. I want to make sure underrepresented voices are heard because diversity is what keeps us together.”</div><div><br /></div><div><b>Jennifer Garcia&nbsp;</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-0xNgARq1z8Q/XdbKfLqTiYI/AAAAAAAAAvw/XCXNBrYbptAZiLsobwk_KtRqv73tQozBACEwYBhgL/s1600/unnamed%2B%252840%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"410\" height=\"640\" src=\"https://1.bp.blogspot.com/-0xNgARq1z8Q/XdbKfLqTiYI/AAAAAAAAAvw/XCXNBrYbptAZiLsobwk_KtRqv73tQozBACEwYBhgL/s640/unnamed%2B%252840%2529.jpg\" width=\"512\" /></a></div><div>Jennifer is a student from the University of Texas at Dallas. She recently launched an initiative to start a scholarship program, <a href=\"https://www.enmibarrioscholarship.com/\">En Mi Barrio</a>, to help Latinx high school seniors in the Dallas Independent School District (DISD) reach their full potential through post-secondary education.&nbsp;</div><div><br /></div><div><u>Jennifer’s advice to others</u>:</div><div>“Be devoted.”</div><div><br /></div><div><u>On Jennifer’s mind during Hispanic Heritage Month</u>:</div><div>“It is essential to create opportunities that allow members of the Hispanic/Latinx community to enter into industries where we are underrepresented. It is vital to support one another in various ways and most importantly make sure the youth grow with the support of everyone else to make their dreams come true. Now more than ever we need to be represented.”&nbsp;</div><div><div><b><br /></b></div><div><b>Jefferson Betancourt&nbsp;</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-tYqJQ9njoGc/XdbKg7dG90I/AAAAAAAAAwA/hugzMPhsvJsrLadIzWqulfp2xCTfO49DACEwYBhgL/s1600/unnamed%2B%252844%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"512\" height=\"640\" src=\"https://1.bp.blogspot.com/-tYqJQ9njoGc/XdbKg7dG90I/AAAAAAAAAwA/hugzMPhsvJsrLadIzWqulfp2xCTfO49DACEwYBhgL/s640/unnamed%2B%252844%2529.jpg\" width=\"640\" /></a></div><div>Jefferson is a student at Cornell Johnson Graduate School of Management. Jefferson has experienced first hand the difficulty of navigating the education system with the burden of debt and lack of career guidance. As a result he co-founded the&nbsp;<a href=\"http://betancourtscholarshipfund.com/\">Betancourt scholarship fund</a>, a non-profit corporation that assists first generation college students succeed in their first semester with financial support and mentorship.</div><div><br /></div><div><u>Jefferson’s advice to others</u>:</div><div>“Get started! Everyone will always be busy and it's easy to get caught up in your own life and forget to help others. Always remember that with great opportunity and success comes great responsibility to elevate other.”&nbsp;</div><div><br /></div><div><u>On Jefferson's mind during Hispanic Heritage Month</u>:</div><div>“I will forever be appreciative for my parents sacrifice of starting a new life in a foreign land to give opportunities to my brother and I. Moreover, I am a proud American and look forward to leaving a lasting positive impact on my Latin community.”&nbsp;</div></div><div><br /></div><div><b>Daniela Beck</b></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-2io4iHkoQpc/XdbKfL1MpQI/AAAAAAAAAv0/1TAYXgUoboU8s16p-Bfbe0GtImlXyuSgwCEwYBhgL/s1600/unnamed%2B%252839%2529.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"512\" data-original-width=\"443\" height=\"640\" src=\"https://1.bp.blogspot.com/-2io4iHkoQpc/XdbKfL1MpQI/AAAAAAAAAv0/1TAYXgUoboU8s16p-Bfbe0GtImlXyuSgwCEwYBhgL/s640/unnamed%2B%252839%2529.jpg\" width=\"552\" /></a></div><div><br /></div><div>Daniela is a student at Chatham University and a leader in the <a href=\"https://www.facebook.com/groups/bloominglastingcareers/learning_content/\">Blooming Lasting Careers (BLC)</a> movement. BLC was formed out of a need to give students from around the world access to opportunities to help them reach the next level of their career. Daniela manages information distribution to over 5,000 students in addition to acting as a one-on-one mentor.&nbsp;</div><div><br /></div><div><u>Daniela’s advice to others</u>:</div><div>“I would advise anyone who is looking to make an impact in their local community to look internally and recognize where you can help the most. Think about your talents, ambitions, and passions and see where that intersects with a need in your local area. Additionally, I suggest having a group of advisors (whether that involves peers, friends, or others) that can act as a support system to encourage and help you during the process.”</div><div><br /></div><div><u>On Daniela’s mind during Hispanic Heritage Month</u>:</div><div>“How we as a community can help to strengthen those in our circles that have made sacrifices so that their families can have better lives. My own mother immigrated to the United States from Colombia over 25 years ago while leaving her home and family behind. This is something that I've always admired and looked up to.”</div></div><div><br /></div></div>Keep up with us on social (<a href=\"https://twitter.com/googlestudents\">Twitter</a>,&nbsp;<a href=\"https://www.instagram.com/googlestudents/\">Instagram</a>,&nbsp;<a href=\"https://www.facebook.com/GoogleStudents/\">Facebook</a>, and&nbsp;<a href=\"https://www.youtube.com/GoogleStudents\">YouTube</a>) to hear more about our initiatives.<br /><div><br /></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 377
}