{
  "guid": "prx_137_8fb702cc-ce36-4371-b009-701b0ce9a39b",
  "title": "812 - National Lampoon's Vacation - Tale of the Tape",
  "pubDate": "Wed, 02 Oct 2019 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/274143",
  "description": "<p>A meandering road trip to Wally World via the sleepy side roads of Scoot’s mind.<br>\n<br>\n(You can find all of our sponsors or become a patron on our new website <a href=\"http://www.sleepwithmepodcast.com/\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com</a> story starts at about 20:00)<br>\n<br>\nCommission a song from the Mystery Bard over at <a href=\"http://www.jonathanmann.net/\" rel=\"nofollow\" target=\"_blank\">http://www.jonathanmann.net<br>\n<br>\n</a>This week the show is sponsored by-</p>\n\n<p><a href=\"http://www.mintmobile.com/sleep\" rel=\"nofollow\" target=\"_blank\">Mint Mobile</a>- Have you looked at your wireless bill lately? You’re probably paying too much. Network coverage is better than ever, no matter your wireless provider. So why pay more for the same service? That’s where <strong>Mint Mobile</strong> comes in, they can cut your bill down to $15 bucks a month for the same premium coverage! To get your new wireless plan for just $15 a month go to <a href=\"http://www.mintmobile.com/sleep\" rel=\"nofollow\" target=\"_blank\">www.mintmobile.com/sleep</a>!</p>\n\n<p><a href=\"http://www.brooklinen.com\" rel=\"nofollow\" target=\"_blank\">Brooklinen</a>- Luxury bedding, at amazing prices. You have to try these sheets today! There is an exclusive offer just for Sleep With Me listeners. Get $20 off AND free shipping when you use promo code [WITHME] at <a href=\"http://www.brooklinen.com\" rel=\"nofollow\" target=\"_blank\">http://www.brooklinen.com</a>. Brooklinen is SO confident that they offer **a risk-free 60-night satisfaction guarantee and a lifetime warranty on all of their sheets and comforters! **<br>\n<br>\n<a href=\"http://www.foursigmatic.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">Four Sigmatic</a>- a natural superfood company that specializes in mushroom-based drinks that benefit immunity, energy, and longevity, and help us live healthier, more enhanced lives. <a href=\"http://www.foursigmatic.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">Four Sigmatic</a> makes a wide variety of blends, including mushroom coffee, mushroom elixirs, hot cacaos, matcha, superfood blends, and more. Use <a href=\"http://www.foursigmatic.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">www.foursigmatic.com/sleepwithme</a> or promo code “sleepwithme” for 15% off your purchase. Make their Mushroom Hot Caco With Reishi or Reishi Elixir a part of your wind-down routine! Sip it like Scoots as you read and relax.</p>\n\n<p><a href=\"http://www.wix.com/sleep\" rel=\"nofollow\" target=\"_blank\">Wix</a>- Create a stunning website and get 20% a Wix premium plan today! Wix has over 500 amazing templates to start with and over 140 million people use Wix for their website. I’m working on a special Wix website you can check out soon!! So get over to <a href=\"http://wix.com/sleep20\" rel=\"nofollow\" target=\"_blank\">wix.com/sleep20</a>!<br>\n<br>\n<a href=\"http://www.betterhelp.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">Betterhelp</a> -Betterhelp offers licensed professional counselors who are specialized in issues, such as depression, stress, anxiety, relationships, sleeping, and more. Best of all, it’s a truly affordable option and our listeners get 10% off your first month with discount code “sleepwithme”. Go over to <a href=\"http://www.betterhelp.com/sleepwithme\" rel=\"nofollow\" target=\"_blank\">www.betterhelp.com/sleepwithme </a>and simply fill out a questionnaire to help them assess your needs and get matched with a counselor you’ll love.</p>",
  "enclosure": "",
  "itunes:title": "National Lampoon's Vacation - Tale of the Tape",
  "itunes:subtitle": "A meandering road trip to Wally World via the sleepy side roads of Scoot’s mind.",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:episode": 812,
  "itunes:duration": "01:05:12"
}