{
  "title": "S14 Ep75: Supernatural News/Parashare: Bring Out Your Dead Edition",
  "link": "https://audioboom.com/posts/8098555",
  "itunes:episode": 75,
  "itunes:title": "Supernatural News/Parashare: Bring Out Your Dead Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6311,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Bring Out Your Dead Edition of Supernatural News & Parashare is available NOW!<br>\n<br>\nIt's been another Phenomenal (doo doo do doo do) week with strange stories in abundance!  We take you to Pot Mountain to have an out of this world experience with UFOs, Jack the Ripper is at it again!, we explore Megan Fox's Phantom and we uncover an unsettling truth about Climate Change you have to hear to believe....or do you?<br>\n<br>\nPLUS Your stories today on the best in paranormal talk radio! Beyond the Darkness<br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\nCarnival Row is a one-hour fantasy drama series starring Orlando Bloom and Cara Delevingne . The series is set in a Victorian fantasy world filled with mythological immigrant creatures whose exotic homelands were invaded by the empires of man. Come together on August 30th to watch Carnival Row only on Amazon Prime Video this Labor Day Weekend!<br>\n<br>\nFeals naturally helps reduce stress, anxiety, pain, and sleeplessness.  Place a few drops of Feals under your tongue and feel the difference within minutes. Become a member today by going to <a href=\"http://Feals.com/DARKNESS\">Feals.com/DARKNESS</a> and you'll get 50% off your first order with free shipping<br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.",
  "itunes:summary": "BEYOND the DARKNESS Bring Out Your Dead Edition of Supernatural News & Parashare is available NOW!\n\nIt's been another Phenomenal (doo doo do doo do) week with strange stories in abundance!  We take you to Pot Mountain to have an...",
  "pubDate": "Sat, 14 Sep 2019 08:00:00 +0000",
  "guid": "0520ca97-6a0c-4150-8367-c1598be353b4",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}