{
  "id": "https://bibleinoneyear.org/en/youth/277",
  "title": "Day 277: Attitude of Gratitude",
  "description": "Psalm 116:12–19, Jeremiah 9:3, Colossians 1:3–23.  It is the lens through which to view our entire life  Ultimately, as we see in today’s passages, the world can be divided into two categories: those who acknowledge God and give thanks to him, and those who don’t",
  "pubDate": "Tue, 04 Oct 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/277/",
  "itunes:duration": "15:12",
  "guid": "enyouth04102022-277",
  "length": 912.95,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 277: Attitude of Gratitude",
  "itunes:subtitle": "Psalm 116:12–19, Jeremiah 9:3, Colossians 1:3–23.  It is the lens through which to view our entire life  Ultimately, as we see in today’s passages, the world can be divided into two categories: those who acknowledge God and give thanks to him, and those who don’t",
  "itunes:summary": "Jean Smith told me her story. She was in her mid-sixties. She came from Cwmbran in Wales. She had been blind for sixteen years. She had a white stick, and a guide dog named Tina. An infection had eaten away at the retinas and mirrors behind her eyes – they could not be replaced. She was in constant pain.\nJean went on a local Alpha course. They had a day away to focus on the work of the Holy Spirit. During this time, the pain left. She went to church the following Sunday to thank God. The minister anointed her with oil. As she wiped the oil away she could see the communion table. God had miraculously healed Jean.\nShe had not seen her husband for sixteen years. She was surprised at how white his beard was! Jean had never even seen her daughter-in-law before. Her six-and-a-half-year-old grandson used to guide her around the puddles to avoid her getting her feet wet.\nHe said to her, ‘Who done that Gran?’\nShe replied, ‘Jesus made me better.’\n‘I hope you said thank you, Gran.’\n‘I will never stop saying thank you,’ she answered.\nYesterday we read Paul’s encouragement: ‘In everything, by prayer and petition, with thanksgiving, present your requests to God’ (Philippians 4:6). Today we see him putting his own instructions into practice. Like Jean, Paul was also constantly giving thanks to God. He had an attitude of gratitude.\nPraise is giving glory to God for who he is. Thanksgiving is giving glory to God for what he has done for us. It is the lens through which to view our entire life. Ultimately, as we see in today’s passages, the world can be divided into two categories: those who acknowledge God and give thanks to him, and those who don’t.\nHow do you cultivate an attitude of gratitude?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 642
}