{
  "title": "Special Episode: COVID-19 - Will Pills Change the Game?",
  "description": "<p>New data on an oral antiviral treatment could have significant impact on the COVID treatment landscape. What’s next for treatments, booster shots and child vaccines.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Matthew Harrison </strong>And I'm Matthew Harrison, Biotechnology Analyst.</p><p><br></p><p><strong>Andrew Sheets</strong> And on this special edition of the podcast, we'll be talking about several new developments in the fight against COVID 19. It's Tuesday, October 5th at 3 p.m. in London,</p><p><br></p><p><strong>Matthew Harrison </strong>and it's 10:00 a.m. in New York</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt. I really wanted to catch up with you today because there are a number of different storylines involving COVID 19 going on at the moment, from child vaccines to the situation with booster shots. But I suppose the headline story that's getting the most attention is data released last Friday on Merck's new oral COVID treatment pill Molnupiravir or I think I said that right. I'm sure I didn't. So maybe let's start there. What is this treatment and why does it matter?</p><p><br></p><p><strong>Matthew Harrison </strong>Yes. Thanks, Andrew. So Molnupiravir is an oral antiviral against COVID. The way it works is that it stops the virus from replicating effectively, and that reduces the amount of virus in someone's body. It was studied here in patients that were recently diagnosed with COVID 19. And it cut the rate of hospitalization in those patients by 50%. So those that didn't get treated with the drug went to hospital at a rate of 14%, and those that did get treated went to hospital rate of 7%. I think the thing I would want to highlight is that this is something you obviously take after you get infection and vaccines remain the primary way to prevent infection.</p><p><br></p><p><strong>Andrew Sheets </strong>So this is kind of one of the things I felt that was so fascinating when that news was announced. Because on the one hand, this seems like very good news, another treatment that appears highly effective against COVID 19. And yet the market reaction was actually to really punish many of the makers of the current COVID vaccines, so how much do you think this could influence the COVID treatment landscape? And do you think the market or people might be overreacting to some of the impact on whether or not people will still get vaccines or vaccines will remain important?</p><p><br></p><p><strong>Matthew Harrison </strong>Vaccines, their primary measure is prevention. Right? This is a drug to treat people once you get disease. But the hope is, and the way we get out of the pandemic, is still by vaccinating everybody to prevent disease from happening and disease from spreading. So, I think of this drug, along with antibodies as drugs that you use to treat people who either have breakthrough infections or those that aren't vaccinated. But you also have antibodies for people that are at higher risk, patients that might not be compliant with taking oral drugs. Or, you know, a whole another segment of the market that we haven't talked about is those that need to be protected either because they can't get a good response to the vaccine, because they're perhaps immunocompromised or otherwise, and those that need some sort of preventative treatment. Where Merck is studying this pill as a preventative treatment, but the antibodies are already authorized as preventative treatments. So, there's a different section of the landscape, I would say, for each of these drugs.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Matt, what impact do these potentially positive results on a pill mean for vaccine hesitancy in the outlook for vaccinations?</p><p><br></p><p><strong>Matthew Harrison </strong>I think that's one of the things that the market is is struggling a lot with, and I think that's part of the reason you saw many of the vaccine stocks under pressure, right? There's definitely one segment of the market that thinks, if you have effective treatments, especially easy to use treatments like orals, that could give people another reason who don't want to have the vaccine to say, \"Look, even if I do get sick, I do have an easy to take treatment.\" And so, on the margin, right, it may impact vaccination uptake, though the flip side is what I would say is I think what we're seeing in the U.S. is at least that you're seeing broad vaccination mandates and you and you are seeing those mandates lead to increases in vaccination, especially employer based mandates. And so, there are other factors driving vaccine uptake.</p><p><br></p><p><strong>Andrew Sheets </strong>So I think it's safe to say we care about the numbers here on this Thoughts of the Market podcast. Could you just run through the various costs of different treatments if we're thinking about vaccines, you know, potential thoughts on where an oral pill could be and then the antibody treatments, which are obviously another form of treatment that we're seeing being used. Just to give people some sense of how much the relative cost of each one of those things is.</p><p><br></p><p><strong>Matthew Harrison </strong>Yes, so vaccines per shot in the U.S., depending on manufacturer, run between $16.50 And $19.50 in the U.S. So a course of vaccination, let's say costs on average about $40. There are some administration fees and otherwise, but direct to drug costs. Merck has signed a contract with the US government for $1.2 Billion for 1.7 Million courses, so that runs about $700 per course for the oral right now. And then the U.S. government also has contracts with a variety of manufacturers for antibodies, which run about $2100 per course. So treatments are more expensive than vaccination and then usually with treatments, there are other associated medical costs which I didn't cover, and I don't have a great estimate for. But obviously, as those patients that might be getting treatments because they're also hospitalized, those costs are more significant.</p><p><br></p><p><strong>Andrew Sheets </strong>So I want to jump next to the topic of child vaccinations. Last week, Pfizer and BioNTech announced that they had submitted data to the Food and Drug Administration that their coronavirus vaccine is safe and effective in children ages 5-11. What do you think? Is the timeline ahead for the next steps here?</p><p><br></p><p><strong>Matthew Harrison </strong>Yes, right, so they have submitted preliminary data, but they have not submitted the final request for an emergency use authorization. The expectation here is that there will be some back and forth between Pfizer and the regulator to finalize the exact package of data after the FDA has reviewed the initial data. That will then trigger the final submission where they ask for the request for emergency use authorization. Most of us think that would occur sometime, let's say, in the next couple of weeks. And then historically right, the FDA, once they receive that final package, takes on order of two to three weeks to approve the EUA authorization. So, I think this ranges from maybe the earliest in late October towards sometime into early November.</p><p><br></p><p><strong>Andrew Sheets </strong>Matt, I also wanted to cover the issue of booster shots, which is the other kind of large development in the fight against COVID 19, and I think there's been a little bit of confusion on the topic. So, you know, what's the latest in terms of who is eligible for a booster in the U.S. and what the CDC is recommending?</p><p><br></p><p><strong>Matthew Harrison </strong>Originally the FDA had asked their external advisory committee whether or not boosters should be made available for everyone where the original vaccine was authorized, so that would be those 16 and up. The advisory committee then asked to narrow that slightly and specifically what the advisory committee asked was: those 65 years or older, as well as those at high risk, either because of underlying medical conditions or because of occupational hazard. So that would include, hospital workers or workers who are otherwise frontline workers in a high-risk scenario. The CDC has a separate committee called ACIP, which a few days later looked into this as well, and they had voted essentially for those at high medical risk and those 65 years and older. But they had said they were somewhat uncomfortable, and it was a very close vote to be clear, about those at increased occupational risk. After that meeting, the CDC themselves or the director of the CDC said that they believe the booster shot should be made available for all of those groups and essentially overrode the committee on the last piece around occupational risk. So right now, its 65 older, immunocompromised, those at high medical risk and those at high occupational risk.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, the final thing I wanted to ask you about is one of the most positive things that seems to have come out of this this terrible pandemic is mRNA vaccination technology. It seems to be a type of medical technology that has really exceeded expectations for how quickly and how effectively a vaccine could be rolled out.</p><p><strong><s>&nbsp;</s></strong></p><p><strong>Andrew Sheets </strong>So Matt, if you think about this technology looking ahead, what do you think are the applications that potentially could go beyond COVID? And also, at what point do you think some of these vaccinations might need to be updated and how difficult will that be?</p><p><br></p><p><strong>Matthew Harrison </strong>So in terms of applications and next steps for RNA, there's a wide variety of disease areas that they're looking at. But in general, the technology is being used to make missing proteins in your body, which occurs a lot with rare genetic diseases. To potentially help various tissues that may need certain proteins or enzymes to help them heal. And also looking at ways that you could, for example, with oncology patients that you could tell the body's own immune system for key flags or markers of the tumors versus normal tissue so that you could redirect the immune system to specifically go after the cancerous tumor. In terms of needing a updated COVID vaccine. I think that all depends on the variant outlook. Currently, what we see is just giving another dose of the current vaccine provides very good protection against Delta. And so, I think as we look out on the outlook, right, it's about if Delta combines with something else, then maybe there is the potential for an update. But the manufacturers are well primed for that, and that process is a couple months process, probably if they had to do that. So, they can adapt quickly.</p><p><br></p><p><strong>Andrew Sheets </strong>Something important to keep an eye on. As always, Matt, it's been great talking with you.</p><p><br></p><p><strong>Matthew Harrison </strong>Thanks, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "itunes:title": "Special Episode: COVID-19 - Will Pills Change the Game?",
  "itunes:episodeType": "full",
  "itunes:episode": 465,
  "itunes:summary": "Recent data on an oral COVID pill had markets on alert last week. What’s next in the fight against COVID-19 and how should investors frame these developments?",
  "content:encoded": "<p>New data on an oral antiviral treatment could have significant impact on the COVID treatment landscape. What’s next for treatments, booster shots and child vaccines.</p><p><br></p><p>----- Transcript -----</p><p><strong>Andrew Sheets </strong>Welcome to Thoughts on the Market. I'm Andrew Sheets, chief cross asset strategist for Morgan Stanley Research.</p><p><br></p><p><strong>Matthew Harrison </strong>And I'm Matthew Harrison, Biotechnology Analyst.</p><p><br></p><p><strong>Andrew Sheets</strong> And on this special edition of the podcast, we'll be talking about several new developments in the fight against COVID 19. It's Tuesday, October 5th at 3 p.m. in London,</p><p><br></p><p><strong>Matthew Harrison </strong>and it's 10:00 a.m. in New York</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt. I really wanted to catch up with you today because there are a number of different storylines involving COVID 19 going on at the moment, from child vaccines to the situation with booster shots. But I suppose the headline story that's getting the most attention is data released last Friday on Merck's new oral COVID treatment pill Molnupiravir or I think I said that right. I'm sure I didn't. So maybe let's start there. What is this treatment and why does it matter?</p><p><br></p><p><strong>Matthew Harrison </strong>Yes. Thanks, Andrew. So Molnupiravir is an oral antiviral against COVID. The way it works is that it stops the virus from replicating effectively, and that reduces the amount of virus in someone's body. It was studied here in patients that were recently diagnosed with COVID 19. And it cut the rate of hospitalization in those patients by 50%. So those that didn't get treated with the drug went to hospital at a rate of 14%, and those that did get treated went to hospital rate of 7%. I think the thing I would want to highlight is that this is something you obviously take after you get infection and vaccines remain the primary way to prevent infection.</p><p><br></p><p><strong>Andrew Sheets </strong>So this is kind of one of the things I felt that was so fascinating when that news was announced. Because on the one hand, this seems like very good news, another treatment that appears highly effective against COVID 19. And yet the market reaction was actually to really punish many of the makers of the current COVID vaccines, so how much do you think this could influence the COVID treatment landscape? And do you think the market or people might be overreacting to some of the impact on whether or not people will still get vaccines or vaccines will remain important?</p><p><br></p><p><strong>Matthew Harrison </strong>Vaccines, their primary measure is prevention. Right? This is a drug to treat people once you get disease. But the hope is, and the way we get out of the pandemic, is still by vaccinating everybody to prevent disease from happening and disease from spreading. So, I think of this drug, along with antibodies as drugs that you use to treat people who either have breakthrough infections or those that aren't vaccinated. But you also have antibodies for people that are at higher risk, patients that might not be compliant with taking oral drugs. Or, you know, a whole another segment of the market that we haven't talked about is those that need to be protected either because they can't get a good response to the vaccine, because they're perhaps immunocompromised or otherwise, and those that need some sort of preventative treatment. Where Merck is studying this pill as a preventative treatment, but the antibodies are already authorized as preventative treatments. So, there's a different section of the landscape, I would say, for each of these drugs.</p><p><br></p><p><strong>Andrew Sheets </strong>So, Matt, what impact do these potentially positive results on a pill mean for vaccine hesitancy in the outlook for vaccinations?</p><p><br></p><p><strong>Matthew Harrison </strong>I think that's one of the things that the market is is struggling a lot with, and I think that's part of the reason you saw many of the vaccine stocks under pressure, right? There's definitely one segment of the market that thinks, if you have effective treatments, especially easy to use treatments like orals, that could give people another reason who don't want to have the vaccine to say, \"Look, even if I do get sick, I do have an easy to take treatment.\" And so, on the margin, right, it may impact vaccination uptake, though the flip side is what I would say is I think what we're seeing in the U.S. is at least that you're seeing broad vaccination mandates and you and you are seeing those mandates lead to increases in vaccination, especially employer based mandates. And so, there are other factors driving vaccine uptake.</p><p><br></p><p><strong>Andrew Sheets </strong>So I think it's safe to say we care about the numbers here on this Thoughts of the Market podcast. Could you just run through the various costs of different treatments if we're thinking about vaccines, you know, potential thoughts on where an oral pill could be and then the antibody treatments, which are obviously another form of treatment that we're seeing being used. Just to give people some sense of how much the relative cost of each one of those things is.</p><p><br></p><p><strong>Matthew Harrison </strong>Yes, so vaccines per shot in the U.S., depending on manufacturer, run between $16.50 And $19.50 in the U.S. So a course of vaccination, let's say costs on average about $40. There are some administration fees and otherwise, but direct to drug costs. Merck has signed a contract with the US government for $1.2 Billion for 1.7 Million courses, so that runs about $700 per course for the oral right now. And then the U.S. government also has contracts with a variety of manufacturers for antibodies, which run about $2100 per course. So treatments are more expensive than vaccination and then usually with treatments, there are other associated medical costs which I didn't cover, and I don't have a great estimate for. But obviously, as those patients that might be getting treatments because they're also hospitalized, those costs are more significant.</p><p><br></p><p><strong>Andrew Sheets </strong>So I want to jump next to the topic of child vaccinations. Last week, Pfizer and BioNTech announced that they had submitted data to the Food and Drug Administration that their coronavirus vaccine is safe and effective in children ages 5-11. What do you think? Is the timeline ahead for the next steps here?</p><p><br></p><p><strong>Matthew Harrison </strong>Yes, right, so they have submitted preliminary data, but they have not submitted the final request for an emergency use authorization. The expectation here is that there will be some back and forth between Pfizer and the regulator to finalize the exact package of data after the FDA has reviewed the initial data. That will then trigger the final submission where they ask for the request for emergency use authorization. Most of us think that would occur sometime, let's say, in the next couple of weeks. And then historically right, the FDA, once they receive that final package, takes on order of two to three weeks to approve the EUA authorization. So, I think this ranges from maybe the earliest in late October towards sometime into early November.</p><p><br></p><p><strong>Andrew Sheets </strong>Matt, I also wanted to cover the issue of booster shots, which is the other kind of large development in the fight against COVID 19, and I think there's been a little bit of confusion on the topic. So, you know, what's the latest in terms of who is eligible for a booster in the U.S. and what the CDC is recommending?</p><p><br></p><p><strong>Matthew Harrison </strong>Originally the FDA had asked their external advisory committee whether or not boosters should be made available for everyone where the original vaccine was authorized, so that would be those 16 and up. The advisory committee then asked to narrow that slightly and specifically what the advisory committee asked was: those 65 years or older, as well as those at high risk, either because of underlying medical conditions or because of occupational hazard. So that would include, hospital workers or workers who are otherwise frontline workers in a high-risk scenario. The CDC has a separate committee called ACIP, which a few days later looked into this as well, and they had voted essentially for those at high medical risk and those 65 years and older. But they had said they were somewhat uncomfortable, and it was a very close vote to be clear, about those at increased occupational risk. After that meeting, the CDC themselves or the director of the CDC said that they believe the booster shot should be made available for all of those groups and essentially overrode the committee on the last piece around occupational risk. So right now, its 65 older, immunocompromised, those at high medical risk and those at high occupational risk.</p><p><br></p><p><strong>Andrew Sheets </strong>So Matt, the final thing I wanted to ask you about is one of the most positive things that seems to have come out of this this terrible pandemic is mRNA vaccination technology. It seems to be a type of medical technology that has really exceeded expectations for how quickly and how effectively a vaccine could be rolled out.</p><p><strong><s>&nbsp;</s></strong></p><p><strong>Andrew Sheets </strong>So Matt, if you think about this technology looking ahead, what do you think are the applications that potentially could go beyond COVID? And also, at what point do you think some of these vaccinations might need to be updated and how difficult will that be?</p><p><br></p><p><strong>Matthew Harrison </strong>So in terms of applications and next steps for RNA, there's a wide variety of disease areas that they're looking at. But in general, the technology is being used to make missing proteins in your body, which occurs a lot with rare genetic diseases. To potentially help various tissues that may need certain proteins or enzymes to help them heal. And also looking at ways that you could, for example, with oncology patients that you could tell the body's own immune system for key flags or markers of the tumors versus normal tissue so that you could redirect the immune system to specifically go after the cancerous tumor. In terms of needing a updated COVID vaccine. I think that all depends on the variant outlook. Currently, what we see is just giving another dose of the current vaccine provides very good protection against Delta. And so, I think as we look out on the outlook, right, it's about if Delta combines with something else, then maybe there is the potential for an update. But the manufacturers are well primed for that, and that process is a couple months process, probably if they had to do that. So, they can adapt quickly.</p><p><br></p><p><strong>Andrew Sheets </strong>Something important to keep an eye on. As always, Matt, it's been great talking with you.</p><p><br></p><p><strong>Matthew Harrison </strong>Thanks, Andrew.</p><p><br></p><p><strong>Andrew Sheets </strong>As a reminder, if you enjoy Thoughts on the Market, please take a moment to rate and review us on the Apple Podcasts app. It helps more people find the show.</p>",
  "guid": "gid://art19-episode-locator/V0/KJtzIzCo1qfETKGjDQ8RU1rAWBaUhm9eLglLvaBpv1k",
  "pubDate": "Tue, 05 Oct 2021 22:19:41 -0000",
  "itunes:explicit": "no",
  "itunes:image": "",
  "itunes:duration": "00:10:10",
  "enclosure": ""
}