{
  "title": "Omakase 4: Jopper",
  "description": "<!--kg-card-begin: markdown--><p>For October's game I collabed with the great <a href=\"https://twitter.com/jynniit\">Jynnie Tang</a>!! Which basically means we came up with an idea late night over juice and decided \"hey let's try and make it happen\".</p>\n<p>The core concept we wanted to reach was the feeling of excitement when playing together with</p>",
  "link": "https://kvfrans.com/omakase-4-jopper/",
  "guid": "60225e9617e26d47c77e8eca",
  "category": "games",
  "dc:creator": "Kevin Frans",
  "pubDate": "Thu, 21 Nov 2019 23:53:41 GMT",
  "content:encoded": "<!--kg-card-begin: markdown--><p>For October's game I collabed with the great <a href=\"https://twitter.com/jynniit\">Jynnie Tang</a>!! Which basically means we came up with an idea late night over juice and decided \"hey let's try and make it happen\".</p>\n<p>The core concept we wanted to reach was the feeling of excitement when playing together with friends and someone pulls off an amazing move. As a dorm, we often play games together in our main lounge, and I've come to really enjoy couch co-op as a game style. We wanted to capture some of that feeling by creating a super lightweight arena-style minigame, where anyone could join in by using their phone.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/11/--s-1.png\" alt></p>\n<blockquote>\n<p>Beautiful concept art</p>\n</blockquote>\n<p>With that in mind, we started work on what would become known as Jopper. The game was centered around the beat of \"\" -- rather than continuously control your character, you can only adjust your velocity when the beat hits. At the same time, your character will shoot a projectile behind you, so it's up to the player to decide if they want to move around or try and line up a shot.<br>\n<img src=\"https://kvfrans.com/content/images/2019/11/screencast.gif\" alt></p>\n<p>After a bit of tinkering in Unity, we managed to build a very basic stage for the game! Every two seconds, the player will launch towards the mouse cursor, bouncing off any walls it happens to encounter.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/11/s2.gif\" alt></p>\n<p>Of course, if the game was to be multiplayer, we couldn't just use one player. I had to rewrite a bit of the core engine to work smoothly, but the game was now playable with multiple players on the same field! I also added in a line to show just how far and in what direction the player would launch.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/11/--s-4.png\" alt></p>\n<p>At this point we went for burgers and brainstormed on a napkin. Some cool ideas came out, such as slowing down time during the aiming period and how to structure the phone's touch control scheme.<br>\n<img src=\"https://kvfrans.com/content/images/2019/11/Screen-Shot-2019-11-22-at-2-58-52-AM.png\" alt></p>\n<p>Jessica worked on making a super smooth joystick in native javascript that could open on any phone, and on connecting the server up so it could integrate into Unity.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/11/s2-1.gif\" alt></p>\n<p>And with that, we had the first playable build! We could connect in with our phones, and have a duel. It was time to bring in some friends.</p>\n<p><img src=\"https://kvfrans.com/content/images/2019/11/--s-0.png\" alt></p>\n<blockquote>\n<p>Live hotfixing some bugs</p>\n</blockquote>\n<p>And the final result....?</p>\n<video loop width=\"100%\" controls>\n  <source src=\"https://kvfrans.com/static/jopper.mp4\" type=\"video/mp4\">\n</video>\n<!--kg-card-end: markdown-->"
}