{
  "title": "South Australian state to criminalize ‘abhorrent’ sex trend",
  "link": "https://www.rt.com/news/565873-australia-stealthing-sex-crime/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565873-australia-stealthing-sex-crime/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363b8142030274f556bbe0e.jpg\" /> South Australia could impose life sentences for “stealthing” — the act of non-consensually removing a condom during sex <br/><a href=\"https://www.rt.com/news/565873-australia-stealthing-sex-crime/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The act of removing a condom during sex without the partner’s consent could lead to a life sentence under a new law</strong></p>\n            \n                        \n            <p>An Australian state has voted to pass a bill that would introduce harsh penalties for men who remove condoms during sex without the consent of their partner, an act colloquially known as &lsquo;stealthing.&rsquo;</p>\n<p>The South Australian (SA) parliament passed the bill on Wednesday, joining other Australian states including ACT, Tasmania, Victoria, and New South Wales, which have also outlawed the practice. Anyone convicted of stealthing could potentially face a maximum sentence of life in prison.</p>\n<p>The legislation, dubbed the Criminal Law Consolidation (Stealthing) Amendment Bill, was introduced by SA MP Connie Bonaros, who described &lsquo;stealthing&rsquo; in a statement as a <em>&ldquo;repugnant''</em> and <em>&ldquo;disgusting act of betrayal.&rdquo;</em></p>\n<p><em>&ldquo;Such grotesque acts of indecency deserve to be treated in the same manner as rape and a crime punishable by terms of imprisonment,&rdquo;</em> Bonaros said.</p>\n<p>A study of 10,000 people conducted by the Australian Institute of Criminology last month reportedly found that as many as one in three women and one in five gay men had been stealthed at least once.</p>\n<p>While it&rsquo;s expected that the introduction of criminal liability for the act of &ldquo;stealthing&rdquo; may deter potential offenders, some have raised concerns that not many people are even aware of the term.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635a823b85f54009214e564b.jpg\" alt=\"Brittany Higgins.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565449-australia-metoo-brittany-higgins/\">Australia’s most notorious #MeToo case ends in chaos</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p><strong></strong></p>\n<p><em>&ldquo;Stealthing is a particularly intricate type of sexual violence because the definition, by default, means that you have consented to having protected sex with the perpetrator, meaning you probably had positive feelings towards that person,&rdquo;</em> the director of the Australia Institute&rsquo;s Centre for Sex and Gender Equality, Chanel Contos, told The Guardian last month.</p>\n<p>She went on to call for the introduction of a national curriculum on consent and respectful relationships and to harmonize Australia&rsquo;s laws on stealthing in order to <em>&ldquo;facilitate education and public awareness that stealthing is a form of sexual assault.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 13:59:02 +0000",
  "dc:creator": "RT"
}