{
  "title": "Is Our Fiscal System Discouraging Marriage? A New Look at the Marriage Tax",
  "link": "https://fedinprint.org/item/fedawp/94787/original",
  "description": "We develop, apply, and test a new measure of the marriage tax: the reduction in future spending from getting married. Our measure is a comprehensive, actuarial (expected) present value. It incorporates all major and most minor US tax and benefit programs, weighing the present value of additional net taxes from marrying along each marital survivor path by the path’s probability. And it assumes clone marriage—marrying oneself—to ensure the living-standard loss from marrying is unaffected by spousal choice. We calculate our marriage tax for young respondents using the Survey of Consumer Finances (SCF). The marriage tax rate—the percentage reduction in expected future spending from marrying—averages 2.69 percent. This sample-weighted average is comparable to losing several years of earnings and is much higher in some states than others. Average marriage tax rates are also highly income dependent. Nationwide, the average marriage penalty imposed on people with low incomes is roughly twice that levied on the rich. Low-income females with children face particularly stiff marrying penalties, primarily in the form of lost benefits, both in-cash or in-kind. The variation in marriage taxation is particularly striking and ranges, across our sample, from negative 74.4 percent to positive 45.8 percent. We use the American Community Survey to study the impact of our marriage tax (imputed via a SCF statistical match) on marrying rates. Our tax on remaining lifetime spending matters—a lot. This is particularly true for low-income, single females with children. Absent the tax, 13.7 percent more would marry each year. Cumulatively, 7.5 percent more would be married at age 35. These are much larger effects than arise using the conventional marriage-tax measure. Our findings are robust to adjusting for partial benefit take-up and respondents marrying higher- or lower-income versions of themselves. Given the importance of marriage to child development and a host of economic indicators, heavily penalizing marriage might have far-reaching, deleterious consequences.",
  "guid": "https://fedinprint.org/item/fedawp/94787/original",
  "dc:creator": "Ilin, Elias; Pitts, M. Melinda; Kotlikoff, Laurence J.",
  "dc:date": "2022-06-29",
  "rdau:hasExtent": 54,
  "dc:subject": "marriage taxation; disincentives; marriage; social safety net; income tax",
  "swpo:hasNumber": "2022-6",
  "identifiers:doi": "10.29338/wp2022-06",
  "bibo:series": "FRB Atlanta Working Paper"
}