{
  "title": "TU118: Mental Health Support During this Damn Coronavirus Pandemic",
  "link": "https://therapistuncensored.com/episodes/tu118-mental-health-support-during-this-damn-coronavirus-pandemic/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu118-mental-health-support-during-this-damn-coronavirus-pandemic",
  "pubDate": "Mon, 30 Mar 2020 14:00:00 +0000",
  "guid": "http://4918bfaf-7a6c-47aa-a1df-30847e4d8924",
  "description": "Calm is contagious, too! Coping through Coronavirus.\nOur hearts hurt for those affected by COVID. Those who are ill, survivors of those taken by the virus, service employee&#039;s continuing to work, front-line medical and science warriors, those who lost their job or savings, those who are isolated alone and those stuck at home in harsh relationships or with kids out of school and needy... it&#039;s all relative. It doesn&#039;t help to compare pain - pain is pain - we all need support through this coronavirus pandemic. Period.\n\nSo let&#039;s clasp hands and co-regulate one another through this as best we can.\n\nIn this episode, Sue and Ann discuss how we are collectively processing the coronavirus pandemic and provide some tools on how we can regulate our emotions during these coronavirus times. We are having experiences that are creating emotions that we do not normally have from a day-to-day basis and will have to understand how to process.\n\nGet the Facts but don&#039;t Rubber-Neck (southern term I think, slowing down and looking hard at a wreck on the freeway even though you don&#039;t really want to see). Use social media purposefully, don&#039;t get hooked watching the stats there is nothing to see there that will help us cope. It&#039;s being covered each time as new news, so our nervous system stays in alert. Limit social media and create your bubble of safety.\n\nUse sources you trust and don&#039;t act from rumors.\n\nName your feelings - identify the specific source rather than live in ocean of free-floating anxiety. Better to be afraid for your mom or your 401 K than feel the weight of anxiety globally.\n\nConnect socially as part of your ADL&#039;s - activities of daily living.\n\nBreathing Techniques - Breathing in for a count of 5 and exhaling for a count of 5.\n\nImagery - Imagining a sense of calm and safety in your environment and community. Use your mind to soothe and comfort yourself - this is neuroscience and it actually works! Add a safe person, place or animal that comforts you.\n\nPerspective matters - this will end.\n\nInterconnectedness - We are all experiencing this collectively. You are not alone. The virus does not discriminate it&#039;s a great equalizer even though we aren&#039;t equally effected (it hits marginalized communities hardest).\n\nKnow what you can and cannot control - We cannot predict what will happen. We can control what we focus on, what information and how much information we are consuming.\n\nOur global actions can have a global impact.\n\nWorld Health Organization\n\nRAIN by Tara Brock\n\nRecognize what is happening;\n\nAllow the experience to be there, just as it is;\n\nInvestigate with interest and care;\n\nNurture with self-compassion.\n\nAPPLE\n\nAcknowledge the thought that comes to mind.\n\nPause your reaction and breathe.\n\nPull back and understand that thoughts are not always your own.\n\nLet go of the thought or feeling.\n\nExplore the present moment.\n\nStop. Touch. Go.\n\n \tResources and Links to recent articles:\n\nTrusted resources\n\nTU64: Mindfulness Meditation with Yoga Therapist Kelly Inselman\n\nTU63: Living with Cancer – The Six Principles of Emotional Healing with Guest Kelly Inselmann\n\nTU52: Using Mindfulness, Movement and Yoga to Manage Arousal, with Guest Kelly Inselmann\n\nOur course on Attachment and Neuroscience has been recently released and is now available! And, since you are deep into these show notes then you are one of us, so get 10% off by putting in code OURCLAN. 🙂\n\nWhile this course is utilized heavily by clinicians (CE’s available!), all who are interested in deepening security in yourselves and your relationships are welcome to participate.\n\nIt is a full 4 hours of curated content!\n\nCLICK HERE FOR MORE INFORMATION\n\n______\n\nWant to help us keep going?\n\nWe have pledged 50% of all corporate profits & merch sales (very fun swag!) to organizations that support mental health access to those traditionally left out of mainstream healthcare.",
  "enclosure": "",
  "itunes:subtitle": "Calm is contagious, too! Coping through Coronavirus. Our hearts hurt for those affected by COVID. Those who are ill, survivors of those taken by the virus, service employee&#039;s continuing to work, front-line medical and science warriors,",
  "itunes:summary": "Throw out getting through this one on you own - autoregulation is for the birds right now.  We need each others nervous system for mutual support through this sucker, here is how....",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:duration": "40:59"
}