{
  "title": "66: When To Eat For Optimal Brain Function with Max Lugavere",
  "pubDate": "Thu, 19 Jul 2018 12:43:57 +0000",
  "guid": "4e8887a4011149c1ae9d9757d935fba9",
  "link": "https://sites.libsyn.com/94610/66-when-to-eat-for-optimal-brain-function-with-max-lugavere",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">In previous episodes, we’ve talked about brain superfoods and what we should be eating to power a healthier, happier brain. Today’s show takes the conversation a step further as we talk about when we should be eating, and how fasting can impact our longevity and brain health. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">A common question from the Kwik Brain community has been how we can improve our brain functionality through nutrition and diet. A respected health and science journalist and author of a best-selling book on diet and brain health, today’s guest</span> <strong>Max Lugavere</strong> <span style=\"font-weight: 400;\">has years of health and diet research experience to give you the best advice on improving your brain function through nutrition. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">The food we eat matters to our grey matter. When and what we eat can affect our memory, our thinking, our lifespan and our happiness. In today’s world, many of us are chronically eating, which is creating ongoing impacts and stresses on our bodies and brains — this makes sense if you consider we evolved as hunter-gatherers, eating only when we were able to find adequate food.</span></p> <p> </p> <p><span style=\"font-weight: 400;\">In today’s conversation we talk about some key nutrients for healthy brain cells, cover Max’s list of top genius foods you should be eating on a daily basis, provide a framework to guide when you eat and explain the effect of fasting on your mental state and metabolism. We’ll explain what current research is saying about fasting, and how you can improve your health through connectedness. </span></p> <p> </p> <p><span style=\"font-weight: 400;\">*Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</span></p>",
  "content:encoded": "<p>In previous episodes, we’ve talked about brain superfoods and what we should be eating to power a healthier, happier brain. Today’s show takes the conversation a step further as we talk about when we should be eating, and how fasting can impact our longevity and brain health. </p> <p> </p> <p>A common question from the Kwik Brain community has been how we can improve our brain functionality through nutrition and diet. A respected health and science journalist and author of a best-selling book on diet and brain health, today’s guest Max Lugavere has years of health and diet research experience to give you the best advice on improving your brain function through nutrition. </p> <p> </p> <p>The food we eat matters to our grey matter. When and what we eat can affect our memory, our thinking, our lifespan and our happiness. In today’s world, many of us are chronically eating, which is creating ongoing impacts and stresses on our bodies and brains — this makes sense if you consider we evolved as hunter-gatherers, eating only when we were able to find adequate food.</p> <p> </p> <p>In today’s conversation we talk about some key nutrients for healthy brain cells, cover Max’s list of top genius foods you should be eating on a daily basis, provide a framework to guide when you eat and explain the effect of fasting on your mental state and metabolism. We’ll explain what current research is saying about fasting, and how you can improve your health through connectedness. </p> <p> </p> <p>*Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access.</p>",
  "enclosure": "",
  "itunes:duration": "20:00",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In previous episodes, we’ve talked about brain superfoods and what we should be eating to power a healthier, happier brain. Today’s show takes the conversation a step further as we talk about when we should be eating, and how fasting can impact...",
  "itunes:episodeType": "full"
}