{
  "title": "Restaurants Seeded the Massive Coronavirus Epidemic in New York City",
  "link": "https://medium.com/@chris_bour/restaurants-seeded-the-massive-coronavirus-epidemic-in-new-york-city-23ea7e767039?source=rss-90ca8bc640f4------2",
  "guid": "https://medium.com/p/23ea7e767039",
  "category": [
    "coronavirus",
    "covid19",
    "data-science"
  ],
  "dc:creator": "Christophe Bourguignat",
  "pubDate": "Mon, 20 Apr 2020 21:18:50 GMT",
  "atom:updated": "2020-04-20T21:18:50.858Z",
  "content:encoded": "<p><em>Disclaimer: this post is a copy/paste parodic version of the original MIT paper ‘</em><a href=\"http://web.mit.edu/jeffrey/harris/HarrisJE_WP2_COVID19_NYC_13-Apr-2020.pdf\"><em>The Subways Seeded the Massive Coronavirus Epidemic in New York City</em></a><em>’ — but data are still real. I do that to raise citizens awareness: why we should be careful when reading papers claiming to prove things with data.</em></p><p><em>Read also: </em><a href=\"https://medium.com/@chris_bour/bike-sharing-system-seeded-the-massive-coronavirus-epidemic-in-new-york-city-fd9760623111\"><em>Bike Sharing System Seeded the Massive Coronavirus Epidemic in New York City</em></a></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*mPj1mAZkWMZzquUAaEx-6Q.png\" /><figcaption>Figure 1. Numbers of Newly Diagnosed COVID-19 Cases (Pink Data Points, Left Axis) and restaurant meals (Blue Bars, Right Axis), New York City, March 1–April 3, 2020.</figcaption></figure><p><strong>New York City’s multitentacled restaurant network was a major disseminator — if not the principal transmission vehicle — of coronavirus infection during the initial takeoff of the massive epidemic that became evident throughout the city during March 2020</strong>. The near shutoff of restaurants in NYC — down by over 80 percent at the end of March — correlates strongly with the substantial increase in the doubling time of new cases in this the city.</p><p>Figure 1 simultaneously tracks the daily movements of two variables from March 1 though April 3, 2020. The pink-filled circles show the <strong>numbers of new coronavirus infections</strong> reported each day by <a href=\"https://www1.nyc.gov/site/doh/covid/covid-19-data.page\">the New York City Department of Health</a>. For this variable, the vertical axis on the left is rendered on a logarithmic scale. That way, a straight-line trend would represent the exponential growth typically seen during the initial upsurge of an epidemic where everyone in the population is naïve to the infectious agent.</p><p>For the same variable of newly reported cases, the horizontal axis at the bottom ticks off the date that the coronavirus test was performed.</p><p>The second variable tracked in Figure 1 above represents the total <strong>numbers of seated diners at restaurants</strong> every day throughout New York City. These counts are <a href=\"https://www.opentable.com/state-of-industry\">reported each week by OpenTable</a>. This variable is represented as sky-colored vertical bars, along the vertical axis on the right side of Figure 1. For this variable, the horizontal axis measures the dates on which restaurant meals happened.</p><p>Figure 1 shows only the volume of seated diners from March 1 onward. Still, the counts shown during the first full week of the month — from Sunday March 1 through Saturday March 6 — are quite typical of the pattern for prior weeks. As decline diners volumes accelerates markedly beginning on Monday March 16, the day that New York City Mayor de Blasio issued an order limiting gatherings and closing numerous places of congregation. By the third week overall, restaurant diners are down 68 percent from the first week in March, and by the fourth week, it’s down 86 percent.</p><p>Simple comparison of the two trends in Figure 1 cannot by itself answer questions of causation. Still, <strong>the parallel between the continued high diner number and the rapid, exponential surge in infections during the first two weeks of March supports the hypothesis that the restaurants played a role</strong>. While the subsequent plummeting of diners appears likewise to parallel the flattening of the reported incidence curve, the steep fall in the heights of the blue bars may just as well represent the public’s response to widespread publicity about the ferocity of the outbreak that had been gathering storm for two weeks. As economists say, the precipitous drop in restaurant meals may well have been <em>endogenous</em>. Even so, the temporal pattern in Figure 1 is compatible with the conclusion that <strong>the restaurants were the vehicle by which the public’s response was translated into reduced transmission of the virus</strong>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=23ea7e767039\" width=\"1\" height=\"1\" alt=\"\">"
}