{
  "title": "TU51: Conquer Shame by Understanding the Science Behind the Feeling, with Guest Expert Dr. Steve Finn",
  "link": "https://therapistuncensored.com/episodes/tu51-conquer-shame-by-understanding-the-science-behind-the-feeling-with-guest-expert-dr-steve-finn/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu51-conquer-shame-by-understanding-the-science-behind-the-feeling-with-guest-expert-dr-steve-finn",
  "pubDate": "Fri, 15 Dec 2017 02:55:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=5781",
  "description": "Shame, the good, the bad and the ugly! In this podcast, learn how to recognize the various forms of shame and how guilt can be an antidote to this pit in the stomach feeling. Sue Marriott, Dr. Ann Kelley and guest Dr. Stephen Finn engage in a wide-ranging discussion about the least favorite feeling in most people – the collapsed feeling of shame!\n\nIt is more complicated than you think. Shamelessness and debilitating shame are both toxic and yet there is a version of these feeling that is quite healthy. Listen as we discuss the contemporary research and the biology of this emotion and practical implications for your everyday life. Listen to the end to find out if you are a dandelion or an orchid.\n\nWho is Steve Finn:\n\nStephen Finn is a psychologist in private practice in Austin, TX and a Clinical Associate Professor of Psychology at the University of Texas at Austin. He is known for developing Therapeutic Assessment, a brief psychological intervention that combines psychological testing and psychotherapy. He lectures around the world on Therapeutic Assessment and other topics, including—in recent years—shame.\n\nIf you like this kind of content you’ll enjoy Episode 23, Self-Compassion with Kristin Neff\n\nWant more like this?\n\nCheck out our free YouTube video Modern Adult Attachment 101 to learn more –  https://www.youtube.com/watch?v=PF7g4K8fDvo\n\n0:00-15:00\n\nIntro\n\nStephen Finn’s initial interest in shame\n\nDefining shame, differentiating shame from guilt\n\nBarrier experience, shame can become a central part of personality in some people\n\nGuilt is a developmental achievement and is appropriate in certain circumstances. Doing something bad rather than being bad, this it’s not hopeless.\n\nSome shame is good – healthy shame indicates capacity for empathy.\n\nShame is a necessary social adhesive and social conditioning required for living in groups.\n\nLack of guilt in psychopaths\n\nProblem of having too much shame or getting caught up in shame.\n\nDeveloping trait shame. If normal emotions have been shamed (particularly by parents to their developing children), this can occur. This can also result from emotional neglect; misconstruing being unloved as being un-loveable. \n\n15:00-30:00\n\nProblem of parents with cell phones fueling neglect at an early age.\n\nStill face experiment and instilling shame through lack of expression – (see resources for link it’s very interesting)\n\nRelationship between having a conscience and shame\n\nShaming and repairing is healthy, never shaming is not. Guilt is really healthy shame. \n\nPhysical effect of shame and biology.\n\nIn order to get over hidden shame, you need to expose it to safe people.\n\nShame can only be healed interpersonally.\n\nDifferent cultures social constructions of shame.\n\nImportance of overcoming hesitation or anxiety of punishment from sharing shame.\n\n30:00-45:00\n\nExperiences of sharing shame in group. Importance of sharing shame in group.\n\nComplication of therapist feeling need to relate or there’s no need to feel shamed when its one on one.\n\nJoining in sharing shame is very powerful tool.\n\nCouples and understanding or dismissing shame. Connecting right brain to right brain.\n\nGetting people to transition from shame to guilt\n\nWhat does repair actually look like?\n\nThe journey from shame to guilt is recognizing its something you did, not something you are.\n\n45:00-57:00\n\nIdea of narcissism freeing others up from shame, especially in a relationship. Need to go from shame to guilt, not shamelessness.\n\nImportance of “me too” in terms of diminishing shame.\n\nEmphasis on shame in Japan and link to high rates of suicide.\n\nOrchid and Dandelion children concept.\n\nStephen’s method of therapeutic assessment (www.therapeuticassessment.com)\n\nWrap up & outro\n\nResources:\n\n \tTherapeutic Assessment Institute How to reach Steve Finn and his expert team, who train this technique across the globe.",
  "enclosure": "",
  "itunes:subtitle": "Shame, the Least Favorite Feeling, How Healthy Guilt Can Help Your Shame",
  "itunes:summary": "Shame, the good, the bad and the ugly!  In this podcast, learn how to recognize the various forms of shame and how guilt can be an antidote to this pit in the stomach feeling.  Sue Marriott LCSW, CGP, Dr. Ann Kelley and guest Dr. Stephen Finn engage in a wide-ranging discussion about the least favorite feeling in most people – the collapsed feeling of shame!",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 51,
  "itunes:title": "Conquer Shame by Understanding the Science Behind the Feeling, with Guest Expert Dr. Steve Finn",
  "itunes:duration": "59:26"
}