{
  "title": "S15 Ep52: Supernatural News/Parashare: Mirror Universe Edition",
  "link": "https://audioboom.com/posts/8098471",
  "itunes:episode": 52,
  "itunes:title": "Supernatural News/Parashare: Mirror Universe Edition",
  "itunes:season": 15,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5407,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "Darkness Radio has Supernatural News Mirror Universe Edition!<br>\n<br>\nThe world is insane right now and scientists want to open portals to Mirror Universes!!??<br>\nPlus Dave reports on Zombie Monkey Uprisings, Terminator Wombat Attack, Nessie Rises, Bobby Brown's Spectral Tryst, all this AND Carol Baskin faces the ghosts of Joe Exotics past!<br>\n<br>\nSit back and laugh along at the absurdity of the week that was in Supernatural News!<br>\n<br>\nGet your awesome Paranormal needs met here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nIf you’re looking for a fun way to pass the time while engaging your brain and enjoying breathtaking visuals and a gripping story, your answer is Best Fiends.  Best Fiends is a casual game anyone can play !  Engage your brain with fun puzzles and collect tons of cute characters!  5-star rated mobile puzzle game, Download FREE on the Apple App Store or Google Play !<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.",
  "itunes:summary": "Darkness Radio has Supernatural News Mirror Universe Edition!\n\nThe world is insane right now and scientists want to open portals to Mirror Universes!!??\nPlus Dave reports on Zombie Monkey Uprisings, Terminator Wombat Attack, Nessie Rises,...",
  "pubDate": "Sat, 27 Jun 2020 08:00:00 +0000",
  "guid": "d7b86c33-ea85-42b4-a845-743e3847a117",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}