{
  "title": "Whole world suffers from Western propaganda – Russia",
  "link": "https://www.rt.com/news/565804-western-propaganda-ukraine-conflict/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565804-western-propaganda-ukraine-conflict/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636265b8203027107f392126.jpg\" /> Amid the Ukraine conflict, the West is waging an information war not only against Russia but the whole world, Moscow’s UN envoy has claimed <br/><a href=\"https://www.rt.com/news/565804-western-propaganda-ukraine-conflict/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Moscow’s UN envoy compared the barrage of ‘fake news’ about the Ukraine conflict to shelling a city</strong></p>\n            \n                        \n            <p>Western countries are waging an information war not only against Russia but also the entire international community, Vassily Nebenzia, Moscow's Permanent Representative to the United Nations, said on Tuesday.</p>\n<p>Speaking at a presentation at the UN of the RT documentary &lsquo;Journalists Under Fire,&rsquo; the top diplomat spoke of the massive media pressure on his country, especially since the Ukraine conflict escalated in February.</p>\n<p>Nebenzia noted that Western coverage of the situation is typified by<em> &ldquo;a huge number of &lsquo;fakes&rsquo; about the activities of the [Russian] military, as well as about the goals, objectives and motives&rdquo;</em> of its campaign in Ukraine.</p>\n<p><em>&ldquo;It&rsquo;s no secret that the West has launched a real information war against us, which affects not only the residents of Russia and Ukraine but also people around the world,&rdquo;</em> he reiterated.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6361877a20302727b05a92b8.png\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/russia/565762-un-preview-rt-documentary-journalists-fire/\">UN shown preview of RT documentary ‘Journalists Under Fire’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>He went on to compare Western media coverage with actual Ukrainian bombings of civilian infrastructure. <em>&ldquo;Just as Western weapons are now targeting cities in the Donbass and the liberated territories, Western propaganda is firing &lsquo;information shells&rsquo; at its own citizens,&rdquo;</em> he claimed.</p>\n<p>According to Nebenzia, the media onslaught is harmful to ordinary people, who <em>&ldquo;are losing touch with reality, become distressed and confused&rdquo;</em> when being overwhelmed with an endless barrage of falsehoods. They also lose the ability to think critically, he claimed.</p>\n<p>After Russia launched its military operation against Ukraine, Western countries unleashed an unprecedented crackdown on Russian media abroad, with the European Union banning RT and Sputnik channels. Moscow has repeatedly criticized the move, with Foreign Ministry spokeswoman Maria Zakharova claiming that it has shown the world the true worth of so-called Western values.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 15:34:33 +0000",
  "dc:creator": "RT"
}