{
  "title": "The Many Faces of Nord Stream Two",
  "link": "https://jamestown.org/the-many-faces-of-nord-stream-two/",
  "dc:creator": "web1983",
  "pubDate": "Fri, 12 Nov 2021 20:29:31 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=91104",
  "description": "<p>Over the last several years, Ukraine’s leaders have expressed grave concern over the dangers posed to regional energy security by Russia’s Nord Stream Two natural gas pipeline. From Germany and, more broadly, from Europe, the answer we received was: “Do not worry, we will not let it become a problem, either for you or for Europe.” Yet today, with energy &#8230; <a href=\"https://jamestown.org/the-many-faces-of-nord-stream-two/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/the-many-faces-of-nord-stream-two/\">The Many Faces of Nord Stream Two</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>Over the last several years, Ukraine’s leaders have expressed grave concern over the dangers posed to regional energy security by Russia’s Nord Stream Two natural gas pipeline. From Germany and, more broadly, from Europe, the answer we received was: “Do not worry, we will not let it become a problem, either for you or for Europe.” Yet today, with energy prices at record highs, it is increasingly clear that promises are easy to make but harder to deliver. Even more so when Russia is involved.</p>\n<p>It is now November 2021, and Ukraine’s warnings about Nord Stream Two were not heard. The pipeline, whose main purpose is to make Europe more dependent on Russia, was built—on Europe’s dime but under Russian Gazprom’s ownership and control. Nord Stream Two has yet to be certified, but it is already causing substantial problems.</p>\n<p>Because of the pipeline, the European Union is divided and Russia is all the more convinced that the EU is weak and corruptible. Moscow lobbyists around the world pontificate that, with energy demand as well as prices soaring, the West’s “green delusion” is finally over, and the world is back to an era of rule by nations that have what really counts: oil, gas and coal.</p>\n<p>For quite a while, Moscow has pursued a three-fold strategy: fool Europe, corrupt Europe, seduce Europe. The Nord Stream Two saga included all three elements. It fooled Europe by promising an unnecessary pipeline that was rooted in geopolitical expediency. It corrupted Europe, by hiring its former leaders to lucrative advisory contracts and allowing Europe to finance what it promised would eventually be a cash cow. With the pipeline certification under consideration, Russia is now in the seduction phase, promising that once Nord Stream Two is certified, gas supply problems, will go away. Of course, that is like saying that one more bottle of vodka will make alcoholism go away.</p>\n<p>The West should remain sober though. Here are five basic facts about the Nord Stream Two pipeline.</p>\n<p>First, it will not bring more natural gas to Europe, but it will undoubtedly allocate Gazprom even more leverage than it already has.</p>\n<p>Second, it will take decades for the pipeline to pay off economically. Yet this does not matter—the project is not about economics but about Russia’s attempted domination over the European energy market.</p>\n<p>Third, Nord Stream Two (in its current form) ultimately eliminates Central Asia as a significant European supplier and makes Ukraine (the cheapest, shortest and most efficient gas transit route) reliant on Russian President Vladimir Putin.</p>\n<p>Fourth, it undermines Europe’s “green deal” by spiking market prices, making the long-term transition to renewables even more expensive.</p>\n<p>Fifth, it is a way to force Europe to pay for a pipeline that punishes Ukraine while simultaneously obliging Europe to compensate Ukraine for the punishment.</p>\n<p>If certified, the project would have long repercussions for Europe—not only because of its dubious moral nature but primarily because of its geopolitical miscalculations. Europe is about to get in bed with someone who clearly believes the EU is on its way out. Should this someone really be trusted?</p>\n<p>So, what is to be done here? Three things.</p>\n<p>First, do not rush to anything. Take a deep breath and count to ten.</p>\n<p>Second, start listening to what Russian propaganda says behind your back, not to your face: Energy prices are soaring; the Western economies are collapsing; the EU is drifting away from the US and towards Russia. This is the picture of the world the Kremlin propaganda mills have been selling to Russians for quite a while.</p>\n<p>Third, if you do not want to be on a short leash, then either do not certify Nord Stream Two, or certify it on your own terms—not Russia’s. The latter means the full application of EU energy rules, including requiring the unbundling of gas production from gas transit, as well as moving the gas entry points of Ukrainian pipelines from the Ukraine-EU to the Ukraine-Russia border (Ukrainians have been urging this for years).</p>\n<p>Do not make the mistake of handing an essential part of Europe’s future to a country that is demonstratively not the EU’s friend. Time will not be kind to such decision or to those who made it.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/the-many-faces-of-nord-stream-two/\">The Many Faces of Nord Stream Two</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}