{
  "id": "yt:video:KSd4nGoNftg",
  "yt:videoId": "KSd4nGoNftg",
  "yt:channelId": "UC3jOd7GUMhpgJRBhiLzuLsg",
  "title": "Nicki Minaj ft. Fivio Foreign - We Go Up (Official Video)",
  "link": "",
  "author": {
    "name": "Nicki Minaj",
    "uri": "https://www.youtube.com/channel/UC3jOd7GUMhpgJRBhiLzuLsg"
  },
  "published": "2022-04-19T19:00:06+00:00",
  "updated": "2022-11-02T09:05:52+00:00",
  "media:group": {
    "media:title": "Nicki Minaj ft. Fivio Foreign - We Go Up (Official Video)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Official music video for Nicki Minaj feat. Fivio Foreign \"We Go Up\", available everywhere now: https://NickiMinaj.lnk.to/WeGoUp\n\n►Connect with Nicki:\nhttp://www.nickiminajofficial.com\nhttps://instagram.com/nickiminaj\nhttps://twitter.com/nickiminaj\nhttps://facebook.com/nickiminaj\nhttps://tiktok.com/@nickiminaj\n\n►Shop New Merch: https://shop.nickiminajofficial.com\n\n►Subscribe on YouTube: http://bit.ly/NickiMinajYTSub\n\n►Lyrics:\nAye yo\nThis week Rarri \nNext week Lambo\nBitch I’m fly \nI don’t land tho\nThis they funeral\nStart the service\nSay my name \nMake em nervous \nUhh \nThese bitches is salty I give them pressure \nUhh \nThese bitches is salty pass me the peppa\nUhh \nThese bitches be jackin me like the rippa\nUhh \nI am a hustla I could sell water to flippa\nUhh \nI know they t-baggin bitches is testy\nGet you a vacuum bitches is messy \nLet’s see\nAfter all of that surgery you are still ugly\nNow that is what gets me\nThis shit ain’t new to me shit is just new to y’all\nI wish a bitch would upon a shooting star\nYou thought you witnessed my final Coup de Grace \nLook up! We shootin stars\n\nSitting in the back of the Benz and my feet go up\nBitches don’t come outside when the beef go up\nBut I love the way they mob when we roll up\nThese bitches bums when I see them they make me throw up\nI wish a bitch would spin I’m like please show up\nWhen you talk to me please don’t bring a cheap hoe up\nYou keep talking bout a bitch for the streets grow up\nCause you the type to say that shit and knock a freak hoe up \nUhhhhhhhh\n\nI'm bout to make you regret you chose me as a enemy bitch\nSouthside Jamaica we mobbin them bricks so pull up wit da blicks \nSome of the best shooters out of New York they don’t play wit da Knicks\nThat ain't Fivio Foreign, that’s Barbie new foreign bitch\nThese nah dat ain't Reebok, we back on that ewok\nPercocets gotta detox firearms gone get restocked\nShooters hitting that G-spot \nBitches imitate \nPlease stop\nSuck his dick like a freeze pop\nFirst he gotta give me top\nLouie bag oh that Louie bag more colorful than a peacock\nWeak niggas gotta get the boot gotta get the boot with no treetop\nHe was like “Who dat? She bad” I was like “Oh dats bestie”\nI could be all the way covered it’s still givin sexy\nI know they sleeping on me bitches got epilepsy \nI don’t do coke little bitch I don’t even do Pepsi\nLet’s see\nHow you don’t like me but tryna do everything like me? \nThat is what gets me!\n\nSitting in the back of the Benz and my feet go up\nBitches don’t come outside when the beef go up\nBut I love the way they mob when we roll up\nThese bitches bums when I see them they make me throw up\nI wish a bitch would spin I’m like please show up\nWhen you talk to me please don’t bring a cheap hoe up\nYou keep talking bout a bitch for the streets grow up\nCause you the type to say that shit and knock a freak hoe up \nUhhhhhhhh\n\nGo on a Drill and I make it look good to you\nI tell my shooter to bully you\nThat nigga gone kill you as soon as I look at you\nI never say what I wouldn’t do\nOpen the door and I shoot out the bulletproof \nI’m with a baddie she love the aggression\nI’m with a demon he wanna get reckless\nI’m showing em growth and I’m teaching em lessons\nI watch how I’m moving cause I’m the investment \nFucc her all night and I go and get breakfast\nI don’t do paperwork or confessions \nI don’t do internet shows or texting \nShoot up the party that’s sending a message\nThem niggas started us\nThe bulletproof is like a guarded truck \nAin’t no blicky with me, I got Nicki with me and she Barbied up\nIf we see em we shooting the party up\nWe ain’t squashing so don’t try to sorry us\nI got rich friends and they b Rarri’d up\nIf they want to they shooting the Garvey Up\nFivi spazzing, 2 shows backend \nFendi Fashion, Fendi Fashion\nI put yah brains onna napkin, I tell my demons to wack em\nMy nigga died then that nigga died\nI don’t even know how it happen \n\nPink Rolls truck and my feet go up\nBitches don’t come outside when the beef go up\nBut I love the way they mob when we roll up\nBums when I see them they make me throw up\nI wish a bitch would spin I’m like please show up\nWhen they come to Queens seas all the fees go up\nI said we out, you can't breeze with us\nAnd my wrist always on ice time, freeze it's us\n\n#NickiMinaj #FivioForeign #WeGoUp",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}