{
  "id": "yt:video:483ntvfKmco",
  "yt:videoId": "483ntvfKmco",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "Employment Law Update in D.C., MD, VA and Illinois",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-05-25T13:49:50+00:00",
  "updated": "2022-08-24T15:35:19+00:00",
  "media:group": {
    "media:title": "Employment Law Update in D.C., MD, VA and Illinois",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "​The District of Columbia, Maryland, and Virginia have enacted or are considering a host of changes that employers need to keep track of in 2022, including increases to the minimum wage and amendments to anti-discrimination laws. Maryland revised its Fair Employment Practices Act to extend the time period for filing a charge of discrimination alleging an unlawful employment practice other than harassment, introduced new requirements for employers to comply with when conducting mass layoffs, amended its leave laws to account for paid bereavement leave, and passed a law permitting employers to file for peace orders on behalf of an employee facing threats or acts of violence in the workplace. The District of Columbia passed a law banning non-compete agreements for almost all employees. Virginia amended its Overtime Wage Act, which now provides overtime protections for employees under state law and establishes a three-year statute of limitations. Virginia also added “disability” to the list of characteristics protected from discrimination under the Virginia Human Rights Act (VHRA), which came shortly after the VHRA was expanded last year to cover most Virginia employers.\n\nParticipants in this webinar will learn about:\n\n• How to comply with D.C.’s new Non-Compete Ban\n• Amendments to state anti-discrimination and wage and hour laws;\n• Which policies and procedures should be reviewed and/or revised;\n• Employment issues related to lawful use of marijuana; and\n• Steps to comply with Maryland’s revised discrimination laws and Mini-WARN Act\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}