{
  "title": "New kid in the playground: China's antitrust push",
  "link": "https://audioboom.com/posts/7863577",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1717,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This episode is part of the ZhōngHuá Mundus series of The Sound of Economics.<br>\n<br>\n\n</div>\n<div>ZhōngHuá Mundus is a newsletter by Bruegel, bringing you monthly analysis of China in the world, as seen from Europe. <a href=\"https://bruegel.secure.force.com/events/UpdateAcc?sf=1&s4=1\">Sign up now</a> to receive it in your mailbox!<br>\n<br>\nChina’s growing economic power is causing great anxiety in the West: European regulators are tightening the rules on takeovers by Chinese state-owned giants, while the United States is imposing aggressive sanctions on leading Chinese technology firms such as Huawei, ByteDance (TikTok) and Tencent (WeChat).<br>\n<br>\n\n</div>\n<div>In this episode of The Sound of Economics, Bruegel’s<a href=\"https://www.bruegel.org/author/alicia-garcia-herrero/\"> Alicia García-Herrero</a>, <a href=\"https://www.bruegel.org/author/mario-mariniello/\">Mario Mariniello</a> and <a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\">Giuseppe Porcaro</a> make the virtual trip to the enclave of Hong Kong, where they are joined by <a href=\"https://www.bruegel.org/author/angela-huyue-zhang/\">Angela Huyue Zhang</a>, an expert on Chinese law and the author of “Chinese Antitrust Exceptionalism: How the Rise of China Challenges Global Regulation”. She draws on her experience of examining how Chinese exceptionalism, as manifested in the way China regulates and is regulated, is reshaping global antitrust regulation to impose extraterritoriality and counter western sanctions and influence.</div>\n",
  "pubDate": "Wed, 12 May 2021 09:25:57 +0000",
  "guid": "tag:audioboom.com,2021-05-12:/posts/7863577",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}