{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-1900831952580744387",
  "published": "2020-01-10T13:00:00.000-08:00",
  "updated": "2020-01-10T13:00:52.910-08:00",
  "title": "The FOMC: Where It's Come From, and Where It's Going",
  "content": "After three reductions of 25 basis points each in its fed funds rate target range since the middle of last year, the Fed seems to be on pause. What is the FOMC concerned about, and why, and what's in store for the rest of the year?<br /><br />What does the data look like? First, the labor market has become increasingly tight:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://2.bp.blogspot.com/-9KSJMHzbsnQ/XhibLIoO0JI/AAAAAAAADwE/uG_DffdC7SYitEb0jfOkqkfZCt1r3SjxACNcBGAsYHQ/s1600/labor%2Bmarket.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://2.bp.blogspot.com/-9KSJMHzbsnQ/XhibLIoO0JI/AAAAAAAADwE/uG_DffdC7SYitEb0jfOkqkfZCt1r3SjxACNcBGAsYHQ/s640/labor%2Bmarket.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>The unemployment rate is lower than it's been for a very long time, and the job openings rate is higher than at any time since the BLS started collecting the vacancy data. Most people, me included, have been surprised by how low the unemployment rate has fallen, but possibly that's because our experience with expansions of this length is limited to non-existent. Real GDP growth has been consistently strong, if we adjust for the moderate average growth we have been seeing since the 2008-2009 recession:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-cpnNJS8xbJg/XheoYu9wwLI/AAAAAAAADvo/VLoPdlVM3VYia_xT5I1HGvBKSm7AnShlQCNcBGAsYHQ/s1600/gdp%2Bgrowth.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-cpnNJS8xbJg/XheoYu9wwLI/AAAAAAAADvo/VLoPdlVM3VYia_xT5I1HGvBKSm7AnShlQCNcBGAsYHQ/s640/gdp%2Bgrowth.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>In particular, recent observations in the chart are close to the 2.3% year-over-year average since 2010. Finally, according to standard measures, inflation is close to, though slightly below, the FOMC's 2% inflation target.<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-8_0j5OtKcfc/Xheo9ZNa6QI/AAAAAAAADv0/eM84J3apkf4_-gmuHCfRlSKzAva0V_X9ACNcBGAsYHQ/s1600/inflation.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-8_0j5OtKcfc/Xheo9ZNa6QI/AAAAAAAADv0/eM84J3apkf4_-gmuHCfRlSKzAva0V_X9ACNcBGAsYHQ/s640/inflation.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>In the last three years, inflation has been close to 2%, and the most recent observations for headline PCE, core PCE, headline CPI, and core CPI, are 1.4%, 1.8%, 2.4%, and 1.8%, respectively.<br /><br />So, relative to the objectives the FOMC laid out for itself in the <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">Statement of Longer-Run Goals and Monetary Policy Strategy</a>, it is doing well. This is an economy that has not experienced a large shock for a long time, and is growing smoothly with no apparent unemployed resources - at least, unemployed resources of the sort that monetary policy could put back to work. In terms of what monetary policy can hope to accomplish, there's nothing to do, which should be a wonderful state of affairs for American central bankers. Of course, people being what they are, you can find complainers, both inside and outside the Federal Reserve System.<br /><br />The only fault we could find here is that inflation is below the 2% target. According to the inflation measure the FOMC chose for itself - the raw PCE deflator - inflation is at 1.4%, year-over-year. We can temper our criticism with the fact that a miss of 0.6 percentage points isn't so bad in inflation-targeting circles and also, as I showed in the last chart, by other measures inflation is closer to target. But there's more going on here. Concern with below-target inflation was part of the motivation for the three interest rate reductions that occurred last year, in three consecutive FOMC meetings. And part of the concern about inflation is focused on anticipated inflation measures, for example the 10-year breakeven rate:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-dwukfIiS8TE/Xhigd49imvI/AAAAAAAADwU/PoiOxRIYkrc4wsuSqY46_PEPZjzWfTrkgCNcBGAsYHQ/s1600/breakeven.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-dwukfIiS8TE/Xhigd49imvI/AAAAAAAADwU/PoiOxRIYkrc4wsuSqY46_PEPZjzWfTrkgCNcBGAsYHQ/s640/breakeven.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>At 1.8%, that's not so low, but it's lower than seems consistent with 2% inflation over a 10-year horizon.<br /><br />The troubling part is that the typical FOMC member seems willing to admit that he or she does not understand the connection between FOMC actions and inflation. For example, Mary Daly, President of the San Francisco Fed, is quoted in the <a href=\"https://www.nytimes.com/reuters/2020/01/04/business/04reuters-usa-fed-daly.html\">January 4 New York Times</a> as saying, at the ASSA meetings, that: <blockquote>We don't have a really good understanding of why it's been so difficult to get inflation back up...</blockquote>And, this makes here want to predict that: <blockquote>...this new 'fighting inflation from below' is going to be with us, I would argue, for a longer period of time than just a few years.</blockquote>She also concludes that: <blockquote>...a new policy framework will likely be required...</blockquote>So, that seems correct - if the FOMC feels its chronically failing on some dimension, it should change what it's doing. Of course, it will help if the Fed understands the problem first.<br /><br />I've been saying this for a long time (e.g. <a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3194984\">this paper in the St. Louis Fed Review,</a> <a href=\"https://onlinelibrary.wiley.com/doi/full/10.1111/caje.12403\">this one in the CJE,</a> and numerous blog posts), but it bears repeating. For some reason, central bankers have a hard time understanding Fisher effects. There's ample empirical evidence that low (high) nominal interest rates induce low (high) inflation, and that's what essentially all of our mainstream dynamic macroeconomic models tell us. For about 20 years we've known about the <a href=\"https://www.sciencedirect.com/science/article/pii/S0022053199925851\">perils of Taylor rules.</a> The idea is that a Taylor-rule central banker, observing inflation below target, will cut the nominal interest rate target, which reduces inflation, which produces further rate cuts, until the central banker hits the zero lower bound (ZLB), or possibly a lower effective lower bound. This behavior fits some recent central bank experience - the Bank of Japan in particular.<br /><br />We can think of the long-run problem of an inflation-targeting central bank as one of finding the average nominal interest rate target that is consistent with hitting the inflation target, on average. The problem for the FOMC, post-financial crisis, is that it is hard to know what that average nominal interest rate is. It's certainly lower than in the past - worldwide, we have observed falling real interest rates on safe debt since about 1980. But, the post-financial crisis period was not such a bad one for sorting this out, for the FOMC. Basically, \"normalization\" was proposed by the FOMC as a sorting-out - let's increase the policy rate until we find the sweet spot that sustains 2% inflation. The FOMC engaged in a somewhat leisurely tightening phase, with an ultimate target of about 3% for what the Fed thought was a \"neutral\" rate - roughly, the rate that would be consistent with 2% inflation, provided the economy never saw another large shock again. This approach seemed OK, as the FOMC could take its time to see the effects of tightening policy work themselves out, and decide when to stop (possibly before reaching 3%) based on observed inflation.<br /><br />The FOMC developed a case of the heebie jeebies in mid-2019, however, brought on in part by Donald Trump - his criticisms of the Fed and his trade \"policy\" - and by inflation falling below the 2% target. In hindsight, I think the interest rate cuts were wrong. I'd argue that nominal interest rates at the current level are too low to be consistent with 2% inflation over the long run, and nothing was achieved on the real side of the economy. If the fed funds rate target were still at 2.25%-2.5%, the real economy would be performing about the same, inflation might be on target, and the FOMC would have another 75 basis points that they could cut in the event that something bad actually coming to pass.<br /><br />Since the July 2019 FOMC meeting, the Committee has had a running discussion which you'll find under \"Review of Monetary Policy Strategy, Tools, and Communication\" in the published FOMC minutes. To summarize, the Board staff and the Committee appear to recognize that low real interest rates are a persistent phenomenon, and that this implies that nominal interest rates have to be low in order for the Fed to be achieving 2% inflation. This then implies that, if the Fed engages in countercyclical policy to the same extent as in the past, then the FOMC will more frequently encounter the ZLB. What then to do at the ZLB? Should the Fed engage in unconventional monetary policies? If the answer is yes, then what? Also, should this state of affairs imply some change in the Fed's inflation-targeting approach?<br /><br />The FOMC seems to like unconventional policies - at least the ones it's experimented with. It doesn't like negative interest rate policy, though, which is fine with me. The FOMC seems very confident that quantitative easing (QE) and forward guidance are effective policies. However, in several meetings worth of discussion, as reported in the FOMC minutes, it's hard to see how the Fed learned anything from its experience with QE and forward guidance after the financial crisis. The theory has not advanced, and the evidence to support the use of such policies to further the Fed's goals is lacking. With respect to QE, it seems hard to argue that replacing US Treasury securities with bank reserves is a useful thing to do - this amounts to swapping a crappy asset for a good one, basically. And there's no evidence that QE helps in terms of achieving the Fed's ultimate goals. Ask the Bank of Japan, which has tried in vain, through a massive increase in its balance sheet, to get inflation up to 2% in the last 7 years. Forward guidance, while in principle unobjectionable if it serves only to clarify the nature of the FOMC's policy rule, was a bust in the post-financial crisis period. If someone characterizes the Fed's forward guidance over that period as anything but confusing, they need to explain - carefully.<br /><br />A significant portion of the discussion of new approaches to policy in the FOMC minutes relates to possible modifications of the FOMC's inflation targeting approach. Standard inflation targeting has an important defect, which is that past inflation is a bygone - under inflation targeting, the central bank cares only about how its policy rule allows it to control future inflation. In principle, depending of course on why we think inflation is costly, it's possible that \"makeup strategies\" might be superior. The FOMC considers a couple of these, which are price level targeting and inflation averaging. I discuss both of these in more detail in <a href=\"https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnwxOTU0c3RlcGhlbndpbGxpYW1zb258Z3g6NTJmNWI3Yjc4Y2FjOWYwZA\">this paper.</a> Price level targeting essentially involves the choice of three parameters: a base year, an inflation rate, and a rate of adjustment. The idea is to calculate, given the base year, and the inflation rate, a target inflation path, and to then conduct policy so that the price level adjusts to the target path at the required adjustment rate. Inflation averaging is related, but uses a rolling base year. In this case, policy is conducted so that inflation misses over some past period of time are made up over some future period of time.<br /><br />Both of these approaches have something going for them in theory, but in practice there are problems. Both makeup strategies are difficult to explain to the public, as they imply that the target inflation rate needs to change over time. This creates internal decision-making problems as well, since a more complicated rule permits slippage between stated and unstated goals in policy discussions, and can only bog down a committee. The most important problem, though, is that support for makeup policies tends to come from people who believe strongly (as I think they should not) in Phillips curve theories of inflation. These proponents typically think that price level targeting or inflation averaging would lead to more stimulative policy in a recession. Also typically, I think, what people have in mind is that price level targeting or inflation averaging will imply lower rates for longer during a recession. What this would lead to is actually worse performance relative to the target - more undershooting of inflation targets, however specified. This is just part of the \"Taylor rule perils\" problem - policy rules that produce permanently low nominal interest rates and low inflation. It's not the goal that's the issue here, but the policy rule that people have in mind to achieve the goal.<br /><br />An interesting exercise is to look at the time path of the price level (as measured by the PCE deflator) in the United States for a long period of time, and see how the Fed did relative to a 2% path for inflation. We'll take a \"long time\" to be the last 25 years:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-d3VvEEy4eRE/XhjaBG7G0sI/AAAAAAAADwk/Gjtphk5XxLctGaqQjN3AGydnBLGxU0s1QCNcBGAsYHQ/s1600/two%2Bpercent%2Bgoal.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://1.bp.blogspot.com/-d3VvEEy4eRE/XhjaBG7G0sI/AAAAAAAADwk/Gjtphk5XxLctGaqQjN3AGydnBLGxU0s1QCNcBGAsYHQ/s640/two%2Bpercent%2Bgoal.png\" width=\"640\" height=\"247\" data-original-width=\"1168\" data-original-height=\"450\" /></a></div>Up until the last recession, performance was pretty good, and you can see the undershooting since 2009. Even so, the current deviation from the 25-year 2% inflation path is only about 5%, which seems pretty good. What does this say? Clearly, the Fed hasn't been following a Taylor rule as this would have turned the US into low-inflation low-nominal-interest-rate Japan long ago. What's going on? I ran the following regression on monthly data for the US:<br /><br /><i>r(t)=a + bu(t) + di(t)</i>,<br /><br />where <i>a</i> is a is a constant, <i>b < 0,</i> <i>d > 0</i>, and <i>r(t)</i>, <i>u(t)</i>, and <i>i(t)</i> are, respectively, the nominal fed funds rate, the unemployment rate, and the pce inflation rate, all hp-filtered. That is, we're estimating the response (in a crude way, of course) of the deviation in trend from the Fed's policy rate to the deviation from trend in the unemployment rate, and the deviation from trend in the inflation rate. The OLS estimates are <i>b</i> = -0.95, <i>d</i> = 0.13, and <i>a</i> = 0 by construction. This says that, indeed, the Fed has not been a Taylor-rule central banker, which would imply <i>d > 1</i>. The Fed responds strongly to deviations of the unemployment rate from trend, and in a minor way to deviations of inflation from trend. So, that approach seems to have been successful in achieving a 2% inflation target - supposing that the implicit target was 2% even in the Greenspan era. Maybe getting too bothered by inflation isn't such a great idea (in the short run), even if you're an inflation-targeting central bank. Though of course long-run policy is important for hitting the inflation target.<br /><br />What's the upshot? If central banks want to hit inflation targets, they have to find reasons to increase nominal interest rate targets in the face of below-target inflation. The Fed, and other central banks have used an incipient-inflation argument in the past - basically, inflation is just around the corner unless we increase interest rates now. Unfortunately, that argument seems to lose steam if the central bank tries to do the interest rate hikes in a leisurely fashion. But, if central banks undershoot inflation perpetually, who cares? Probably only the central bankers, as no one outside of direct financial market participants is paying attention. That the central bankers care can be a problem, as they seem to like QE and forward guidance which, it seems to me, can be harmful policies. I could go on to complain about the Fed's floor system, but we'll leave that for another time. Have a good 2020.<br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}