{
  "title": "AI’s Grandmaster Status Overshadows Chess Scandal",
  "link": "https://spectrum.ieee.org/magnus-carlsen-chess-scandal-ai",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-men-playing-chess.jpg?id=31869740&width=1200&height=800&coordinates=0%2C0%2C0%2C115\"/><br/><br/><p>Last week Magnus Carlsen, the world chess champion, <a href=\"https://www.nytimes.com/2022/09/28/crosswords/hans-niemann-magnus-carlsen-cheating-update.html\" rel=\"noopener noreferrer\" target=\"_blank\">directly accused</a> Hans Niemann, a U.S. grandmaster, of cheating during their game at the <a href=\"https://en.wikipedia.org/wiki/Sinquefield_Cup\" target=\"_blank\">Sinquefield Cup</a>, in St. Louis, Mo. He thus made plain an accusation he had been hinting at for weeks.</p><p>Carlsen has so far provided no evidence to back up his charge, nor has he specified how the cheating took place. Everyone agrees, however, that if there was cheating, then it must have involved computers, because nothing else could dismay Carlsen, whose rating of 2856 is higher than that of any other player. And everyone seems to have chosen sides.</p><p>Those who back Carlsen point to Niemann’s own admission that he used computers to cheat in online play at least twice—once at age 14 and again at 16; Niemann is now 19. Others note that his performance has risen very rapidly in the past two years. Still others raise an eyebrow at the <a href=\"https://en.chessbase.com/post/statistical-analysis-of-the-games-of-hans-niemann\" target=\"_blank\">large number of games</a> he has played in recent years that <a href=\"https://deadspin.com/ai-all-but-confirms-that-hans-niemann-has-been-cheating-1849593392\" target=\"_blank\">get a score of nearly perfect</a> from computer analysis. And behind it all are statements from leading players that they are <a href=\"https://zwischenzug.substack.com/p/six-thoughts-on-chesss-cheating-scandal\" target=\"_blank\">convinced that cheating happens all the time</a> nowadays, though hardly anybody ever gets caught.</p><p class=\"pull-quote\">Computers loom so large because they now play chess like gods. </p><p>What makes the scandal so big is not merely the level of the players. In 1961 the great Bobby Fischer wrote an article for <em>Sports Illustrated</em> titled “<a href=\"https://vindication-of-bobby-fischer.co/history-rodriguez/si/index.html\" rel=\"noopener noreferrer\" target=\"_blank\">The Russians Have Fixed World Chess.</a>” He alleged that Soviet chess players arranged draws to ensure that one of them would win a tournament.</p><p>Nor is the scandal notable for flagrancy. In 1967 <a href=\"https://en.wikipedia.org/wiki/Milan_Matulovi%C4%87\" target=\"_blank\">Milan Matulović</a>, a Yugoslavian grandmaster, shockingly <a href=\"https://en.wikipedia.org/wiki/Milan_Matulovi%C4%87\" rel=\"noopener noreferrer\" target=\"_blank\">took back a move</a> he had just played and only then said “<a href=\"https://www.chess.com/terms/jadoube-chess\" target=\"_blank\">J’adoube</a>,” the French phrase uttered when a player merely adjusts the position of a chessman. Players thereafter called him “<a href=\"https://www.dorsetchess.co.uk/daily-quiz-answers-4/\" target=\"_blank\">J’adoubavić</a>.”</p><p>No, what makes today’s accusations resonate is the pervasive role of chess computers. They give children around the world sparring partners that earlier generations couldn’t have dreamed of facing, even if they’d lived next to the <a href=\"https://en.chessbase.com/post/the-most-beautiful-chess-club-in-the-world\" target=\"_blank\">Moscow Central Chess Club</a>. No wonder <a href=\"https://evidently.substack.com/p/are-chess-players-getting-younger\" target=\"_blank\">prodigies of the game have gotten younger and younger</a>.</p><p><br/></p><div class=\"rm-embed embed-media\"><div class=\"flourish-embed flourish-chart\" data-src=\"visualisation/11394050?607871\"><script src=\"https://public.flourish.studio/resources/embed.js\"></script></div></div><p><br/></p><p>And computers do so well in helping the home preparation of the opening, the early moves of a game, that players, including Carlsen, will sometimes deliberately play a second-best move just to force the opponents out of “book.”</p><p>Finally, computer analysis offered during Internet broadcasts of ongoing tournaments will look 12 moves ahead within a second or two. They show the amateurs in the audience much that the grandmasters miss, creating the illusion that the amateurs actually understand what’s going on. Of course, any viewer could give illicit help to a player if provided a means of communication.</p><p>Several things are at stake. There is the prize money, which runs in the <a href=\"https://www.chess.com/article/view/how-much-is-the-world-chess-championship-worth\" target=\"_blank\">hundreds of thousands of dollars</a> for <a href=\"https://grandchesstour.org/2022-grand-chess-tour/2022-sinquefield-cup\" target=\"_blank\">the circuit of which the Sinquefeld Cup tournament is a part</a>. There are the invitations to future events, which are often contingent on doing well in qualifying events. Then there are the rating points. Carlsen cares deeply about this metric: Although he recently declined to contest his World Championship title in 2023, he insists that he will continue to play <a href=\"https://www.chess.com/forum/view/general/will-magnus-carlsen-reach-2900\" target=\"_blank\">in the hope of raising his rating to an unprecedented 2900</a>.</p><p>The cheating to which Niemann does admit—in his younger years, during online play—was itself detected with the aid of computers of <a href=\"https://www.chess.com/\" target=\"_blank\">Chess.com</a>, the online playing forum in question. Recently, however, the <em>Wall Street Journal </em><a href=\"https://www.wsj.com/articles/chess-cheating-hans-niemann-report-magnus-carlsen-11664911524\" target=\"_blank\">reported</a> that an internal investigation by Chess.com has found that Niemann in fact cheated in more than 100 online games, most recently when he was 17. The company did not impugn the grandmaster’s over-the-board play. </p><p class=\"pull-quote\">A key hint can be encoded in just a few bits of data, which means it might be transmitted, perhaps via a buzzer in the player’s shoe, on his body—or inside it.</p><p>Online play is fast and loose, and its computerized basis may provide clues that a cheat-detection algorithm can catch. But over-the-board offers less data. Often there are only one or two key points in a game at which cheating might occur; a little hint, offered at such a point, is enough to make the difference to a grandmaster. Even a duffer, when showed a chess problem, may be truly stumped. But told that it is “mate in three moves,” the duffer may see the light. Just a phrase—“the rook,” say, or “double attack”—may also make the idea apparent.</p><p>A key hint can be encoded in just a few bits of data, which means it might be transmitted, perhaps via a buzzer in the player’s shoe, on his body—or inside it. Do not laugh, but innuendos have been made concerning the possible use of a <a href=\"https://www.independent.co.uk/news/world/americas/magnus-carlson-chess-hans-niemann-b2167248.html\" target=\"_blank\">buzzing sex toy</a>. As a joke, Niemann declared that he was willing to play naked. A camsite called Stripchat promptly <a href=\"https://www.vice.com/en/article/v7vzvm/cam-site-offers-hans-niemann-dollar1-million-to-play-chess-nude-to-prove-he-didnt-cheat\" rel=\"noopener noreferrer\" target=\"_blank\">offered him [US] $1 million</a> to do so.</p><p>Computers loom so large because they now play chess like gods. The best free program, <a href=\"https://stockfishchess.org/blog/2021/stockfish-14/\" rel=\"noopener noreferrer\" target=\"_blank\">Stockfish 14</a>, is rated at 3534—678 points ahead of Carlsen. That’s enough of a gap to predict a <a href=\"http://wismuth.com/elo/calculator.html\" rel=\"noopener noreferrer\" target=\"_blank\">winning expectancy</a> of 99 percent.</p><p>In the early days, when chess programs were a lab project for AI, they played like idiots. Then the programmers began to enter their creations in competitions, and the programs got good. I learned that the hard way.</p><p>In late 1974, at a student tournament held in Evanston, Ill., I was paired against Northwestern University’s Chess 4.0 program, played the <a href=\"https://www.chess.com/openings/Sicilian-Defense\" target=\"_blank\">Sicilian Defense</a>, blundered a knight for two pawns, mentally kicked myself, and hastily resigned. David Slate, the programmer, waited patiently as I completed the ritual of resignation, which involves signing the score sheet and handing it to the tournament director—in this case, him. Only then did he tell me that if I’d just played on, I would have gotten a draw.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"58276d7790942bfb08458df24124ac4b\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/wljgxS7tZVE?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">The Strongest Computer Chess Engines Over Time</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n<a href=\"https://www.youtube.com/watch?v=wljgxS7tZVE\" target=\"_blank\">www.youtube.com</a>\n</small>\n</p><p>“It can’t play endgames,” Slate said. I kicked myself again.</p><p>Back then I was rated somewhere in the 1600s, about average for an amateur. Still, I was the highest-rated player any machine had yet beaten in a tournament game. It’s my claim to fame. Chess 4.0 went on to beat another guy higher rated than me, somewhat soothing my wounded pride.</p><p>It took years for the Northwestern program to reach 2000. Other university programs then took the lead, until at last a machine originating at Carnegie Mellon and redomiciled at IBM reached 2600, about grandmaster strength. That was strong enough to beat my old, 1600-rated self <a href=\"http://wismuth.com/elo/calculator.html\" rel=\"noopener noreferrer\" target=\"_blank\">99.9 percent</a> of the time. In 1997 an even stronger version of the IBM machine, dubbed Deep Blue, beat Gary Kasparov, the reigning world champion.</p><p>Deep Blue filled a room. Today, a smartphone can crush any human player.</p>",
  "pubDate": "Wed, 05 Oct 2022 22:53:41 +0000",
  "guid": "https://spectrum.ieee.org/magnus-carlsen-chess-scandal-ai",
  "category": [
    "Computer chess",
    "Artificial intelligence",
    "Machine learning"
  ],
  "dc:creator": "Philip E. Ross",
  "media:content": ""
}