{
  "title": "Best new tech items to keep on your radar for fall 2022: Apple Airpods Pro, Google Pixel 7 and more",
  "link": "https://www.ziffdavis.com/about/news/best-new-tech-items-to-keep-on-your-radar-for-fall-2022-apple-airpods-pro-google-pixel-7-and-more",
  "dc:creator": "Jeremy Jones",
  "pubDate": "Fri, 30 Sep 2022 20:44:53 +0000",
  "category": [
    "Recent News",
    "RetailMeNot"
  ],
  "guid": "https://www.ziffdavis.com/?p=4359",
  "description": "<p>Traditionally, tech buys and gadgets tend to be on the higher end when it comes to pricing, but RetailMeNot's shopping expert Kristin McGrath told \"GMA\" a helpful way to save is to start looking early. \"Over the past few years, we've seen retailers offering Black Friday pricing on select products in October. And, this year, Target's Deal Days event is taking place Oct. 6-8 and Amazon's Prime Early Access event the week after — making these great opportunities to check tech off your list early and avoid the short supply and longer shipping times we might see later in the season.\"</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/best-new-tech-items-to-keep-on-your-radar-for-fall-2022-apple-airpods-pro-google-pixel-7-and-more\">Best new tech items to keep on your radar for fall 2022: Apple Airpods Pro, Google Pixel 7 and more</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n",
  "content:encoded": "\n<p>Traditionally, tech buys and gadgets tend to be on the higher end when it comes to pricing, but RetailMeNot&#8217;s shopping expert Kristin McGrath told &#8220;GMA&#8221; a helpful way to save is to start looking early. &#8220;Over the past few years, we&#8217;ve seen retailers offering Black Friday pricing on select products in October. And, this year, Target&#8217;s Deal Days event is taking place Oct. 6-8 and Amazon&#8217;s Prime Early Access event the week after — making these great opportunities to check tech off your list early and avoid the short supply and longer shipping times we might see later in the season.&#8221;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.ziffdavis.com/about/news/best-new-tech-items-to-keep-on-your-radar-for-fall-2022-apple-airpods-pro-google-pixel-7-and-more\">Best new tech items to keep on your radar for fall 2022: Apple Airpods Pro, Google Pixel 7 and more</a> appeared first on <a rel=\"nofollow\" href=\"https://www.ziffdavis.com\">Ziff Davis</a>.</p>\n"
}