{
  "title": "namer, Automatic Labelling of R Markdown Chunks",
  "link": "https://itsalocke.com/blog/namer-automatic-labelling-of-r-markdown-chunks/",
  "pubDate": "Wed, 31 Oct 2018 00:00:00 +0000",
  "guid": "https://itsalocke.com/blog/namer-automatic-labelling-of-r-markdown-chunks/",
  "description": "<p>We&rsquo;ve just <a href=\"https://cran.r-project.org/web/packages/namer/index.html\">released a sweet package</a> to save you stress from the hassle of unnamed chunks in R Markdown! <code>namer</code> will name all your chunks, so you can quickly debug in future. More details in this post!</p>\n\n<h1 id=\"why-name-your-r-markdown-chunks\">Why name your R Markdown chunks?</h1>\n\n<p>When writing R Markdown documents, be it a single report or a whole book based on dozens of documents, it&rsquo;s crucial to name your R Markdown chunks. Informative names can help when navigating your files and will be used as informative filenames for figures generated in chunks. But even when not informative, chunk labels are very important! Imagine you&rsquo;re compiling a whole book, and oops, a bug appears in&hellip; unnamed-chunk-566. How do you find the culprit?! That name you get in the error message is <em>not</em> written in any file!</p>\n\n\n<figure >\n    \n        <img src=\"../img/namer-oh-no.png\" />\n    \n    \n    <figcaption>\n        <h4>Sad chibi Stef being told by R that there is an error in unnamed-chunk-12</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<p>Or, since caches are named after chunks, if you delete one chunk in a document full of unnamed chunks, all your caches become useless. The horror!</p>\n\n<p>One good piece of advice would be to always name your chunks. That&rsquo;s what we say when teaching R Markdown, and what&rsquo;s promoted <a href=\"https://masalmon.eu/2017/08/08/chunkpets/\">in this blog post of mine featuring puppy photographs</a>! But, sadly, we don&rsquo;t always follow best practice, do we?</p>\n\n<h1 id=\"what-does-namer-do\">What does <code>namer</code> do?</h1>\n\n<p>Luckily, thanks to a brilliant idea of Steph&rsquo;s, <code>namer</code> is now here to save your (vegan) bacon! This nifty package will name your chunks for you when you&rsquo;ve (willingly or unwillingly) forgotten to do so! For any R Markdown document, <code>namer</code> creates and saves chunk labels based on the filename stripped from its extension. Therefore, all chunks of &ldquo;my-fantastic-report.Rmd&rdquo; get named &ldquo;my-fantastic-report-1&rdquo;, &ldquo;my-fantastic-report-2&rdquo;. Voilà!</p>\n\n\n<figure >\n    \n        <img src=\"../img/namer-yaaasss.png\" />\n    \n    \n    <figcaption>\n        <h4>Happy chibi Stef being told by R that there is an error in the chunk labelled test-12</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<p>In practice, <code>namer</code> provides this service for a single document, or a whole folder at once, and an RStudio add-in for naming the chunks of the current active document.</p>\n\n<p>The screenshot below is <a href=\"https://github.com/lockedata/pres-datascience/pull/1\">a real-life example</a>  result of running namer::name_dir_chunks(&ldquo;pres&rdquo;). In each of the files in the dir &ldquo;pres&rdquo;, it labelled chunks using the filename and numbers.</p>\n\n\n<figure >\n    \n        <img src=\"../img/namer1.png\" />\n    \n    \n    <figcaption>\n        <h4>Difference between two R Markdown reports before and after using namer to label chunks</h4>\n        \n    </figcaption>\n    \n</figure>\n\n\n<h1 id=\"how-to-use-namer\">How to use <code>namer</code>?</h1>\n\n<p>First, install <code>namer</code> from CRAN.</p>\n<div class=\"highlight\"><pre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"><code class=\"language-r\" data-lang=\"r\">install.packages(<span style=\"color:#e6db74\">&#34;namer&#34;</span>)</code></pre></div>\n<p>Then, say you want to name the chunks of a report saved under &ldquo;reports/my-report.md&rdquo;, type</p>\n<div class=\"highlight\"><pre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"><code class=\"language-r\" data-lang=\"r\">namer<span style=\"color:#f92672\">::</span>name_chunks(<span style=\"color:#e6db74\">&#34;reports/my-report.md&#34;</span>)</code></pre></div>\n<p>Here comes a warning from us&hellip; When using <code>namer</code>, please check the edits before pushing them to your code base. Such automatic chunk labelling is best paired with <a href=\"http://happygitwithr.com/\">version control</a>!</p>\n\n<p>If you want to label the chunks of all the R Markdown documents of your &ldquo;reports&rdquo; folder, use <code>namer::name_dir_chunks()</code>:</p>\n<div class=\"highlight\"><pre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"><code class=\"language-r\" data-lang=\"r\">namer<span style=\"color:#f92672\">::</span>name_dir_chunks(<span style=\"color:#e6db74\">&#34;reports&#34;</span>)</code></pre></div>\n<p>Now, as life is sometimes a bit more complicated, you might sometimes need to <em>unname</em> all chunks of a report before re-naming it, if you e.g. used <code>namer</code> once, then added many chunks, or if you don&rsquo;t like the naming scheme you had been using. We have a function for that too! It will unname all chunks except the setup chunk!</p>\n<div class=\"highlight\"><pre style=\"color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4\"><code class=\"language-r\" data-lang=\"r\">namer<span style=\"color:#f92672\">::</span>unname_all_chunks(<span style=\"color:#e6db74\">&#34;reports/my-report.md&#34;</span>)</code></pre></div>\n<p>Last but not least, we have a minimal RStudio addin shipped with the package, to name chunks of any R Markdown file. It allows you to select that file thanks to <a href=\"https://github.com/lockedata/namer/pull/14\">our very first Hacktoberfest contributor</a>, <a href=\"https://github.com/ellisvalentiner\">Ellis Valentiner</a>! Read more about Hacktoberfest at Locke Data <a href=\"https://itsalocke.com/blog/up-your-open-source-game-with-hacktoberfest-at-locke-data/\">here</a>.</p>\n\n<h1 id=\"future-plans-for-even-more-nifty-automatic-naming\">Future plans for even more nifty automatic naming</h1>\n\n<p>Like <a href=\"https://itsalocke.com/oss/packages/\">all our packages</a>, <code>namer</code> is <a href=\"https://github.com/lockedata/namer\">developed in the open on GitHub</a> so you can go read what we&rsquo;re planning for the future. In particular, we&rsquo;re aiming to extend the RStudio addin to make it possible to select any file or folder, not just the active document.</p>\n\n<p>Furthermore, if you&rsquo;re keen to get involved in open-source development, we&rsquo;d be glad to mentor you, <a href=\"https://github.com/lockedata/namer/issues?q=is%3Aissue+is%3Aopen+label%3A%22help+wanted+%3Araised_hand%3A%22\">check out the issues that&rsquo;d welcome external help</a>! As a side-note, if you&rsquo;re into programmatic change or assessment of chunk options, you might be interested in <a href=\"https://github.com/ropenscilabs/tinkr\">the <code>tinkr</code> package</a>, that provides a function to transform R Markdown files into XML documents, and another one to save them back as R Markdown.</p>\n\n<p>In the meantime, go write awesome R Markdown documents, now that the fear of the unnamed chunks no longer dawns on you!</p>"
}