{
  "title": "TU 150: Ann &#038; Sue&#8217;s 150th Episode &#8211; Recaps &#038; Recommendations for Growing Security",
  "link": "https://therapistuncensored.com/episodes/tu150-recap-recommendations/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu150-recap-recommendations",
  "pubDate": "Thu, 22 Jul 2021 16:41:23 +0000",
  "guid": "https://therapistuncensored.com/?p=11769",
  "description": "Sue Marriott LCSW CGP and Ann Kelley PhD conclude their fifth season of this podcast.  Therapist Uncensored is packed with incredible content and has an archive of episodes developed over the past 5 years with the theme growing security.  The expert guest list is an embarrassment of riches. This episode reviews some of the highlights and points you in the right direction based on your interest. Shownotes at therapistuncensored.com/tu150.",
  "enclosure": "",
  "itunes:subtitle": "Where do you start with our huge library of content-heavy episodes?  Ann and Sue will help you out as they wrap up Season 5 and look ahead to Season 6",
  "itunes:summary": "<br />\nAnn and Sue's reflections on the past 5 seasons with the theme of Growing Security<br />\nIn today's episode, Sue Marriott and Ann Kelley conclude their fifth season, and it's all because of our listeners and audience that we've been able to maintain our Apple Top 10 Social Science (independently produced!) podcast.  We've had many brilliant people on for interviews, and today we're going to talk about some of the highlights of these episodes since it's unlikely that you may have heard all 150 episodes. We're doing this podcast because we're excited about it, we're passionate about it, and we are creating this content for ANYONE to help you grow security in your life. It's a GLBTQI+ inclusive, female-led, independently produced show that will always be FREE to everyone (not on paid platforms), and we will try our best to remain AD-FREE thanks to our patrons.  The general theme is all about deepening security in yourself and your close relationships.<br />\n<br />\nUse the search button on our website to find topics you enjoy.<br />\n<br />\nWe are working to lift under-represented voices so if you have a recommendation for a guest we may not know about, send us a note. We continue to value sharing the privilege of the mic.  As July is BIPOC Mental Health month (see below for resources and detail), we highlight several episodes on Hip Hop, community-based treatment and the story of resilience shared by Alphaso Appleton from Liberia.<br />\n<br />\n<br />\nLooking Back on 150 Episodes to help you grow security in your relationships:<br />\n<a href=\"https://therapistuncensored.com/episodes/holding-your-own1-messy-but-secure-relating/\">TU133: Holding Your Own 1: Messy but Secure Relating</a><br />\n<br />\nOn the Holding Your Own series, most frequent comment was an appreciation of basic humility in discussing mental health. Many of you think it's refreshing that the podcast is about content not about personalities.<br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/tu-149-modern-attachment-regulation-spectrum-an-integrated-model-of-change/\">TU 149: Modern Attachment Regulation Spectrum – An Integrated Model of Change</a><br />\n<a href=\"https://therapistuncensored.com/episodes/tu130-the-deep-biology-of-love-oxytocin-unpacked-dr-sue-carter/\">TU130 – The Deep Biology of Love – Oxytocin Unpacked, with Research Pioneer Dr. Sue Carter</a><br />\n<br />\n<br />\nThe fact that Dr. Sue Carter launched the study of oxytocin makes ME happier!<br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/tu93-polyvagal-theory-in-action-the-practice-of-body-regulation-with-dr-stephen-porges/\">TU93: Polyvagal Theory in Action – The Practice of Body Regulation With Dr. Stephen Porges</a><br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/tu110-story-follows-state-investigating-polyvagal-theory-with-guest-deb-dana/\">TU110: Story Follows State – Investigating Polyvagal Theory with Guest Deb Dana</a><br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/tu117-resilience-trauma-and-the-brain-w-guest-bruce-perry-md-phd/\">TU117: Resilience Trauma and the Brain W/ Guest Bruce Perry MD, PhD</a><br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/what-actually-heals-in-therapy-with-psychoanalyst-nancy-mcwilliams/\">TU106: What Actually Heals in Therapy with Psychoanalyst Nancy McWilliams</a><br />\n<br />\nThe difficult person we struggle with may be evoking the parts of ourselves that we hate.  It could be a disowned part that we have shame about, and we're seeing a mirror.<br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/attachment-through-the-lifespan-alan-sroufe/\">TU141: How We Become the Person's We Are with Dr. Alan Sroufe, Attachment Through the Lifespan</a><br />\n<br />\n<a href=\"https://therapistuncensored.com/episodes/tu56-how-we-come-to-define-ourselves-attachment-research-over-decades-with-guest-alan-sroufe/\">TU56: How We Come to Define Ourselves - Attachment ...",
  "itunes:author": "Sue Marriott LCSW, CGP, Ann Kelley PhD",
  "itunes:image": "",
  "itunes:season": 5,
  "itunes:episode": 150,
  "itunes:title": "150th Episode!  Recap and Recommendations with Sue Marriott & Ann Kelley",
  "itunes:duration": "43:13"
}