{
  "title": "Semiclassical spacetimes at super-Planckian scales from delocalized sources. (arXiv:2211.01657v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01657",
  "description": "<p>We derive the gravitational field and the spacetime metric generated by\nsources in quantum superposition of different locations. We start by working in\na Newtonian approximation, in which the effective gravitational potential is\ncomputed as the expectation value of the gravitational potential operator in a\nGaussian distribution of width $R$ for the position of the source. The\neffective gravitational potential is then covariantly uplifted to a fully\nrelativistic metric in general relativity, describing the spacetime generated\nby averaging over the state of such sources. These results are then rederived\nand extended by adopting an independent construction in terms of quantum\nreference frames. We find three classes of quantum effective metrics which are\nall asymptotically flat and reproduce the Schwarzschild metric at great\ndistances. The solutions differ, however, in the inner core. The quantum\nuncertainty $\\Delta r\\sim R$ in the position of the source prevents the radius\nof the transverse two-sphere to shrink to zero. Depending on the strength of\nthe quantum superposition effects, we have either a nonsingular black hole with\na ``quantum hair'' and an event horizon, a one-way wormhole with a critical\nnull throat or a traversable wormhole. We also provide a detailed study of the\ngeometric and thermodynamic properties of the spacetime structure for each of\nthese three families of models, as well as their phenomenology.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Akil_A/0/1/0/all/0/1\">Ali Akil</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Cadoni_M/0/1/0/all/0/1\">Mariano Cadoni</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Modesto_L/0/1/0/all/0/1\">Leonardo Modesto</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Oi_M/0/1/0/all/0/1\">Mauro Oi</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Sanna_A/0/1/0/all/0/1\">Andrea Pierfrancesco Sanna</a>"
}