{
  "title": "MALUNet: A Multi-Attention and Light-weight UNet for Skin Lesion Segmentation. (arXiv:2211.01784v1 [eess.IV])",
  "link": "http://arxiv.org/abs/2211.01784",
  "description": "<p>Recently, some pioneering works have preferred applying more complex modules\nto improve segmentation performances. However, it is not friendly for actual\nclinical environments due to limited computing resources. To address this\nchallenge, we propose a light-weight model to achieve competitive performances\nfor skin lesion segmentation at the lowest cost of parameters and computational\ncomplexity so far. Briefly, we propose four modules: (1) DGA consists of\ndilated convolution and gated attention mechanisms to extract global and local\nfeature information; (2) IEA, which is based on external attention to\ncharacterize the overall datasets and enhance the connection between samples;\n(3) CAB is composed of 1D convolution and fully connected layers to perform a\nglobal and local fusion of multi-stage features to generate attention maps at\nchannel axis; (4) SAB, which operates on multi-stage features by a shared 2D\nconvolution to generate attention maps at spatial axis. We combine four modules\nwith our U-shape architecture and obtain a light-weight medical image\nsegmentation model dubbed as MALUNet. Compared with UNet, our model improves\nthe mIoU and DSC metrics by 2.39% and 1.49%, respectively, with a 44x and 166x\nreduction in the number of parameters and computational complexity. In\naddition, we conduct comparison experiments on two skin lesion segmentation\ndatasets (ISIC2017 and ISIC2018). Experimental results show that our model\nachieves state-of-the-art in balancing the number of parameters, computational\ncomplexity and segmentation performances. Code is available at\nhttps://github.com/JCruan519/MALUNet.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Ruan_J/0/1/0/all/0/1\">Jiacheng Ruan</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Xiang_S/0/1/0/all/0/1\">Suncheng Xiang</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Xie_M/0/1/0/all/0/1\">Mingye Xie</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Liu_T/0/1/0/all/0/1\">Ting Liu</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Fu_Y/0/1/0/all/0/1\">Yuzhuo Fu</a>"
}