{
  "id": "yt:video:ZFikZnuSahM",
  "yt:videoId": "ZFikZnuSahM",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "Was England really warmer in medieval times?",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-08-31T10:02:50+00:00",
  "updated": "2022-09-19T00:53:11+00:00",
  "media:group": {
    "media:title": "Was England really warmer in medieval times?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Get to grips with how the natural world really works with Brilliant! https://www.brilliant.org/simonclark\n\nThis video topic was picked by my patrons! Help me make more videos like this one by becoming a patron at http://www.patreon.com/simonoxfphys\n\nThe recent extreme heat in Europe has led many people on my social feeds to claim that England used to be warmer in the so-called \"medieval warm period\" than today, and so that any modern heat isn't worrying. In this video I look through the evidence often cited for this claim and discuss why the medieval warm period wasn't that warm, and certainly wasn't global. In short: we should still be very, very worried.\n\nReferences in this video:\n1. http://www.meteo.psu.edu/holocene/public_html/shared/articles/MannetalScience09.pdf\n2. https://www.nature.com/articles/s41586-019-1401-2\n3. https://www.blogs.uni-mainz.de/fb09climatology/files/2012/03/Esper_2012_NatureCC6.pdf\n4. https://www.st-andrews.ac.uk/~rjsw/ScottishPine/PDFs/Wilson2009.pdf\n5. https://crudata.uea.ac.uk/~timo/datapages/mxdtrw.htm\n6. https://web.archive.org/web/20200310164209/https://repository.arizona.edu/bitstream/handle/10150/621352/JQSR-D-16-00018R1.pdf;jsessionid=9B8B7F76B023F4E572425DD0964189A0?sequence=1\n7. https://en.wikipedia.org/wiki/Temperature_record_of_the_last_2,000_years#/media/File:2000+_year_global_temperature_including_Medieval_Warm_Period_and_Little_Ice_Age_-_Ed_Hawkins.svg \n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty\n\nVideo essay about the medieval warm period. What was the medieval warm period and the little ice age? Was England really hotter in the medieval warm period? This video essay in a similar style to Kurzgesagt, SciShow, Smarter Every Day, and Veritasium looks at the evidence for the claim England was warmer in medieval times.\n\nHuge thanks to my supporters on Patreon: Angela Flierman, Alipasha Sadri, Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, Jimmy Lee, Simon Stelling, Gabriele Siino, Bjorn Bakker, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Shab Kumar, Brady Johnston, Liat Khitman, Jesper Norsted, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, Robert Connell, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, SexyCaveman , Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Anne Smith, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}