{
  "title": "571: What if 'Deathly Hallows' Played Out Very Differently?",
  "link": "https://audioboom.com/posts/8126979",
  "itunes:episode": 571,
  "itunes:title": "What if 'Deathly Hallows' Played Out Very Differently?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4549,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This week, we wrap up our month-long <em>Deathly Hallows </em>15th anniversary celebration by discussing a number of \"What If\" scenarios from the final installment of the <em>Harry Potter</em> series! What if things had gone drastically different at several key moments of the seventh book? Would Harry, Ron and Hermione have found another way, or would it have just been GAME OVER?<br>\n<br>\n\n</div>\n<ul>\n<li>Welcome back Sequoia, from <a href=\"https://www.fanaticalfics.com/\">Fanatical Fics and Where to Find Them</a> podcast!</li>\n<li>\n<a href=\"https://www.patreon.com/posts/introducing-2022-68800529\">Don't miss our 2022 Patreon Gifts</a> - The MuggleCast Collectors Club and the MuggleCast Wand! Pledge to our Patreon by August 7, 2022 and fill out the form(s) to receive your gifts! We are so proud of this year's items and hope you check them out!</li>\n<li>News: <a href=\"https://www.cnn.com/2022/07/20/us/quidditch-name-change-quadball-cec/index.html\">Quidditch is changing its name to Quadball</a>\n</li>\n<li>We continue our Deathly Hallows 15th Anniversary Celebration!</li>\n<li>Main Discussion: What if... Deathly Hallows Edition</li>\n<li>What if... Harry had been sorted into Slytherin?</li>\n<li>What if... Harry had not inadvertently destroyed the Diary Horcrux in <em>Chamber of Secrets</em>?</li>\n<li>What if... Lily and James had kept Sirius as their Secret Keeper?</li>\n<li>What if... Cedric Diggory didn't die in <em>Goblet of Fire</em>?</li>\n<li>What if... Draco had changed allegiances and served as double agent for Dumbledore's Army? What if... he was a double agent all along?</li>\n<li>What if... Rita Skeeter never published <em>The Life and Lies of Albus Dumbledore</em>?</li>\n<li>What if... Dumbledore got it all wrong and Harry died? How would the Epilogue be different?</li>\n<li>What if... Snape never shared his memories with Harry?</li>\n<li>What if... Harry didn't disarm Draco at Malfoy Manor? What if... Draco had given up the Trio to Voldemort?</li>\n<li>What if... Ron or Hermione had died?</li>\n<li>Listener What Ifs cover Hermione leaving instead of Ron, Narcissa's confirmation of Harry's death, Dobby and more!</li>\n<li>Next Week: We will be reviewing the <em>Secrets of Dumbledore</em> script book and see if we can gleam any new details from it!</li>\n<li>Quizzitch: What resident of Little Hangleton is quoted as saying that Frank Bryce definitely killed the Riddles no matter what the police think?</li>\n<li>This week's episode is brought to you by Upside (Download the free <a href=\"https://www.upside.com/\">Upside app</a><br>\nand use promo code 'mugglecast' to get $5 or more cash back on your first purchase of $10 or more), Shudder (stream your first 30 days of Shudder for FREE at <a href=\"http://www.Shudder.com/MuggleCast\">Shudder.com/MuggleCast</a>) and BetterHelp (Get 10% off your first month of therapy at <a href=\"https://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 26 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-25:/posts/8126979",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}