{
  "title": "The Radical Scope of Tesla’s Data Hoard",
  "link": "https://spectrum.ieee.org/tesla-autopilot-data-scope",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/aerial-view-of-a-tesla-charging-lot.jpg?id=30501433&width=600&height=600&coordinates=6%2C0%2C723%2C0\"/><br/><br/><p>You won’t see a single Tesla cruising the glamorous beachfront in Beidaihe, China, this summer. <a href=\"https://www.reuters.com/business/autos-transportation/chinas-beidaihe-district-bar-tesla-cars-driving-july-local-police-2022-06-20/\" rel=\"noopener noreferrer\" target=\"_blank\">Officials banned</a> Elon Musk’s popular electric cars from the resort for two months while it hosts the <a href=\"https://asia.nikkei.com/Politics/Xi-s-agenda-faces-test-at-party-conclave-ahead-of-bid-for-third-term\" target=\"_blank\">Communist Party’s annual retreat</a>, presumably fearing what their built-in cameras might capture and feed back to the United States.</p><p>Back in Florida, Tesla recently faced a negligence lawsuit after two young men died in a fiery car crash while driving a Model S belonging to a father of one of the accident victims. As part of its defense, the company submitted a <a href=\"https://www.documentcloud.org/documents/22088110-28-4-tesla-exhibit\" rel=\"noopener noreferrer\" target=\"_blank\">historical speed analysis</a> showing that the car had been driven with a daily top speed averaging over 90 miles per hour (145 kilometers per hour) in the months before the crash. This information was quietly captured by the car and uploaded to Tesla’s servers. (A jury later found Tesla just 1 percent negligent in the case.)</p><p>Meanwhile, every recent-model Tesla reportedly records a breadcrumb GPS trail of every trip it makes—and shares it with the company. While this data is supposedly anonymized, experts are skeptical.</p><p>Alongside its advances in electric propulsion, Tesla’s innovations in data collection, analysis, and usage are transforming the automotive industry, and society itself, in ways that appear genuinely revolutionary.</p><p class=\"pull-quote\">“Gateway log” files—periodically uploaded to Tesla—include seatbelt, Autopilot, and cruise-control settings, and whether drivers had their hands on the steering wheel.  </p><p>In a series of articles (<a href=\"https://spectrum.ieee.org/tesla-autopilot-data-deluge\" target=\"_blank\">story 2</a>; <a href=\"https://spectrum.ieee.org/tesla-autopilot-data-ownership\" target=\"_blank\">story 3</a>), <em>IEEE Spectrum</em> is examining exactly what data Tesla vehicles collect, how the company uses them to develop its automated driving systems, and whether owners or the company are in the driver’s seat when it comes to accessing and exploiting that data. There is no evidence that Tesla collects any data beyond what customers agree to in their terms of service—even though opting out of this completely appears to be very difficult.</p><p>Almost every new production vehicle has a battery of sensors, including cameras and radars, that capture data about their drivers, other road users, and their surroundings. There is now a <a href=\"https://themarkup.org/the-breakdown/2022/07/27/who-is-collecting-data-from-your-car\" rel=\"noopener noreferrer\" target=\"_blank\">worldwide connected car-data industry</a>, trading in anonymized vehicle, driver, and location data aggregated from <a href=\"https://themarkup.org/the-breakdown/2022/07/27/who-is-collecting-data-from-your-car\" rel=\"noopener noreferrer\" target=\"_blank\">billions of journeys made in tens of millions of vehicles</a> from all the major automotive equipment manufacturers. But none seem to store that information and send it back to the manufacturer as regularly, or in such volume, or have been doing so for as long, as those made by Tesla.</p><p>“As far as we know, Tesla vehicles collect the most amount of data,” says Francis Hoogendijk, a researcher at the <a href=\"https://www.forensicinstitute.nl/\" rel=\"noopener noreferrer\" target=\"_blank\">Netherlands Forensic Institute</a> who began investigating Tesla’s data systems after fatal crashes in the United States and the Netherlands in 2016.</p><p><em>Spectrum</em> has used expert analyses, NTSB crash investigations, <a href=\"https://www.nhtsa.gov/laws-regulations/standing-general-order-crash-reporting\" rel=\"noopener noreferrer\" target=\"_blank\">NHTSA reports</a>, and Tesla’s <a href=\"https://www.tesla.com/legal/privacy\" rel=\"noopener noreferrer\" target=\"_blank\">own documents</a> to build up as complete a picture as possible of the data Tesla vehicles collect and what the company does with them.</p><p>To start with, Teslas, like over 99 percent of new vehicles, have <a href=\"https://www.nhtsa.gov/research-data/event-data-recorder\" target=\"_blank\">event data recorders (EDRs)</a>. These “black box” recorders are triggered by a crash and collect a scant 5 seconds of information, including speed, acceleration, brake use, steering input, and automatic brake and stability controls, to assist in crash investigations.</p><p>But Tesla also makes a permanent record of these data—and many more—on a 4-gigabyte SD or 8-GB microSD card located in the car’s <a href=\"https://tesletter.com/tags/tesla-media-control-unit/\" target=\"_blank\">Media Control Unit (MCU)</a> Linux infotainment computer. These time-stamped <a href=\"https://www.researchgate.net/publication/355202701_Reverse_engineering_and_evaluation_of_Tesla_vehicle_logs\" target=\"_blank\">“gateway log” files</a> also include seatbelt, Autopilot, and cruise-control settings, and whether drivers had their hands on the steering wheel. They are normally recorded at a relatively low resolution, such as 5 hertz, allowing the cards to store months’ or years’ worth of data, even up to the lifetime of the vehicle.</p><p>Because the gateway logs use data from cars’ standard control area network (CAN) buses, they can include the unique vehicle identification number, or VIN. However, no evidence suggests these logs could include information from the car’s GPS module, or from its cameras or (for earlier models) radars.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A bar graph labelled Maximum Vehicle Speed by Date - 2018 showing high vehicle speeds over the course of 4 months.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"fb82ee0252921d8e89928dfd26961a17\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"e3cce\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-bar-graph-labelled-maximum-vehicle-speed-by-date-2018-showing-high-vehicle-speeds-over-the-course-of-4-months.jpg?id=30501692&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">In a Florida court, Tesla presented detailed data about the top speeds of a Model S involved in a fatal crash.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Car Engineering/Tesla/Southern District of Florida U.S. Courts</small></p><p>When an owner connects a Tesla to a Wi-Fi network—for instance, to download an over-the-air update that adds new features or fixes bugs—the gateway log data is periodically uploaded to Tesla. Judging by Tesla’s use of gateway log data in the Florida lawsuit, Tesla appears to link that data to its originating vehicle and store it permanently. (Tesla did not respond to requests for clarification on this and other issues).</p><p>Teslas also have a separate <a href=\"https://www.tesla.com/autopilot\" rel=\"noopener noreferrer\" target=\"_blank\">Autopilot</a> Linux computer, which takes inputs from the cars’ cameras to handle driver-assistance functions like cruise control, lane-keeping, and collision warnings. If owners plug their own USB thumb drives into the car, they can make live dashcam recordings, and set up <a href=\"https://www.tesla.com/blog/sentry-mode-guarding-your-tesla\" rel=\"noopener noreferrer\" target=\"_blank\">Sentry Mode</a> to record the vehicle’s surroundings when parked. These recordings do not appear to be uploaded to Tesla.</p><p>However, there are many occasions in which Tesla vehicles do store images and (in 2016 models onward) videos from the cameras, and then share them with the company. These Autopilot “snapshots” can span several minutes and consist of up to several hundred megabytes of data, according to one engineer and Tesla owner who has studied Tesla’s data-collection process using salvaged vehicles and components, and who tweets using the pseudonym <a href=\"https://twitter.com/greentheonly?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" rel=\"noopener noreferrer\" target=\"_blank\">Green</a>.</p><p>As well as visual data, the snapshots include high-resolution log data, similar to that captured in the gateway logs but at a much higher frequency—up to 50 Hz for wheel-speed information, notes Hoogendijk.</p><p>Snapshots are triggered when the vehicle crashes—as detected by the airbag system deploying—or when certain conditions are met. These can include anything that Tesla engineers want to learn about, such as particular driving behaviors, or specific objects or situations being detected by the Autopilot system. (These matters will be covered in the second installment in our series, to be posted tomorrow.)</p><p>GPS location data is always captured for crash events, says Green, and sometimes for other snapshots. Like gateway data, snapshots are uploaded to Tesla when the car connects to Wi-Fi, although those triggered by crashes will also attempt to upload over the car’s 4G cellular connection. Then, Green says, once a snapshot has been successfully uploaded, it is deleted from the Autopilot’s onboard 32-GB storage.</p><p>In addition to the snapshots, the Autopilot computer also records a complete trip log every time a mid-2017 or later Tesla is shifted from Park to Drive, says Green. Trip logs include a GPS breadcrumb trail until the car is shifted back into Park and include speeds, road types, and when or whether Autopilot was activated. Green says that trip logs are recorded whether or not Autopilot (or Full Self-Driving) is used. Like the snapshots, trip logs are deleted from the vehicle after being uploaded to Tesla.</p><p>But what happens to this treasure trove of data? Tesla has sold about three million vehicles worldwide, the majority of which are phoning home daily. They have provided the company <a href=\"https://electrek.co/2020/04/22/tesla-autopilot-data-3-billion-miles/\" rel=\"noopener noreferrer\" target=\"_blank\">with billions of miles</a> of real-world driving data and GPS tracks, and many millions of photos and videos. What the world’s leading EV automaker is doing with all that data is the subject of our next installment.</p><p><em>This article appears in the October 2022 print issue.</em></p><p><strong></strong><em><strong>Update 5 Aug. 2022:</strong> Elon Musk announced this week that Tesla has now sold about three million vehicles worldwide (not two as we had originally reported). </em><br/></p>",
  "pubDate": "Wed, 03 Aug 2022 21:27:27 +0000",
  "guid": "https://spectrum.ieee.org/tesla-autopilot-data-scope",
  "category": [
    "Tesla motors",
    "Autopilot",
    "Big data"
  ],
  "dc:creator": "Mark Harris",
  "media:content": ""
}