{
  "title": "60 Words",
  "link": "http://www.wnycstudios.org/story/60-words/",
  "description": "<p>This hour we pull apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace.</p> <p>Last weekend President Trump authorized a strike that killed Iranian General Qasem Soleimani in Iraq. The news had us thinking about an episode we produced in 2014. We pulled apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace.</p>\n<p>In the hours after the attacks of Sept. 11, 2001, a lawyer sat down in front of a computer and started writing a legal justification for taking action against those responsible. The language that he drafted and that President George W. Bush signed into law - called the Authorization for Use of Military Force (AUMF) -  has at its heart one single sentence, 60 words long. Over the last decade, those 60 words have become the legal foundation for the \"war on terror.\"</p>\n<p>In this collaboration with BuzzFeed, reporter Gregory Johnsen tells us the story of how this has come to be one of the most important, confusing, troubling sentences of the last two decades. We go into the meetings that took place in the chaotic days just after 9/11, speak with Congresswoman Barbara Lee and former Congressman Ron Dellums about the vote on the AUMF. We hear from former White House and State Department lawyers John Bellinger &amp; Harold Koh. We learn how this legal language unleashed Guantanamo, Navy Seal raids and drone strikes. And we speak with journalist Daniel Klaidman, legal expert Benjamin Wittes and Virginia Senator Tim Kaine about how these words came to be interpreted, and what they mean for the future of war and peace.</p>\n<p>Finally, we check back in with Wittes, to see how the AUMF has trickled into the 2020s.</p>\n<p>Produced by Matt Kielty and Kelsey Padgett with original music by Dylan Keefe. </p>\n<p>Watch Congresswomen Barbara Lee's speech <a href=\"https://www.youtube.com/watch?v=mvnLtMKzX6Y\" target=\"_blank\" rel=\"noopener noreferrer\" data-auth=\"NotApplicable\"><strong>here</strong></a>. </p>",
  "pubDate": "Tue, 07 Jan 2020 12:00:00 -0500",
  "guid": "http://www.radiolab.org/story/60-words/",
  "enclosure": "",
  "category": [
    "guantanamo",
    "national_security",
    "politics",
    "war_on_terror"
  ],
  "media:content": "",
  "media:description": "60 Words",
  "media:thumbnail": "",
  "itunes:duration": "64:59",
  "content:encoded": "<p>This hour we pull apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace.</p>",
  "itunes:title": "60 Words",
  "itunes:summary": "<p>This hour we pull apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace.</p>",
  "itunes:episodeType": "full",
  "author": "wnycdigital@gmail.com (WNYC Studios)",
  "itunes:explicit": "no",
  "itunes:subtitle": "This hour we pull apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace. Last weekend President Trump authorized a strike that killed Iranian General Qasem Soleimani in Iraq. The news had us thinking about an episode we produced in 2014. We pulled apart one sentence, written in the hours after September 11th, 2001, that has led to the longest war in U.S. history. We examine how just 60 words of legal language have blurred the line between war and peace. In the hours after the attacks of Sept. 11, 2001, a lawyer sat down in front of a computer and started writing a legal justification for taking action against those responsible. The language that he drafted and that President George W. Bush signed into law - called the Authorization for Use of Military Force (AUMF) -  has at its heart one single sentence, 60 words long. Over the last decade, those 60 words have become the legal foundation for the \"war on terror.\" In this collaboration with BuzzFeed, reporter Gregory Johnsen tells us the story of how this has come to be one of the most important, confusing, troubling sentences of the last two decades. We go into the meetings that took place in the chaotic days just after 9/11, speak with Congresswoman Barbara Lee and former Congressman Ron Dellums about the vote on the AUMF. We hear from former White House and State Department lawyers John Bellinger &amp; Harold Koh. We learn how this legal language unleashed Guantanamo, Navy Seal raids and drone strikes. And we speak with journalist Daniel Klaidman, legal expert Benjamin Wittes and Virginia Senator Tim Kaine about how these words came to be interpreted, and what they mean for the future of war and peace. Finally, we check back in with Wittes, to see how the AUMF has trickled into the 2020s. Produced by Matt Kielty and Kelsey Padgett with original music by Dylan Keefe.  Watch Congresswomen Barbara Lee's speech here.",
  "itunes:author": "WNYC Studios",
  "itunes:keywords": "Science,Technology,Philosophy,Education,radiolab,jad,abumrad,krulwich,Radio,Lab,wnyc,studios"
}