{
  "title": "182: WeWork: Or the Making and Breaking of a $47 Billion Unicorn",
  "link": "https://audioboom.com/posts/7873494",
  "itunes:episode": 182,
  "itunes:title": "WeWork: Or the Making and Breaking of a $47 Billion Unicorn",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3575,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>TICK TOCK IT'S CULOT O'CLOCK....AGAIN! And Gwyneth Paltrow is here? WHAT? <br>\n<br>\nIf you live in a city, there was a time you saw a WeWork on just about every corner. It was the co-working space where all the cook kids went to, like, make stuff and drink coffee. But who even knew the whole thing was a cult-meets-pyramid-scheme with all you can drink \"summer camps\" and a leader who looks like the low rent Ashton Kutcher. OH BUT THEN REAL ASHTON KUTCHER SHOWS UP. This one is ridiculous. AND WE HAVE SO MUCH TO SAY ABOUT OUR TIME WORKING AT A WEWORK. Dive in, lovelies. <br>\n<br>\n<strong>FAM! WE LAUNCHED A NEW PODCAST!</strong> <a href=\"https://lnk.to/98BXWuip\">Check  out \"Murder in Alliance.\"</a> It's a \"Serial\"-style active investigation into who killed 26-year-old Yvonne Layne in Alliance, Ohio. The murder was brutal and personal. Her ex-boyfriend, David Thorne, was convicted of the crime, but he couldn't have done it--he was two counties away at a class with several people who saw him. Host Maggie Freleng and her team of investigators--including Jason Baldwin of the West Memphis Three--are on the ground in Alliance tracking down witnesses, finding new evidence, and reporting in REAL TIME as they track down the real. Killer. <a href=\"https://lnk.to/98BXWuip\">Binge the first 4 episodes here!</a><br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n",
  "pubDate": "Tue, 25 May 2021 10:13:06 +0000",
  "guid": "tag:audioboom.com,2021-05-25:/posts/7873494",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}