{
  "title": "A better way to tell which species are vulnerable",
  "link": "https://news.mit.edu/2022/species-vulnerable-climate-change-1031",
  "description": "New analysis takes account of natural fluctuations and predictability to assess which parts of an ecosystem are most threatened by climate change and other disruptions.",
  "pubDate": "Mon, 31 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/species-vulnerable-climate-change-1031",
  "dc:creator": "David L. Chandler | MIT News Office",
  "content:encoded": "<div>\n<p>Wildfires, floods, pollution, and overfishing are among the many disruptions that can change the balance of ecosystems, sometimes endangering the future of entire species. But evaluating these ecosystems to determine which species are most at risk, in order to focus preservation actions and policies where they are most needed, is a challenging task.</p>\n\n<p></p>\n\n<p>Most such efforts assume that ecosystems are essentially in a state of equilibrium, and that external perturbations cause a temporary shift before things eventually return to that equilibrium state. But that assumption fails to account for the reality that ecosystems are often in flux, with the relative abundances of their different components shifting on timetables of their own. Now, a team of researchers at MIT and elsewhere have come up with a better, predictive way of evaluating these systems in order to rank the relative vulnerabilities of different species, and to detect species that are under threat but could otherwise go unnoticed.</p>\n\n<p></p>\n\n<p>Contrary to conventional ways of making such rankings today, they found, the species with the lowest population numbers or the steepest decline in numbers — criteria typically used today — are sometimes not the ones most at risk.</p>\n\n<p></p>\n\n<p>The findings are reported today in the journal <em>Ecology Letters,</em> in a paper by MIT associate professor of civil and environmental engineering Serguei Saavedra, recent doctoral student Lucas Medeiros PhD ’22, and three others.</p>\n\n<p></p>\n\n<p>The new work is analogous to the way Edward Lorenz’s analysis of weather patterns decades ago revolutionized that field, Saavedra says. Lorenz’s research suggested that tiny perturbations could ultimately lead to very large outcomes — famously expressed as the idea that the flapping of a butterfly’s wings in one place could ultimately lead to a hurricane somewhere else. “Even infinitesimally close initial conditions can diverge quite largely over a given period of time and therefore become unpredictable,” he says. With that in mind, “We said, what would happen if we apply the same kind of perspective to trying to figure out which are the most sensitive species?”</p>\n\n<p></p>\n\n<p>In some cases, as in aspects of weather forecasting, scientists understand the underlying physics of the phenomena and can produce equations describing their dynamics, up to a point. That’s not the case with complex ecosystems, he says, where we don’t have the underlying equations for the dynamics of even single species, much less the whole system. But over the last decade or so, he says, the team has developed mathematical techniques so that “we can have a description of the dynamics without knowing the underlying equations,” as long as there is a sufficient time series of data to work with.</p>\n\n<p></p>\n\n<p>The team developed two different approaches, called expected sensitivity ranking and Eigenvector ranking. Both approaches performed well in tests using large sets of simulated data, producing rankings that closely matched those expected given the underlying assumptions of the simulation’s model.</p>\n\n<p></p>\n\n<p>Traditional attempts to rank the vulnerability of species tend to focus on measures such as body size — larger species tend to be more vulnerable — as well as population size, both of which can be useful indicators much of the time. But, as Saavedra points out, “These species are embedded in communities, and these communities have nonlinear emergent behavior such that a small change in one place would change completely in a different way some other aspect of the system.”</p>\n\n<p></p>\n\n<p>The fact that species within an ecosystem may have abundances that rise and fall, sometimes cyclically, sometimes randomly or determined by external forces, means that the exact timing of a given perturbation can make a big difference — something that equilibrium models fail to account for. “Approaches based on equilibrium dynamics have this static view of species interaction effects,” Medeiros says. “Under nonequilibrium abundance fluctuations, these interaction effects can change over time, impacting the sensitivity of any given species to perturbations.”</p>\n\n<p></p>\n\n<p>For example, a species that is highly active in summer but dormant in winter may be strongly impacted by a summer wildfire or heat wave, but completely unaffected if the disruption happens in winter. Or, if interactions between a predator species and its prey vary over the course of a year, then the timing of a disruption can be more disruptive during some seasons than others.</p>\n\n<p></p>\n\n<p>The new analytical approaches are broadly applicable to any kind of ecosystem, Saavedra says, whether it be marine or terrestrial, tropical or arctic. In fact, the formulas are so general, when applied to systems with many interactions and constant flux, that some of the researchers have also applied them successfully to predicting the dynamics of financial markets.</p>\n\n<p></p>\n\n<p>“The techniques are quite general for any nonlinear dynamics or dynamical systems in general out of equilibrium,” Saavedra says. One student in the group who had been working on these techniques ended up working for a hedge fund, he says, and another took a sabbatical to work for a foreign bank. “He basically was able to apply these techniques, and they were working.”</p>\n\n<p></p>\n\n<p>But the primary goal of the work remains in the assessment of species vulnerability, and already the findings are beginning to be applied. For example, Medeiros, the paper’s lead author, is working at the University of California at Santa Cruz and the National Oceanic and Atmospheric Administration, applying these techniques to the management of fisheries. “With fisheries in particular, you have a lot of data series, looking at the rise and fall of these population sizes over time,” Saavedra says. Using those data, he says, it’s now possible “to predict precisely the species that should be most sensitive to, for example, climate change, or the highest rate of fishing quotas.”</p>\n\n<p></p>\n\n<p>The research team also included Stefano Allesina, now at the University of Chicago and Northwestern University; Vasilis Dakos, now at the University of Montpelier, in France; and George Sugihara, now at the University of California at San Diego. The work was supported by MIT’s Environmental Solutions Initiative, the Martin Family Society of Fellows for Sustainability, the U.S. Department of Defense Environmental Research and Development Program, the National Science Foundation, the Department of the Interior, and the MIT Sea Grant Program.</p>\n</div>",
  "media:content": {
    "media:description": "Intertidal ecosystems containing species of mussels, barnacles, and algae were one of the systems with fluctuating populations analyzed by the team. They developed a new way to detect species that are vulnerable to perturbations, such as waves and storms that affect intertidal ecosystems.",
    "media:credit": "Courtesy of the researchers"
  },
  "category": [
    "Research",
    "Ecology",
    "Biology",
    "Civil and environmental engineering",
    "School of Engineering",
    "National Science Foundation (NSF)",
    "MIT Energy Initiative"
  ]
}