{
  "id": "https://bibleinoneyear.org/en/youth/76",
  "title": "Day 76: If the Grass Looks Greener, It Is Probably AstroTurf",
  "description": "Proverbs 7:6–20, Numbers 6:24–26, Luke 2:1–20. ’God’s faithfulness towards us gives us an example to follow in our own relationships  Faithfulness is something we should strive for in marriage, friendships and in our relationship with God",
  "pubDate": "Thu, 17 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/76/",
  "itunes:duration": "13:20",
  "guid": "enyouth17032022-76",
  "length": 800.81,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 76: If the Grass Looks Greener, It Is Probably AstroTurf",
  "itunes:subtitle": "Proverbs 7:6–20, Numbers 6:24–26, Luke 2:1–20. ’God’s faithfulness towards us gives us an example to follow in our own relationships  Faithfulness is something we should strive for in marriage, friendships and in our relationship with God",
  "itunes:summary": "A campaign by one online agency offered a dating service for married men and women who wanted to have an affair. The agency is by no means alone in this market. What was different was that they executed an extensive advertising campaign specifically on massive billboards next to motorways with the slogan, ‘The grass is always greener.’\nEssentially, they were making money feeding on people’s weaknesses and helping them to be unfaithful. This may seem attractive, but the reality is that it can ruin the lives of the individuals involved, as well as the lives of their partners, their families and their children.\nJesus puts faithfulness alongside justice and mercy (Matthew 23:23). Faithfulness is a fruit of the Holy Spirit (Galatians 5:22). Mother Teresa said, ‘I am not called to be successful but to be faithful.’\nGod’s faithfulness towards us gives us an example to follow in our own relationships. Faithfulness is something we should strive for in marriage, friendships and in our relationship with God.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 441
}