{
  "title": "Plausible constraints on the range of bulk terrestrial exoplanet compositions in the Solar neighbourhood. (arXiv:2211.01800v1 [astro-ph.EP])",
  "link": "http://arxiv.org/abs/2211.01800",
  "description": "<p>Rocky planet compositions regulate planetary evolution by affecting core\nsizes, mantle properties, and melting behaviours. Yet, quantitative treatments\nof this aspect of exoplanet studies remain generally under-explored. We attempt\nto constrain the range of potential bulk terrestrial exoplanet compositions in\nthe solar neighbourhood (&lt;200 pc). We circumscribe probable rocky exoplanet\ncompositions based on a population analysis of stellar chemical abundances from\nthe Hypatia and GALAH catalogues. We apply a devolatilization model to simulate\ncompositions of hypothetical, terrestrial-type exoplanets in the habitable\nzones around Sun-like stars, considering elements O, S, Na, Si, Mg, Fe, Ni, Ca,\nand Al. We further apply core-mantle differentiation by assuming constant\noxygen fugacity, and model the consequent mantle mineralogy with a Gibbs energy\nminimisation algorithm. We report statistics on several compositional\nparameters and propose a reference set of (21) representative planet\ncompositions for using as end-member compositions in imminent modelling and\nexperimental studies. We find a strong correlation between stellar Fe/Mg and\nmetallic core sizes, which can vary from 18 to 35 wt%. Furthermore, stellar\nMg/Si gives a first-order indication of mantle mineralogy, with high-Mg/Si\nstars leading to weaker, ferropericlase-rich mantles, and low-Mg/Si stars\nleading to mechanically stronger mantles. The element Na, which modulates\ncrustal buoyancy and mantle clinopyroxene fraction, is affected by\ndevolatilization the most. While we find that planetary mantles mostly consist\nof Fe/Mg-silicates, core sizes and relative abundances of common minerals can\nnevertheless vary significantly among exoplanets. These differences likely lead\nto different evolutionary pathways among rocky exoplanets in the solar\nneighbourhood.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Spaargaren_R/0/1/0/all/0/1\">Rob J. Spaargaren</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Wang_H/0/1/0/all/0/1\">Haiyang S. Wang</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Mojzsis_S/0/1/0/all/0/1\">Stephen J Mojzsis</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ballmer_M/0/1/0/all/0/1\">Maxim D Ballmer</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Tackley_P/0/1/0/all/0/1\">Paul J Tackley</a>"
}