{
  "title": "Unsolved Mysteries Ep 4: No Ride Home",
  "link": "https://audioboom.com/posts/7717450",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3453,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On April 3, 2004, 23 year old Alonzo Brooks and 3 friends drove to a party in La Cygne, Kansas--about 50 miles from where they lived in Garner Kansas. It would later be said that Alonzo was the only black person at the party, and though by all accounts he was having fun, racial slurs had been directed at him. Later that night, Alonzo's three friends left the party, unknowingly stranding him there. When Alonzo didn't show up at home, the police eventually got involved and did search of the area near the party, but didn't find him. A month later, when the family was allowed to do their own search, they found Alonzo's body within minutes--and just behind the house where he was last seen. <br>\n<strong><br>\nYOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. Episodes 1 & 2 are available right now! <a href=\"https://www.centuriespod.com/post/episode-1-mary-phagan\">Episode tells the story of the 1913 murder of 13-year-old Mary Phagan</a> which resulted in one of the country's first high-profile murder trials. <a href=\"https://www.centuriespod.com/post/episode-2-leopold-loeb\">Episode 2 tells the story of the Jazz Age killers Leopold & Loeb</a>, who murdered a boy just to prove they could get away with it. <strong>Find \"Crimes of the Centuries\" wherever you get your podcasts. </strong>\n</div>\n",
  "pubDate": "Thu, 29 Oct 2020 10:33:13 +0000",
  "guid": "tag:audioboom.com,2020-10-29:/posts/7717450",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}