{
  "title": "The Realistic Market for Private Governance",
  "link": "https://mises.org/node/60821",
  "description": "<p><strong>[Excerpted from remarks delivered at the Free Private Cities \"Liberty in our Lifetime\" Conference in Prague on 22 October, 2022]</strong></p>\n<p>At this conference and others like it, dealing with alternative legal and monetary structures, I’ve noticed in recent years a strong bias in favor of action over argument, for building over persuading, for practice over theory. This is laudable and understandable for all of us frustrated by statism and all its terrible offspring: war, bad money, division, along with economic, social, and cultural degradation. We understandably want out, and not one hundred years from now but within our lifetimes.</p>\n<p>I saw a response to a tweet promoting this gathering to this effect: you have some great thinkers and theorists scheduled to speak, but what you really need is urban planners! Or, we might think, architects and engineers. This is certainly a fair point! But I must confess to representing the theorists today, and Rothbardians in particular.</p>\n<p>In my defense, the theory underpinning any new model for private governance or free cities is as important as the blueprints for a building. Carpenters have a saying, “Measure twice and cut once.” Another version of this is found in the Zen koan “Slow down to speed up.” Maybe this is a good time to rethink our approach to what private governance could mean, and how better to align this movement with current political, economic, and cultural realities. Remember, “parallel” implies peaceful coexistence with existing political structures. It is nonthreatening and voluntary.</p>\n<p>To promote the idea of private governance, we should understand it fully ourselves. We should make sure our vision comports with human nature, which is another way of saying it aligns with the marketplace. As entrepreneurs, we should take the world as it is rather than how we wish it were. Otherwise, we risk creating a product that nobody is buying.</p>\n<p>And as an aside, speaking of creating, let’s not forget the earliest and most enduring form of private governance is the family! Maybe the fastest way to build your own “parallel structure” is to start having kids. We heard a lot yesterday about living as a digital nomad, seeking multiple passports, and seasteading, but we should not forget that the whole point of building better governance structures is so humans can live better. This requires new humans!</p>\n<p>I also suggest an appeal to the better angels among the many nationalist and breakaway movements happening across the world. These are real, they hunger for independence, and we should not ignore them. And of course we should sell community: clean and safe streets, nice parks, good schools, and competent local services from competent local providers. I mean the basic building blocks of a nice community. A good place to raise a family, as the saying goes. The market for start-up or private communities is not only expats or perpetual travelers or bitcoin aficionados, but also soccer moms and religious people and retirees.</p>\n<p>We can use the term “private” in more than one sense: the first is personal, relating to private matters in our personal lives, matters which are not public. And we use it as a bright-line distinction between state and civil society, between government action and private action—though, as we’ve seen, that distinction is increasingly blurred by what Robert Higgs calls “participatory fascism.” But when discussing private cities or regions or services or governance, we use “private” as a synonym for “commercial,” like any private business. In this sense, we simply mean “not governmental.” But beyond that the possible models are wide open, so we should focus on consumer sovereignty just as the seller of any new product should.</p>\n<p>The marketplace—capital and entrepreneurship, as opposed to politics—is the way forward.</p>\n<h4><strong>I. The Dystopian Vision</strong></h4>\n<p>When we consider the market for new parallel private structures, we should take a moment to play devil’s advocate and consider the typical strawman arguments presented by people who reflexively abhor the notion of private government. These are the people who go on and on about our “sacred democracy” but cannot conceive of the truly democratizing elements of the marketplace, what Mises called a “daily plebiscite.” It’s uncanny: people have no objection whatsoever to private governance when it comes to vast companies like Google or the British National Trust (the biggest private landowner in the UK) or the ecclesiastical hierarchy of the Roman Catholic Church or the management of Real Madrid football club. But suggest privatizing police or trash pickup in their town of thirty thousand, and they overwhelmingly object. Why?</p>\n<p>In large part, “privatization” has become a boogieman for progressives, who treat the concept as a sinister plot for big corporations to run our lives. This is the mentality we must overcome.</p>\n<p>In 1992, the sci-fi writer Neal Stephenson published a really enjoyable and groundbreaking book titled <em>Snow Crash</em>, which essentially presents a cheeky anarcho-capitalist future—fully privatized, but very messy. The reader senses Stephenson is one of us, but also a bit of a provocateur and contrarian.</p>\n<p><em>Snow Crash </em>takes place in the old territory of California, over which both the US federal government and the state government lost control following a terrible economic crisis (so, unlike our models, the new “startup” territories were born of necessity, not choice).</p>\n<p>Government still controls minor aspects of this new world, but authority is mostly now ceded to a complex patchwork of private sovereign agencies, franchises, and mercenaries—some of whom received their training from and work for the now privatized CIA (after a merger with the Library of Congress).</p>\n<p>Mafia gangs have achieved the status of quasi-private governments, and rule a network of semiautonomous corporate neighborhoods (“burbclaves”). These regions are linked by privatized roads and protected by de facto mercenaries. Major intersections in Los Angeles now fall under the control of defense contractors and private security (following gunfire battles to determine who would win control of them).</p>\n<p>So the new private territories were not born without violence, and the old “Won’t warlords take over?” critique of privatization is always lurking behind the story. The protagonist, Hiro, is a delivery driver for Cosa Nostra Pizza, a gang run by Uncle Enzo. But the warlords are at least efficient: when Hiro is late with a delivery, he gets an ominous call from Don Enzo himself implying that the next time he fails the thirty-minute guarantee will be the last time.</p>\n<p>Only in the metaverse (a term credited to Stephenson) does Hiro have more status, as a successful denizen of the upper echelons of society unavailable to him in the meat space of his real life delivering pizzas. But even here he is no happier; in the virtual world, every last space is commercialized, monetized, and motivated only by rank status or money. It is a caricature of anarcho-capitalism which ignores the full spectrum of human experience beyond commerce. Stephenson’s metaverse is a hellscape, every human interaction is mercenary and transactional and ugly. This is clearly not the way to sell private governance!</p>\n<h4><strong>II. Rothbard’s Vision</strong></h4>\n<p>What if the parallel communities we seek to build already exist in some form and our task is to identify and coalesce around those existing “nations within nations”? Surely this would be a leap forward.</p>\n<p>Natural communities exist everywhere; they may not be libertarian in outlook, but neither are many private entities which don’t aggress against anyone. The idea is not only to start up such communities, but also to recognize them. Religious groups like the Amish and the Mennonites in America; ethnic, cultural, and linguistic identifications like the Catalans in Spain or the Welsh in the United Kingdom; corporations; fraternal associations—even country clubs and gated housing developments—all form natural communities which may well increasingly seek to unyoke from their centralized and failing political rulers. They may be socialist or capitalist, right wing or woke, provincial or cosmopolitan, provided they have no desire or incentive to aggress against other private communities.</p>\n<p>To sell parallel structures, we should identify them in nascent form here and now.</p>\n<p>Murray Rothbard’s article “<a href=\"https://mises.org/library/nations-consent\">Nations by Consent</a>,” written just before he died, in 1994, is an excellent guidepost here:</p>\n<p align=\"left\">The “nation,” of course, is not the same thing as the state, a difference that earlier libertarians and classical liberals such as Ludwig von Mises and Albert Jay Nock understood full well. Contemporary libertarians often assume, mistakenly, that individuals are bound to each other only by the nexus of market exchange. They forget that everyone is necessarily born into a family, a language, and a culture.</p>\n<p align=\"left\">Every person is born into one or several overlapping communities, usually including an ethnic group, with specific values, cultures, religious beliefs, and traditions. He is generally born into a “country.” He is always born into a specific historical context of time and place, meaning neighborhood and land area.</p>\n<p>Rothbard provides several key takeaways which can benefit the marketing of private governance:</p>\n<ul><li>Nation is not state. Nation stands between individual and state.</li><li>Contractual consent and the right to exit distinguish truly private “nations” from a government or state.</li><li>A true “free private city” does not originate with conquest or decades/centuries of disputed titles, but rather with a fresh start, clear title, and a win-win market approach to services and membership (“citizenship”).</li><li>Total privatization “solves” nationality problems, <em>even while some land areas remain in the governmental sphere</em>.</li><li>Decentralization and localism “solve” problems of access for enclaves and landlocked areas.</li><li>Voting and citizenship are inferior to consent, contract, and ownership in a true private community.</li></ul>\n<p>Rothbard’s conception of a nation is very different than a “state,” although we have been led to believe the two are synonymous. By identifying existing nations—organic and not contrived, like so many national borders—we dramatically increase the market opportunities for selling private governance to dissatisfied constituencies.</p>\n<h4><strong>III. Common Law: No Vision Required!</strong></h4>\n<p>While we identify existing nations and intentional communities, we similarly can identify existing mechanisms for ordering, structuring, and enforcing contractual societies. We don’t necessarily need dramatic new constitutions or complex legal structures. Common law, evolved over centuries of hard human experience, provides a dependable model to navigate conflicts and provide governance guardrails in a private parallel structure. We don’t need a grand vision; we need the wisdom of the ages.</p>\n<p>Moreover, I think we should be very cautious about imagining what we can design. This is not only the lesson of Hayek, but also the lesson of countless entrepreneurs finding their way in the marketplace every day.</p>\n<p>Remember, law is about conflict. It is about resolving, hopefully minimizing, violence and property disputes in society—which is precisely why politics is self-defeating, even if you accept its premises. Private societies seek to promote human flourishing in win-win ways, versus the zero-sum political outcomes and deeply harmful state legal systems. But we should remember that a key measure of whether a society is just and flourishing is how it handles the inevitable conflicts and frictions that occur under any kind of system.</p>\n<p>But we need the market for this! In Adam Smith’s time—despite the de jure government monopoly on courts—a Scottish or English peasant had more choice of law than we do today! Parties could use local, manorial, county, ecclesiastical, merchant, chancery (equitable relief versus money damages), and common law venues. Why do we have fewer choices of law in the West today?</p>\n<p>In <em>For a New Liberty</em>, Rothbard points out how the history of a changing and evolving law can be enormously useful to find just rules: “Since we have a body of common law principles to draw on, however, the task of reason in correcting and amending the common law would be far easier than trying to construct a body of systematic legal principles de novo out of the thin air.”</p>\n<p>Bruno Leoni, the midcentury Italian philosopher and legal theorist, makes the best case for how to have law without legislation—and without legislatures—in his 1961 classic <em><a href=\"https://mises.org/library/freedom-and-law\">Freedom and the Law</a></em>.</p>\n<p align=\"left\">In Anglo-Saxon common law, “law” did not mean what we think today: endless enactments by a legislature or executive. “Law” was not enacted but found or discovered; it was a body of customary rules that had, like languages or fashions, grown up spontaneously and purely voluntarily among the people. These spontaneous rules constituted “the law”; and it was the work of experts in the law to determine what the law was and how the law would apply to the numerous cases in dispute that perpetually arise.</p>\n<p>A common law model of governance and dispute resolution solves so many of the thorny questions of how to order a private society:</p>\n<ul><li>Five-hundred-plus years of real-world “models.”</li><li>Principles are easier than specifics.</li><li>Emphasis on discovery of law mirrors the entrepreneurial market process, akin to the Kirznerian entrepreneurial discovery process.</li><li>Choice of law is provided by the market.</li><li>Adjudication of disputes by contract, known to both parties prior, reduces those disputes.</li><li>Judge-made law reflects the most hyperlocal culture, lifestyle, geography, and economy—and therefore fashions the most just results.</li><li>Judge-made law is more temporal, individualized, flexible, and proportional.</li></ul>\n<p>In closing, let me recommend three additional texts to get us thinking in the right direction. First, Titus Gebel’s <a href=\"https://mises.org/wire/private-cities-model-truly-free-society\"><em>Free Private Cities</em></a> is quite literally the handbook for this burgeoning movement. Edward Stringham’s <a href=\"https://store.mises.org/Private-Governance-Creating-Order-in-Economic-and-Social-Life-P11006.aspx\"><em>Private Governance</em></a> is the single best book I’ve seen on the history and technical aspects of creating economic and social order through private mechanisms. Finally, Prince Hans-Adam II of Liechtenstein’s wonderful <a href=\"https://www.amazon.com/gp/product/3905881047/ref=dbs_a_def_rwt_hsch_vapi_taft_p1_i0\"><em>The State in the Third Millennium</em></a> provides an excellent and erudite argument for transforming states into private service providers as the next stage in human development.</p>\n<p>A new and better world is possible through the understanding of private governance, nations within nations, and common law mechanisms for dealing with human conflict. How we market and sell this world is worth understanding, just as any entrepreneurial venture needs both a vision and the hard details.</p>\n<p>Thank you.</p>\n\n",
  "author": "Jeff Deist",
  "enclosure": "",
  "guid": 60821,
  "pubDate": "Fri, 28 Oct 2022 16:00:00 -0500",
  "source": "Mises Wire"
}