{
  "title": "Credit Assignment in Deep Learning",
  "link": "https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/",
  "comments": "https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/#comments",
  "dc:creator": "Tim Dettmers",
  "pubDate": "Sat, 16 Sep 2017 17:17:00 +0000",
  "category": [
    "Academia",
    "Science",
    "PhD"
  ],
  "guid": "http://timdettmers.com/?p=596",
  "description": "<p>This morning I got an email about my blog post discussing the history of deep learning which rattled me back into a time of my academic career which I rather not think about. It was a low point which nearly ended my Master studies at the University of Lugano, and it made me feel so [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/\">Credit Assignment in Deep Learning</a> appeared first on <a rel=\"nofollow\" href=\"https://timdettmers.com\">Tim Dettmers</a>.</p>\n",
  "content:encoded": "<p>This morning I got an email about my blog post discussing the <a href=\"https://developer.nvidia.com/blog/deep-learning-nutshell-history-training/\">history of deep learning </a>which rattled me back into a time of my academic career which I rather not think about. It was a low point which nearly ended my Master studies at the University of Lugano, and it made me feel so bad about blogging that I took two long years to recover. So what has happened?</p>\n<p><span id=\"more-596\"></span></p>\n<p>When I started my masters, I worked on blog posts for NVIDIA which featured introductions into deep learning. Part of this blog post series also discusses the history of deep learning. I hence discussed what I thought to be the historical milestones with the largest impact but in doing so, I inadvertently assigned credit to researchers that I thought had a good impact on the field. I worked on this blog post and circulated it in my deep learning class&#8217;s forums to the dismay of my then advisor who holds the opposite view of mine.</p>\n<p>To evaluate the credit that a research idea deserves, I believe that it is not only important who has the first idea, but I also believe that it is equally important to actually make it work (the implementation). My ex-advisor believed that it only really matters who was the first who published the idea.</p>\n<p>My advisor scolded me in class for my views since he felt very strongly that the first idea counts and that my view is plain wrong. To redeem myself and to salvage the relationship with him, I felt coerced to change my blog post to his wishes.</p>\n<p>This quasi-censorship of my blog post eviscerated me, and in consequence, I lost all desire to blog for two years. Despite my efforts, the relationship with my then advisor deteriorated further, and I had to look for a new advisor.</p>\n<p>Looking back at the blog post that I produced, I feel ashamed. It does not express my personal views. I value integrity, and my behavior did not reflect who I want to be.</p>\n<p>I write this blog post to discuss my true beliefs about credit assignment and why I believe that the idea, its communication and its implementation are all equally important.</p>\n<h1>Who Deserves Credit for Deep Learning Ideas?</h1>\n<p>There has been a lot of discussion about how to assign credit to researchers, or in other words, how to determine whose work had a large impact. Note that I do not discuss here who deserves credit for discovering an idea, I look at who deserves credit for the impact that an idea has. Looking at this, there are two main camps: The first believes that ideas and implementation count equally, and, the second believes that it counts who had the ideas first.</p>\n<p>The problem with this discussion is that it is not a scientific topic, but a philosophical one. How do we determine what has how much value? We use the scientific method. What is the scientific method in philosophy? Use reductions to arrive at simple statements, then use logic to derive other factual statements, failing that — like in this case — we make thought experiments where we isolate variables which we then take to extremes. Let&#8217;s do this now to get insight into the issue.</p>\n<h2>All Ideas, No Communication, No Implementation</h2>\n<p>Let&#8217;s imagine there exists a person that has come up with all ideas in deep learning of the past and all ideas in deep learning of the future. However, this person cannot communicate&nbsp;with either words or writing. This person also cannot write code. How much credit deserves such a person?</p>\n<p>I would argue that such a person deserves zero credit. In fact, I think it is epistemologically correct that this person deserves no credit because nobody can know that he or she deserves credit.</p>\n<h2>All Ideas, 1 Communication + No Ideas, Full Communication</h2>\n<p>We have a Person 1 that invented everything in deep learning. Now this person can communicate, but he or she is so unclear that only a single Person 2 can understand these ideas.</p>\n<p>Now, Person 2 has no creativity but is a perfect communicator. Person 2 basically just translates what Person 1 said and the entire world understands. Who deserves credit here?</p>\n<p>It is tempting to think that Person 2 deserves all the credit because Person 1 is useless without Person 2. But similarly, Person 2 is useless without Person 1.</p>\n<p>Both people thus deserve equal credit — no one can achieve anything without the other.</p>\n<h2>All Ideas, Full Communication, 1 Implementation</h2>\n<p>Let&#8217;s increase the complexity of the problem. Let us say the duo of Person 1 and Person 2 spread the ideas so that the entire world understands deep learning, but let us assume that all people are implementation agnostic. Nobody can make deep learning work. The world knows about all deep learning ideas but cannot solve any problem with it. In such a world, the ideas of deep learning are quickly abandoned by the large majority due to their uselessness (just like the majority of the population does not care much about pure mathematics, e.g., few care if&nbsp;<span class=\"texhtml\">a<sup>n</sup> + b<sup>n</sup> = c<sup>n</sup></span>&nbsp;is true for all integer n >2).</p>\n<p>Enter Person 3. Person 3 has no creativity, cannot communicate, but he or she can implement all the deep learning ideas in a practical manner. The world looks at this person&#8217;s code and suddenly is able to solve all problems which are solvable with deep learning.</p>\n<p>Who deserves the most credit: Person 1, Person 2, or Person 3?</p>\n<p>As discussed before, Person 1 and Person 2 deserve equal credit, and also here, I would argue, that Person 3 deserves equal credit.</p>\n<p>This becomes apparent when we think about the value of ideas. Ideas are useful when they have an affect. If they have no or only a small effect they just deserve no recognition or little recognition. If deep learning ideas have no practical value then they would not deserve more recognition than, say, the idea that there might be something beyond the observable universe — it is a nice idea, but it will never produce anything of much value.</p>\n<h1>Comparative Individual Value For Collective Contributions</h1>\n<p>The evaluation changes if we distribute the contributions of ideas, communication, and implementation among many individuals. If we can take the three scenarios above, expand Person 1-3 into groups of people and subject them to comparative evaluation, that is, how much value the contributions of each individual has compared to all the other people have we arrive at the following thought experiment.</p>\n<h2>1 Ideas, 1000 Communication, 1000 Implementation</h2>\n<p>We have 1 person who has all the ideas, 1000 people who can understand these ideas and communicate them to the world, and 1000 people who can implement them to yield practical value, then how do we assign credit?</p>\n<p>As discussed it is reasonable that each of the areas, (1) ideas, (2) communication, (3) implementation deserve equal credit. If now the groups of 1000 people made contributions (communications and implementations) of equal value, it would be fair to say that:</p>\n<ul>\n<li>1 Ideas: 1/3 credit</li>\n<li>1000 Communication: 1/3000 credit each</li>\n<li>1000 Implementation: 1/3000 credit each.</li>\n</ul>\n<p>We see in this case the one person with the idea should receive the largest amount of credit.</p>\n<p>Similarly, if we weight the numbers differently, and if we assume contributions of individuals in groups are equal, then this credit assignment holds for all other combinations like (1000, 1, 1000), or (10000, 1000, 1).</p>\n<h1>Timing and Relational Effects</h1>\n<p>In the real world, we have timing effects and relational effects. Not all 1000 Ideas, Communication, or Implementation people will publish their work at the same time, but they will have a specific sequence. In this sequence, they will influence and build on each other — they stand on the shoulders of giants. Who are the giants? Who deserves what amount of credit?</p>\n<p>If we think about it, it is not much different than our first analysis. Lets take Person 1 that only has ideas and can communicate his or her ideas to only one other Person 2; Person 2, standing on Person 1&#8217;s shoulders, is only able to communicate the ideas to another person Person 3; Person 3, standing on Person 2&#8217;s shoulders, in turn, can communicate the ideas clearly to the entire world.</p>\n<p>If we express the ability of people as numbers which represent the fraction of all value ideas, communication, and implementation we could weight Person 1, Person 2, and Person 3 in this way:</p>\n<ul>\n<li>Person1: [1, 1/10^10, 0]</li>\n<li>Person2: [0, 1/10^10, 0]</li>\n<li>Person3: [0, 1, 0]</li>\n</ul>\n<p>Which means that Person 1, has all the ideas (1), could communicate these ideas to 1 person (we assume a total population of 10 billion people to make the math easier). Person 2 has no ideas, could understand Person 1&#8217;s idea but could only communicate this idea to one other person, Person 3. Person 3 has no ideas, understands the idea of Person 2 and can communicate it so that everybody understands. Note that this example is simplified so that all people are implementation agnostic.</p>\n<p>From these fractions, we see that Person 2 has almost no fraction of contributions since Person 2 is not creative and also not a good communicator. However, if we look at the relational effects we know Person 3 would have no value without Person 2, and Person 1 would also have no value without Person 2. So how do we solve this credit assignment problem?</p>\n<p>We can try to solve this problem by expressing it as a weighted graph which expressed relationships over time and the relationships of the fractions with respect to the world.</p>\n<p><figure id=\"attachment_602\" aria-describedby=\"caption-attachment-602\" style=\"width: 534px\" class=\"wp-caption aligncenter\"><a href=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png\"><img data-attachment-id=\"602\" data-permalink=\"https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/relational_example-4/\" data-orig-file=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?fit=534%2C449&ssl=1\" data-orig-size=\"534,449\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"relational_example\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?fit=300%2C252&ssl=1\" data-large-file=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?fit=534%2C449&ssl=1\" class=\"wp-image-602 size-full\" src=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?resize=534%2C449\" alt=\"\" width=\"534\" height=\"449\" srcset=\"https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?w=534&ssl=1 534w, https://i0.wp.com/timdettmers.com/wp-content/uploads/2017/09/relational_example-3.png?resize=300%2C252&ssl=1 300w\" sizes=\"(max-width: 534px) 100vw, 534px\" data-recalc-dims=\"1\" /></a><figcaption id=\"caption-attachment-602\" class=\"wp-caption-text\">Graphical representation of this particular credit assignment problem: The world has 10^10 people (self-weight: 1). Person 1 (P1) has all the ideas that exist in the world (1) and can communicate to one other person in the world (1/10^10), that is P2 (1); P2 can communicate the ideas to one person in the world (1/10^10), which is P3 (1); P3 can communicate the idea to the entire world in an understandable way (1). Connections between P1-P2, and P2-P3 are bidirectional, meaning that it is important (a) to understand and (b) to communicate ideas.</figcaption></figure></p>\n<p>How we weight the contribution of each&nbsp;person in this case? There are many answers to this, but here PageRank would be a good fit. PageRank works exactly as we discussed above, the credit is assigned&nbsp;comparatively, that is if we have a (1, 1000, 1000) distribution, the largest chunk of PageRank will be distributed by the single person. Thus it reflects our evaluation system. PageRank also takes into account the relationships between nodes and their recursive weight (standing on the shoulders of giants).</p>\n<p>Using the scenario above, we find the contributions as follows:</p>\n<p>\n<table id=\"tablepress-2\" class=\"tablepress tablepress-id-2\">\n<thead>\n<tr class=\"row-1 odd\">\n\t<th class=\"column-1\">Name</th><th class=\"column-2\">PageRank</th><th class=\"column-3\">Relative Contribution</th>\n</tr>\n</thead>\n<tbody class=\"row-hover\">\n<tr class=\"row-2 even\">\n\t<td class=\"column-1\">P2</td><td class=\"column-2\">0.3450</td><td class=\"column-3\">0.4319</td>\n</tr>\n<tr class=\"row-3 odd\">\n\t<td class=\"column-1\">P1</td><td class=\"column-2\">0.2697</td><td class=\"column-3\">0.3376</td>\n</tr>\n<tr class=\"row-4 even\">\n\t<td class=\"column-1\">P3</td><td class=\"column-2\">0.1841</td><td class=\"column-3\">0.2305</td>\n</tr>\n</tbody>\n</table>\n<!-- #tablepress-2 from cache --></p>\n<p>We see that P2 has the largest contribution despite being only the bridge between P1 and P3 who have the largest fractions (all the ideas and full communication abilities). However, P1&#8217;s success depends on P2, and P3&#8217;s success depends on P2 and as such P2 is the most critical link in the entire system.</p>\n<p>This is quite insightful. If you understand some obscure research and communicate this to just a few&nbsp;researchers who, in turn, influence many other researchers then you will have made a substantial contribution to the deep learning community.</p>\n<p>It would not feel this way because you will probably not experience any fame or recognition here. The recognition will come for P1 (having ideas) and P3 (communicating ideas). But still, the numbers do not lie here.</p>\n<p>This experiment was quite interesting, and if you want to experiment&nbsp;a bit by yourself, you can&nbsp;<a href=\"https://github.com/TimDettmers/CreditAssignment\">download the code</a> to see what happens if you add more people and more relationships among these people. This exercise can give quite some insight into what is valuable for research.</p>\n<h1>Response to Criticism on Reddit</h1>\n<p>There has been some <a href=\"https://www.reddit.com/r/MachineLearning/comments/70j88n/d_credit_assignment_in_deep_learning_tim_dettmers/\">sharp criticism on Reddit</a> concerning ideas expressed in this blog post. The user metacurse makes the point that in science we credit usually those researchers who had the idea first and that communication and implementation are not valued. For example we value Albert Einstein more highly for the discovery of general relativity and the photoelectric effect and not its communication by Neil deGrasse Tyson; similarly, Cocks is credited for RSA even though he never implemented it in any way that was widely used (and he could not produce public implementations due to the classified status of RSA). However, this entire argument is rather weak and unfair:</p>\n<ul>\n<li>I do not discuss who should be credited for an idea or the usage of the idea, I discuss who should be credited for the overall <em>impact</em> of an idea. These are very different questions.</li>\n<li>He uses examples to try to prove his own hypothesis when we know that <a href=\"https://en.wikipedia.org/wiki/Problem_of_induction\">examples cannot prove anything</a>&nbsp;(he uses classical philosophic techniques, which has some value, but it does not generate any reliable knowledge like analytical philosophy does). He mocks me for not using examples myself.</li>\n<li>He appeals to the emotion of the readers, by saying that my views endorse unethical ideas like &#8220;stealing olds ideas and rebranding them as your own&#8221; when it has nothing to do with my argument (reductio ad Hitlerum). He does this quite successfully swaying many emotional readers. I do not think this is helpful.</li>\n</ul>\n<p>To make a sharper contrast why metacurse&#8217;s argument is not relevant to mine take this thought experiment.</p>\n<p>We have a super genius who knows about all possible ideas and writes them down so that everybody can understand it easily. Then she locks these notes away in a locker and dies the next second. Over the next billions of years humanity rediscovers all ideas and uses them to build a flourishing society where all living things live in harmony and every being is fulfilled and so forth. One second before the last human dies in heat death, that human discovers the notebook.</p>\n<p>Metacurse&#8217;s argument would look for the answer to the question: Should our super genius be credited for inventing everything? Metacurse would argue, yes, and I would totally agree.</p>\n<p>What I discuss in this blog post: How much impact did our super genius have on the overall impact of all ideas? Very little, she never had any direct or even indirect effect with any of the ideas; the only impact she had was that one other person understood that she had the ideas before others had them. That is the total impact of her ideas. Her impact is almost zero.</p>\n<h1>Conclusion</h1>\n<p>Here I discussed how it is best to think about contributions in deep learning. From thought experiments, we could see that ideas, their communication, and their implementation are equally important contributions.</p>\n<p>We also discussed how timing effects and dependencies could be modeled in a relational graph. We found that people that link ideas to communicators can make substantial contributions to the research community even if they themselves are not creative or good communicators. Creating the links between influential ideas and influential communicators (or people that implement) are important here.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/\">Credit Assignment in Deep Learning</a> appeared first on <a rel=\"nofollow\" href=\"https://timdettmers.com\">Tim Dettmers</a>.</p>\n",
  "wfw:commentRss": "https://timdettmers.com/2017/09/16/credit-assignment-deep-learning/feed/",
  "slash:comments": 15,
  "post-id": 596
}