{
  "id": "yt:video:GT7M6eQRIdQ",
  "yt:videoId": "GT7M6eQRIdQ",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "OSHA and Climate Change (Heat Illness, Wildfire Smoke, and Super Storms)",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-07-13T16:21:13+00:00",
  "updated": "2022-10-15T17:36:57+00:00",
  "media:group": {
    "media:title": "OSHA and Climate Change (Heat Illness, Wildfire Smoke, and Super Storms)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Recent studies show that workers are often the first to experience the effects of climate change and may be affected for longer durations and at greater intensities. NIOSH cites a 2014 study indicating that workers are “the canaries in the coal mine of climate change impacts.” Accordingly, OSHA has embarked on one of the broadest, most significant rulemakings it has undertaken in over a decade – to develop a comprehensive occupational standard to regulate heat illness associated with exposure to heat on the job – in outdoors as well as indoor settings.\n\nA heat standard will impact scores of employers in every region of the country and may include requirements to provide conditioned air or increased building ventilation, shade tents, regular paid cool down rest periods, rigorous acclimatization periods, biological monitoring to ensure employees are not dehydrated or showing signs of heat stress, and even turn employers into the water police. The standard has become a top priority for the Biden Administration as part of their interagency effort to address climate change and the impact it is having on US worker populations, especially since most elements of the Administration’s climate agenda died with the unsuccessful Build Back Better legislation.\n\nThis webinar discussed OSHA’s heat illness rulemaking – its status, scope and what it may require – as well as the other significant steps OSHA is taking to address heat illness, including the emergent National Emphasis Program (NEP) on heat illness. The program also delved into other impacts of climate change on OSHA’s regulatory scheme, such as expectations around major storm preparation and response, as well as exposure to wildfire smoke.\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}