{
  "id": "tag:blogger.com,1999:blog-2471378914199150966.post-414160194989056561",
  "published": "2022-05-26T13:54:00.002-07:00",
  "updated": "2022-06-06T05:54:04.819-07:00",
  "category": "",
  "title": "Chrome 103 Beta: Early Navigation Hints, a Host of Completed Origin Trials, and More",
  "content": "<p>Unless otherwise noted, changes described below apply to the newest Chrome beta channel release for Android, Chrome OS, Linux, macOS, and Windows. Learn more about the features listed here through the provided links or from the list on <a href=\"https://www.chromestatus.com/features#milestone%3D76\">ChromeStatus.com</a>. Chrome 103 is beta as of May 26, 2022. You can <a href=\"https://www.blogger.com/blog/post/edit/2471378914199150966/133027011330334491#\">download the latest on Google.com</a> for desktop or on Google Play Store on Android. </p> <h1>Early Hints for Navigation</h1><p>Chrome now supports the <a href=\"https://www.chromestatus.com/feature/5207422375297024\">103 Early Hints HTTP response code</a> for navigation. (Note: the correspondence with the Chrome release number is a coincidence.) When a 103 response includes <code>&lt;link rel=preload&gt;</code> or other link headers Chromium tries to preload (and/or preconnect, prefetch) specified resources before the final response is received. This gives web developers a way to optimize <a href=\"https://web.dev/vitals/\">core web vitals</a> such as Largest Contentful Paint (LCP).</p><p>&nbsp; <br />HTTP/2 introduced the concept of server push, a mechanism that allows a server to preemptively send data to the client. Server push was intended to improve site performance. In the years since, developers have generally preferred preloading from the client side of a web interaction. 103 early hints for navigation provides a new way to do that.</p><p>&nbsp; <br />For information on the work that went into bringing this to the web, see <a href=\"https://www.fastly.com/blog/beyond-server-push-experimenting-with-the-103-early-hints-status-code\">Beyond Server Push: The 103 Early Hints Status Code</a>.</p> <h1>Origin Trials</h1><p>Origin trials allow you to try new features and give feedback on usability, practicality, and effectiveness to the web standards community. To register for any of the origin trials currently supported in Chrome, including the ones described below, visit the <a href=\"https://developers.chrome.com/origintrials/#/trials/active\">Chrome Origin Trials dashboard</a>. To learn more about origin trials in Chrome, visit the <a href=\"https://web.dev/origin-trials/\">Origin Trials Guide for Web Developers</a>. Microsoft Edge runs its own origin trials separate from Chrome. To learn more, see the <a href=\"https://developer.microsoft.com/en-us/microsoft-edge/origin-trials/\">Microsoft Edge Origin Trials Developer Console</a>. </p> <h2>New Origin Trials</h2> <h3>Federated Credentials Management</h3><p>The <a href=\"https://developer.chrome.com/origintrials/#/view_trial/3977804370874990593\">Federated Credential Management API</a> allows users to log in to websites with their federated accounts in a privacy preserving manner. It allows the browser to understand the context in which the relying party and identity provider exchange information, inform the user about the information and privilege levels being shared and prevent unintended abuse. For more information, see&nbsp;<a href=\"https://developer.chrome.com/blog/fedcm-origin-trial/\">Participate in a Federated Credential Management API origin trial for IdPs</a>.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXPmNTmWrIaYRXVpNr8JMnNog4WtnO8wJ6knn6Y6yUg_LnReqaHpjfenuEcNIGU87dOUVQ8B2EH41HILAoxeyuv7yRPpiAh_G4qpWT8y_BYQMaV7sPennLrOngG1lPU3MEaAys6nDSbyGRP2KiMgD2p6ImL6bPouce8ShtKxlk6fbj_PclCHG48pQhyw/s512/%5Bdraft%5Dchrome1--ukeg0xhn0m.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"225\" data-original-width=\"512\" height=\"282\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgXPmNTmWrIaYRXVpNr8JMnNog4WtnO8wJ6knn6Y6yUg_LnReqaHpjfenuEcNIGU87dOUVQ8B2EH41HILAoxeyuv7yRPpiAh_G4qpWT8y_BYQMaV7sPennLrOngG1lPU3MEaAys6nDSbyGRP2KiMgD2p6ImL6bPouce8ShtKxlk6fbj_PclCHG48pQhyw/w640-h282/%5Bdraft%5Dchrome1--ukeg0xhn0m.png\" width=\"640\" /></a></div><br />   <h2>Completed Origin Trials</h2><p>The following features, previously in a Chrome origin trial, are now enabled by default.</p> <h3>Local Font Access</h3><p>Web applications can now <a href=\"https://web.dev/local-fonts/\">enumerate local fonts and metadata about each</a>. The new API also gives web applications access to table data stored within local fonts, allowing those fonts to be rendered within their applications using custom text stacks.</p> <p><strong>Note: </strong>The Chrome 102 beta post erroneously listed this feature as shipping in that version.</p> <h3>Same-Origin Prerendering Triggered by the Speculation Rules API</h3><p>Prerendering <a href=\"https://www.chromestatus.com/feature/5355965538893824\">loads a web page before it is needed</a>, so that when the actual navigation to that page occurs, it can be shown instantly. To speed up page loads. Chrome's previous prerender mechanism is now replaced with <a href=\"https://developer.chrome.com/blog/nostate-prefetch/\">No State Prefetch</a>. No State Prefetch doesn't generally result in an instant page load experience, but the new feature does. This feature is supported on Android only.</p> <h3>Update User-Agent Client Hints GREASE Implementation</h3><p>The implementation of <code>GREASE</code> in User Agent Client Hints <a href=\"https://www.chromestatus.com/feature/5630916006248448\">is now aligned with the current spec</a>, which includes additional <code>GREASE</code> characters beyond the current semicolon and space, and which recommends varying the arbitrary version. This helps prevent bad assumptions from being built on top of User-Agent strings.</p> <h1>Other Features in this Release</h1> <h2>AbortSignal.timeout() Static Method</h2><p>Returns <a href=\"https://www.chromestatus.com/feature/5768400507764736\">a new AbortSignal object</a> that is automatically aborted after a given number of milliseconds. Use this method to easily implement timeouts for signal-accepting asynchronous APIs, such as <code>fetch()</code>. For example:<br /><br /><code>fetch(url, { signal: AbortSignal.timeout(10_000) });</code></p> <h2>ARIA Attribute Reflection for the role Attribute</h2><p>The <code>Element</code> and <code>ElementInternal</code> interfaces <a href=\"https://www.chromestatus.com/feature/5188935855636480\">now include an <code>ARIA</code> property</a> called ariaRoleDescription which returns or modifies the ARIA role attribute directly. This feature is only supported on desktop.</p> <h2>avif is Now a Permitted Web Share File Extension</h2><p>The avif image file format is <a href=\"https://www.chromestatus.com/feature/5116829864296448\">now sharable by Web Share</a>. Adding avif to the other allowed image file types helps spread the use of it. A website might like their users to be able to share pictures and other files through social media, email, chat, etc. The Web Share API is already shipped to more platforms such as ChromeOS and Windows, but avif is not supported yet.</p> <h2>\"deflate-raw\" Compression Format</h2><p>Chrome supports a new compression format, <code><a href=\"https://www.chromestatus.com/feature/5172771293233152\">deflate-raw</a></code>, to give web developers access to the raw deflate stream without any headers or footers. This is needed, for example, to read and write zip files.</p> <h2>form rel Attribute</h2><p><a href=\"https://www.chromestatus.com/feature/5139812343349248\">The <code>'rel'</code> attribute has been added to form elements</a>. This makes it possible to prevent <code>window.opener</code> from being present on websites navigated to by form elements which have <code>rel=noopener</code>. It also prevents the <code>referer</code> header from being sent with <code>rel=noreferrer</code>.</p> <h2>popstate Fires Before Load</h2><p>Chromium now matches Firefox and by <a href=\"https://www.chromestatus.com/feature/5080172872073216\">firing <code>popstate</code> immediately after URL changes</a> so that the order of events is now <code>popstate</code> then <code>hashchange</code> across both platforms. Before this change, Chromium fired <code>hashchange</code> asynchronously after a task, and delayed <code>popstate</code> until the load event. This means the event order could be either <code>hashchange</code> then <code>popstate</code>, or <code>popstate</code> then <code>hashchange</code>, depending on how long a document took to load. </p> <h2>Restrict Gamepad Usage</h2><p>The Gampepad API now <a href=\"https://chromestatus.com/feature/5138714634223616\">requires a secure context</a>. Additionally a new feature policy called <code>'gamepad'</code> has been added with a default allowlist of <code>'self'</code>.</p> <h2>SerialPort forget()</h2><p>The <a href=\"https://web.dev/serial/#revoke-access\"><code>SerialPort forget()</code> method</a> allows web developers to voluntarily revoke a permission to a serial port that was granted by a user. Some sites may not be interested in retaining long-term permissions to access serial ports. For example, for an educational web application used on a shared computer with many devices, a large number of accumulated user-generated permissions creates a poor user experience.<br /><br />In addition to user agent mitigations to avoid this problem, such as defaulting to a session scoped permission on the first request or expiring infrequently used permissions, it should be possible for the site itself to clean up user-generated permissions it no longer needs.</p> <p>This follows the recent additions of a <code>forget()</code> method for the <code>HIDDevice</code> and <code>USBDevice</code> interfaces.</p> <h2>Support visual-box on overflow-clip-margin</h2><p>The <code>overflow-clip-margin</code> CSS property <a href=\"https://www.chromestatus.com/feature/5082351989161984\">now supports <code>visual-box</code></a>, which specifies the box edge to use as the overflow clip edge origin. Valid values are <code>content-box</code>, <code>padding-box</code> (the default), or <code>border-box</code>. The <code>overflow-clip-margin</code> property specifies how far an element's content is allowed to paint before being clipped.  </p> <h2>User Activation Required for SPC Credential Enrollment</h2><p>A <a href=\"https://www.chromestatus.com/feature/5104475634139136\">user activation requirement</a> has been added for Secure Payment Confirmation credential enrollment in a cross-origin iframe. This is being done to help mitigate <a href=\"https://github.com/w3c/secure-payme\">a privacy issue</a>.</p> <h1>Deprecations, and Removals</h1><p>This version of Chrome introduces the deprecations and removals listed below. Visit ChromeStatus.com for lists of <a href=\"https://www.chromestatus.com/features#browsers.chrome.status%3A%22Deprecated%22\">current deprecations</a>  and <a href=\"https://www.chromestatus.com/features#browsers.chrome.status:%22Removed%22\">previous removals</a>.</p> <h2>Block External Protocol in Sandboxed iframe</h2><p>Sandboxed iframes are not blocked from opening external applications. Currently, developers sandbox untrusted content and block user navigation. Blocking probably should have also included links to external apps or to the Play store. <a href=\"https://chromestatus.com/feature/5680742077038592\">This has now been fixed</a>. </p> <p>Sites that need navigation can add the following values to the <code>&lt;iframe&gt;</code> element's sandbox property:</p> <ul><li><code>allow-popups</code></li><li><code>allow-top-navigation</code></li><li><code>allow-top-navigation-with-user-activation</code></li></ul> <h2>Remove Battery Status API on Insecure Origins</h2><p>The Battery Status API is <a href=\"https://chromestatus.com/feature/4878376799043584\">no longer supported on insecure contexts</a>, specifically HTTP pages and HTTPS iframes embedded in HTTP pages. This is being removed in accordance with our policy of <a href=\"https://www.chromium.org/Home/chromium-security/deprecating-powerful-features-on-insecure-origins\">deprecating powerful features on insecure origins</a>, This also follows <a href=\"https://github.com/w3c/battery/issues/15\">a spec change</a>.</p> <h2>Remove &lt;param&gt; Element</h2><p>Given the removal of plugins from the web platform, and the relative lack of use of <code>&lt;param&gt;</code>, it is being <a href=\"https://chromestatus.com/feature/6283184588193792\">removed from the web platform</a>.</p><span class=\"post-author\">Posted by Joseph Medley</span>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Chromium Blog",
    "uri": "http://www.blogger.com/profile/06394244468194711527",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}