{
  "title": "#483: Fantasy Casting the Harry Potter TV Series, 'Hogwarts Legacy' Announced",
  "link": "https://audioboom.com/posts/7687774",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4548,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Andrew's prophecy comes true... almost!</li>\n<li>\n<a href=\"https://www.hypable.com/harry-potter-rpg-hogwarts-legacy-announced-for-playstation-5/\">Hogwarts Legacy</a> is coming to a video game console near you in 2021!</li>\n<li>What are our initial reactions to the trailer for this open-world video game?</li>\n<li>We offer some suggestions on what fans can do who are hesitant about purchasing this game.</li>\n<li>Muggle Mail covers The Pizza Wizard, The Lost Day, Neville, Sirius, a Harry Potter television station and more!</li>\n<li>Main Discussion: Fantasy Casting The Harry Potter Television Series</li>\n<li>Peeves, Professor Binns, Ludo Bagman, Augusta Longbottom and The Gaunts: we cast the characters from the books that never made it on screen!</li>\n<li>Who would play the Founders? Would James Cosmo or Paul Giamatti make a better Gryffindor? Would you cast Viola Davis or Indira Varma for Ravenclaw? John Malkovich as Slytherin? Rebel Wilson as Hufflepuff?</li>\n<li>In recasting the trio of Harry, Ron and Hermione, can the Potter series catch lightning in a bottle twice?</li>\n<li>Who did the hosts recast in the roles of Dumbledore, Snape, McGonagall and Voldemort?</li>\n<li>How would Patton Oswalt fair as Rubeus Hagrid? Tom Ellis as Sirius Black?</li>\n<li>For Quizzitch: Which famous British actor put in two weeks notice and quit a role they had been cast in for<em> Harry Potter and the Chamber of Secrets</em>?</li>\n<li>You can join our community at <a href=\"http://www.patreon.com/mugglecast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!!</li>\n<li>This week's episode is brought to you by BetterHelp (Get 10% off your first month by visiting <a href=\"http://BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a>)</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 22 Sep 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-09-21:/posts/7687774",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}