{
  "title": "Video service suspends access in France over censorship demand",
  "link": "https://www.rt.com/news/565785-rumble-france-censorship-demand/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565785-rumble-france-censorship-demand/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362392420302760ed24f0b7.jpg\" /> Rumble says it blocked all users in France from using the platform after the government demanded it censor Russian news sources <br/><a href=\"https://www.rt.com/news/565785-rumble-france-censorship-demand/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Government wanted Rumble to remove Russian news sources, which it refused to do, the platform has said</strong></p>\n            \n                        \n            <p>Rumble, a Toronto-based video hosting service similar to YouTube, which touts itself as pro-freedom of speech, has announced that users in France will no longer be able to access the site. The suspension came after a demand by Paris to remove some Russian news sources, the company added.&nbsp;&nbsp;</p>\n<p>The video hosting service said it was committed to not moving the <em>&ldquo;goalposts&rdquo;</em> on its policy of platforming users with <em>&ldquo;unpopular views.&rdquo;</em> It has challenged the legality of the French order, but for now, access in France will be disabled, the statement on Tuesday said.</p>\n<p>Rumble added that the decision will not impact the company materially, since less than 1% of its user base was viewing videos from France. It expressed hope that Paris will reconsider its demand and allow Rumble to operate in the country again.</p>\n<p>CEO Chris Pavlovski shared the news on Twitter &ndash; in a reply to a tweet by Elon Musk in which he reported that he resisted pressure by some governments to ban Russian news sources on his Starlink satellite broadband service. In the post from March, Musk declared himself a <em>&ldquo;free speech absolutist&rdquo;</em> and promised not to yield <em>&ldquo;unless at gunpoint.&rdquo;</em> The billionaire purchased Twitter last month and pledged to overhaul its controversial content moderation policies.</p>\n\n            <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">The French Government has demanded that Rumble (<a href=\"https://twitter.com/rumblevideo?ref_src=twsrc%5Etfw\">@rumblevideo</a>) block Russian news sources. Like <a href=\"https://twitter.com/elonmusk?ref_src=twsrc%5Etfw\">@elonmusk</a>, I won't move our goal posts for any foreign government.<br><br>Rumble will turn off France entirely (France isn't material to us) and we will challenge the legality of this demand. <a href=\"https://t.co/a4Nn4S1MMf\">https://t.co/a4Nn4S1MMf</a></p>&mdash; Chris Pavlovski (@chrispavlovski) <a href=\"https://twitter.com/chrispavlovski/status/1587539647932108803?ref_src=twsrc%5Etfw\">November 1, 2022</a></blockquote> <script async src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n    \n\n<p>Journalist Glenn Greenwald contrasted Rumble&rsquo;s reaction to France&rsquo;s demands to the close cooperation between other American tech companies and the US government. <em>&ldquo;Thankfully, Rumble told France to f**k itself,&rdquo;</em> he <a href=\"https://twitter.com/ggreenwald/status/1587552154977378304\" target=\"_blank\" rel=\"noopener noreferrer\">said</a>.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/636009cb2030273e791f89e9.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565690-social-media-censorship-usa/\">US government worked with Big Tech to censor social media – Intercept</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p></p>\n<p>A report in The Intercept, a news outlet which Greenwald co-founded and later resigned from, revealed last week that US federal agencies and major US-based Big Tech firms have been working hand-in-glove to suppress what Washington deems to be <em>&ldquo;misinformation,&rdquo;</em> including the factually true Hunter Biden laptop story.&nbsp;</p>\n<p>Greenwald left The Intercept in October 2020 due to its refusal to print in full his analysis of Big Tech and media censorship of the laptop story. He has since partnered with Rumble and is in the process of launching a talk show on the platform, which he said <em>&ldquo;has no desire to be anything other than a content-neutral free speech platform.&rdquo;</em></p>\n<p>France, like other EU nations, banned Russian government-funded news outlets, including RT, after the launch of Moscow&rsquo;s military operation in Ukraine. Major platforms such as Facebook and Twitter are enforcing the ban by blocking people in the EU from accessing content from these sources.</p>\n<p>Musk declared last week after his acquisition of Twitter that <em>&ldquo;the bird is freed,&rdquo;</em> but the EU leadership seemed to pour cold water on the notion. <em>&ldquo;In Europe, the bird will fly by our rules,&rdquo;</em> Thierry Breton, the EU commissioner for the internal market, said.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 09:40:21 +0000",
  "dc:creator": "RT"
}