{
  "title": "If you did not already know",
  "link": "https://analytixon.com/2022/10/31/if-you-did-not-already-know-1873/",
  "comments": "https://analytixon.com/2022/10/31/if-you-did-not-already-know-1873/#respond",
  "dc:creator": "Michael Laux",
  "pubDate": "Mon, 31 Oct 2022 02:03:17 +0000",
  "category": "What is ...",
  "guid": "https://analytixon.com/?p=37439",
  "description": "Context-Dependent Diffusion Network (CDDN) Visual relationship detection can bridge the gap between computer vision and natural language for scene understanding &#8230;<p><a href=\"https://analytixon.com/2022/10/31/if-you-did-not-already-know-1873/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a></p>",
  "content:encoded": "<p><a href=\"http://arxiv.org/abs/1809.06213v1\" target=\"top\" rel=\"noopener\"><strong>Context-Dependent Diffusion Network (CDDN)</strong></a>  <a href=\"https://www.google.de/search?q=Context-Dependent Diffusion Network\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Visual relationship detection can bridge the gap between computer vision and natural language for scene understanding of images. Different from pure object recognition tasks, the relation triplets of subject-predicate-object lie on an extreme diversity space, such as \\textit{person-behind-person} and \\textit{car-behind-building}, while suffering from the problem of combinatorial explosion. In this paper, we propose a context-dependent diffusion network (CDDN) framework to deal with visual relationship detection. To capture the interactions of different object instances, two types of graphs, word semantic graph and visual scene graph, are constructed to encode global context interdependency. The semantic graph is built through language priors to model semantic correlations across objects, whilst the visual scene graph defines the connections of scene objects so as to utilize the surrounding scene information. For the graph-structured data, we design a diffusion network to adaptively aggregate information from contexts, which can effectively learn latent representations of visual relationships and well cater to visual relationship detection in view of its isomorphic invariance to graphs. Experiments on two widely-used datasets demonstrate that our proposed method is more effective and achieves the state-of-the-art performance. &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1712.02517v1\" target=\"top\" rel=\"noopener\"><strong>Broadcasting Convolutional Network</strong></a>  <a href=\"https://www.google.de/search?q=Broadcasting Convolutional Network\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">While convolutional neural networks (CNNs) are widely used for handling spatio-temporal scenes, there exist limitations in reasoning relations among spatial features caused by their inherent structures, which have been issued consistently in many studies. In this paper, we propose Broadcasting Convolutional Networks (BCN) that allow global receptive fields to share spatial information. BCNs are simple network modules that collect effective spatial features, embed location informations and broadcast them to the entire feature maps without much additional computational cost. This method gains great improvements in feature localization problems through efficiently extending the receptive fields, and can easily be implemented within any structure of CNNs. We further utilize BCN to propose Multi-Relational Networks (multiRN) that greatly improve existing Relation Networks (RNs). In pixel-based relation reasoning problems, multiRN with BCNs implanted extends the concept of `pairwise relations&#8217; from conventional RNs to `multiple relations&#8217; by relating each object with multiple objects at once and not in pairs. This yields in O(n) complexity for n number of objects, which is a vast computational gain from RNs that take O(n^2). Through experiments, BCNs are proven for their usability on relation reasoning problems, which is due from their efficient handlings of spatial information. &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1808.03908v1\" target=\"top\" rel=\"noopener\"><strong>Adversarial Personalized Ranking (APR)</strong></a>  <a href=\"https://www.google.de/search?q=Adversarial Personalized Ranking\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Item recommendation is a personalized ranking task. To this end, many recommender systems optimize models with pairwise ranking objectives, such as the Bayesian Personalized Ranking (BPR). Using matrix Factorization (MF) &#8212; the most widely used model in recommendation &#8212; as a demonstration, we show that optimizing it with BPR leads to a recommender model that is not robust. In particular, we find that the resultant model is highly vulnerable to adversarial perturbations on its model parameters, which implies the possibly large error in generalization. To enhance the robustness of a recommender model and thus improve its generalization performance, we propose a new optimization framework, namely Adversarial Personalized Ranking (APR). In short, our APR enhances the pairwise ranking method BPR by performing adversarial training. It can be interpreted as playing a minimax game, where the minimization of the BPR objective function meanwhile defends an adversary, which adds adversarial perturbations on model parameters to maximize the BPR objective function. To illustrate how it works, we implement APR on MF by adding adversarial perturbations on the embedding vectors of users and items. Extensive experiments on three public real-world datasets demonstrate the effectiveness of APR &#8212; by optimizing MF with APR, it outperforms BPR with a relative improvement of 11.2% on average and achieves state-of-the-art performance for item recommendation. Our implementation is available at: <a href=\"https://github.com/hexiangnan/adversarial_personalized_ranking.\" target=\"top\" rel=\"noopener\">https://&#8230;/adversarial_personalized_ranking.</a>  &#8230; </span><BR/><BR/><a href=\"http://arxiv.org/abs/1802.05383v1\" target=\"top\" rel=\"noopener\"><strong>DEEPBEAM</strong></a>  <a href=\"https://www.google.de/search?q=DEEPBEAM\" target=\"_blank\" rel=\"noopener\"><img decoding=\"async\" class=\"alignright\" src=\"https://analytixon.files.wordpress.com/2015/01/google.png?w=529\" alt=\"google\" data-recalc-dims=\"1\"/></a><BR/><span style=\"font-size:12px;font-style:normal;text-align:justify;\">Multi-channel speech enhancement with ad-hoc sensors has been a challenging task. Speech model guided beamforming algorithms are able to recover natural sounding speech, but the speech models tend to be oversimplified or the inference would otherwise be too complicated. On the other hand, deep learning based enhancement approaches are able to learn complicated speech distributions and perform efficient inference, but they are unable to deal with variable number of input channels. Also, deep learning approaches introduce a lot of errors, particularly in the presence of unseen noise types and settings. We have therefore proposed an enhancement framework called DEEPBEAM, which combines the two complementary classes of algorithms. DEEPBEAM introduces a beamforming filter to produce natural sounding speech, but the filter coefficients are determined with the help of a monaural speech enhancement neural network. Experiments on synthetic and real-world data show that DEEPBEAM is able to produce clean, dry and natural sounding speech, and is robust against unseen noise. &#8230; </span><BR/></p>\n",
  "wfw:commentRss": "https://analytixon.com/2022/10/31/if-you-did-not-already-know-1873/feed/",
  "slash:comments": 0,
  "post-id": 37439
}