{
  "title": "From Fixing Farm Equipment to Becoming a Director at 3M",
  "link": "https://spectrum.ieee.org/gus-gaynor-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-photo-of-an-older-smiling-man-in-glasses.jpg?id=29959300&width=1200&height=800&coordinates=0%2C114%2C0%2C324\"/><br/><br/><p><a href=\"https://www.linkedin.com/in/gus-gaynor-5652715\" rel=\"noopener noreferrer\" target=\"_blank\">Gerard “Gus” Gaynor</a> says he knew he would become an engineer when he was 7 years old, inspired by his father’s monthly <a href=\"https://www.popularmechanics.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Popular Mechanics</em></a> magazines. As his fascination with different engineering fields grew, he set out to explore them. He visited <a href=\"https://www.ford.com/\" rel=\"noopener noreferrer\" target=\"_blank\">a Ford</a> auto manufacturing plant in his home state of Michigan, watched the printing presses roll at the <a href=\"https://www.freep.com/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Detroit Free Press</em></a> plant, and listened on his crystal radio receiver to the broadcast of <a href=\"https://www.biography.com/historical-figure/charles-lindbergh\" rel=\"noopener noreferrer\" target=\"_blank\">Charles Lindbergh</a>’s transatlantic flight in 1927.</p><p>His enthusiasm for understanding how things work continued when, during the Great Depression, his family moved from his hometown of Detroit to a small farm in Livonia, Mich., about 32 kilometers away. He and his older brother repaired farm equipment and cars there, and they built their own chicken-plucking machine to automate the process.</p><hr/><p>“We couldn’t afford to pay [US] $350 to buy a machine at that time, so we had to build our own,” he says.</p><p>Gaynor’s hands-on experience and love of engineering led to a successful career with <a href=\"https://www.3m.com/\" rel=\"noopener noreferrer\" target=\"_blank\">3M</a> in St. Paul, Minn. The IEEE Life Fellow and <a href=\"https://cies.org/us-scholar-awards\" rel=\"noopener noreferrer\" target=\"_blank\">Fulbright</a> scholar held a variety of positions during his 25 years with the company, working his way up from instrumentation specialist to director.</p><p>Gaynor, who recently celebrated his 100th birthday, has been an active IEEE volunteer for more than three decades.</p><p>“I worked with Gus Gaynor in multiple capacities for over 30 years,” says IEEE Life Senior Member <a href=\"https://www.ieee.org/content/dam/ieee-org/ieee/web/org/voluntr/tab/hall-of-honor/tab-hall-of-honor-celia-desmond.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Celia Desmond</a>, a former president of the <a href=\"https://www.ieee-tems.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Technology and Engineering Management Society</a>. “He has been consistently active through this entire time, always offering his vast knowledge of management techniques, problems, and solutions. He has been active at the board level in all the iterations of what is now [the] Technology and Engineering Management [Society], guiding many volunteers over the years. He has also been active in Technical Activities, where his influence was felt by a much wider audience. His contributions have brought incredible value to IEEE.”</p><p><strong>THE TRAVELING ENGINEER</strong></p><p>Like many people who lived through the Great Depression, Gaynor faced economic challenges that made a college degree seem unattainable. But he was determined to be an engineer. During the day he installed telecommunication equipment for <a href=\"https://en.wikipedia.org/wiki/Michigan_Bell\" rel=\"noopener noreferrer\" target=\"_blank\">Michigan Bell</a>, a subsidiary of AT&T, and at night he attended the Lawrence Institute of Technology (now <a href=\"https://www.ltu.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">Lawrence Technological University</a>), in Southfield, outside of Detroit.</p><p>During that time, he joined the U.S. <a href=\"https://www.usar.army.mil/Portals/98/Documents/ARCD/DA%20PAM%20600-3s/SC%20DA%20PAM%20600-3.pdf?ver=2018-07-10-193039-390\" rel=\"noopener noreferrer\" target=\"_blank\">Army Signal Corps Reserve</a> and spent six months training in basic electronics. When World War II began, he was drafted to serve in Europe, where he was stationed for three years. After he was discharged, he continued his education at the <a href=\"https://umich.edu/\" rel=\"noopener noreferrer\" target=\"_blank\">University of Michigan</a> in Ann Arbor.</p><p>While pursuing his bachelor’s degree, he worked part time as a technician at a university research lab that had a contract with the U.S. government. He designed equipment that could measure the upper atmosphere’s temperature and pressure.</p><p>“I worked there for two years until I graduated” in 1950, he says. “I was guaranteed a job at the research lab, so I didn’t bother looking for a different one.” But just a few days before graduation, the lab’s contract with the government was terminated and Gaynor was laid off.</p><p class=\"pull-quote\">Gaynor says the best part about being an IEEE volunteer is the camaraderie.</p><p>He found work as a technician for telephone equipment supplier <a href=\"https://en.wikipedia.org/wiki/Automatic_Electric\" rel=\"noopener noreferrer\" target=\"_blank\">Automatic Electric</a>, in Chicago. The company required incoming employees to go through a training program that taught them to install its telephone switch. Gaynor already knew how to do that. When the company wouldn’t let him skip the training, he quit.</p><p>He soon found a job at <a href=\"http://www.johnsonfarebox.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Johnson Farebox</a>, which made coin-collection systems for streetcars and buses. He was put in charge of establishing an electronics lab at the company. Its first project was to develop a device—now known as an electromagnetic flow meter—that could measure fluid movement without any interruptions in the pipe. Gaynor’s group also developed equipment for testing a streetcar’s exhaust and battery levels.</p><p>Throughout the nearly 10 years Gaynor spent there, the company moved its offices twice. First it merged with the U.S. <a href=\"https://www.energy.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">Department of Energy</a>’s <a href=\"https://www.energy.gov/science/history\" rel=\"noopener noreferrer\" target=\"_blank\">Office of Science</a>, and Gaynor moved his family to Washington, D.C. Two years later the company relocated to Fort Wayne, Ind.</p><p>Gaynor says the work was satisfying, and he enjoyed giving presentations to technology companies and publishing research papers. But eventually, he felt his work was becoming stagnant. In 1959 he asked to be transferred to another division, in California. His supervisor refused the request, so Gaynor resigned.</p><p>He “tried his hand at being an entrepreneur,” he says, and founded a startup in Chicago. The company developed instrumentation and process control systems for Ford, <a href=\"https://www.hotpoint.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Hotpoint</a>, <a href=\"https://www.nasa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">NASA</a>, the U.S. <a href=\"https://www.airforce.com/mission/history/overview\" rel=\"noopener noreferrer\" target=\"_blank\">Air Force</a>, and several small companies. But after three years, Gaynor took a job as an instrumentation specialist with 3M, where he worked for 25 years.</p><p>He says “3M was a very progressive company. Engineers and scientists could spend 15 percent of their time working on whatever projects they wanted.”</p><p>In 1964 3M bought an Italian company, <a href=\"https://www.filmferrania.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Ferrania Photographic Operations</a>, which made several types of film as well as inexpensive cameras. Gaynor was promoted to chief engineer there and relocated his family to Italy, where they lived for seven years. He’s most proud, he says, of turning the company’s 50-year-old plant into a successful modern photographic facility that produced triacetate film, which is the base material for photographic emulsions.</p><p>“The technologies that [the] engineers were using were backward compared to what Kodak and Fuji were using,” Gaynor says, “so we redesigned the entire operation.” It was a big investment, he remembers: “We managed to get $20 million of initial funding from 3M, but in the three years it took to complete the redesign, the company put in well over $150 million.”</p><p>He eventually became director of engineering for 3M Europe and then director of worldwide engineering for its graphic technologies sector. The sector generated approximately 25 percent of 3M’s revenue, Gaynor says.</p><p>He also chaired task forces on performance improvement in research and engineering, future trends in technology, and project management processes.</p><p>After retiring in 1987, he did consulting work for 3M and became more active in IEEE.</p><p><strong>ENTHUSIASTIC VOLUNTEER </strong></p><p>Gaynor joined the <a href=\"https://ethw.org/IRE_History_1912-1963#History_of_the_Institute_of_Radio_Engineers_1912-1963\" rel=\"noopener noreferrer\" target=\"_blank\">Institute of Radio Engineers</a>, one of IEEE’s predecessor societies, as a student member in 1942. He wanted to get involved with the organization then, he says, but between going to night school and working full time, he couldn’t find the extra time to do so. </p><p>It wasn’t until he was asked to attend a meeting of the <a href=\"https://tc-ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Twin Cities (Minn.) Section</a> in 1962 that he became more involved. At the talk, he met <a href=\"https://ethw.org/Oral-History:Joel_Snyder\" rel=\"noopener noreferrer\" target=\"_blank\">Joel Snyder</a>, who was 2001 IEEE president and “built up a very personal relationship with him,” Gaynor says. Snyder introduced him to other IEEE leaders and inspired him to become a member of the <a href=\"https://www.ieee.org/about/volunteers/tab.html\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Technical Activities</a>’ finance committee, which jump-started his volunteerism.</p><p>During the past three decades, he has served on more than 10 IEEE boards and committees including the <a href=\"https://www.ieee.org/documents/opsmanual.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Publications Services and Products Board</a>, the <a href=\"https://www.ieee.org/education/eab.html\" rel=\"noopener noreferrer\" target=\"_blank\">Educational Activities Board</a>’s lifelong learning committee, and the <a href=\"https://www.ieee.org/about/corporate/initiatives/initiatives-committee.html\" rel=\"noopener noreferrer\" target=\"_blank\">New Initiatives Committee</a>.</p><p>He was the founding editor of <a href=\"https://ieeexplore.ieee.org/search/searchresult.jsp?newsearch=true&queryText=Today%27s%20Engineer\" rel=\"noopener noreferrer\" target=\"_blank\"><em>Today’s Engineer</em></a>, which was published by <a href=\"https://ieeeusa.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE-USA</a> to report on government legislation and issues affecting U.S. members’ careers. The 48-page magazine was discontinued after three years, but it is now available as the e-newsletter, <a href=\"https://insight.ieeeusa.org/about/\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE-USA InSight</em></a>. </p><p>Gaynor remains active. He’s currently a member of the IEEE Technology and Engineering Management Society (TEMS) and vice president of its publications.</p><p>“At the tender age of 100, Gus is a living legend in the field of technology and engineering management,” says IEEE Member <a href=\"https://www.linkedin.com/cws/share?url=https%3A%2F%2Fentrepreneurship.ieee.org%2Fspeaker%2F6494%2F\" rel=\"noopener noreferrer\" target=\"_blank\">Andy Chen</a>, 2021 president of IEEE TEMS. “Being the founding editor of <em>Today's Engineer</em> magazine, Gus’s contribution in the field of engineering management is well respected by scholars, researchers, and industry experts around the globe.”</p><p>Gaynor says the best part about being an IEEE volunteer is the camaraderie. He says he relishes the relationships he’s built.</p>",
  "pubDate": "Thu, 09 Jun 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/gus-gaynor-profile",
  "category": [
    "3m",
    "Ieee member news",
    "Ieee technology and engineering management society",
    "Member profile",
    "Photography",
    "Volunteer profile",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}