{
  "title": "Lesley M.M. Blume interview about her WWII history book about John Hersey&#8217;s 1946 reporting on the effects of the Hiroshima bombing (Simon &#038; Schuster, 2020)",
  "link": "http://warscholar.org/lesley-m-m-blume-interview-about-her-wwii-history-book-about-john-herseys-1946-reporting-on-the-effects-of-the-hiroshima-bombing-simon-schuster-2020/",
  "pubDate": "Sun, 25 Oct 2020 17:40:18 +0000",
  "guid": "http://warscholar.org/?p=2093",
  "comments": "http://warscholar.org/lesley-m-m-blume-interview-about-her-wwii-history-book-about-john-herseys-1946-reporting-on-the-effects-of-the-hiroshima-bombing-simon-schuster-2020/#respond",
  "wfw:commentRss": "http://warscholar.org/lesley-m-m-blume-interview-about-her-wwii-history-book-about-john-herseys-1946-reporting-on-the-effects-of-the-hiroshima-bombing-simon-schuster-2020/feed/",
  "slash:comments": 0,
  "category": [
    "All WWII",
    "Interviews",
    "Podcasts",
    "audio interviews",
    "author",
    "books",
    "podcast",
    "Simon & Schuster",
    "United States",
    "wwII"
  ],
  "description": "Lesley M.M. Blume interview about her WWII history book John Hersey and his 1946 reporting about Hiroshima Check out this book here   https://amzn.to/3jrcwFt Interview Summary Lesley M.M. Blume is an award-winning journalist, historian, and bestselling author. She’s written a huge amount of material and her latest publication, Fallout, is a study of John Hersey’s reporting…",
  "enclosure": "",
  "itunes:subtitle": "Lesley M.M. Blume interview about her WWII history book John Hersey and his 1946 reporting about Hiroshima Check out this book here   https://amzn.to/3jrcwFt Interview Summary Lesley M.M. Blume is an award-winning journalist, historian,",
  "itunes:summary": "<br />\nLesley M.M. Blume interview about her WWII history book John Hersey and his 1946 reporting about Hiroshima<br />\n<a href=\"https://amzn.to/3jrcwFt\">Check out this book here</a>   <a href=\"https://amzn.to/3jrcwFt\">https://amzn.to/3jrcwFt</a><br />\nInterview Summary<br />\nLesley M.M. Blume is an award-winning journalist, historian, and bestselling author. She’s written a huge amount of material and her latest publication, Fallout, is a study of John Hersey’s reporting on the aftermath of the Hiroshima bombing. We spoke about the book, about John Hersey’s work, about Lesley’s research and about freedom of the press.<br />\n(THE AUDIO PLAYER IS AT THE BOTTOM OF THE POST.)<br />\nArkady Martine talks about her sci-fi novel &#8220;A Memory Called Empire&#8221; <a href=\"https://wp.me/p7CDU9-4Z1\">https://wp.me/p7CDU9-4Z1</a><br />\nJames Miller talks about the early days of nuclear power in subs and about the NASA NEAR mission <a href=\"http://spacewalksmoneytalks.com/p/605\">http://spacewalksmoneytalks.com/p/605</a><br />\n1:17 &#8211; Lesley talks about why she wrote a book on Hiroshima and John Hersey.<br />\n3:20 &#8211; Lesley talks about how reporters covered Hiroshima and Nagasaki bombings. She talks about how MacArthur&#8217;s staff was able to quickly control reporting on the bombings.<br />\n6:52 &#8211; Lesley talks about how the US government and military presented the atomic bombs to the public.<br />\n9:17 &#8211; Lesley talks about what people might have thought if the bomb had also been dropped on Germany.<br />\n13:26 &#8211; Lesley talks about how John Hersey got into Japan to write his story on Hiroshima.<br />\n16:02 &#8211; Lesley talks about how Hersey got around Japan.<br />\n19:09 &#8211; Lesley compares conditions for reporters in WWII versus wars now.<br />\n20:30 &#8211; Lesley talks about the Christian missionary that Hersey first interviewed.<br />\n22:20 &#8211; Lesley talks about how Hersey got his manuscript approved. She also talks about the protection of nuclear data during WWII.<br />\n27:06 &#8211; Lesley talks about the research she did for this book.<br />\n30:22 &#8211; Lesley talks about the SCAP papers that were left behind in Japan.<br />\n34:17 &#8211; Lesley talks about her FOIA requests to the CIA and FBI.<br />\n36:00 &#8211; Lesley talks about how enjoyable her archival research was.<br />\n38:57 &#8211; Lesley talks about the nostalgia and noir feel of the time period she studied.<br />\n40:40 &#8211; Lesley talked about some of the help Hersey got in Japan.<br />\n44:05 &#8211; Lesley talks about being surprised that the New Yorker carried Hersey&#8217;s story since it was a niche humor magazine.<br />\n45:09 &#8211; Lesley talks about wishing she could have seen the notes between the military and the New Yorker.<br />\n47:49 &#8211; Lesley talks about Japanese reaction to the story.<br />\n50:43 &#8211; Lesley talks about how the Soviet Union censored the story in the USSR.<br />\n51:52 &#8211; Lesley talks about some of the emotional impact of her research. She says the recountings of American POWs and the atrocities committed by the Japanese were torturous to read. She also discusses the importance of protecting the press.<br />\n57:34 &#8211; Lesley talks about how you can trust the press if it serves as a mouthpiece of the government or companies.<br />\n1:00:12 &#8211; Lesley talks about the reporters during WWII who simply reported what the government wanted them to. She also talks about the anxiety she had about publishing during Covid.<br />\n1:05:48 &#8211; Lesley can be found at lesleymmblume.com and on twitter @lesleymmblume.<br />\nLinks of interest<br />\n<a href=\"https://amzn.to/3jrcwFt\">https://amzn.to/3jrcwFt</a><br />\n<a href=\"https://www.simonandschuster.com/books/Fallout/Lesley-M-M-Blume/9781982128517\">https://www.simonandschuster.com/books/Fallout/Lesley-M-M-Blume/9781982128517</a><br />\n<a href=\"https://www.lesleymmblume.com/\">https://www.lesleymmblume.com/</a><br />\n",
  "itunes:author": "Cris Alvarez",
  "itunes:image": "",
  "itunes:duration": "1:09:26",
  "post-id": 2093
}