{
  "title": "Episode 18: What You Should Know About Poverty in America",
  "itunes:title": "Episode 18: What You Should Know About Poverty in America",
  "pubDate": "Wed, 14 Jun 2017 16:00:00 +0000",
  "guid": "3f1c67f394048a863aa8095d801903cf",
  "link": "https://wordsandnumbers.libsyn.com/what-you-should-know-about-poverty-in-america",
  "itunes:image": "",
  "description": "<p>Poverty is a big deal – it affects about 41 million people in the United States every year – yet the federal government spends a huge amount of money to end poverty. So much of the government’s welfare spending gets eaten up by bureaucracy, conflicting programs, and politicians presuming they know how people should spend their own money. Obviously, this isn’t working.<br /> <br /> This week on Words and Numbers, Antony Davies and James R. Harrigan delve into how people can really become less poor and what that means for society and the government.<br /> <br /> Learn More:</p> <p><a href= \"https://fee.org/articles/what-you-should-know-about-poverty-in-america/\"> https://fee.org/articles/what-you-should-know-about-poverty-in-america/</a></p> <p> </p>",
  "content:encoded": "<p>Poverty is a big deal – it affects about 41 million people in the United States every year – yet the federal government spends a huge amount of money to end poverty. So much of the government’s welfare spending gets eaten up by bureaucracy, conflicting programs, and politicians presuming they know how people should spend their own money. Obviously, this isn’t working.  This week on Words and Numbers, Antony Davies and James R. Harrigan delve into how people can really become less poor and what that means for society and the government.  Learn More:</p> <p><a href= \"https://fee.org/articles/what-you-should-know-about-poverty-in-america/\"> https://fee.org/articles/what-you-should-know-about-poverty-in-america/</a></p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "14:18",
  "itunes:explicit": false,
  "itunes:keywords": "business,education,politics,government,economics,Opinion,poverty",
  "itunes:subtitle": "Poverty is a big deal – it affects about 41 million people in the United States every year – yet the federal government spends a huge amount of money to end poverty. So much of the government’s welfare spending gets eaten up by bureaucracy,...",
  "itunes:season": 1,
  "itunes:episode": 18,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}