{
  "title": "Crime Prediction using Machine Learning with a Novel Crime Dataset. (arXiv:2211.01551v1 [cs.LG])",
  "link": "http://arxiv.org/abs/2211.01551",
  "description": "<p>Crime is an unlawful act that carries legal repercussions. Bangladesh has a\nhigh crime rate due to poverty, population growth, and many other\nsocio-economic issues. For law enforcement agencies, understanding crime\npatterns is essential for preventing future criminal activity. For this\npurpose, these agencies need structured crime database. This paper introduces a\nnovel crime dataset that contains temporal, geographic, weather, and\ndemographic data about 6574 crime incidents of Bangladesh. We manually gather\ncrime news articles of a seven year time span from a daily newspaper archive.\nWe extract basic features from these raw text. Using these basic features, we\nthen consult standard service-providers of geo-location and weather data in\norder to garner these information related to the collected crime incidents.\nFurthermore, we collect demographic information from Bangladesh National Census\ndata. All these information are combined that results in a standard machine\nlearning dataset. Together, 36 features are engineered for the crime prediction\ntask. Five supervised machine learning classification algorithms are then\nevaluated on this newly built dataset and satisfactory results are achieved. We\nalso conduct exploratory analysis on various aspects the dataset. This dataset\nis expected to serve as the foundation for crime incidence prediction systems\nfor Bangladesh and other countries. The findings of this study will help law\nenforcement agencies to forecast and contain crime as well as to ensure optimal\nresource allocation for crime patrol and prevention.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Shohan_F/0/1/0/all/0/1\">Faisal Tareque Shohan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Akash_A/0/1/0/all/0/1\">Abu Ubaida Akash</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Ibrahim_M/0/1/0/all/0/1\">Muhammad Ibrahim</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Alam_M/0/1/0/all/0/1\">Mohammad Shafiul Alam</a>"
}