{
  "title": "Episode 96 (video): The Phonetic Alphabet Part 2",
  "pubDate": "Sun, 20 Mar 2011 22:08:08 +0000",
  "guid": "9817cedd91e9247a7ab5640041d4e147",
  "link": "https://traffic.libsyn.com/secure/thepsychfiles/phonetic_p2_Revised.mp4",
  "itunes:image": "",
  "description": "<p>In this video you’ll learn exactly how the <strong>phonetic alphabet</strong> system works. In the last episode you saw me memorize – almost  perfectly – a list of 20 top sci-fi movies.  How did I do it?   I’ll  show you how each number becomes a letter, each letter becomes a word  and each word becomes an image that will help you memorize just about  any size list.  Skeptical?  You won’t be after seeing exactly how the <strong>phonetic alphabet</strong> works.</p>",
  "content:encoded": "<p>In this video you’ll learn exactly how the phonetic alphabet system works. In the last episode you saw me memorize – almost  perfectly – a list of 20 top sci-fi movies.  How did I do it?   I’ll  show you how each number becomes a letter, each letter becomes a word  and each word becomes an image that will help you memorize just about  any size list.  Skeptical?  You won’t be after seeing exactly how the phonetic alphabet works.</p>",
  "enclosure": "",
  "itunes:duration": "26:38",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In this video you’ll learn exactly how the phonetic alphabet system works. In the last episode you saw me memorize – almost  perfectly – a list of 20 top sci-fi movies.  How did I do it?   I’ll  show you how each number becomes...",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "In this video you’ll learn exactly how the phonetic alphabet system works. In the last episode you saw me memorize – almost perfectly – a list of 20 top sci-fi movies. How did I do it? I’ll show you how each number becomes a letter, each letter becomes a word and each word becomes an image that will help you memorize just about any size list. Skeptical? You won’t be after seeing exactly how the phonetic alphabet works."
}