{
  "title": "Namakhvani HPP: Georgian Hydropower Between Energy Security and Geopolitics",
  "link": "https://jamestown.org/namakhvani-hpp-georgian-hydropower-between-energy-security-and-geopolitics/",
  "dc:creator": "web1983",
  "pubDate": "Wed, 16 Jun 2021 21:09:24 +0000",
  "category": "Uncategorised",
  "guid": "https://jamestown.org/?p=89748",
  "description": "<p>On May 25, just ahead of the 103rd anniversary of the First Georgian Republic’s (1918–1921) independence, Georgian protesters paralyzed the streets of the capital city of Tbilisi in the largest rally to date against the Namakhvani Hydroelectric Power Plant (HPP) project (Civil.ge, May 25, 26). Relatively small demonstrations against the planned dam, by locals organized under the banner “Guardians of &#8230; <a href=\"https://jamestown.org/namakhvani-hpp-georgian-hydropower-between-energy-security-and-geopolitics/\" class=\"more\"></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/namakhvani-hpp-georgian-hydropower-between-energy-security-and-geopolitics/\">Namakhvani HPP: Georgian Hydropower Between Energy Security and Geopolitics</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n",
  "content:encoded": "<p>On May 25, just ahead of the 103<sup>rd</sup> anniversary of the First Georgian Republic’s (1918–1921) independence, Georgian protesters paralyzed the streets of the capital city of Tbilisi in the largest rally to date against the Namakhvani Hydroelectric Power Plant (HPP) project (Civil.ge, <a href=\"https://civil.ge/archives/422461\">May 25</a>, <a href=\"https://civil.ge/archives/422609\">26</a>). Relatively small demonstrations against the planned dam, by locals organized under the banner “Guardians of the Rioni Valley,” began years ago around the construction site on the Rioni River in western Georgia. These rallies gradually expanded in number and participation, eventually reaching a nation-wide character by January 2021. On May 23, the demonstrations shifted to Tbilisi, where Rioni inhabitants were joined in solidarity by striking workers from other regions of Georgia (<a href=\"https://www.facebook.com/rioniskheobisgadarchenistvis/videos/360118899118406/\">Facebook.com/rioniskheobisgadarchenistvis</a>, May 23). These protests stretched on for three consecutive days before a decision was made to return to the Rioni Valley (<a href=\"https://agenda.ge/en/news/2021/1412\">Agenda.ge</a>, May 26).</p>\n<p>Criticism of the Namakhvani HPP project was first raised by inhabitants of the Rioni Gorge, who complained they were not involved in the negotiations of the agreement with the foreign contractor companies. Those grievances were augmented by serious environmental and procedural concerns. On the other side, the Georgian government considers the infrastructure fundamental to bolstering the country’s energy security. Moreover, the authorities claim the associated foreign direct investment will benefit Georgians by creating new jobs and reducing prices for household electricity.</p>\n<p>The Namakhvani HPP project envisages the construction, by 2024, of a double-dam facility on the Rioni River in the Racha-Lechkhumi and Western Imereti regions of Georgia. The two dams, measuring 59 and 100 meters in height, respectively, are expected to produce 1.514 gigawatt hours (GWh) of electricity yearly and have a capacity of 433 megawatts (MW). The reservoirs created by the damming will cover 610 hectares surface and will be linked by a 4.4-kilometer-long power tunnel. The southernmost chunk of the facility is around 30 km from Georgia’s third largest city, Kutaisi. The biggest construction project since Georgian independence, the Namakhvani HPP has received $800 million in foreign direct investment from its main contractor, the Turkish company ENKA Renewables, which will hold a 90 percent share in the project; the Norwegian Clean Energy group will hold 10 percent (<a href=\"https://www.enka.com/portfolio-item/namakhvani-hydro-power-plant-cascade-project/\">Enka.com</a>, <a href=\"http://www.cleanenergygroup.no/projects/namakhvani/\">Cleanenergy.no</a>, accessed June 1).</p>\n<p>Georgia’s annual energy consumption of 12.37 terawatt hours (TWh) amounts to a per capita average consumption of 3,300 kilowatt hours (kWh). Georgian citizens spend an average of roughly 660 lari ($200) per year on electricity (<a href=\"https://www.geostat.ge/en\">Geostat.ge</a>, accessed June 1). Domestic electricity supply relies mainly on hydropower and thermal plants as well as, to a minor extent, wind turbines. Georgian generation capacity fails to meet domestic consumption, however, especially in winter months (<a href=\"https://www.iea.org/fuels-and-technologies/electricity\">Iea.org</a>, accessed June 1). The single most important source of electricity is the critical Enguri complex, partially situated in the occupied region of Abkhazia. A temporary halt in production earlier this year, due to maintenance work, made Georgia’s dependence on the Enguri HPP even clearer (<a href=\"https://agenda.ge/en/news/2021/126\">Agenda.ge</a>, January 18).</p>\n<p>The Namakhvani procurement comes with a 15-year Power Purchase Agreement (PPA) that entitles the owners to auction the generated electricity yearly on the free market during the May–August period. For the remaining eight months of the year, electricity must be sold directly to the Georgian government. Details of the contract, first publicized in February by a Georgian newspaper, raised criticism over the price of the electricity expected from the hydroelectric plant, the fiscal burden on the Georgian state, environmental and territorial issues, and the ultimate value of Namakhvani as an additional source of electricity (<a href=\"https://iset-pi.ge/index.php/en/iset-economist-blog-2/entry/namakhvani-hpp-threat-or-opportunity\">Iset-pi.ge</a>, May 3; <a href=\"https://socialjustice.org.ge/en/products/emc-namakhvanhesis-khelshekrulebit-mnishvnelovani-sakhelmtsifo-interesebi-datmobilia-kerdzo-kompaniis-sasargeblod?fbclid=IwAR0SQhr3wUJv7SCsSZe3nzdKhlYgX5WJWRJsoTKapcZXwA-ee3mKYShOZeM\">Socialjustice.org</a>, March 3). On May 25, the newspaper <em>Mtisambebi</em> obtained and released a document, dated March 30, 2019, in which Georgia’s Ministry of Justice gives a negative assessment of the project (<a href=\"https://mtisambebi.ge/news/people/item/1307?fbclid=IwAR09_Y1z7QAyhmEAmjKfmfl-4k-oUUtDse8Ri9XXiwoEPo2GG_Ex9_6CoHc\">Mtisambebi.ge</a>, May 25).</p>\n<p>In contrast, Georgian Prime Minister Irakli Garibashvili, along with his entire cabinet, asserts that the Namakhavani HPP is fundamental to the country’s development because of its prospects of boosting domestic electricity production by 12 percent—especially in light of projected increases in consumption over the next several years (<a href=\"http://gov.ge/index.php?lang_id=GEO&sec_id=556&info_id=78748\">Gov.ge</a>, April 3). Additionally, a higher reliance on domestically generated electricity from renewable sources would reduce Georgia’s dependence on imports from Russia, help the country meet its pledges under the Paris Climate Accord, as well as improve Georgian compliance with European Union accession criteria.</p>\n<p>While controversy over the HPP certainly touches on legitimate concerns related to the project’s technical aspects, the Namakhvani dams have, lately, also assumed a political and geopolitical character.</p>\n<p>On the political front, the Rioni Valley Movement has been targeted by misleading social media campaigns that exploit the cause to disseminate nationalist and xenophobic content, slander protest leader Varlam Goletiani, and promote political advertisements on news and events sponsored by right-wing, Russia-backed, populist politician Levan Vasadze (<a href=\"https://civil.ge/archives/419533\">Civil.ge</a>, May 19). Moreover, the widely cross-cutting nature of the Namakhvani opposition attracts diverse social groups from opposing political backgrounds. Episodes of violence were reported on May 24 against LGBT groups that joined the rally marches, which also included far-right nationalists. Such incidents further polarize the discourse and dilute the original cause (<a href=\"https://www.facebook.com/equalitymovementgeorgia/posts/3898885800167265\">Facebook.com/equalitymovementgeorgia</a>, May 24).</p>\n<p>The Namakhvani issue has additionally been exploited to incite anti-Turkish sentiment, particularly since the main contractor is a Turkish company. In April, Turkey’s ambassador to Georgia, Fatma Ceren Yazgan, addressed the problem by reminding of the importance of ties between the two countries and affirming the benefits of the HPP for Georgian communities (<a href=\"https://civil.ge/archives/412457\">Civil.ge</a>, Apr 16). Good relations between Georgia and Turkey are not only based on economics; they also have a central strategic component in the form of shared transit and energy corridors as well as trilateral defense cooperation with Azerbaijan (see <a href=\"https://jamestown.org/program/azerbaijan-turkey-georgia-geopolitical-axis-accidental-alliance/\">EDM</a>, June 7, 2017). Russian-backed media has long promoted misleading and conspiratorial narratives about alleged Turkish irredentism in the region of Adjara, and insinuated Georgia is giving up its territory to a “Turkish invasion” (see <a href=\"https://jamestown.org/program/georgian-azerbaijani-monastery-dispute-and-the-intersection-of-local-national-and-international-drivers-of-conflict/\">EDM</a>, July 30, 2019).</p>\n<p>Currently, with the Georgian government increasing its rhetoric about integrating closer with the Euro-Atlantic community, and the South Caucasus not yet fully pacified following last year’s Karabakh war, the Russia informational offensive targeting Georgia and the wider region has been growing. Not only anti-Western but also anti-Turkish and anti-Muslim rhetoric have all grown louder. Playing on internal political cleavages and exploiting the variegated ethnic, linguistic and religious composition of Georgian society, Russia is backing extremist leaders as well as promoting divisive narratives to split the society and hinder friendly ties with Georgia’s neighbors.</p>\n<p>&nbsp;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://jamestown.org/namakhvani-hpp-georgian-hydropower-between-energy-security-and-geopolitics/\">Namakhvani HPP: Georgian Hydropower Between Energy Security and Geopolitics</a> appeared first on <a rel=\"nofollow\" href=\"https://jamestown.org\">Jamestown</a>.</p>\n"
}