{
  "guid": "ee91a738-583e-4b4f-84d3-e64b186c466d",
  "title": "The Law as a Covenantal Partnership - Law E2",
  "description": "<p>In part 1 (0-21:00), Tim points out that the laws are not a “law code” but terms of a covenant relationship. The laws are not a “constitutional code” (i.e. a divine behavior manual) dropped from heaven. Rather, they illustrate the official terms of the covenant relationship between Yahweh and the people of ancient Israel. The 613 laws all fall within the ceremony of God’s covenant with Israel in Exodus 19-24.</p>\n<p>Tim asks the question: If these laws aren’t a judicial code, then what are they?</p>\n<p>The laws are the shared agreement between God and Israel that was put forth in their covenant ceremony. We witness this relationship between Israel and Yahweh, Tim shares, as outsiders. People today were not at Mt. Sinai when the covenant was ratified. Instead, the law is used as “torah” for us, or “instruction,” meaning they reveal more about ourselves and God and the human condition. The Torah, Tim says, is a narrative about a covenant relationship, not a law code. He points out that there would have inevitably been more rules and laws governing ancient Israel than the 613 laws included in the Bible.</p>\n<p>In part 2 (21:00-26:00), Tim expresses how the law served as “relational authority” between Israel and God. The laws served as a witness to Israel’s difference from other kingdoms, that they were a “kingdom of priests” who all had a relationship with God.</p>\n<p>Ancient Law: Examples from History</p>\n<p>In part 3, (26:00-41:30) Tim explains that to best understand the ancient laws of Israel, one should also understand how other ancient laws worked. Tim brings up the Code of Hammurabi, the most well known ancient law code. Tim shares the start of the law code of Hammurabi:</p>\n<p>“When lofty Anum, king of the Anunnaki and Enlil, lord of heaven and earth, the determiner of the destinies of the land, determined for Marduk, the first-born of Enki, 6 the Enlil supreme powers over all mankind, made him great among the Igigi, called Babylon by its exalted name, He made it supreme in the world, established for him in its midst an enduring kingship, whose foundations are as firm as heaven and earth—</p>\n<p>“at that time Anum and Enlil named me to promote the welfare of the people, me, Hammurabi, the devout, god-fearing prince, to cause justice to prevail in the land, to destroy the wicked and the evil, that the strong might not oppress the weak, to rise like the sun over humankind, and to light up the land.</p>\n<p>“Hammurabi, the shepherd, called by Enlil, am I; the one who makes affluence and plenty abound; the one who relaid the foundations of Sippar; who decked with green the chapels of Aya; the designer of the temple of Ebabbar, which is like a heavenly dwelling.</p>\n<p>“When the god Marduk commanded me to provide just ways for the people of the land (in order to attain) appropriate behavior, I established truth and justice as the declaration of the land, I enhanced the well-being of the people.”</p>\n<p>The Epilogue and Prologue to the Law Code [From Martha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor]</p>\n<p>Here are a few laws in the code of Hammurabi:</p>\n<p>#196: \"If a man destroy the eye of another man, they shall destroy his eye. If one break a man's bone, they shall break his bone. If one destroy the eye of a freeman or break the bone of a freeman he shall pay one gold mina. If one destroy the eye of a man's slave or break a bone of a man's slave he shall pay one-half his price.\"</p>\n<p>#250 (xliv 44–51) “If an ox gores to death a man while it is passing through the streets, that case has no basis for a claim.”</p>\n<p>#251 (xliv 52–65) “If a man’s ox is a known gorer, and the authorities of his city quarter notify him that it is a known gorer, but he does not blunt(?) its horns or control his ox, and that ox gores to death a member of the awīlu-class, he (the owner) shall give 30 shekels of silver.”</p>\n<p>Here is the epilogue of the law:</p>\n<p>“May any king who will appear in the land in the future, at any time, observe the pronouncements of justice that I inscribed upon my stela. May he not alter the judgments that I rendered and the verdicts that I gave, nor remove my engraved image. If that man has discernment, and is capable of providing just ways for his land, may he heed the pronouncements I have inscribed upon my stela.”</p>\n<p>The Epilogue and Prologue to the Law Code [From Martha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor]</p>\n<p>Tim brings up some interesting observations, puzzles and problems that ancient laws present.</p>\n<p>This code is one of the most frequently copied texts from the ancient world, copies ranging over 1500yrs, and yet, as he quotes:</p>\n<p>“Of the many thousands of Mesopotamian legal documents in our possession, not one of them cites the Code of Hammurabi, or any other ‘code’ as a source of authority. This in spite of the fact that the code of Hammurabi was esteemed and recopied for more than a millennium. All of this suggests that ancient near eastern law codes were of a literary, educational, and monumental nature, rather than legal and juridical.” (Joshua Berman, Created Equal: 84)</p>\n<p>The code of Hammurabi was copied and recopied for over a thousand years. But across the centuries, none of the dozens of monetary fines were changed (which they would have if consulted and used for legal purposes). The code is nowhere near comprehensive—you won’t find any laws concerning inheritances, one of the most important features of landed-agricultural life in Babylon. Copies of the Code of Hammurabi have been found in royal archives but never in the sites of local courts, and never with caches of legal documents (receipts, divorce certificates, etc.).</p>\n<p>Additionally, there are no ancient legal texts that ever cite or even refer to the Code as a source of law. In the thousands of ancient legal texts that do exist and address the same topics as the code, they are usually at odds with the sentences and fines given within it.</p>\n<p>So, if these compositions were not legal codes, (1) where could the law of the land be found? And if they were not legal codes, (2) what was their purpose?</p>\n<p>Tim shares this quote:</p>\n<p>“Archaeologists have unearthed thousands of law-practice documents from the ancient near East, documents such as land transfers, financial contracts, and court rulings where law was applied to actual situations (divorces, civil disputes). There have also been discovered dozens of ancient law codes (Hammurabi, Ur-Namma, Lipit-Ishtar, Eshnunna). A curious problem emerges when these practice documents are compared with the law collections. The law as practiced in those cultures often differed from, even contradicted, the laws as stated in the collections. Penalties found in court decisions are repeatedly inconsistent with the penalties inscribed in the collections. Prices established in contracts don’t match those given in the law codes. This has raised important questions about the purpose of these collections. Whatever their purposes were, they do not appear to have dictated actual legal practice. Scholars have come to see that these law codes as academic and monumental collections, but not the source of law in these societies.” (Michael Lefebvre, Collections, Codes, and Torah, 1)</p>\n<p>Two Kinds of Law</p>\n<p>In part 4, (41:30-49:30) Tim explains that the ancient world would have been known as a common or customary law society, whereas our modern world is largely known as a statutory law society. He shares more quotes:</p>\n<p>“The scholarly consensus is that law in Mesopotamia was customary/common law. A judge would determine the law at the moment of adjudication by drawing on an extensive reservoir of custom, accepted norms, and principles from the legal texts with which he was educated. The law would vary from place to place, and neither the Code of Hammurabi nor any other text was ‘the final word’ on what law should be applied. Indeed, the association of “law” with a written collection of statutes and rules is a modern anachronistic imposition from our own culture. It is no surprise, therefore, that neither Mesopotamia, Egyptian, or Hittite culture has any word for ‘written law,’ that we find in later Greek as thesmos, or nomos.” (Joshua Berman, Inconsistency in the Torah, 112-113)</p>\n<p>“The law collections, instead, are anthologies of judgments from times past, snapshots of decisions and customs rendered by judges or even by a king. The collections were a model of justice meant to educate and inspire…. They were records of precedent, but not of legislation….they instilled in later generations of scribes a unified legal vision.” (Ibid.)</p>\n<p>Tim says this has helped him understand three main purposes of the law:</p>\n<p>Judicial Education texts: Collections of the most common representative decisions from a culture, compiled to train the moral-instincts of leaders, not to legislate actual practice.<br />\nMonumental Propaganda: Like the Code of Hammurabi, the code praises the king’s wisdom and justice and claims that his decisions are in fact divinely inspired.<br />\nEducational texts: These are compilations for training the scribal class, introducing them to a literary tradition of justice.  </p>\n<p>In part 5 (49:30-63:00), Tim further delineates the differences between common law and statutory law:</p>\n<p>Statutory Law<br />\nThe law itself is contained in a codified text, whose authority combines two elements: (a) the law emanates from a sovereign (a king or legislative body, etc.), (b) the law is a finite and complete legal system, so that only what is written in the code is the law. The law code supersedes all other sources of law that precede the formulation of the code. Where the code lacks explicit legislation, judges must adjudicate with the code as their primary guide.</p>\n<p>Common Law<br />\nWith common law, the law is not found in a written code that serves as a judge’s point of reference or limits what they can decide. Rather, the judges make decisions based on the mores and spirit of the community and its customs. Law develops through the distillation and continual restatement of legal doctrine through the decision of courts. Previous legal decisions are consulted but not binding, and importantly, a judge’s decision does not create a binding law, because no particular formulation of the law is binding. The common law is consciously and inherently incomplete, fluid, and vague. Under common law, legal codes are not the source of law, but rather a resource for later judges to consult.</p>\n<p>Tim shares a helpful metaphor from Sir Matthew Hale (“the greatest British common-law judge of the 17th century”): The common law can change and yet still be considered part of the same legal “system” just as a ship can return home after a long voyage and still be considered the “same” ship, even though it returns with many repairs, new materials, and old materials discarded and replaced. In the same saw, law collections create a system of legal reasoning that a judge accesses to apply in new and unanticipated circumstances.</p>\n<p>A Helpful Illustration from History</p>\n<p>Common law traditions flourished for most of human history, because they require a homogeneous community where a common story and common values are assumed and perpetuated by all members of a society. 19th century German legal theorist Carl von Savigny called this the Volksgeist, “the collective spirit and conscience of a people.” Where social cohesion breaks down, it becomes more difficult to anchor the law in a collective set of values, and this is what happened in 19th century Europe with the rise of immigration, urbanization, and the modern nation-state.</p>\n<p>Nineteenth-century Germany faced transition from a historically tribal state into a modern state (Otto von Bismarck and Carl Savigny continued to advocate the common law tradition of their past). One of his most famous students was Jacob Grimm (1785-1863), best known for his collaboration with his brother Wilhelm. These brothers did exhaustive research into their cultural folklore and produced comprehensive editions of Germany’s moral heritage in their anthology called “Kinder und Hausmarchen” = “Children’s and Household Tales” (2 volumes in 1812 and 1815), including the classic tales of Cinderella, Hansel and Gretel, Rapunzel, Rumpelstiltskin, Sleeping Beauty, and the Frog Prince.</p>\n<p>The Brothers Grimm established a methodology for collecting and recording folk stories that became the basis for folklore studies. Between the first edition of 1812-15 and the seventh and final edition of 1857, they revised their collection many times so that it grew from 156 stories to more than 200. In addition to collecting and editing folk tales, the brothers compiled German legends. Individually, they published a large body of linguistic and literary scholarship. Together in 1838, they began work on a massive historical German dictionary (Deutsches Wörterbuch), which, in their lifetimes, they completed only as far as the word Frucht, 'fruit'.</p>\n<p>Tim points out that the Grimm brothers bridged the gap between folklore and common law in German society into a society of more statutory law in Germany. In many ways, Tim says, this is how Israel came to treat the law. The stories surrounding the laws allowed Israel to illustrate what happens when the rules are or are not followed.</p>\n<p>Examples of Law Implementation in Scripture</p>\n<p>In part 6 (63:00-end), Tim points out that many times in the Bible, the actual implementation of the laws are totally different from the given or written laws. There are many cases where narratives about legal decisions either differ from the statements of practice in the biblical law codes, or the decision is offered without any recourse to a law code.</p>\n<p>For example, in 2 Samuel 14, David gives a ruling contrary to every law and principle in the biblical law codes concerning murder. David simply excuses his son Absalom (who murdered Amnon) with no appeal or defense of his actions and no mention of a law code.</p>\n<p>Another example is found in Jeremiah 26, the most detailed description of a trial in the Old Testament. Jeremiah is accused of treason for announcing the temple’s destruction. His defense is that another prophet before him, Micah, announced the same message and he was never imprisoned. This is an argument from precedent, not from a law code. The arguments advanced against him are offered on theological grounds (“he speaks in the name of Yahweh”) and political grounds (“he prophesied against our city”). No law codes are ever consulted to defend or accuse him.</p>\n<p>A third example is Solomon’s famous “decision” about the two women in 1 Kings 3. Solomon listens to the witnesses (the two women), and uses his intuition (which is divinely inspired according to the previous narrative) to make a decision. The concluding statement shows the real source of legal authority: “When all Israel heard of the judgment which the king had decided, they revered the king, for they saw the wisdom of God in him to do justice.” (1 Kings 3:28)</p>\n<p>Here is a helpful quote to understand why the implementation may have been different.</p>\n<p>“The Hebrew Bible strongly suggests that the earliest forms of disputes… were resolved… by intuitions of justice against a background of custom, rather than appeal to formulated rules. The biblical sources which talk about the establishment of the judicial system in Israel give no indication that judges were to use written sources. Rather, judges are urged to avoid partiality and corruption and to ‘do justice.’ But what was the source of such justice? The version attributed to king Jehoshaphat is the most explicit, ‘God is with you in giving judgment’ (2 Chronicles 19:6). Divine inspiration is also attributed to the king in rendering judgment: Proverbs 16:10, ‘Inspired decisions are on the lips of a king; his mouth does not sin in judgment.’ Solomon’s judgment (1 Kings 3:16-28) is presented as an example of just such a process…. This is not to say that judges were expected to go into some kind of trance or function as an oracle. Rather, they were called to operate by combining local custom with divinely guided intuitions of justice…relying on the ‘practical wisdom’ that existed within the social consciousness of the people as a whole.” (Bernard Jackson, Wisdom Laws, 30-31)</p>\n<p>Show Produced by:<br />\nDan Gummel, Jon Collins</p>\n<p>Show Music:<br />\n“Defender Inst.” by Tents<br />\n“Shot in the back of the head” by Moby<br />\nSynth Groove<br />\n“Scream Pilots” by Moby<br />\n“Shine” by Moby<br />\nThird Floor  </p>\n<p>Show Resources:<br />\nJoshua Berman, Inconsistency in the Torah<br />\nBernard Jackson, Wisdom Laws<br />\nMartha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor<br />\nMichael Lefebvre, Collections, Codes, and Torah <br />\nThank you to all our supporters!</p>\n",
  "pubDate": "Mon, 6 May 2019 07:01:00 +0000",
  "author": "admin@bibleproject.com (Tim Mackie & Jon Collins)",
  "link": "http://www.bibleproject.com",
  "content:encoded": "<p>In part 1 (0-21:00), Tim points out that the laws are not a “law code” but terms of a covenant relationship. The laws are not a “constitutional code” (i.e. a divine behavior manual) dropped from heaven. Rather, they illustrate the official terms of the covenant relationship between Yahweh and the people of ancient Israel. The 613 laws all fall within the ceremony of God’s covenant with Israel in Exodus 19-24.</p>\n<p>Tim asks the question: If these laws aren’t a judicial code, then what are they?</p>\n<p>The laws are the shared agreement between God and Israel that was put forth in their covenant ceremony. We witness this relationship between Israel and Yahweh, Tim shares, as outsiders. People today were not at Mt. Sinai when the covenant was ratified. Instead, the law is used as “torah” for us, or “instruction,” meaning they reveal more about ourselves and God and the human condition. The Torah, Tim says, is a narrative about a covenant relationship, not a law code. He points out that there would have inevitably been more rules and laws governing ancient Israel than the 613 laws included in the Bible.</p>\n<p>In part 2 (21:00-26:00), Tim expresses how the law served as “relational authority” between Israel and God. The laws served as a witness to Israel’s difference from other kingdoms, that they were a “kingdom of priests” who all had a relationship with God.</p>\n<p>Ancient Law: Examples from History</p>\n<p>In part 3, (26:00-41:30) Tim explains that to best understand the ancient laws of Israel, one should also understand how other ancient laws worked. Tim brings up the Code of Hammurabi, the most well known ancient law code. Tim shares the start of the law code of Hammurabi:</p>\n<p>“When lofty Anum, king of the Anunnaki and Enlil, lord of heaven and earth, the determiner of the destinies of the land, determined for Marduk, the first-born of Enki, 6 the Enlil supreme powers over all mankind, made him great among the Igigi, called Babylon by its exalted name, He made it supreme in the world, established for him in its midst an enduring kingship, whose foundations are as firm as heaven and earth—</p>\n<p>“at that time Anum and Enlil named me to promote the welfare of the people, me, Hammurabi, the devout, god-fearing prince, to cause justice to prevail in the land, to destroy the wicked and the evil, that the strong might not oppress the weak, to rise like the sun over humankind, and to light up the land.</p>\n<p>“Hammurabi, the shepherd, called by Enlil, am I; the one who makes affluence and plenty abound; the one who relaid the foundations of Sippar; who decked with green the chapels of Aya; the designer of the temple of Ebabbar, which is like a heavenly dwelling.</p>\n<p>“When the god Marduk commanded me to provide just ways for the people of the land (in order to attain) appropriate behavior, I established truth and justice as the declaration of the land, I enhanced the well-being of the people.”</p>\n<p>The Epilogue and Prologue to the Law Code [From Martha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor]</p>\n<p>Here are a few laws in the code of Hammurabi:</p>\n<p>#196: \"If a man destroy the eye of another man, they shall destroy his eye. If one break a man's bone, they shall break his bone. If one destroy the eye of a freeman or break the bone of a freeman he shall pay one gold mina. If one destroy the eye of a man's slave or break a bone of a man's slave he shall pay one-half his price.\"</p>\n<p>#250 (xliv 44–51) “If an ox gores to death a man while it is passing through the streets, that case has no basis for a claim.”</p>\n<p>#251 (xliv 52–65) “If a man’s ox is a known gorer, and the authorities of his city quarter notify him that it is a known gorer, but he does not blunt(?) its horns or control his ox, and that ox gores to death a member of the awīlu-class, he (the owner) shall give 30 shekels of silver.”</p>\n<p>Here is the epilogue of the law:</p>\n<p>“May any king who will appear in the land in the future, at any time, observe the pronouncements of justice that I inscribed upon my stela. May he not alter the judgments that I rendered and the verdicts that I gave, nor remove my engraved image. If that man has discernment, and is capable of providing just ways for his land, may he heed the pronouncements I have inscribed upon my stela.”</p>\n<p>The Epilogue and Prologue to the Law Code [From Martha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor]</p>\n<p>Tim brings up some interesting observations, puzzles and problems that ancient laws present.</p>\n<p>This code is one of the most frequently copied texts from the ancient world, copies ranging over 1500yrs, and yet, as he quotes:</p>\n<p>“Of the many thousands of Mesopotamian legal documents in our possession, not one of them cites the Code of Hammurabi, or any other ‘code’ as a source of authority. This in spite of the fact that the code of Hammurabi was esteemed and recopied for more than a millennium. All of this suggests that ancient near eastern law codes were of a literary, educational, and monumental nature, rather than legal and juridical.” (Joshua Berman, Created Equal: 84)</p>\n<p>The code of Hammurabi was copied and recopied for over a thousand years. But across the centuries, none of the dozens of monetary fines were changed (which they would have if consulted and used for legal purposes). The code is nowhere near comprehensive—you won’t find any laws concerning inheritances, one of the most important features of landed-agricultural life in Babylon. Copies of the Code of Hammurabi have been found in royal archives but never in the sites of local courts, and never with caches of legal documents (receipts, divorce certificates, etc.).</p>\n<p>Additionally, there are no ancient legal texts that ever cite or even refer to the Code as a source of law. In the thousands of ancient legal texts that do exist and address the same topics as the code, they are usually at odds with the sentences and fines given within it.</p>\n<p>So, if these compositions were not legal codes, (1) where could the law of the land be found? And if they were not legal codes, (2) what was their purpose?</p>\n<p>Tim shares this quote:</p>\n<p>“Archaeologists have unearthed thousands of law-practice documents from the ancient near East, documents such as land transfers, financial contracts, and court rulings where law was applied to actual situations (divorces, civil disputes). There have also been discovered dozens of ancient law codes (Hammurabi, Ur-Namma, Lipit-Ishtar, Eshnunna). A curious problem emerges when these practice documents are compared with the law collections. The law as practiced in those cultures often differed from, even contradicted, the laws as stated in the collections. Penalties found in court decisions are repeatedly inconsistent with the penalties inscribed in the collections. Prices established in contracts don’t match those given in the law codes. This has raised important questions about the purpose of these collections. Whatever their purposes were, they do not appear to have dictated actual legal practice. Scholars have come to see that these law codes as academic and monumental collections, but not the source of law in these societies.” (Michael Lefebvre, Collections, Codes, and Torah, 1)</p>\n<p>Two Kinds of Law</p>\n<p>In part 4, (41:30-49:30) Tim explains that the ancient world would have been known as a common or customary law society, whereas our modern world is largely known as a statutory law society. He shares more quotes:</p>\n<p>“The scholarly consensus is that law in Mesopotamia was customary/common law. A judge would determine the law at the moment of adjudication by drawing on an extensive reservoir of custom, accepted norms, and principles from the legal texts with which he was educated. The law would vary from place to place, and neither the Code of Hammurabi nor any other text was ‘the final word’ on what law should be applied. Indeed, the association of “law” with a written collection of statutes and rules is a modern anachronistic imposition from our own culture. It is no surprise, therefore, that neither Mesopotamia, Egyptian, or Hittite culture has any word for ‘written law,’ that we find in later Greek as thesmos, or nomos.” (Joshua Berman, Inconsistency in the Torah, 112-113)</p>\n<p>“The law collections, instead, are anthologies of judgments from times past, snapshots of decisions and customs rendered by judges or even by a king. The collections were a model of justice meant to educate and inspire…. They were records of precedent, but not of legislation….they instilled in later generations of scribes a unified legal vision.” (Ibid.)</p>\n<p>Tim says this has helped him understand three main purposes of the law:</p>\n<p>Judicial Education texts: Collections of the most common representative decisions from a culture, compiled to train the moral-instincts of leaders, not to legislate actual practice.<br />\nMonumental Propaganda: Like the Code of Hammurabi, the code praises the king’s wisdom and justice and claims that his decisions are in fact divinely inspired.<br />\nEducational texts: These are compilations for training the scribal class, introducing them to a literary tradition of justice.  </p>\n<p>In part 5 (49:30-63:00), Tim further delineates the differences between common law and statutory law:</p>\n<p>Statutory Law<br />\nThe law itself is contained in a codified text, whose authority combines two elements: (a) the law emanates from a sovereign (a king or legislative body, etc.), (b) the law is a finite and complete legal system, so that only what is written in the code is the law. The law code supersedes all other sources of law that precede the formulation of the code. Where the code lacks explicit legislation, judges must adjudicate with the code as their primary guide.</p>\n<p>Common Law<br />\nWith common law, the law is not found in a written code that serves as a judge’s point of reference or limits what they can decide. Rather, the judges make decisions based on the mores and spirit of the community and its customs. Law develops through the distillation and continual restatement of legal doctrine through the decision of courts. Previous legal decisions are consulted but not binding, and importantly, a judge’s decision does not create a binding law, because no particular formulation of the law is binding. The common law is consciously and inherently incomplete, fluid, and vague. Under common law, legal codes are not the source of law, but rather a resource for later judges to consult.</p>\n<p>Tim shares a helpful metaphor from Sir Matthew Hale (“the greatest British common-law judge of the 17th century”): The common law can change and yet still be considered part of the same legal “system” just as a ship can return home after a long voyage and still be considered the “same” ship, even though it returns with many repairs, new materials, and old materials discarded and replaced. In the same saw, law collections create a system of legal reasoning that a judge accesses to apply in new and unanticipated circumstances.</p>\n<p>A Helpful Illustration from History</p>\n<p>Common law traditions flourished for most of human history, because they require a homogeneous community where a common story and common values are assumed and perpetuated by all members of a society. 19th century German legal theorist Carl von Savigny called this the Volksgeist, “the collective spirit and conscience of a people.” Where social cohesion breaks down, it becomes more difficult to anchor the law in a collective set of values, and this is what happened in 19th century Europe with the rise of immigration, urbanization, and the modern nation-state.</p>\n<p>Nineteenth-century Germany faced transition from a historically tribal state into a modern state (Otto von Bismarck and Carl Savigny continued to advocate the common law tradition of their past). One of his most famous students was Jacob Grimm (1785-1863), best known for his collaboration with his brother Wilhelm. These brothers did exhaustive research into their cultural folklore and produced comprehensive editions of Germany’s moral heritage in their anthology called “Kinder und Hausmarchen” = “Children’s and Household Tales” (2 volumes in 1812 and 1815), including the classic tales of Cinderella, Hansel and Gretel, Rapunzel, Rumpelstiltskin, Sleeping Beauty, and the Frog Prince.</p>\n<p>The Brothers Grimm established a methodology for collecting and recording folk stories that became the basis for folklore studies. Between the first edition of 1812-15 and the seventh and final edition of 1857, they revised their collection many times so that it grew from 156 stories to more than 200. In addition to collecting and editing folk tales, the brothers compiled German legends. Individually, they published a large body of linguistic and literary scholarship. Together in 1838, they began work on a massive historical German dictionary (Deutsches Wörterbuch), which, in their lifetimes, they completed only as far as the word Frucht, 'fruit'.</p>\n<p>Tim points out that the Grimm brothers bridged the gap between folklore and common law in German society into a society of more statutory law in Germany. In many ways, Tim says, this is how Israel came to treat the law. The stories surrounding the laws allowed Israel to illustrate what happens when the rules are or are not followed.</p>\n<p>Examples of Law Implementation in Scripture</p>\n<p>In part 6 (63:00-end), Tim points out that many times in the Bible, the actual implementation of the laws are totally different from the given or written laws. There are many cases where narratives about legal decisions either differ from the statements of practice in the biblical law codes, or the decision is offered without any recourse to a law code.</p>\n<p>For example, in 2 Samuel 14, David gives a ruling contrary to every law and principle in the biblical law codes concerning murder. David simply excuses his son Absalom (who murdered Amnon) with no appeal or defense of his actions and no mention of a law code.</p>\n<p>Another example is found in Jeremiah 26, the most detailed description of a trial in the Old Testament. Jeremiah is accused of treason for announcing the temple’s destruction. His defense is that another prophet before him, Micah, announced the same message and he was never imprisoned. This is an argument from precedent, not from a law code. The arguments advanced against him are offered on theological grounds (“he speaks in the name of Yahweh”) and political grounds (“he prophesied against our city”). No law codes are ever consulted to defend or accuse him.</p>\n<p>A third example is Solomon’s famous “decision” about the two women in 1 Kings 3. Solomon listens to the witnesses (the two women), and uses his intuition (which is divinely inspired according to the previous narrative) to make a decision. The concluding statement shows the real source of legal authority: “When all Israel heard of the judgment which the king had decided, they revered the king, for they saw the wisdom of God in him to do justice.” (1 Kings 3:28)</p>\n<p>Here is a helpful quote to understand why the implementation may have been different.</p>\n<p>“The Hebrew Bible strongly suggests that the earliest forms of disputes… were resolved… by intuitions of justice against a background of custom, rather than appeal to formulated rules. The biblical sources which talk about the establishment of the judicial system in Israel give no indication that judges were to use written sources. Rather, judges are urged to avoid partiality and corruption and to ‘do justice.’ But what was the source of such justice? The version attributed to king Jehoshaphat is the most explicit, ‘God is with you in giving judgment’ (2 Chronicles 19:6). Divine inspiration is also attributed to the king in rendering judgment: Proverbs 16:10, ‘Inspired decisions are on the lips of a king; his mouth does not sin in judgment.’ Solomon’s judgment (1 Kings 3:16-28) is presented as an example of just such a process…. This is not to say that judges were expected to go into some kind of trance or function as an oracle. Rather, they were called to operate by combining local custom with divinely guided intuitions of justice…relying on the ‘practical wisdom’ that existed within the social consciousness of the people as a whole.” (Bernard Jackson, Wisdom Laws, 30-31)</p>\n<p>Show Produced by:<br />\nDan Gummel, Jon Collins</p>\n<p>Show Music:<br />\n“Defender Inst.” by Tents<br />\n“Shot in the back of the head” by Moby<br />\nSynth Groove<br />\n“Scream Pilots” by Moby<br />\n“Shine” by Moby<br />\nThird Floor  </p>\n<p>Show Resources:<br />\nJoshua Berman, Inconsistency in the Torah<br />\nBernard Jackson, Wisdom Laws<br />\nMartha Tobi Roth, Harry A. Hoffner, and Piotr Michalowski, Law Collections from Mesopotamia and Asia Minor<br />\nMichael Lefebvre, Collections, Codes, and Torah <br />\nThank you to all our supporters!</p>\n",
  "enclosure": "",
  "itunes:title": "The Law as a Covenantal Partnership - Law E2",
  "itunes:author": "Tim Mackie & Jon Collins",
  "itunes:image": "",
  "itunes:duration": "01:13:13",
  "itunes:summary": "Welcome to our second episode on how to read biblical law!",
  "itunes:subtitle": "Welcome to our second episode on how to read biblical law!",
  "itunes:keywords": "priests, jon collins, biblical, jesus christ, bible study, law, god, old testament, christianity, torah, bible, theology, tim mackie, spirituality, jesus",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 133
}