{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-9009626193680467803",
  "published": "2022-10-04T19:34:00.006-05:00",
  "updated": "2022-10-06T10:11:12.948-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Out of the box risks",
  "content": "<p><a href=\"https://policytensor.substack.com/p/a-nuclear-zugzwang\" target=\"_blank\">Policy Tensor</a> on the consequences of a Russian nuke (<a href=\"https://marginalrevolution.com/marginalrevolution/2022/10/monday-assorted-links-374.html\" target=\"_blank\">HT Marginal Revolution</a>) was very interesting:&nbsp;</p><blockquote><p>Consider the least escalatory option, that of a “demonstration detonation”: Russian forces air-burst (to avoid the nuclear fallout that results from a ground detonation) a tactical nuclear weapon with sub-kiloton yield (ie, no bigger than a big conventional weapon) over uninhabited territory somewhere in south-eastern Ukraine. This would be consistent with Russia’s “escalate-to-deescalate” doctrine ... What happens then?</p></blockquote><blockquote><p>Precisely because it is such a dramatic break with precedent, even a demonstration detonation would radically change the character of the Russo-Western conflict over Ukraine. New Yorkers and Berliners etc, are likely to flee the cities. Everywhere, in Europe and America, supermarkets would likely empty within hours. Many local authorities may institute civil defense measures, even as federal governments everywhere urge calm. A widespread breakdown of law and order would be a real possibility; especially in America, where it would be attended by partisan passions and finger-pointing....</p></blockquote><p>Not to bash a hobby horse, but the Fed, SEC, FDIC and so forth are now obsessed with climate risk to the financial system. Chatting with colleagues at the Fed, it is astonishing how much and how detailed the research is in to climate (really weather) scenarios, much of this directed by higher-ups.&nbsp;</p><p>Today I will not criticize that effort. Maybe pianos do fall from the sky. &nbsp;What is striking to me, verified in every conversation I have with people in these institutions (please prove me wrong!) is that nobody at these institutions&nbsp;<i>is doing any analysis of any other risk.&nbsp;</i></p><p>This seems like a useful one, for example. Any nuclear explosion is going to make the ATMs go dark. Is anyone at the Fed gaming this out? What if (when) China blockades Taiwan? What about a massive cyberattack on the banking system, a deliberate attempt to cause a run (Russian disinformation that a major bank has had all its account information wiped out, get your cash now)? A new pandemic that looks more like 1350 than the flu? &nbsp;<span></span></p><a name='more'></a><p></p><p>So a positive suggestion: Let the climate risk to the financial system efforts continue, but broaden them to all out of the box shocks to the financial system. Game them out, then let's assign some probability. I would guess this one at 5% or so. It's certainly worth asking, \"are we ready?\"&nbsp;</p><p>I do not worry so much about the massive climate financial risk effort. If they do it honestly, I suspect they will only produce careful qualitative refutation that says climate, for all its problems, is not a risk to the financial system. A lot of time gets wasted in central bank research anyway. But a good worry about climate-financial risk taking over all the attention is that nobody is paying any attention to far more likely scenarios. As the UK was not watching plain old collateral in derivatives contracts, and we'll see about whether the rest of Europe managed to oversee plain old borrow short lend long risk.&nbsp;</p><p>(To clarify, after some comments. Yes, economists are writing papers about this sort of thing. But it is not even conceived of in central bank risk analysis and systemic stress tests.)&nbsp;</p><p>BTW, on a game theory note, I'm less persuaded &nbsp;by the rest of Policy Tensor's argument that the Russian nuclear step is quite so likely. Look one more step down the game tree. The goal is to restore Russia's status as world power. But losing a war in Ukraine that can only be stopped by a demonstrated resort to nuclear terrorism is not a long-run strategy to be a great power. It would be a Pearl-Harbor wake up to the West. And Russia would be even more a pariah, and in fact show even more evidently how utterly powerless it is in any other way. The goal of great-power respect would not be achieved. It would only become absolutely everybody's enemy.&nbsp;</p><p><i>Update:</i></p><p>Correction. There is in fact a good deal of attention to cybersecurity risks. There is for example an&nbsp;<span style=\"font-family: Calibri;\">Office of Cybersecurity and Critical Infrastructure Protection at the Department of Treasury. There is&nbsp;</span>no need to overstate the issue. Thanks to correspondent.&nbsp;</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 14
}