{
  "title": "Debate: Are Democrats REALLY Any Better Than Republicans?",
  "itunes:title": "Debate: Are Democrats REALLY Any Better Than Republicans?",
  "pubDate": "Fri, 09 Sep 2022 05:00:49 +0000",
  "guid": "a69b7d41-33ad-4114-bfbb-9499fe95233e",
  "link": "https://thejimmydoreshow.libsyn.com/debate-are-democrats-really-any-better-than-republicans",
  "itunes:image": "",
  "description": "<p>Standup comedian, game show host and erstwhile Presidential candidate Ben Gleib stopped by The Jimmy Dore Show studio for a segment discussing his new special on YouTube, the state of comedy in the era of wokeness, the Trump phenomenon and whether there are any substantive differences between the two major American political parties.<br /> <br /> Jimmy and America’s comedian Kurt Metzger engage in a predominantly civil but sometimes heated exchange of ideas with Gleib.<br /> <br /> Plus a segment on progressives' latest opportunity to use their leverage to stop Joe Manchin's bad climate bill - and why they won't do it.<br /> <br /> Also featuring Stef Zamorano and Mike MacRae! And a phone call from George Clooney!</p>",
  "content:encoded": "<p>Standup comedian, game show host and erstwhile Presidential candidate Ben Gleib stopped by The Jimmy Dore Show studio for a segment discussing his new special on YouTube, the state of comedy in the era of wokeness, the Trump phenomenon and whether there are any substantive differences between the two major American political parties.  Jimmy and America’s comedian Kurt Metzger engage in a predominantly civil but sometimes heated exchange of ideas with Gleib.  Plus a segment on progressives' latest opportunity to use their leverage to stop Joe Manchin's bad climate bill - and why they won't do it.  Also featuring Stef Zamorano and Mike MacRae! And a phone call from George Clooney!</p>",
  "enclosure": "",
  "itunes:duration": "01:03:34",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Standup comedian, game show host and erstwhile Presidential candidate Ben Gleib stopped by The Jimmy Dore Show studio for a segment discussing his new special on YouTube, the state of comedy in the era of wokeness, the Trump phenomenon and whether...",
  "itunes:episodeType": "full",
  "itunes:summary": "Standup comedian, game show host and erstwhile Presidential candidate Ben Gleib stopped by The Jimmy Dore Show studio for a segment discussing his new special on YouTube, the state of comedy in the era of wokeness, the Trump phenomenon and whether there are any substantive differences between the two major American political parties. Jimmy and America’s comedian Kurt Metzger engage in a predominantly civil but sometimes heated exchange of ideas with Gleib. Plus a segment on progressives' latest opportunity to use their leverage to stop Joe Manchin's bad climate bill - and why they won't do it. Also featuring Stef Zamorano and Mike MacRae! And a phone call from George Clooney!"
}