{
  "title": "Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform",
  "link": "https://www.iaasiaonline.com/emersons-latest-control-system-update-lays-foundation-for-software-driven-data-centric-automation-platform/",
  "dc:creator": "Tzelong",
  "pubDate": "Fri, 28 Oct 2022 20:47:00 +0000",
  "category": [
    "Control System",
    "Industry News",
    "Recent News",
    "Emerson"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38706",
  "description": "<p>Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform DeltaV version 15 helps drive faster, easier digital transformation to accelerate IT/OT convergence, enabling easy upgrades and modernization Emerson, a global software and engineering leader, has released a new version of its DeltaV distributed control system (DCS). Version 15 of the DeltaV DCS &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/emersons-latest-control-system-update-lays-foundation-for-software-driven-data-centric-automation-platform/\"> <span class=\"screen-reader-text\">Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/emersons-latest-control-system-update-lays-foundation-for-software-driven-data-centric-automation-platform/\">Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p><strong>Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform</strong></p>\n<p><em>DeltaV version 15 helps drive faster, easier digital transformation to accelerate IT/OT convergence, enabling easy upgrades and modernization</em></p>\n<p><span id=\"more-38706\"></span></p>\n<p>Emerson, a global software and engineering leader, has released a new version of its DeltaV distributed control system (DCS). <a href=\"https://www.emerson.com/en-us/automation/brands/deltav/deltav-v15\">Version 15 of the DeltaV DCS</a> helps plants digitally transform operations through improved production optimization and enhanced operator performance. New software designed to reduce the burden of IT support and modernization spend coupled with expanded analytics will help increase flexibility and speed to market and drive operational improvements.</p>\n<p>&nbsp;</p>\n<p>Market forces and public expectation are putting more pressure than ever on manufacturers to drive improved performance and sustainability. Meeting these goals, especially in an era of personnel shortages, means making the most of available data. DeltaV version 15 expands access to critical data to provide every operator with actionable decision support. New infrastructure makes automation easier to set up and maintain while real-time analytics and an improved human machine interface (HMI) help operators improve situational awareness.</p>\n<p>&nbsp;</p>\n<p>“As the Purdue Model of control system engineering continues to flatten and more manufacturers need visibility across the enterprise, the control system plays an increasingly important role in providing real-time access to highly-contextualized, democratized data,” said Claudio Fayad, vice president of technology for Emerson’s process systems and solutions business. “Version 15 continues our focus on intuitive, software-defined architectures to help operators and engineers meet the more sustainable, efficient future of process manufacturing.”</p>\n<p>&nbsp;</p>\n<p>Project and operations teams rely on <a href=\"https://www.emerson.com/en-us/automation/control-and-safety-systems/distributed-control-systems-dcs/deltav-distributed-control-system/deltav-virtualization\">virtualization</a> to reduce the hardware and energy footprint of the automation system while simultaneously increasing its availability. DeltaV now supports a hyperconverged infrastructure (HCI) virtualization option that can be deployed in half the time of a traditional virtualization setup. DeltaV HCI is easy to scale and maintain and delivers improved performance. The HCI platform is easily expandable and scalable, allowing users to future-proof their investment, and is the foundation of the DeltaV evolution into a data-centric and software-defined system.</p>\n<p>&nbsp;</p>\n<p>Users can increase their speed to market through the new <a href=\"https://www.emerson.com/en-us/automation/control-and-safety-systems/distributed-control-systems-dcs/deltav-distributed-control-system/deltav-spectral-pat\">DeltaV Spectral Process Analytical Technology</a> (PAT). DeltaV Spectral PAT integrates two analytics solutions with the DeltaV DCS for real-time closed-loop control. This tighter control helps reduce human error and increase speed to market of quality therapies by moving plants closer to continuous manufacturing of drugs.</p>\n<p>&nbsp;</p>\n<p>Enhancements to DeltaV Live, a modern HTML5-based, built for purpose HMI, empower operators with easy access to expert insights for more effective, efficient decisions that drive better performance and help personnel of any skill level. Teams can also unlock anytime, anywhere access to digital twin simulations from across the globe with the new <a href=\"https://www.emerson.com/en-us/automation/control-and-safety-systems/distributed-control-systems-dcs/deltav-distributed-control-system/deltav-simulation-cloud\">software-as-a-service DeltaV Simulation Cloud</a>, saving time and money with subscription options and facilitating easier collaboration among experts.</p>\n<p>&nbsp;</p>\n<p>Easier, more flexible I/O integration lowers capital costs and improves modernizations. Built-in cybersecurity remains a priority, with DeltaV version 15 being ISASecure SSA Level 1 certified, providing end-to-end cybersecurity across the whole system and at all levels.<!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/emersons-latest-control-system-update-lays-foundation-for-software-driven-data-centric-automation-platform/\">Emerson’s Latest Control System Update Lays Foundation for Software-Driven, Data-Centric Automation Platform</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}