{
  "title": "#455: How To Hogwarts (OOTP 19, The Lion & The Serpent)",
  "link": "https://audioboom.com/posts/7519880",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5456,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Some of your favorite Potter actors are back to voice The Tales of Beedle The Bard audiobook</li>\n<li>MuggleCasTBT recalls a time when we discussed J.K. Rowling <a href=\"https://twitter.com/MuggleCast/status/1233208321706020865\">potentially writing</a> under a pseudonym.</li>\n<li>Muggle Mail covers becoming inspired to teach, the Hog's Head and the Room of Requirement.</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 19: The Lion & The Serpent.</li>\n<li>7-Word Summary: The Quidditch match features Draco falling out.</li>\n<li>Dumbledore's Army is going swimmingly. Harry really IS a teacher!</li>\n<li>Is Luna the best representation of inter-house cooperation at Hogwarts?</li>\n<li>We discuss whether \"Weasley Is Our King\" is bullying or just typical sportsmanship.</li>\n<li>It's insane how the staff reacted to Harry and George’s attack versus the taunting on the field, which no one tried to stop.</li>\n<li>WHERE is Dumbledore? And where was Hermione to set another fire in the stands?</li>\n<li>Isn’t there a charm for earplugs? Ron doesn’t need to hear to be a good Keeper.</li>\n<li>Honestly, is Draco any good at Quidditch?</li>\n<li>McGonagall vs. Umbridge</li>\n<li>McGonagall: the star Quidditch player - it runs in her family!</li>\n<li>On Fred: Can you lifetime ban someone for something you thought they were “about to” do? And why is this described as a lifetime ban?</li>\n<li>Is this an opportunity where Harry, if he had known Umbridge’s backstory, could have used it to his advantage.</li>\n<li>Everything is terrible this chapter, but Hagrid is back!</li>\n<li>The Umbridge Suck Count climbs to 40!</li>\n<li>The Debate returns as Andrew & Micah and Laura & Eric team up to debate Umbridge's punishments!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: Where did Hagrid have a disagreement with a vampire?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 03 Mar 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-02:/posts/7519880",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}