{
  "title": "Fast-Charging EV Batteries With Nickel Foil",
  "link": "https://spectrum.ieee.org/ev-battery-fast-charging",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-grey-box-labeled-ec-power-with-a-minus-and-plus-sticker-on-the-side-and-equipment-on-top.jpg?id=31967086&width=1245&height=700&coordinates=0%2C120%2C0%2C121\"/><br/><br/><p>Standard electric-vehicle batteries can recharge much of their range in just 10 minutes with the addition of a thin sheet of nickel inside them, a new study finds. This could provide a welcome and economically attractive alternative to expensive EVs that carry massive and massively expensive battery packs. </p><p>If faster-charging options were available, enabling the EV’s sticker price to drop substantially, some researchers suspect consumers’ EV phobia and industry dogma against “<a href=\"https://spectrum.ieee.org/quantum-sensor-range-anxiety\" target=\"_self\">range anxiety</a>“ could be overcome. </p><p>For instance, a conventional long-range EV with a 120-kilowatt-hour pack that requires an hour to recharge could be replaced with an EV with a 60-kWh pack capable of 10-minute fast charging while preserving a very similar travel time during long-distance trips.<br/></p><p class=\"pull-quote\">“Lithium-ion batteries can be very stable and safe at elevated temperatures with a simple adjustment of battery materials—[and] elevated temperatures give us fast-charging capability.”<br/>—Chao-Yang Wang, Penn State</p><p>In the new study, researchers experimented with a lithium-ion battery with a roughly 560-kilometer range when fully charged. (The battery’s energy density was 265 watt-hours-per-kilogram.) By adding an ultrathin nickel foil to its interior, they could recharge it to 70 percent in 11 minutes for a roughly 400-km range, and 75 percent in 12 minutes for a roughly 440-km range.<br/></p><p>“Our technology enables smaller, faster-charging batteries to be deployed for mass adoption of affordable electric cars,” says study senior author Chao-Yang Wang, a battery engineer at Pennsylvania State University. “When we use up 200 miles per charge, we can stop and go to the restroom, and 10 minutes later the vehicle is recharged and ready for another 200 miles of travel. So there is no range anxiety this way.”</p><p>In <a href=\"https://spectrum.ieee.org/lithiumion-battery-warms-up-operates-in-subzero-temperatures\" target=\"_self\">2016</a>, Wang and his colleagues added nickel foil to lithium-ion battery interiors to heat them and help them perform better in the freezing cold. In the new study, they similarly used nickel foil to warm EV batteries and boost their performance, a strategy they also pursued in 2021 for <a href=\"https://spectrum.ieee.org/evtol-battery\" target=\"_self\">batteries for electric flying cars</a>.</p><p>“Conventional lithium-ion batteries are developed for man-portable electronics—as such, scientists and developers are very afraid of heat,” Wang says. “We went against this traditional mind-set.”</p><p>Batteries operate best when they are hot, but not too hot. Keeping batteries consistently at precisely the right temperature has been a major challenge for battery engineers. In the past, they relied on external, bulky heating and cooling systems to regulate battery temperature, which respond slowly and waste a lot of energy, Wang says.</p><p class=\"pull-quote\">“Our work improves the current state of art by three times.”<br/>—Chao-Yang Wang, Penn State</p><p>In the new study, the scientists regulated battery temperatures from inside the batteries using nickel foil. “We needed a simple way to get the battery to an elevated temperature very quickly—within a minute, since fast charging only lasts for 10 minutes,” Wang says. “We happened to have invented an internal heating foil in our earlier work on self-heating batteries.”</p><p>All in all, they found “lithium-ion batteries can be very stable and safe at elevated temperatures with a simple adjustment of battery materials,” Wang says. This let them “enjoy the side benefit that elevated temperatures give us fast-charging capability.”</p><p>The battery lasted for more than 900 cycles when charged to 75 percent, for a range of about 402,000 km, and roughly 2,000 cycles when charged to 70 percent, for a range of about 804,000 km—or 500,000 miles. All in all, then, this performance is equivalent to a half-million mile range in which every charge is a fast charge, they say.</p><p>The scientists note their work “is quite different from current electric cars claiming 100 or 150 miles after 10 minutes of charging because these cars usually have a 600-mile cruise range, so filling energy for 150 miles is essentially equal to charging to 25 percent,” Wang says. “Our work improves the current state of art by three times.”</p><p>These findings come as California, the largest auto market in the United States, aims to effectively retire the internal combustion engine by 2035. The new fast-charging technology works for most energy-dense batteries, and permits the use of electric vehicles with relatively small, cheap batteries that can nevertheless avoid range anxiety due to fast charging, Wang says.</p><p>Wang’s lab partnered with startup <a href=\"https://ecpowergroup.com/\" target=\"_blank\">EC Power</a> to develop the technology. The company is now working to manufacture and commercialize the fast-charging battery.</p><p>In the future, “we would like to achieve charging ultrahigh energy density batteries to 80 percent in 5 minutes. This will give consumers a similar experience to filling gas,” Wang says. “We believe that we have laid the scientific foundation for this ultimate goal, and what is left is to fine-tune more stable materials and our thermal modulation strategy.”</p><p>The scientists detailed <a href=\"https://www.nature.com/articles/s41586-022-05281-0\" target=\"_blank\">their findings</a> online 12 October in the journal <em>Nature</em>.</p>",
  "pubDate": "Wed, 19 Oct 2022 15:02:19 +0000",
  "guid": "https://spectrum.ieee.org/ev-battery-fast-charging",
  "category": [
    "Lithium-ion batteries",
    "Range anxiety",
    "Rechargeable batteries",
    "Fast charging",
    "Nickel",
    "Electric vehicles"
  ],
  "dc:creator": "Charles Q. Choi",
  "media:content": ""
}