{
  "title": "S5 Ep53: Deep Focus: Energy transition in the next EU institutional cycle",
  "link": "https://audioboom.com/posts/7312117",
  "itunes:episode": 53,
  "itunes:title": "Deep Focus: Energy transition in the next EU institutional cycle",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 965,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>When the dust settles after the recent European elections, and as the new Commission takes office, the problem of climate change - and its accompanying policy challenges - will remain one of the EU's chief agenda items.<br>\n<br>\nOne significant facet is the transition of Europe's energy generation to more renewable sources. The EU has to find a way to decarbonise particular sectors much more quickly than has been managed so far, while allowing for and managing the distributional consequences of such policies for the continent's population.<br>\n<br>\nSimone Tagliapietra has co-written a research paper on energy transition with his Bruegel colleague Georg Zachmann, as well as Jean-Michel Glachant, director of the Florence School of Regulation; Pedro Linares, professor at Universidad Pontificia Comillas; Andreas Loeschel, professor at the University of Muenster; and Ottmar Edenhofer, director and chief economist at the Potsdam Institute for Climate Impact Research.<br>\n<br>\nIf you would like to read more on this topic, we suggest Simone Tagliapietra's article the geopolitical implications of the global energy transition. Equally, we recommend an episode of our Backstage podcast series, where the same scholar hosts a discussion on the next decade of energy transition in Europe with Sir Philip Lowe, former director general at the European Commission, DG ENER, and Alberto Pototschnig, director at the European Agency for the Cooperation of Energy Regulators (ACER).<br>\n<br>\n\n</div>\n",
  "itunes:summary": "Bruegel fellow Simone Tagliapietra speaks to Sean Gibson in this instalment of 'The Sound of Economics', on the matter of the European energy transition and how the EU should proceed in the new institutional cycle.",
  "pubDate": "Wed, 10 Jul 2019 09:47:09 +0000",
  "guid": "tag:audioboom.com,2019-07-10:/posts/7312117",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}