{
  "title": "To-Do Lists or Kanban: Which Planning Tool works Better?",
  "description": "<p>In this blog post, you will find a comparison of the planning tools Trello and Todoist. After using both tools for over a year, I finally selected one of the tools for my own workflow and I will show you the reasons why I switched from Todoist to Trello.</p><h2 id=\"introduction\">Introduction</h2>",
  "link": "https://www.data-blogger.com/to-do-lists-or-kanban-which-planning-tool-works-better/",
  "guid": "622d009c092f120001a24e3f",
  "category": "Productivity",
  "dc:creator": "Kevin Jacobs",
  "pubDate": "Sat, 20 Nov 2021 00:00:00 GMT",
  "media:content": "",
  "content:encoded": "<img src=\"https://images.unsplash.com/photo-1484480974693-6ca0a78fb36b?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHRvZG98ZW58MHx8fHwxNjQ3MTE2NDcz&ixlib=rb-1.2.1&q=80&w=2000\" alt=\"To-Do Lists or Kanban: Which Planning Tool works Better?\"><p>In this blog post, you will find a comparison of the planning tools Trello and Todoist. After using both tools for over a year, I finally selected one of the tools for my own workflow and I will show you the reasons why I switched from Todoist to Trello.</p><h2 id=\"introduction\">Introduction</h2><p>I know that planning my own project and executing on the planning is a bottleneck for me. I learned this the hard way while I was writing my Master&#x2019;s Thesis. Since that time, I read and experimented a lot on Time Management. I started with Trello (an app with boards and lists of task), switched over to Todoist (a todo list app) and finally selected one of them as a clear winner.</p><h2 id=\"capturing-all-tasks-and-why-it-was-unhealthy\">Capturing All Tasks and Why It Was Unhealthy</h2><p>One of the first lessons that I learned was that I will constantly think of tasks when I don&#x2019;t write them down. That is why I started with Todoist. Just one place to capture all your tasks. Things went fine in the beginning, but after a while, the tasks accumulated quickly and I got overwhelmed with the things that needed to be done. This lead to decision fatigue: it was getting harder and harder for me to select which task to work on next since the number of tasks was growing and growing. I tried to implement weekly sessions in which I would clean the enormous task list and tried to organize it into projects, but not of these methods worked for me. Besides that, it felt like a failure every time, since I could not keep up with the task list.</p><h2 id=\"limiting-the-tasks-with-kanban\">Limiting The Tasks with Kanban</h2><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://www.data-blogger.com/wp-content/uploads/2021/11/Screenshot-2021-11-20-at-08.24.41.jpg.webp\" class=\"kg-image\" alt=\"To-Do Lists or Kanban: Which Planning Tool works Better?\" loading=\"lazy\"><figcaption>My Kanban board in Trello.</figcaption></figure><p>What I was looking for, was a way to limit the number of tasks. This can be done in a Kanban board and Trello is one tool in which a Kanban board can be implemented. With Kanban, all your tasks will go through several columns. First, you commit to a set of tasks on a weekly basis (notice that you can experiment with the duration of one sprint) and put them in a &#x201C;commit&#x201D; column. Then, you will focus on one task and one task only and move this task from the list of committed tasks to the &#x201C;in progress&#x201D; column. Once you are done with the task, you will put the task in the &#x201C;done&#x201D; column. And here comes the trick: you can limit the number of items per column. For me, after trying out different settings, it seemed to work when I set a low limit on the number of items in the &#x201C;commit&#x201D; column. Actually, I get way more done in a week than this limit, but with this setting, it feels like a success after going through the tasks in the &#x201C;commit&#x201D; column.</p><p>In Trello, I have used several &#x201C;Power Ups&#x201D; which automatically help me with my workflow:</p><ul><li>The &#x201C;List Limits&#x201D; power-up for limiting the amount of tasks on a list: your list will become yellow if you go over the limit.</li><li>The &#x201C;Card Aging&#x201D; power-up: this power-up will fade out old cards. This will give visual cues on which tasks might need your attention.</li><li>The &#x201C;Flash&#x201D; power-up: this power up will give you statistics related to Kanban, like the lead time. It will also track the workflow of a task.</li></ul><h2 id=\"trimming-down-the-boards\">Trimming down the Boards</h2><p>After a while, I was experimenting with multiple boards. One personal board, one for my blog and one for my job. This approach didn&#x2019;t work for me. In fact, every board added to the total number of tasks that needed to be done throughout the week. And therefore, it was harder to keep up with all the tasks and it felt as a failure if I didn&#x2019;t complete the tasks on one of the boards. So I decided to stick with one board.</p><h2 id=\"organizing-the-backlog\">Organizing the Backlog</h2><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://www.data-blogger.com/wp-content/uploads/2021/11/Screenshot-2021-11-20-at-08.17.48-1024x373.png.webp\" class=\"kg-image\" alt=\"To-Do Lists or Kanban: Which Planning Tool works Better?\" loading=\"lazy\"><figcaption>The weekly review in Notion.</figcaption></figure><p>So, how do you decide what tasks will end up in the &#x201C;commit&#x201D; column? For this question, I created a weekly review document in Notion with a simple template in which I will review the previous week.</p><p>Besides the weekly review, I also have a planning document with a list of all ongoing projects and the final goal for each of the projects. Every week, together with the weekly review, I will decide which next actions I need to take in order to progress a specific project. I am able to prioritize the projects once a week and I get a clear overview of where I am at. For long term planning, I use a Work Breakdown Structure and Gantt Charts, but for most of the projects, a simple single place to store the end goal is sufficient for me.</p><figure class=\"kg-card kg-image-card kg-card-hascaption\"><img src=\"https://www.data-blogger.com/wp-content/uploads/2021/11/Screenshot-2021-11-20-at-08.14.41-1024x394.png.webp\" class=\"kg-image\" alt=\"To-Do Lists or Kanban: Which Planning Tool works Better?\" loading=\"lazy\"><figcaption>My project planning in Notion.</figcaption></figure><h2 id=\"conclusion\">Conclusion</h2><p>Todoist is great to capture all your tasks, but in order to avoid being overwhelmed by the tasks, a Kanban board implemented in a tool such as Trello might be useful.</p><h2 id=\"helpful-resources\">Helpful resources</h2><p>Below is a list of resources that I found helpful. If you have any additions, please share them with the rest of us in the comment section below.</p><ul><li><a href=\"https://www.youtube.com/watch?v=Pv0dvPfiINw&t=568s\" rel=\"noreferrer noopener\">Setup Agile Workflow in PhD | Postit stickers and Trello</a> &#x2013; A YouTube video by PhDCoffeeTime</li><li><a href=\"https://jamesclear.com/atomic-habits\">Atomic Habits &#x2013; James Clear (book)</a></li><li><a href=\"https://gettingthingsdone.com/\">Getting Things Done &#x2013; David Allen (book)</a></li><li>Eat That Frog! &#x2013; Brian Tracey (book)</li></ul>"
}