{
  "id": "https://bibleinoneyear.org/en/youth/72",
  "title": "Day 72: Love Boundaries",
  "description": "Proverbs 7:2–4, Leviticus 27:34, Luke 1:5–17.  Like the rules of football, they do not stop the enjoyment of the game  Rather, they enable the game of life to be enjoyed to the full",
  "pubDate": "Sun, 13 Mar 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/72/",
  "itunes:duration": "12:30",
  "guid": "enyouth13032022-72",
  "length": 750.65,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 72: Love Boundaries",
  "itunes:subtitle": "Proverbs 7:2–4, Leviticus 27:34, Luke 1:5–17.  Like the rules of football, they do not stop the enjoyment of the game  Rather, they enable the game of life to be enjoyed to the full",
  "itunes:summary": "I remember, years ago, a football match that had been arranged involving twenty-two young boys (including one of my sons, aged eight at the time). A friend of mine, Andy, was going to referee. Unfortunately, by 2.30 pm he had not turned up. The boys could wait no longer.\nI was press-ganged into being the substitute referee. But, I had no whistle, there were no markings for the boundaries of the pitch and I did not know the rules nearly as well as some of the boys.\nThe game soon descended into complete chaos. Some shouted that the ball was in. Others said that it was out. I wasn’t at all sure, so I let things run. Then the fouls started. Some cried, ‘Foul.’ Others said, ‘No foul.’ I didn’t know who was right. So I let them play on. Then people began to get hurt. By the time Andy arrived, there were three boys lying ‘injured’ on the ground and all the rest were shouting, mainly at me!\nBut the moment Andy arrived, he blew his whistle, arranged the teams, told them where the boundaries were and had them under complete control. The boys then enjoyed a great game of football.\nWere the boys freer without the rules, or were they in fact less free? Without any effective authority, they could do exactly what they wanted. But people were confused and hurt. They much preferred it when the game was played according to the rules. Then they were free to enjoy the game. The rules of football are not designed to take away the fun of the game. They are designed to enable the game to be enjoyed to the full.\nGod’s ‘rules’ are his boundaries for life, given out of his love for us. His boundaries are not designed to restrict our freedom but rather to give us freedom. Like the rules of football, they do not stop the enjoyment of the game. Rather, they enable the game of life to be enjoyed to the full.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 437
}