{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-8414781811962840090",
  "published": "2022-06-03T15:03:00.002-04:00",
  "updated": "2022-06-03T15:10:41.523-04:00",
  "title": "Announcing the winners of the 2021 GCP VRP Prize",
  "content": "<span class=\"byline-author\">Posted by Harshvardhan Sharma, Information Security Engineer, Google&nbsp;<br /></span><br />2021 was another <a href=\"https://security.googleblog.com/2022/02/vulnerability-reward-program-2021-year.html\">record-breaking year</a> for our Vulnerability Rewards Program (VRP). We paid a total of $8.7 million in rewards, our highest amount yet. 2021 saw some amazing work from the security research community. It is worth noting that a significant portion of the reports we received were for findings in <a href=\"http://cloud.google.com\">Google Cloud Platform (GCP)</a> products. It is heartening to see an increasing number of talented researchers getting involved in cloud security.<br /><br />We first <a href=\"https://security.googleblog.com/2019/08/awarding-google-cloud-vulnerability.html\">announced</a> the GCP VRP Prize in 2019 to encourage security researchers to focus on the security of GCP, in turn helping us make GCP more secure for our users, customers, and the internet at large. Even 3 years into the program, the submissions we are getting never cease to amaze us. After careful evaluation of the submissions, we are excited to announce the 2021 winners:<br /><br /><b>First Prize</b>, $133,337: Sebastian Lutz for the report and write-up <a href=\"https://www.seblu.de/2021/12/iap-bypass.html\">Bypassing Identity-Aware Proxy</a>. Sebastian's excellent write-up outlines how he found a bug in Identity-Aware Proxy (IAP) which an attacker could have exploited to gain access to a user's IAP-protected resources by making them visit an attacker-controlled URL and stealing their IAP auth token.<br /><br /><b>Second Prize</b>, $73,331: Imre Rad for the report and write-up <a href=\"https://github.com/irsl/gcp-dhcp-takeover-code-exec\">GCE VM takeover via DHCP flood</a>. The flaw described in the write-up would have allowed an attacker to gain access to a Google Compute Engine VM by sending malicious DHCP packets to the VM and impersonating the GCE metadata server.<br /><br /><b>Third Prize</b>, $73,331: Mike Brancato for the report and write-up <a href=\"https://mbrancato.github.io/2021/12/28/rce-dataflow.html\">Remote Code Execution in Google Cloud Dataflow</a>. Mike's write-up describes how he discovered that Dataflow nodes were exposing an unauthenticated Java JMX port and how an attacker could have exploited this to run arbitrary commands on the VM under some configurations.<br /><br /><b>Fourth Prize</b>, $31,337: Imre Rad for the write-up <a href=\"https://irsl.medium.com/the-speckle-umbrella-story-part-2-fcc0193614ea\">The Speckle Umbrella story — part 2</a> which details multiple vulnerabilities that Imre found in Cloud SQL.<br /><br /><i>(Remember, you can make multiple submissions for the GCP VRP Prize and be eligible for more than one prize!)</i><br /><br /><b>Fifth Prize</b>, $1,001: Anthony Weems for the report and write-up <a href=\"https://lf.lc/vrp/203177829/\">Remote code execution in Managed Anthos Service Mesh control plane</a>. Anthony found a bug in Managed Anthos Service Mesh and came up with a clever exploit to execute arbitrary commands authenticated as a Google-managed per-project service account.<br /><br /><b>Sixth Prize</b>, $1,000: Ademar Nowasky Junior for the report and write-up <a href=\"https://docs.google.com/document/d/1-TTCS6fS6kvFUkoJmX4Udr-czQ79lSUVXiWsiAED_bs/edit#\">Command Injection in Google Cloud Shell</a>. Ademar found a way to bypass some of the validation checks done by Cloud Shell. This would have allowed an attacker to run arbitrary commands in a user's Cloud Shell session by making them visit a maliciously crafted link.<br /><br />Congratulations to all the winners!<br /><br />Here's a video that with more details about each of the winning submissions:<div><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><iframe allowfullscreen=\"\" class=\"BLOG_video_class\" height=\"338\" src=\"https://www.youtube.com/embed/GvO2Xtx8p9w\" width=\"588\" youtube-src-id=\"GvO2Xtx8p9w\"></iframe></div><br /><div><div><br /></div><div><h2 style=\"text-align: left;\"><b>New Details About 2022 GCP VRP</b></h2><br />We will pay out a total of $313,337 to the top seven submissions in the 2022 edition of the GCP VRP Prize. Individual prize amounts will be as follows:<br /><br /><ul style=\"text-align: left;\"><li>1st prize: $133,337</li><li>2nd prize: $73,331</li><li>3rd prize: $31,337</li><li>4th prize: $31,311</li><li>5th prize: $17,311</li><li>6th prize: $13,373</li><li>7th prize: $13,337</li></ul><br />If you are a security researcher, here's how you can enter the competition for the GCP VRP Prize 2022:<br /><ul style=\"text-align: left;\"><li>Find a vulnerability in a GCP product (check out <a href=\"https://cloud.google.com/free/docs/gcp-free-tier\">Google Cloud Free Program</a> to get started).</li><li>Report it to <a href=\"http://bughunters.google.com\">bughunters.google.com</a>. Your bug needs to be awarded a financial reward  to be eligible for the GCP VRP Prize (the GCP VRP Prize money will be in addition to what you received for your bug!).</li><li>Create a public write-up describing your vulnerability report. One of the goals behind the GCP VRP Prize is to promote open research into cloud security.</li><li>Submit it <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSebVBNu4_1s4b1dmGv5Kc3T_D_lOAH6rQ6ZY3_ncFzcswe9LA/viewform?usp=sf_link\">here</a>.</li></ul>Make sure to submit your VRP reports and write-ups before <b>January 15, 2023 at 23:59 PT.</b> VRP reports which were submitted in preceding years but fixed only in 2022 are also eligible. You can check out the official rules for the prize <a href=\"https://static.googleusercontent.com/media/www.google.com/en//about/appsecurity/reward-program/GCP_PRIZE_2022.pdf\">here</a>. Good luck!<div><span id=\"docs-internal-guid-d4fc47ae-7fff-fd30-c46c-6ba8772382b7\"><div><span style=\"font-family: Arial; font-size: 11pt; font-variant-east-asian: normal; font-variant-numeric: normal; vertical-align: baseline; white-space: pre-wrap;\"><br /></span></div></span></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Unknown",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}