{
  "id": "tag:theatlantic.com,2021:39-620171",
  "content": "<figure><iframe frameborder=\"0\" src=\"https://audm.herokuapp.com/player-embed/?pub=atlantic&amp;articleID=men-killing-americas-newspapers\" style=\"width: 100%; height: 90px; margin-bottom: 0; margin-top: 0;\"></iframe></figure><p class=\"dropcap\"><span class=\"smallcaps\">The Tribune Tower </span>rises above the streets of downtown Chicago in a majestic snarl of Gothic spires and flying buttresses that were designed to exude power and prestige. When plans for the building were announced in 1922, Colonel Robert R. McCormick, the longtime owner of the <i>Chicago Tribune</i>, said he wanted to erect “the world’s most beautiful office building” for his beloved newspaper. The best architects of the era were invited to submit designs; lofty quotes about the Fourth Estate were selected to adorn the lobby. Prior to the building’s completion, McCormick directed his foreign correspondents to collect “fragments” of various historical sites—a brick from the Great Wall of China, an emblem from St. Peter’s Basilica—and send them back to be embedded in the tower’s facade. The final product, completed in 1925, was an architectural spectacle unlike anything the city had seen before—“romance in stone and steel,” as one writer described it. A century later, the Tribune Tower has retained its grandeur. It has not, however, retained the <i>Chicago Tribune</i>.</p><p>To find the paper’s current headquarters one afternoon in late June, I took a cab across town to an industrial block west of the river. After a long walk down a windowless hallway lined with cinder-block walls, I got in an elevator, which deposited me near a modest bank of desks near the printing press. The scene was somehow even grimmer than I’d imagined. Here was one of America’s most storied newspapers—a publication that had endorsed Abraham Lincoln and scooped the Treaty of Versailles, that had toppled political bosses and tangled with crooked mayors and collected dozens of Pulitzer Prizes—reduced to a newsroom the size of a Chipotle.</p><p>Spend some time around the shell-shocked journalists at the <i>Tribune</i> these days, and you’ll hear the same question over and over: <i>How did it come to this? </i>On the surface, the answer might seem obvious. Craigslist killed the Classified section, Google and Facebook swallowed up the ad market, and a procession of hapless newspaper owners failed to adapt to the digital-media age, making obsolescence inevitable. This is the story we’ve been telling for decades about the dying local-news industry, and it’s not without truth. But what’s happening in Chicago is different.</p><p>In May, the <i>Tribune </i>was acquired by Alden Global Capital, a secretive hedge fund that has quickly, and with remarkable ease, become one of the largest newspaper operators in the country. The new owners did not fly to Chicago to address the staff, nor did they bother with paeans to the vital civic role of journalism. Instead, they gutted the place.</p><p>Two days after the deal was finalized, Alden announced an aggressive round of buyouts. In the ensuing exodus, the paper lost the Metro columnist who had championed the occupants of a troubled public-housing complex, and the editor who maintained a homicide database that the police couldn’t manipulate, and the photographer who had produced beautiful portraits of the state’s undocumented immigrants, and the investigative reporter who’d helped expose the governor’s offshore shell companies. When it was over, a quarter of the newsroom was gone.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>The hollowing-out of the <i>Chicago Tribune</i> was noted in the national press, of course. There were sober op-eds and lamentations on Twitter and expressions of disappointment by professors of journalism. But outside the industry, few seemed to notice. Meanwhile, the <i>Tribune</i>’s remaining staff, which had been spread thin even before Alden came along, struggled to perform the newspaper’s most basic functions. After a powerful Illinois state legislator resigned amid bribery allegations, the paper didn’t have a reporter in Springfield to follow the resulting scandal. And when Chicago suffered a brutal summer crime wave, the paper had no one on the night shift to listen to the police scanner.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/politics/archive/2021/10/gannett-local-newspaper-hawk-eye-iowa/619847/?utm_source=feed\">Read: What we lost when Gannett came to town</a>]</i></p><p>As the months passed, things kept getting worse. Morale tanked; reporters burned out. The editor in chief mysteriously resigned, and managers scrambled to deal with the cuts. Some in the city started to wonder if the paper was even worth saving. “It makes me profoundly sad to think about what the <i>Trib</i> was, what it is, and what it’s likely to become,” says David Axelrod, who was a reporter at the paper before becoming an adviser to Barack Obama. Through it all, the owners maintained their ruthless silence—spurning interview requests and declining to articulate their plans for the paper. Longtime <i>Tribune</i> staffers had seen their share of bad corporate overlords, but this felt more calculated, more sinister.</p><figure class=\"full-width\"><img alt='A stack of Chicago Tribune newspapers, tied together as a bundle with yellow police tape that has black text \"Crime Scene Do Not Cross\"' height=\"928\" src=\"https://cdn.theatlantic.com/media/img/posts/2021/10/WEL_Coppins_AldenStack/7e2ac14d2.jpg\" width=\"928\">\n<figcaption class=\"credit\">Ricardo Rey</figcaption>\n</figure><p>“It’s not as if the <i>Tribune</i> is just withering on the vine despite the best efforts of the gardeners,” Charlie Johnson, a former Metro reporter, told me after the latest round of buyouts this summer. “It’s being snuffed out, quarter after quarter after quarter.” We were sitting in a coffee shop in Logan Square, and he was still struggling to make sense of what had happened. The <i>Tribune</i> had been profitable when Alden took over. The paper had weathered a decade and a half of mismanagement and declining revenues and layoffs, and had finally achieved a kind of stability. Now it might be facing extinction.</p><p>“They call Alden a vulture hedge fund, and I think that’s honestly a misnomer,” Johnson said. “A vulture doesn’t hold a wounded animal’s head underwater. This is predatory.”</p><p class=\"dropcap\"><span class=\"smallcaps\">When Alden first </span>started buying newspapers, at the tail end of the Great Recession, the industry responded with cautious optimism. These were not exactly boom times for newspapers, after all—at least <i>someone </i>wanted to buy them. Maybe this obscure hedge fund had a plan. <a href=\"https://www.poynter.org/reporting-editing/2011/randall-smith-alden-global-capital-newspaper-companies/\">One early article</a>, in the trade publication <i>Poynter</i>, suggested that Alden’s interest in the local-news business could be seen as “flattering” and quoted the owner of <i>The Denver Post </i>as saying he had “enormous respect” for the firm. Reading these stories now has a certain horror-movie quality: You want to somehow warn the unwitting victims of what’s about to happen.</p><p>Of course, it’s easy to romanticize past eras of journalism. The families that used to own the bulk of America’s local newspapers—the Bonfilses of Denver, the Chandlers of Los Angeles—were never perfect stewards. They could be vain, bumbling, even corrupt. At their worst, they used their papers to maintain oppressive social hierarchies. But most of them also had a stake in the communities their papers served, which meant that, if nothing else, their egos were wrapped up in putting out a respectable product.</p><p>The 21st century has seen many of these generational owners flee the industry, to devastating effect. In the past 15 years, more than a quarter of American newspapers <a href=\"https://www.poynter.org/locally/2020/unc-news-deserts-report-2020/\">have gone out of business</a>. Those that have survived are smaller, weaker, and more vulnerable to acquisition. Today, half of all daily newspapers in the U.S. are controlled by financial firms, according to <a href=\"https://www.ft.com/content/5c22075c-f1af-431d-bf39-becf9c54758b\">an analysis</a> by the <i>Financial Times</i>, and the number is almost certain to grow.</p><p>What threatens local newspapers now is not just digital disruption or abstract market forces. They’re being targeted by investors who have figured out how to get rich by strip-mining local-news outfits. The model is simple: Gut the staff, <a href=\"https://www.washingtonpost.com/business/economy/a-hedge-funds-mercenary-strategy-buy-newspapers-slash-jobs-sell-the-buildings/2019/02/11/f2c0c78a-1f59-11e9-8e21-59a09ff1e2a1_story.html\">sell the real estate</a>, <a href=\"https://www.thedailybeast.com/the-gordon-gekko-of-newspapers-a-vulture-capitalist-kneecapping-journalists\">jack up subscription prices</a>, and wring as much cash as possible out of the enterprise until eventually enough readers cancel their subscriptions that the paper folds, or is reduced to a desiccated husk of its former self.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2019/02/who-is-going-to-save-local-news/583696/?utm_source=feed\">John Temple: My newspaper died 10 years ago. I’m worried the worst is yet to come.</a>]</i></p><p>The men who devised this model are Randall Smith and Heath Freeman, the co-founders of Alden Global Capital. Since they bought their first newspapers a decade ago, no one has been more mercenary or less interested in pretending to care about their publications’ long-term health. Researchers at the University of North Carolina found that <a href=\"https://www.cislm.org/wp-content/uploads/2018/10/The-Expanding-News-Desert-10_14-Web.pdf\">Alden-owned newspapers have cut their staff at twice the rate of their competitors</a>; not coincidentally, circulation has fallen faster too, according to Ken Doctor, a news-industry analyst who reviewed data from some of the papers. That might sound like a losing formula, but these papers don’t have to become sustainable businesses for Smith and Freeman to make money.</p><p>With aggressive cost-cutting, Alden can operate its newspapers at a profit for years while turning out a steadily worse product, indifferent to the subscribers it’s alienating. “It’s the meanness and the elegance of the capitalist marketplace brought to newspapers,” Doctor told me. So far, Alden has limited its closures primarily to weekly newspapers, but Doctor argues it’s only a matter of time before the firm starts shutting down its dailies as well.</p><p>This investment strategy does not come without social consequences. When a local newspaper vanishes, research shows, it tends to correspond with <a href=\"https://moody.utexas.edu/sites/default/files/Strauss_Research_Newspaper_Decline_2019-11-Jennings.pdf\">lower voter turnout</a>, increased polarization, and a general <a href=\"https://www.tandfonline.com/doi/full/10.1080/10584609.2012.762817#.VMFGQy711gh\">erosion of civic engagement</a>. <a href=\"https://citap.unc.edu/wp-content/uploads/sites/20665/2020/12/Local-News-Platforms-and-Mis-Disinformation.pdf\">Misinformation proliferates</a>. City budgets balloon, along with corruption and dysfunction. The consequences can influence national politics as well; <a href=\"https://www.politico.com/story/2018/04/08/news-subscriptions-decline-donald-trump-voters-505605\">an analysis by <i>Politico</i></a> found that Donald Trump performed best during the 2016 election in places with limited access to local news.</p><p>With its acquisition of Tribune Publishing earlier this year, Alden now controls more than 200 newspapers, including some of the country’s most famous and influential: the <i>Chicago Tribune</i>, <i>The</i> <i>Baltimore Sun</i>, the New York<i> Daily News</i>. It is the nation’s second-largest newspaper owner by circulation. Some in the industry say they wouldn’t be surprised if Smith and Freeman end up becoming the biggest newspaper moguls in U.S. history.</p><p>They are also defined by an obsessive secrecy. Alden’s website contains no information beyond the firm’s name, and its list of investors is kept strictly confidential. When lawmakers pressed for details last year on who funds Alden, the company replied that “there may be certain legal entities and organizational structures formed outside of the United States.”</p><p>Smith, a reclusive Palm Beach septuagenarian, hasn’t granted a press interview since the 1980s. Freeman, his 41-year-old protégé and the president of the firm, would be unrecognizable in most of the newsrooms he owns. For two men who employ thousands of journalists, remarkably little is known about them.</p><p class=\"dropcap\"><span class=\"smallcaps\">If you want </span>to know what it’s like when Alden Capital buys your local newspaper, you could look to Montgomery County, Pennsylvania, where coverage of local elections in more than a dozen communities <a href=\"https://www.nytimes.com/2020/07/10/us/alden-global-capital-pottstown-mercury.html\">falls to a single reporter</a> working out of his attic and emailing questionnaires to candidates. You could look to Oakland, California, where the <i>East Bay Times</i> <a href=\"https://www.poynter.org/business-work/2017/layoffs-come-to-the-east-bay-times-after-pulitzer-win/\">laid off 20 people</a> one week after the paper won a Pulitzer. Or to nearby Monterey, where the former <i>Herald</i> reporter Julie Reynolds says staffers were pushed to stop writing investigative features so they could produce multiple stories a day. Or to Denver, where the <i>Post</i>’s staff was cut by two-thirds, evicted from its newsroom, and relocated to a plant in an area with poor air quality, where some employees <a href=\"https://www.washingtonpost.com/lifestyle/media/heath-freeman-is-the-hedge-fund-guy-who-says-he-wants-to-save-local-news-somehow-no-ones-buying-it/2020/06/11/9850a15c-884a-11ea-8ac1-bfb250876b7a_story.html\">developed breathing problems</a>.</p><p>But maybe the clearest illustration is in Vallejo, California, a city of about 120,000 people 30 miles north of San Francisco. When John Glidden first joined the <i>Vallejo Times-Herald</i>, in 2014, it had a staff of about a dozen reporters, editors, and photographers. Glidden, then a mild-mannered 30-year-old, had come to journalism later in life than most and was eager to prove himself. He started as a general-assignment reporter, covering local crime and community events. The pay was terrible and the work was not glamorous, but Glidden loved his job. A native of Vallejo, he was proud to work for his hometown paper. It felt important.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/07/constitution-doesnt-work-without-local-news/614056/?utm_source=feed\">Margaret Sullivan: The Constitution doesn’t work without local news</a>]</i></p><p>A month after he started, one of his fellow reporters left and Glidden was asked to start covering schools in addition to his other responsibilities. When the city-hall reporter left a few months later, he picked up that beat too. Glidden had heard rumblings about the paper’s owners when he first took the job, but he hadn’t paid much attention. Now he was feeling the effects of their management.</p><p>It turned out that those owners—New York hedge funders whom Glidden took to calling “the lizard people”—were laser-focused on increasing the paper’s profit margins. Year after year, the executives from Alden would order new budget cuts, and Glidden would end up with fewer co-workers and more work. Eventually he was the only news reporter left on staff, charged with covering the city’s police, schools, government, courts, hospitals, and businesses. “It played with my mind a little bit,” Glidden told me. “I felt like a terrible reporter because I couldn’t get to everything.”</p><p>He gained 100 pounds and started grinding his teeth at night. He used his own money to pull court records, and went years without going on a vacation. Tips that he would never have time to investigate piled up on a legal pad he kept at his desk. At one point, he told me, the city’s entire civil-service commission was abruptly fired without explanation; his sources told him something fishy was going on, but he knew he’d never be able to run down the story.</p><p>Meanwhile, with few newsroom jobs left to eliminate, Alden continued to find creative ways to cut costs. The paper’s printing was moved to a plant more than 100 miles outside town, Glidden told me, which meant that the news arriving on subscribers’ doorsteps each morning was often more than 24 hours old. The “newsroom” was moved to a single room rented from the local chamber of commerce. Layout design was outsourced to freelancers in the Philippines.</p><p>Frustrated and worn out, Glidden broke down one day last spring when a reporter from <i>The</i> <i>Washington Post </i>called. She was writing about Alden’s growing newspaper empire, and wanted to know what it was like to be the last news reporter in town. “It hurts to see the paper like this,” <a href=\"https://www.washingtonpost.com/lifestyle/media/heath-freeman-is-the-hedge-fund-guy-who-says-he-wants-to-save-local-news-somehow-no-ones-buying-it/2020/06/11/9850a15c-884a-11ea-8ac1-bfb250876b7a_story.html\">he told her</a>. “Vallejo deserves better.” A few weeks after the story came out, he was fired. His editor cited a supposed journalistic infraction (Glidden had reported the resignation of a school superintendent before an agreed-upon embargo). But Glidden felt sure he knew the real reason: Alden wanted him gone.</p><figure><img alt='Clear zip-lock bag with forensic \"Evidence\" label that contains a crumpled page from a newspaper' height=\"831\" src=\"https://cdn.theatlantic.com/media/img/posts/2021/10/WEL_Coppins_AldenBag/1cb90fa68.jpg\" width=\"665\">\n<figcaption class=\"credit\">Ricardo Rey</figcaption>\n</figure><p class=\"dropcap\"><span class=\"smallcaps\">The story of </span>Alden Capital begins on the set of a 1960s TV game show called <i>Dream House</i>. A young man named Randall Duncan Smith—Randy for short—stands next to his wife, Kathryn, answering quick-fire trivia questions in front of a live studio audience. The show’s premise pits two couples against each other for the chance to win a home. When the Smiths win, they pass on the house and take the cash prize instead—a $20,000 haul that Randy will eventually use to seed a small trading firm he calls R.D. Smith &amp; Company.</p><p>A Cornell grad with an M.B.A., Randy is on a partner track at Bear Stearns, where he’s poised to make a comfortable fortune simply by climbing the ladder. But he has a big idea: He believes there’s serious money to be made in buying troubled companies, steering them into bankruptcy, and then selling them off in parts. The term <i>vulture capitalism</i> hasn’t been invented yet, but Randy will come to be known as a pioneer in the field. He scores big with a bankrupt aerospace manufacturer, and again with a Dallas-based drilling company.</p><p>By the 1980s, this strategy has made Randy luxuriously wealthy—vacations in the French Riviera, a family compound outside New York City—and he has begun to school his children on the wonders of capitalism. He teaches his 8-year-old son, Caleb, to make trades on a Quotron computer, and imparts the value of delayed gratification by reportedly postponing his family’s Christmas so that he can use all their available cash to buy stocks at lower prices in December. Caleb will later recall, in <a href=\"https://www.dmagazine.com/publications/d-ceo/2011/march/is-spire-realtys-caleb-smith-the-next-trammell-crow/\">an interview</a> with <i>D Magazine</i>, asking his dad why he works so hard.</p><p>“It’s a game,” Randy explains to his son.</p><p>“How do you know who wins?” the boy asks.</p><p>“Whoever dies with the most money.”</p><p>Even in the “greed is good” climate of the era, Randy is a polarizing character on Wall Street. When <i>The</i> <i>New York Times </i><a href=\"https://www.nytimes.com/1991/03/29/business/company-news-bottom-fishing-with-rd-smith.html\">profiles him in 1991</a>, it notes that he excels at “profiting from other people’s misery” and quotes a parade of disgruntled clients and partners. “The one central theme,” the <i>Times </i>reports, “seems to be that Smith and its web of affiliates are out, first and foremost, for themselves.” If this reputation bothers Randy and his colleagues, they don’t let on: For a while, <a href=\"https://www.villagevoice.com/1999/04/20/vulture-press/\">according to <i>The Village Voice</i></a>, his firm proudly hangs a painting of a vulture in its lobby.</p><p>Around this time, Randy becomes preoccupied with privacy. He stops talking to the press, refuses to be photographed, and rarely appears in public. One acquaintance tells <i>The</i> <i>Village Voice</i> that “he’s the kind of guy who divests himself every couple of years” to avoid ending up on lists of the world’s richest people.</p><p>Most of his investments are defined by a cold pragmatism, but he takes a more personal interest in the media sector. With his own money, he helps his brother launch the <i>New York Press</i>, a free alt-weekly in Manhattan. Russ Smith is a puckish libertarian whose self-described “contempt” for the journalistic class animates the pages of the publication. “I’m repulsed by the incestuous world of New York journalism,” <a href=\"https://nymag.com/nymetro/news/media/columns/medialife/151/\">he tells <i>New York</i> magazine</a>. He writes a weekly column called “Mugger” that savages the city’s journalists by name and frequently runs to 10,000 words.</p><p>Randy claims no editorial role in the <i>Press</i>, and his investment in the project—which has little chance of producing the kind of return he’s accustomed to—could be chalked up to brotherly loyalty. But years later, when Randy relocates to Palm Beach and becomes a major donor to Donald Trump’s presidential campaign, it will make a certain amount of sense that his earliest known media investment was conceived as a giant middle finger to the journalistic establishment.</p><p class=\"dropcap\"><span class=\"smallcaps\">How exactly Randall Smith</span> chose Heath Freeman as his protégé is a matter of speculation among those who have worked for the two of them. In conversations with former Alden employees, I heard repeatedly that their partnership seemed to transcend business. “They had a father-figure relationship,” one told me. “They were very tight.” Freeman has resisted elaborating on his relationship with Smith, saying simply that they were family friends before going into business together.</p><p>Freeman’s father, Brian, was a successful investment banker who specialized in making deals on behalf of labor unions. After serving in the Carter administration’s Treasury Department, Brian became widely known—and feared—in the ’80s for his hard-line negotiating style. “I sort of bully people around to get stuff done,” <a href=\"https://www.washingtonpost.com/archive/business/1985/09/22/the-unions-heavyweight-deal-maker/8a7b1faa-f468-47f6-bdb3-a3b8b2476031/\">he boasted</a> to <i>The</i> <i>Washington Post </i>in 1985. The details of how Smith got to know him are opaque, but the resulting loyalty was evident.</p><p>After Brian took his own life, in 2001, Smith became a mentor and confidant to Heath, who was in college at the time of his father’s death. Several years later, when Heath was still in his mid-20s, Smith co-founded Alden Global Capital with him, and eventually put him in charge of the firm.</p><p>People who know him described Freeman—with his shellacked curls, perma-stubble, and omnipresent smirk—as the archetypal Wall Street frat boy. “If you went into a lab to create the perfect bro, Heath would be that creation,” says one former executive at an Alden-owned company, who, like others in this story, requested anonymity to speak candidly. Freeman would show up at business meetings straight from the gym, clad in athleisure, the executive recalled, and would find excuses to invoke his college-football heroics, saying things like “When I played football at Duke, I learned some lessons about leadership.” (Freeman was a walk-on placekicker on a team that won no games the year he played.)</p><p>When Alden first got into the news business, Freeman seemed willing to indulge some innovation. The firm oversaw the promotion of John Paton, a charismatic digital-media evangelist, who improved the papers’ web and mobile offerings and increased online ad revenue. In 2011, Paton launched an ambitious initiative he called “Project Thunderdome,” hiring more than 50 journalists in New York and strategically deploying them to supplement short-staffed local newsrooms. For a fleeting moment, Alden’s newspapers became unexpected darlings of the journalism industry—written about by <i>Poynter</i> and Nieman Lab, endorsed by academics like Jay Rosen and Jeff Jarvis. But by 2014, it was becoming clear to Alden’s executives that Paton’s approach would be difficult to monetize in the short term, according to people familiar with the firm’s thinking. Reinventing their papers could require years of false starts and fine-tuning—and, most important, a delayed payday for Alden’s investors.</p><p>So Freeman pivoted. He <a href=\"https://www.washingtonpost.com/lifestyle/style/digital-first-medias-project-thunderdome-on-chopping-block/2014/04/02/e2c26ae4-ba20-11e3-96ae-f2c36d2b1245_story.html\">shut down Project Thunderdome</a>, parted ways with Paton, and placed all of Alden’s newspapers on the auction block. When the sale failed to attract a sufficiently high offer, Freeman turned his attention to squeezing as much cash out of the newspapers as possible.</p><p>Alden’s calculus was simple. Even in a declining industry, the newspapers still generated hundreds of millions of dollars in annual revenues; <a href=\"https://www.niemanlab.org/2018/05/newsonomics-alden-global-capital-is-making-so-much-money-wrecking-local-journalism-it-might-not-want-to-stop-anytime-soon/\">many of them were turning profits</a>. For Freeman and his investors to come out ahead, they didn’t need to worry about the long-term health of the assets—they just needed to maximize profits as quickly as possible.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2019/03/local-news-is-dying-and-americans-have-no-idea/585772/?utm_source=feed\">Read: Local news is dying, and Americans have no idea</a>]</i></p><p>From 2015 to 2017, he presided over staff reductions of 36 percent across Alden’s newspapers, according to <a href=\"https://dfmworkers.org/from-newspapers-to-big-coal-aldens-questionable-investments-continue/\">an analysis</a> by the NewsGuild (a union that also represents employees of <i>The Atlantic</i>). At the same time, he increased subscription prices in many markets; it would take awhile for subscribers—many of them older loyalists who didn’t carefully track their bills—to notice that they were paying more for a worse product. Maybe they’d cancel their subscriptions eventually; maybe the papers would fold altogether. But as long as Alden had made back its money, the investment would be a success. (Freeman denied this characterization through a spokesperson.)</p><p>Crucially, the profits generated by Alden’s newspapers did not go toward rebuilding newsrooms. Instead, the money was used to finance the hedge fund’s other ventures. In <a href=\"https://dfmworkers.org/in-court-filing-hedge-fund-alden-admits-diverting-hundreds-of-millions-from-newspaper-chain/\">legal filings</a>, Alden has acknowledged diverting hundreds of millions of dollars from its newspapers into risky bets on commercial real estate, a bankrupt pharmacy chain, and Greek debt bonds. To industry observers, Alden’s brazen model set it apart even from chains like Gannett, known for its aggressive cost-cutting. Alden “is not a newspaper company,” says Ann Marie Lipinski, a former editor in chief of the <i>Chicago Tribune</i>. “It’s a hedge that went and bought up some titles that it milks for cash.”</p><p>Even as Alden’s portfolio grew, Freeman rarely visited his newspapers. When he did, he exhibited a casual contempt for the journalists who worked there. On more than one occasion, according to people I spoke with, he asked aloud, “What do all these people do?” According to the former executive, Freeman once suggested in a meeting that Alden’s newspapers could get rid of all their full-time reporters and rely entirely on freelancers. (Freeman denied this through a spokesperson.) In my many conversations with people who have worked with Freeman, not one could recall seeing him read a newspaper.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/1914/03/newspaper-morals/306219/?utm_source=feed\">From the March 1914 issue: H. L. Mencken on newspaper morals</a>]</i></p><p>A story circulated throughout the company—possibly apocryphal, though no one could say for sure—that when Freeman was informed that <i>The Denver Post </i>had won a Pulitzer in 2013, his first response was: “Does that come with any money?”</p><p>In budget meetings, according to the former executive, Freeman hectored local publishers, demanding that they produce detailed numbers off the top of their head and then humiliating them when they couldn’t. But for all the theatrics, his marching orders were always the same: Cut more.</p><p>“It was clear that they didn’t care about this being a business in the future. It was all about the next quarter’s profit margins,” says Matt DeRienzo, who worked as a publisher for Alden’s Connecticut newspapers before finally resigning.</p><p>Another ex-publisher told me Freeman believed that local newspapers should be treated like any other commodity in an extractive business. “To him, it’s the same as oil,” the publisher said. “Heath hopes the well never runs dry, but he’s going to keep pumping until it does. And everyone knows it’s going to run dry.”</p><p class=\"dropcap\"><span class=\"smallcaps\">On March 9, 2020</span>, a small group of <i>Baltimore Sun</i> reporters convened a secret meeting at the downtown Hyatt Regency. Alden Global Capital had recently purchased a nearly one-third stake in the <i>Sun</i>’s parent company, Tribune Publishing, and the firm was signaling that it would soon come for the rest. By that point, Alden was widely known as the “<a href=\"https://www.vanityfair.com/news/2020/02/hedge-fund-vampire-alden-global-capital-that-bleeds-newspapers-dry-has-chicago-tribune-by-the-throat\">grim reaper of American newspapers</a>,” as <i>Vanity Fair</i> had put it, and news of the acquisition plans had unleashed a wave of panic across the industry.</p><p>But there was still a sliver of hope: Tribune and Alden agreed that the hedge fund would not increase its stake in the company for at least seven months. That gave the journalists at the <i>Sun </i>a brief window to stop the sale from going through. The question was how.</p><p>In the Hyatt meeting, Ted Venetoulis, a former Baltimore politician, advised the reporters to pick a noisy public fight: Set up a war room, circulate petitions, hold events to rally the city against Alden. If they did it right, Venetoulis said, they just might be able to line up a local, civic-minded owner for the paper. The pitch had a certain romantic appeal to the reporters in the room. “Baltimore is an underdog town,” Liz Bowie, a <i>Sun</i> reporter who was at the meeting, told me. “We were like, <i>They’re not going to take our newspaper from us! </i>”</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/1905/02/the-confessions-of-a-newspaper-woman/524799/?utm_source=feed\">From the February 1905 issue: The confessions of a newspaper woman</a>]</i></p><p>The paper’s union hired a PR firm to launch a public-awareness campaign under the banner “Save Our Sun” and published a letter calling on the Tribune board to sell the paper to local owners. Soon, Tribune-owned newsrooms across the country were kicking off similar campaigns. “We were in collective revolt,” Lillian Reed, a <i>Sun</i> reporter who helped organize the campaign, told me. When the journalists created a Slack channel to coordinate their efforts across multiple newspapers, they dubbed it “Project Mayhem.”</p><p>In Orlando, the<i> Sentinel </i>ran an editorial pleading with the community to “deliver us from Alden” and comparing the hedge fund to “a biblical plague of locusts.” In Allentown, Pennsylvania, reporters held reader forums where they tried to instill a sense of urgency about the threat Alden posed to <i>The</i> <i>Morning Call</i>. The movement gained traction in some markets, with local politicians and celebrities expressing solidarity. But even for a group of journalists, it was <a href=\"https://www.theatlantic.com/technology/archive/2019/03/local-news-is-dying-and-americans-have-no-idea/585772/?utm_source=feed\">tough to keep the public’s attention</a>. After a contentious presidential race and amid a still-raging pandemic, there was a limited supply of outrage and sympathy to spare for local reporters. When the <i>Chicago Tribune</i> held a “Save Local News” rally, most of the people who showed up were members of the media.</p><p>Meanwhile, reporters fanned out across their respective cities in search of benevolent rich people to buy their newspapers. The most promising prospect materialized in Baltimore, where a hotel magnate named Stewart Bainum Jr. expressed interest in the <i>Sun</i>. Earnest and unpolished, with a perpetually mussed mop of hair, Bainum presented himself as a contrast to the cutthroat capitalists at Alden. As a young man, he’d studied at divinity school before taking over his father’s company, and decades later he still carried a healthy sense of noblesse oblige. He took particular pride in finding novel ways to give away his family fortune, funding child-poverty initiatives in Baltimore and prenatal care for women in Liberia.</p><p>Bainum told me he’d come to appreciate local journalism in the 1970s while serving in the Maryland state legislature. At the time, the <i>Sun</i> had a bustling bureau in Annapolis, and he marveled at the reporters’ ability to sort the honest politicians from the “political whores” by exposing abuses of power. “You have no way of knowing that if you don’t have some nosy son of a bitch asking a lot of questions down there,” he told me.</p><p>Bainum envisioned rebuilding the paper—which, by 2020, was down to a single full-time statehouse reporter—as a nonprofit. In February 2021, he announced a handshake deal to buy the <i>Sun</i> from Alden for $65 million once it acquired Tribune Publishing.</p><p>But within weeks, Bainum said, Alden tried to tack on a five-year licensing deal that would have cost him tens of millions more. (Freeman has, in the past, disputed Bainum’s account of the negotiations.) Feeling burned by the hedge fund, Bainum decided to make a last-minute bid <a href=\"https://www.washingtonpost.com/lifestyle/media/maryland-business-executive-wanted-to-buy-the-baltimore-sun-now-he-may-try-to-buy-the-rest-of-tribune-newspapers/2021/03/15/b1a35730-85a1-11eb-bfdf-4d36dab83a6d_story.html\">for all of Tribune Publishing’s newspapers</a>, pledging to line up responsible buyers in each market. For those who cared about the future of local news, it was hard to imagine a better outcome—which made it all the more devastating when the bid fell through.</p><p>What exactly went wrong would become a point of bitter debate among the journalists involved in the campaigns. Some expressed exasperation with the staff of the <i>Chicago Tribune</i>, who were unable to find a single interested local buyer. Others pointed to Bainum’s financing partner, who pulled out of the deal at the 11th hour. The largest share of the blame was assigned to the Tribune board for allowing the sale to Alden to go through. Freeman, meanwhile, would later gloat to colleagues that Bainum was never serious about buying the newspapers and just wanted to bask in the worshipful media coverage his bid generated.</p><p>But beneath all the recriminations and infighting was a cruel reality: When faced with the likely decimation of the country’s largest local newspapers, most Americans didn’t seem to care very much. “It was like watching a slow-motion disaster,” says Gregory Pratt, a reporter at the <i>Chicago Tribune</i>.</p><p>Alden completed its takeover of the Tribune papers in May. It financed the deal with the help of Cerberus—a private-equity firm that owned, among other businesses, the <a href=\"https://www.nytimes.com/2021/06/22/us/politics/khashoggi-saudi-kill-team-us-training.html\">security company that trained Saudi operatives</a> who participated in the murder of the journalist Jamal Khashoggi.</p><p>Three days later, Bainum—still smarting from his experience with Alden, but worried about the <i>Sun</i>’s fate—sent a pride-swallowing email to Freeman. After congratulating him on closing the deal, Bainum said he was still interested in buying the <i>Sun</i> if Alden was willing to negotiate. Freeman never responded.</p><figure class=\"full-width\"><img alt='Red street-corner newspaper dispenser with \"The Baltimore Sun\" logo lying on its side with glass window smashed and newspaper spilling out, surrounded by numbered yellow evidence markers from a murder scene' height=\"742\" src=\"https://cdn.theatlantic.com/media/img/posts/2021/10/WEL_Coppins_Dispenser/f16486b02.jpg\" width=\"928\">\n<figcaption class=\"caption\">Ricardo Rey</figcaption>\n</figure><p class=\"dropcap\"><span class=\"smallcaps\">Shortly after</span> the Tribune deal closed earlier this year, I began trying to interview the men behind Alden Capital. I knew they almost never talked to reporters, but Randall Smith and Heath Freeman were now two of the most powerful figures in the news industry, and they’d gotten there by dismantling local journalism. It seemed reasonable to ask that they answer a few questions.</p><p>My request for an interview with Smith was dismissed by his spokesperson before I finished asking. A reporter at one of his newspapers suggested I try “doorstepping” Smith—showing up at his home unannounced to ask questions from the porch. But it turned out that Smith had <i>so many </i>doorsteps—<a href=\"https://www.thenation.com/article/archive/how-many-palm-beach-mansions-does-a-wall-street-tycoon-need/\">16 mansions in Palm Beach alone</a>, as of a few years ago, some of them behind gates—that the plan proved impractical. At one point, I tracked down the photographer who’d taken <a href=\"https://nypost.com/2012/07/26/vulture-in-distress/\">the only existing picture</a> of Smith on the internet. But when I emailed his studio looking for information, I was informed curtly that the photo was “no longer available.” Had Smith bought the rights himself? I asked. No response came back.</p><p>Freeman was only slightly more accessible. He declined to meet me in person or to appear on Zoom. After weeks of back-and-forth, he agreed to a phone call, but only if parts of the conversation could be on background (which is to say, I could use the information generally but not attribute it to him). On the appointed afternoon, I dialed the number provided by his spokesperson and found myself talking to the most feared man in American newspapers.</p><p>When I asked Freeman what he thought was broken about the newspaper industry, he launched into a monologue that was laden with jargon and light on insight—summarizing what has been the conventional wisdom for a decade as though it were Alden’s discovery. “Many of the operators were looking at the newspaper business as a local advertising business,” he said, “and we didn’t believe that was the right way to look at it. This is a subscription-based business.”</p><p>Freeman was more animated when he turned to the prospect of extracting money from Big Tech. “We must finally require the online tech behemoths, such as Google, Apple, and Facebook, to fairly compensate us for our original news content,” he told me. He had spoken on this issue before, and it was easy to see why. Many in the journalism industry, watching <a href=\"https://www.wsj.com/articles/french-regulator-fines-google-268-million-in-antitrust-settlement-11623054737\">lawsuits play out</a> in Australia and Europe, have held out hope in recent years that Google and Facebook will be compelled to share their advertising revenue with the local outlets whose content populates their platforms. Some have even suggested that this represents America’s last chance to save its local-news industry. But for that to happen, the Big Tech money would need to flow to underfunded newsrooms, not into the pockets of Alden’s investors.</p><p>Before our interview, I’d contacted a number of Alden’s reporters to find out what they would ask their boss if they ever had the chance. Most responded with variations on the same question: Which recent stories from your newspapers have you especially appreciated? I put the question to Freeman, but he declined to answer on the record.</p><p>Freeman was clearly aware of his reputation for ruthlessness, but he seemed to regard Alden’s commitment to cost-cutting as a badge of honor—the thing that distinguished him from the saps and cowards who made up America’s previous generation of newspaper owners. “Prior to the acquisition of the Tribune Company, we purchased substantially all of our newspapers out of bankruptcy or close to liquidation,” he told me. “These papers were in many cases left for dead by local families not willing to make the tough but appropriate decisions to get these news organizations to sustainability. These papers would have been liquidated if not for us stepping up.”</p><p>This was the core of Freeman’s argument. But while it’s true that Alden entered the industry by purchasing floundering newspapers, not all of them were necessarily doomed to liquidation. More to the point, Tribune Publishing—which represents a substantial portion of Alden’s titles—was profitable at the time of the acquisition.</p><p>There’s little evidence that Alden cares about the “sustainability” of its newspapers. A more honest argument might have claimed, as some economists have, that vulture funds like Alden play a useful role in “creative destruction,” dismantling outmoded businesses to make room for more innovative insurgents. But in the case of local news, nothing comparable is ready to replace these papers when they die. Some publications, such as the Minneapolis<i> Star Tribune</i>, have developed successful long-term models that Alden’s papers might try to follow. But that would require slow, painstaking work—and there are easier ways to make money.</p><p>In truth, Freeman didn’t seem particularly interested in defending Alden’s reputation. When he’d agreed to the interview, I’d expected him to say the things he was supposed to say—that the layoffs and buyouts were necessary but tragic; that he held local journalism in the highest esteem; that he felt a sacred responsibility to steer these newspapers toward a robust future. I would know he didn’t mean it, and he would know he didn’t mean it, but he would at least go through the motions.</p><p>But I had underestimated how little Alden’s founders care about their standing in the journalism world. For Freeman, newspapers are financial assets and nothing more—numbers to be rearranged on spreadsheets until they produce the maximum returns for investors. For Smith, the Palm Beach conservative and Trump ally, sticking it to the mainstream media might actually be a perk of Alden’s strategy. Neither man will ever be the guest of honor at the annual dinner for the Committee to Protect Journalists—and that’s probably fine by them. It’s hard to imagine they’d show, anyway.</p><p class=\"dropcap\"><span class=\"smallcaps\">About a month </span>after <i>The</i> <i>Baltimore Sun</i> was acquired by Alden, a senior editor at the paper took questions from anxious reporters on Zoom. The new owners had announced a round of buyouts, some beloved staffers were leaving, and those who remained were worried about the future. When a reporter asked if their work was still valued, the editor sounded deflated. He said that <i>he</i> still appreciated their journalism, but that he couldn’t speak for his corporate bosses.</p><p>“This company that owns us now seems to still be pretty—I don’t even know how to put it,” the editor said, according to a recording of the meeting obtained by <i>The Atlantic</i>. “We don’t hear from them ... They’re, like, nameless, faceless people.”</p><p>In the months that followed, the <i>Sun </i>did not immediately experience the same deep staff cuts that other papers did. Reporters kept reporting, and editors kept editing, and the union kept looking for ways to put pressure on Alden. But a sense of fatalism permeated the work. “It feels like we’re going up against capitalism now,” Lillian Reed, the reporter who helped launch the “Save Our Sun” campaign, told me. “Am I going to win against capitalism in America? Probably not.”</p><p>To David Simon, the whimpering end of <i>The</i> <i>Baltimore Sun</i> feels both inevitable and infuriating. A former <i>Sun </i>reporter whose work on the police beat famously led to his creation of <i>The Wire</i> on HBO, Simon told me the paper had suffered for years under a series of blundering corporate owners—and it was only a matter of time before an enterprise as cold-blooded as Alden finally put it out of its misery.</p><p>Like many alumni of the <i>Sun</i>, Simon is steeped in the paper’s history. He can cite decades-old scoops and tell you whom they pissed off. He quotes H. L. Mencken, the paper’s crusading 20th-century columnist, on the joys of journalism: It is really the life of kings. At the <i>Sun</i>’s peak, it employed more than 400 journalists, with reporters in London and Tokyo and Jerusalem. Its World War II correspondent brought firsthand news of Nazi concentration camps to American readers; its editorial page had the power to make or break political careers in Maryland.</p><p>But for Simon, that paper exists entirely in the past. With Alden in control, he believes the <i>Sun </i>is “now a prisoner” that stands little chance of escape. What most concerns him is how his city will manage without a robust paper keeping tabs on the people in charge. “The practical effect of the death of local journalism is that you get what we’ve had,” he told me, “which is a halcyon time for corruption and mismanagement and basically misrule.”</p><p>When Simon called me, he was on the set of his new miniseries, <i>We Own This City</i>, which tells the true story of Baltimore cops who spent years running their own drug ring from inside the police department. By the time the FBI caught them, in 2017, the conspiracy had resulted in one dead civilian and a rash of wrongful arrests and convictions. The show draws from a book written by a <i>Sun </i>reporter, and Simon was quick to point out that the paper still has good journalists covering important stories. But he couldn’t help feeling that the police scandal would have been exposed much sooner if the <i>Sun </i>were operating at full force.</p><p>Baltimore has always had its problems, he told me. “But if you really started fucking up in grandiose and belligerent ways, if you started stealing and grifting and lying, eventually somebody would come up behind you and say, ‘You’re grifting and you’re lying’ … and they’d put it in the paper.”</p><p>“The bad stuff runs for so long now,” he went on, “that by the time you get to it, institutions are irreparable, or damn near close.”</p><p>Take away the newsroom packed with meddling reporters, and a city loses a crucial layer of accountability. What happens next? Unless the <i>Tribune</i>’s trajectory changes, Chicago may soon provide a grim case study. For Baltimore to avoid a similar fate, Simon told me, something new would have to come along—a spiritual heir to the <i>Sun</i>: “A newspaper is its contents and the people who make it. It’s not the name or the flag.”</p><p>He may get his wish. Stewart Bainum, since losing his bid for the <i>Sun</i>, has been quietly working on a new venture. Convinced that the <i>Sun</i> won’t be able to provide the kind of coverage the city needs, he has set out to build a new publication of record from the ground up. In recent months, he’s been meeting with leaders of local-news start-ups across the country—<i>The Texas Tribune</i>, the <i>Daily Memphian</i>, <i>The City</i> in New York—and collecting best practices. He’s impressed by their journalism, he told me, but his clearest takeaway is that they’re not nearly well funded enough. To replace a paper like the <i>Sun</i> would require a large, talented staff that covers not just government, but sports and schools and restaurants and art. “You need real capital to move the needle,” he told me. Otherwise, “you’re just peeing in the ocean.”</p><p>Next year, Bainum will launch <i>The Baltimore Banner</i>, an all-digital, nonprofit news outlet. He told me it will begin with an annual operating budget of $15 million, unprecedented for an outfit of this kind. It will rely initially on philanthropic donations, but he aims to sell enough subscriptions to make it self-sustaining within five years. He’s acutely aware of the risks—“I may end up with egg on my face,” he said—but he believes it’s worth trying to develop a successful model that could be replicated in other markets. “There’s no industry that I can think of more integral to a working democracy than the local-news business,” he said.</p><p>The <i>Banner</i> will launch with about 50 journalists—not far from the size of the <i>Sun</i>—and an ambitious mandate. One tagline he was considering was “Maryland’s Best Newsroom.”</p><p>When I asked, half in jest, if he planned to raid the <i>Sun</i> to staff up, he responded with a muted grin. “Well,” he told me, “they have some very good reporters.”</p><hr><p><small><em>This article appears in the <a href=\"https://www.theatlantic.com/magazine/toc/2021/11/?utm_source=feed\">November 2021</a> print edition with the headline “The Men Who Are Killing America’s Newspapers.”</em></small></p>",
  "author": {
    "name": "McKay Coppins",
    "uri": "http://www.theatlantic.com/author/mckay-coppins/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Dan Winters for The Atlantic"
  },
  "title": "A Secretive Hedge Fund Is Gutting Newsrooms",
  "published": "2021-10-14T06:00:00-04:00",
  "updated": "2022-01-28T16:28:33-05:00",
  "summary": "Inside Alden Global Capital",
  "link": ""
}