{
  "title": "Everyone Is Getting Divorced",
  "description": "Taffy Brodesser-Akner is perhaps best known for her profiles of celebrities like Gwyneth Paltrow, Tonya Harding, and Jonathan Franzen — turning her subjects into characters through the irresistible drama of being famous. Now, she's turned to fiction, and has just published her first novel, Fleishman Is In Trouble, about the painful dissolution of a marriage. Taffy talks about her long-standing fascination with divorce, intensified as she's watched her peers go through the process in the age of dating apps, and shares an excerpt of her novel.\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
  "pubDate": "Tue, 18 Jun 2019 10:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Vox Media Podcast Network",
  "itunes:subtitle": "Taffy Brodesser-Akner is perhaps best known for her profiles of celebrities like Gwyneth Paltrow, Tonya Harding, and Jonathan Franzen — turning her subjects into characters through the irresistible drama of being famous. Now, she's turned to fiction, and has just published her first novel, Fleishman Is In Trouble, about the painful dissolution of a marriage. Taffy talks about her long-standing fascination with divorce, intensified a she's watched her peers go through the process in the age of dating apps, and shares an excerpt of her novel.",
  "itunes:summary": "Taffy Brodesser-Akner is perhaps best known for her profiles of celebrities like Gwyneth Paltrow, Tonya Harding, and Jonathan Franzen — turning her subjects into characters through the irresistible drama of being famous. Now, she's turned to fiction, and has just published her first novel, Fleishman Is In Trouble, about the painful dissolution of a marriage. Taffy talks about her long-standing fascination with divorce, intensified as she's watched her peers go through the process in the age of dating apps, and shares an excerpt of her novel.\nLearn more about your ad choices. Visit podcastchoices.com/adchoices",
  "content:encoded": "<p>Taffy Brodesser-Akner is perhaps best known for her profiles of celebrities like Gwyneth Paltrow, Tonya Harding, and Jonathan Franzen — turning her subjects into characters through the irresistible drama of being famous. Now, she's turned to fiction, and has just published her first novel, <a href=\"https://www.amazon.com/Fleishman-Trouble-Novel-Taffy-Brodesser-Akner/dp/0525510877\"><em>Fleishman Is In Trouble</em></a><em>, </em>about the painful dissolution of a marriage. Taffy talks about her long-standing fascination with divorce, intensified as she's watched her peers go through the process in the age of dating apps, and shares an excerpt of her novel.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://podcastchoices.com/adchoices\">podcastchoices.com/adchoices</a></p>",
  "itunes:duration": 2324,
  "guid": "c8ebcc40-c70f-11e8-b1ca-7334ea6dd659",
  "enclosure": ""
}