{
  "title": "501 - Meeting America’s Public Health Challenge: Recommendations for Building a National Public Health System",
  "itunes:title": "501 - Meeting America’s Public Health Challenge: Recommendations for Building a National Public Health System",
  "pubDate": "Fri, 05 Aug 2022 10:00:00 +0000",
  "guid": "1cb91677-3a15-47ac-a91d-4330952a1b91",
  "link": "https://johnshopkinssph.libsyn.com/501-meeting-americas-public-health-challenge-recommendations-for-building-a-national-public-health-system",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">The public health system has been fragmented and haphazard for years, and COVID-19 showed just how consequential a weak system can be. Former FDA Commissioner</span> <strong>Peggy Hamburg</strong> <span style= \"font-weight: 400;\">talks with</span> <strong>Stephanie Desmo</strong><span style=\"font-weight: 400;\">n about a Commonwealth Fund report that looks at how to build a national public health system that addresses ongoing and future health crises, advances equity, and earns trust. Learn more</span> <a href=\"http://commonwealthfund.org\"><span style= \"font-weight: 400;\">here</span></a><span style= \"font-weight: 400;\">.</span></p>",
  "content:encoded": "<p>The public health system has been fragmented and haphazard for years, and COVID-19 showed just how consequential a weak system can be. Former FDA Commissioner Peggy Hamburg talks with Stephanie Desmon about a Commonwealth Fund report that looks at how to build a national public health system that addresses ongoing and future health crises, advances equity, and earns trust. Learn more <a href=\"http://commonwealthfund.org\">here</a>.</p>",
  "enclosure": "",
  "itunes:duration": "14:05",
  "itunes:explicit": false,
  "itunes:keywords": "future,public,health,Crisis,Pandemic,equity,coronavirus,covid19,covid",
  "itunes:subtitle": "The public health system has been fragmented and haphazard for years, and COVID-19 showed just how consequential a weak system can be. Former FDA Commissioner Peggy Hamburg talks with Stephanie Desmon about a Commonwealth Fund report that looks at how...",
  "itunes:season": 6,
  "itunes:episode": 501,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}