{
  "title": "SpaceX and Dish’s Super-Shady War for the World",
  "link": "https://spectrum.ieee.org/spacex-starlink-dish-network",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/map-of-globe-with-blue-orbs-of-light-around.jpg?id=30131119&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>\n\tBillionaires, satellite links, political chicanery: a present-day, oligopolistic game of jockeying for prime placement in the 12-gigahertz spectrum has at least a few of the ingredients of a thriller. Or—given the outsize personalities involved (including Elon Musk and Michael Dell) and the epic, five-year duration of the dispute to date—maybe more like a space opera.\n</p><p>\n\tAt issue is a set of frequencies where Musk’s SpaceX sets its <a href=\"https://www.starlink.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Starlink</a> Internet service, the company’s well-publicized play for broadband beaming down from low-Earth orbit to satellite dishes in remote areas. Charlie Ergen’s <a href=\"https://about.dish.com/company-info\" rel=\"noopener noreferrer\" target=\"_blank\">Dish Network Corp.</a>, which transmits TV on these frequencies and is one of the two big satellite viewing providers in the United States, has launched a 5G wireless service and wants to increase its signal volume in this wavelength. Musk’s side says the move would make debilitating static for his satellites; Ergen’s engineers say that’s nonsense. As for Dell (you may recall Dell laptops) his <a href=\"https://www.msdcapital.com/Michael_Dell\" rel=\"noopener noreferrer\" target=\"_blank\">private investment firm</a> holds interest in some of the airwaves in play. At the moment, they’re siding with Dish.\n</p><p>\n\tThe current field, more precisely 12.2 to 12.7 GHz in the <a href=\"https://en.wikipedia.org/wiki/Ku_band\" target=\"_blank\">Ku microwave band</a>, is a lot of bandwidth lightly used—primarily today for assorted satellite broadcasts, live feeds, ISS tracking, and military recon drones. But the corporates fighting over it recently <a href=\"https://www.wsj.com/articles/elon-musks-starlink-satellite-internet-service-battles-dish-over-airwaves-11657359181\" rel=\"noopener noreferrer\" target=\"_blank\">cranked up their clashing</a>. The <a href=\"https://www.bloomberg.com/news/articles/2021-10-09/billionaires-musk-ergen-and-dell-brawling-over-spectrum-at-fcc\" rel=\"noopener noreferrer\" target=\"_blank\">sides are lobbying a shorthanded</a> Federal Communications Commission, with recent highlight swipes including Musk blasting his foes as “super shady and unethical” while taking return fire from Dish for “flimsy” and “far-fetched” objections to opening bandwidth.\n</p><p>\n\tBut what’s it mean for those outside the immediate fray? For civilians going about their daily business? For people—possible satellite service subscribers, all—around the world?\n</p><p>\n\tOnly a handful of people who understand the nature of possible interference and related issues seem to be paying attention now. “Rights to use frequencies have not been sharply defined, and the overlapping permits generate controversy,” says Thomas Hazlett, a Clemson University economist <a href=\"https://www.abebooks.com/9780300210507/Political-Spectrum-Tumultuous-Liberation-Wireless-0300210507/plp\" target=\"_blank\">who writes about</a> bandwidth battles (and once served as FCC chief economist). But the rulings—and market activities that result—stand to have real social impact wherever signals from satellite broadcasts or satellite Internet connections may one day fall. Which means pretty much everywhere.\n</p><p>\n\tIt’s a stark contrast given the economic value placed on frequency rights. More than <a href=\"https://www.fcc.gov/auctions-summary\" target=\"_blank\">100 bandwidth auctions</a> over the last 30 years have netted about US $280 billion for the U.S. Treasury. And as with television, radio, and the railway before that, citizens aren’t likely to tune in until more tangible developments happen. But others are paying attention, and the pressures are intense. “In the U.S., it is purely market driven,” says Shahed Mazumder, global director of telecom solutions at <a href=\"https://aerospike.com/author/smazumder/\" rel=\"noopener noreferrer\" target=\"_blank\">Aerospike</a>, a database firm. SpaceX has launched thousands of new satellites; Dish is trying to move into new services. <a href=\"https://www.linkedin.com/pulse/5g-spectrum-series-what-happening-12-ghz-shahed-mazumder\" rel=\"noopener noreferrer\" target=\"_blank\">Neither wants interference</a>.\n</p><p>\n\t“The political pressure, the business pressure, the monetary pressure: There are legitimately major things going on here,” says Mike Dano, who’s been <a href=\"https://www.lightreading.com/iot/5g-skirmishes-at-12ghz-may-escalate-into-all-out-spectrum-war/d/d-id/765009\" rel=\"noopener noreferrer\" target=\"_blank\">following the dispute</a> as editorial director at <a href=\"https://www.lightreading.com/profile.asp?piddl_userid=551155\" rel=\"noopener noreferrer\" target=\"_blank\">Light Reading</a>, a news website covering international teleco. Billions of dollars of value, potentially, to be created or destroyed depending on how an FCC engineer finally decides on it.” Meanwhile the politically appointed commissioners at the FCC are <a href=\"https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/telecom-players-divided-on-gigi-sohn-s-fcc-prospects-as-august-recess-looms-70878011\" rel=\"noopener noreferrer\" target=\"_blank\">down one member</a>, splitting it 2-2 along party lines. It makes controversial calls more difficult.\n</p><p>\n\tMore techie influences may also affect the spectrum spat. In 2018 the United States became the first to approve a <a href=\"https://www.nist.gov/news-events/news/2018/03/nist-helps-facilitate-first-ever-spectrum-sharing-between-military-and\" rel=\"noopener noreferrer\" target=\"_blank\">spectrum-sharing setup</a> in the Citizens Broadband Radio Service band (3.5 GHz). It’s an advanced concept allowing different sets of users to share spectrum—making more room. Dano says the FCC is under pressure to allocate 12 GHz in a way set up for spectrum sharing.\n</p><p>\n\tThis notably did not happen with U.S 5G network rollouts, which turned into a <a href=\"https://spectrum.ieee.org/5g-faa\" target=\"_self\">snarling issue earlier this year</a> over fears of interference in the C-band between high-speed cellular service towers and plane altimeters in low-visibility conditions on approach to airports.\n</p><p>\n\tMeanwhile Starlink wants to open its satellite show in further-flung places, seeking to <a href=\"https://spacenews.com/uk-mulls-starlink-expansion-plan-under-new-ngso-regulations/\" rel=\"noopener noreferrer\" target=\"_blank\">open gateways in the United Kingdom</a>. While its 12-GHz fight with Dish is centered in the United States and Dish’s U.S. services, satellite spectrum allocation is...special. Space has international dimensions, points out Plum Consulting’s Selçuk Kırtay, who was <a href=\"https://www.academia.edu/9483627/Broadband_satellite_system_technologies\" rel=\"noopener noreferrer\" target=\"_blank\">writing about spectrum sharing</a> in 2002. Slicing up the Ku band has history—it even <a href=\"https://ui.adsabs.harvard.edu/abs/1977prag.iafcX....S/abstract\" rel=\"noopener noreferrer\" target=\"_blank\">left its mark</a> at a global astronautical confab in then-Czechoslovakia in <em>Star Wars</em>-era 1977.\n</p><p>\n\tOfcom, the U.K. regulator, is monitoring developments with U.S. allocations in 12 GHz. The German network authority is preparing to discuss the 12.2-to-12.7-GHz frequency range at next year’s <a href=\"https://www.itu.int/en/ITU-R/conferences/wrc/Pages/default.aspx\" target=\"_blank\">ITU World Radiocommunication Conference</a> in the United Arab Emirates.\n</p><p>\n\tStay tuned, say experts and satellite industry watchers. “How the conflicts are resolved in the USA will materially affect markets around the world,” Hazlett says.<br/>\n</p><p>\n<em>This article appears in the October 2022 print issue as “Billionaires Battle\nfor Global Spectrum Domination.”</em>\n</p>",
  "pubDate": "Fri, 15 Jul 2022 15:32:41 +0000",
  "guid": "https://spectrum.ieee.org/spacex-starlink-dish-network",
  "category": [
    "Satellites",
    "Spacex",
    "Starlink",
    "Dell",
    "Dish network",
    "Elon musk"
  ],
  "dc:creator": "Michael Dumiak",
  "media:content": ""
}