{
  "title": "#486: Quidditch Through the Ages Illustrated Review, MuggleMail, and Games!",
  "link": "https://audioboom.com/posts/7703701",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3438,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>PSA for the USA: Many voter registration deadlines are approaching in the United States. Please make sure you are registered to vote in your state right now by visiting <a href=\"http://www.iwillvote.com\">IWillVote.com</a>. You can also find out great ballot information at <a href=\"http://www.BallotReady.org\">BallotReady.org</a> and sign up to be a poll worker at <a href=\"http://www.PowerThePolls.org\">PowerThePolls.org</a>. </li>\n<li>Quidditch Through the Ages gets a fully-illustrated edition by Emily Gravett. We dig into the book and share what we love about it!</li>\n<li>The new edition has an illustration on every page, and nearly 3 times the page count of the original book, plus -- Andrew's confirmed -- unique paper stock.</li>\n<li>Are there bits in this new book that weren't in the original? The hosts discuss Emily's impressive world building, and how it feels like a history book.</li>\n<li>What are our favorite new illustrations, and where does this version rank among other illustrated books?</li>\n<li>Debate Segment: Is Quidditch a dumb or amazing sport? Be sure to vote in our polls on social media later this week, to help us determine who won the dbeate!</li>\n<li>MuggleMail addresses more plot holes. How does Lily's love protection work? Why did the portkey take Harry back to the maze? We finally get some satisfying answers.</li>\n<li>The hosts play a game: Avada Kedavra, Imperio, Love Potion with characters from Fantastic Beasts!</li>\n<li>Quizzitch: Who was the seeker for the Irish National Quidditch team in 1994?</li>\n<li>This week's episode is sponsored by ThirdLove (get 10% off your perfect fitting bra by visiting <a href=\"http://ThirdLove.com/mugglecast\">ThirdLove.com/mugglecast</a>) and <a href=\"http://www.peacocktv.com/\">Peacock TV</a> (watch the Harry Potter movies for free, all October long!)</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 13 Oct 2020 11:00:00 +0000",
  "guid": "tag:audioboom.com,2020-10-12:/posts/7703701",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}