{
  "title": "Luxury contraband up for auction in France",
  "link": "https://www.rt.com/news/565852-french-authorities-contraband-luxuries-auction/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565852-french-authorities-contraband-luxuries-auction/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6363775385f54005914ce414.jpg\" /> French authorities are auctioning off contraband seized by the customs service <br/><a href=\"https://www.rt.com/news/565852-french-authorities-contraband-luxuries-auction/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>Among the items authorities want to sell off are uncut diamonds, platinum ingots, and a ruby-inlaid Rolex watch</strong></p>\n            \n                        \n            <p>Historic coins, uncut diamonds, and platinum bars &ndash; these are just some of the luxury items being put up for auction by the French finance ministry. All the goods are said to be contraband seized by the country&rsquo;s customs service.</p>\n<p>On offer are 350 lots worth approximately &euro;1 million ($980,430). More than 1,200 prospective buyers have already signed up for the auction that kicks off on Friday at 9:30 GMT.</p>\n<p>Among the items presented on the Hotel Drouot auction house&rsquo;s website are 14 platinum ingots weighing 1kg each with a starting price of &euro;22,000. The bars were reportedly impounded after the luggage of two UK-bound passengers was searched.</p>\n<p>The catalogue also includes historic British gold coins, and a collection of uncut diamonds, seized at Paris airports.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/634ac7582030272bca0deab2.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/564729-hitler-painting-uk-show/\">TV channel explains purchase of Hitler’s paintings</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>There are also several pricey watches, including a gold Rolex inlaid with 40 rubies estimated at &euro;15,000 as well as a stack of designer handbags.</p>\n<p>A Volkswagen Golf which was used in an attempt to haul some 480kg of hashish across the Spanish-French border is also up for grabs.</p>\n<p>More than 2,000 bottles of Grey Goose vodka are listed with a starting price of &euro;10,000. However, only professional buyers will be able to lay their hands on the upmarket spirit, with the auction organizers citing security and legal reasons.</p>\n<p>Not all the items on offer fall under the category of &lsquo;luxury goods,&rsquo; there are semi-trailer trucks and laptops in the catalogue too.</p>\n<p>Commenting on the auction, the finance ministry praised the customs service for its daily battle &ldquo;<em>against all illegal traffic that threatens our territory and our society in order to protect citizens and the environment.</em>&rdquo;</p>\n<p>The officials added that the sale reflected the sheer diversity of impounded goods.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 09:54:36 +0000",
  "dc:creator": "RT"
}