{
  "id": "https://bibleinoneyear.org/en/youth/108",
  "title": "Day 108: It’s Never Too Late",
  "description": "Proverbs 10:2,9, Deuteronomy 29:29, 30:2–3, Luke 18:35-42, 19:1–10. No matter how long you have travelled in the wrong direction, you can always turn around  With Jesus it’s never too late to make a new start and ensure that your life is set in the right direction",
  "pubDate": "Mon, 18 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/108/",
  "itunes:duration": "13:40",
  "guid": "enyouth18042022-108",
  "length": 820.82,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 108: It’s Never Too Late",
  "itunes:subtitle": "Proverbs 10:2,9, Deuteronomy 29:29, 30:2–3, Luke 18:35-42, 19:1–10. No matter how long you have travelled in the wrong direction, you can always turn around  With Jesus it’s never too late to make a new start and ensure that your life is set in the right direction",
  "itunes:summary": "I like to think of myself as young. Recently, I heard that middle age runs from thirty-five to fifty-eight years of age. On that basis, not only am I not young, I am well past even middle-aged!\nPeople often speak of being middle-aged as a time of ‘midlife crisis’. A midlife crisis can be caused by ageing itself, or ageing in combination with changes, problems, or regrets over work, career, relationships, children and physical changes associated with ageing.\nIndividuals experiencing a midlife crisis are often searching for an undefined dream or goal. We may have a deep sense of remorse for goals not yet accomplished. We may fear humiliation among more successful colleagues. We often desire to achieve a feeling of youthfulness.\nAt the root of all these things is a sense of something being missing. There is often a tragic wisdom in mid-life crises, we realise the emptiness of much of what we used to strive for (even if what we replace it with is not always particularly wise).\nI have often wondered whether Zacchaeus, whom we read about in today’s New Testament passage, was going through a midlife crisis. Whether he was or not, he found the answer that so many people are searching for in his encounter with Jesus.\nNo matter how long you have travelled in the wrong direction, you can always turn around. With Jesus it’s never too late to make a new start and ensure that your life is set in the right direction.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 473
}