{
  "id": "yt:video:TbmoGe1zoDc",
  "yt:videoId": "TbmoGe1zoDc",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Why Queen Elizabeth II was the queen of 15 countries",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-09-24T00:11:44+00:00",
  "updated": "2022-09-27T18:00:14+00:00",
  "media:group": {
    "media:title": "Why Queen Elizabeth II was the queen of 15 countries",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "The Commonwealth, explained.\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nAfter centuries of colonizing much of the world, the British Empire began its fast descent in the 1960s amid a global wave of independence movements. But when Queen Elizabeth II died in 2022, she was not only still queen of 14 countries besides the United Kingdom, she was also still the leader of an organization that on a map looks a lot like the British Empire.\n\nThe British Empire created the first iteration of the Commonwealth to appease white settler colonies looking for more autonomy. It granted them more independence to govern themselves but kept them under the crown. As British leaders realized their power might be at risk throughout their colonies worldwide, the monarchy made a play to keep ties and preserve their global influence by allowing newly independent republics to join the Commonwealth too. The only catch: They had to accept the queen as the leader of the organization. With the death of Queen Elizabeth II, this vestige of the British Empire is now under the leadership of King Charles III. So, what exactly is the Commonwealth? Why is it still here? And will it survive?\n\nCorrection: A previous version of this video mistakenly showed Myanmar as a member of the Commonwealth on a 1994 map, mislabeled Sierra Leone and Gold Coast for a brief moment on a 1927 map, and omitted Greenland, all of which have now been corrected. \n\nWe have also clarified that India became a republic shortly after independence with a new line of narration at 3:12; corrected Queen Elizabeth II’s title at 00:16 and 00:47; and updated the date Barbados became a republic from November 29, 2021, to November 30, 2021.\n\nSources:\n\nRead about Barbados shedding the queen and becoming a republic:\nhttps://www.bbc.com/news/world-latin-america-59470843\n\nTo learn more about the sugar plantations under the British Empire check out this project:\nhttps://runaways.gla.ac.uk/minecraft/index.php/slaves-work-on-sugar-plantations/#:~:text=English%20planters%20first%20began%20growing,and%20Mississippi%20in%20North%20America.\n\nTo understand 20th-century Britain and the rise of independence movements, check out “The Impact of the Second World War on the Decolonization of Africa”:\nhttps://scholarworks.bgsu.edu/cgi/viewcontent.cgi?article=1048&context=africana_studies_conf\n\nTo take a deeper look at how the monarchy started using its image and the media to stay relevant and survive in a changing world, check out Ed Owens’ book:\nhttps://www.academia.edu/40806538/The_Family_Firm_Monarchy_Mass_Media_and_the_British_Public_1932_53\n\nTo understand the role of the Commonwealth today, check out this op-ed by Philip Murray, director of the Institute of Commonwealth Studies:\nhttps://www.theafricareport.com/71058/the-commonwealth-why-does-it-exist-and-does-it-help-its-members/\n\nFor a deeper look at royalty in general and the British Royal family in particular, watch our episode of Royalty, Explained on Netflix:\nhttps://www.netflix.com/watch/81273753?trackId=255824129\n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}