{
  "title": "Episode 100: &#8220;Love Me Do&#8221; by the Beatles",
  "link": "https://500songs.com/podcast/episode-100-love-me-do-by-the-beatles/",
  "pubDate": "Sat, 26 Sep 2020 20:50:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=362",
  "description": "This week there are&nbsp;<em>two</em> episodes of the podcast going up, both of them longer than normal. This one, episode one hundred, is the hundredth-episode special and is an hour and a half long. It looks at the early career of the Beatles, and at the three recordings of \"Love Me Do\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42023843\">&nbsp;on \"Misirlou\" by Dick Dale and the Deltones</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nWhile there are many books on the Beatles, and I have read dozens of them, only one needs to be mentioned as a reference for this episode (others will be used for others).&nbsp;<em>All These Years Vol 1: Tune In</em>&nbsp;by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out.\n\nThere are two versions of the book -- <a href=\"https://amzn.to/340FVAD\">a nine-hundred page mass-market version</a> and <a href=\"https://amzn.to/3j508vz\">a 1700-page expanded edition</a>. I recommend the latter. The information in this podcast is almost all from Lewisohn's book, but I must emphasise that the opinions are mine, and so are any errors -- Lewisohn's book only has one error that I'm aware of (a joke attributed to the comedian Jasper Carrott in a footnote that has since been traced to an earlier radio show). I am only mortal, and so have doubtless misunderstood or oversimplified things and introduced errors where he had none.\n\nThe single version of \"Love Me Do\" can be found on <em><a href=\"https://amzn.to/2S1gc5q\">Past Masters</a>,</em> a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides. The version with Andy White playing on can be found on&nbsp;<a href=\"https://amzn.to/2FRymEx\"><em>Please Please Me</em></a>. The version with Pete Best, and many of the other early tracks used here, is on <a href=\"https://amzn.to/3kSPFUx\"><em>Anthology 1</em></a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Errata</strong>\n\nI pronounce the name of Lewisohn's book as \"All Those Years\" instead of \"All These Years\".\n\nI say \" The Jets hadn't liked playing at Williams' club\" at one point. I meant \"at Koschmider's club\"\n\n<strong>Transcript</strong>\n\nThe Beatles came closer than most people realise to never making a record.\n\nUntil the publication of Mark Lewisohn's seminal biography All These Years vol 1: Tune In, in 2013 everyone thought they knew the true story -- John met Paul at Woolton Village Fete in 1957, and Paul joined the Quarrymen, who later became the Beatles. They played Hamburg and made a demo, and after the Beatles' demo was turned down by Decca, their manager Brian Epstein shopped it around every record label without success, until finally George Martin heard the potential in it and signed them to Parlophone, a label which was otherwise known for comedy records. Martin was, luckily, the one producer in the whole of the UK who could appreciate the Beatles' music, and he signed them up, and the rest was history.\n\nThe problem is, as Lewisohn showed, that's not what happened. Today I'm going to tell, as best I can the story of how the Beatles actually became the band that they became, and how they got signed to EMI records. I'm going to tell you the story of \"Love Me Do\":\n\n[Excerpt: The Beatles, \"Love Me Do (single version)\"]\n\nAs I mentioned at the beginning, this episode owes a *huge* debt to Mark Lewisohn's book. I like to acknowledge my sources, anyway, but I've actually had difficulty with this episode because Lewisohn's book is *so* detailed, *so* full, and written *so* well that much of the effort in writing this episode came from paring down the information, rather than finding more, and from reworking things so I was not just paraphrasing bits of his writing. Normally I rely on many sources, and integrate the material myself, but Lewisohn has done all that work far better than any other biographer of any other musician. Were the Beatles not such an important part of music history, I would just skip this episode because there is nothing for me to add. As it is, I *obviously* have to cover this, but I almost feel like I'm cheating in doing so. If you find this episode interesting at all, please do yourself a favour and buy that book.\n\nThis episode is going to be a long one -- much longer than normal. I won't know the precise length until after I've recorded and edited it, of course, but I'm guessing it's going to be about ninety minutes. This is the hundredth episode, the end of the second year of the podcast, the end of the second book based on the podcast, and the introduction of the single most important band in the whole story, so I'm going to stretch out a bit. I should also mention that there are a couple of discussions of sudden, traumatic, deaths in this episode.\n\nWith all that said, settle in, this is going to take a while.\n\nEvery British act we've looked at so far -- and many of those we're going to look at in the next year or two -- was based in London. Either they grew up there, or they moved there before their musical career really took off. The Beatles, during the time we're covering in this episode, were based in Liverpool. While they did eventually move to London, it wasn't until after they'd started having hits. And what listeners from outside the UK might not realise is what that means in terms of attitudes and perceptions. Liverpool is a large city -- it currently has a population of around half a million, and the wider Liverpool metropolitan area is closer to two million -- but like all British cities other than London, it was regarded largely as a joke in the British media, and so in return the people of Liverpool had a healthy contempt for London.\n\nTo give Americans some idea of how London dominates in Britain, and thus how it's thought of outside London, imagine that New York, Washington DC, and Los Angeles were all the same city -- that the financial, media, and political centres of the country were all the same place. Now further imagine that Silicon Valley and all the Ivy League universities were half an hour's drive from that city. Now, imagine how much worse the attitudes that that city would have about so-called \"flyover states\" would be, and imagine in return how people in large Midwestern cities like Detroit or Chicago would think about that big city.\n\nIn this analogy, Liverpool is Detroit, and like Detroit, it was very poor and had produced a few famous musicians, most notably Billy Fury, who was from an impoverished area of Liverpool called the Dingle:\n\n[Excerpt: Billy Fury, \"Halfway to Paradise\"]\n\nBut Fury had, of course, moved to London to have his career. That's what you did.\n\nBut in general, Liverpool, if people in London thought of it at all, was thought of as a provincial backwater full of poor people, many of them Irish, and all of them talking with a ridiculous accent. Liverpool was ignored by London, and that meant that things could develop there out of sight.\n\nThe story of the Beatles starts in the 1950s, with two young men in their mid-teens. John Winston Lennon was born in 1940, and had had a rather troubled childhood. His father had been a merchant seaman who had been away in the war, and his parents' relationship had deteriorated for that and other reasons. As a result, Lennon had barely known his father, and when his mother met another man, Lennon's aunt, Mary Smith, who he always called Mimi, had taken him in, believing that his mother \"living in sin\" would be a bad influence on the young boy.\n\nThe Smith family were the kind of lower middle class family that seemed extremely rich to the impoverished families in Liverpool, but were not well off by any absolute standard. Mimi, in particular, was torn between two very different urges. On one hand, she had strongly bohemian, artistic, urges -- as did all of her sisters. She was a voracious reader, and a lover of art history, and encouraged these tendencies in John. But at the same time, she was of that class which has a little status, but not much security, and so she was extremely wary of the need to appear respectable. This tension between respectability and rebellion was something that would appear in many of the people who Lennon later worked with, such as Brian Epstein and George Martin, and it was something that Lennon would always respond to -- those people would be the only ones who Lennon would ever view as authority figures he could respect, though he would also resent them at times.\n\nAnd it might be that combination of rebellion and respectability that Lennon saw in Paul McCartney. McCartney was from a family who, in the Byzantine world of the British class system of the time, were a notch or so lower than the Smith family who raised Lennon, but he was academically bright, and his family had big plans for him -- they thought that it might even be possible that he might become a teacher if he worked very hard at school. McCartney was a far less openly rebellious person than Lennon was, but he was still just as caught up in the music and fashions of the mid-fifties that his father associated with street gangs and hooliganism.\n\nLennon, like many teenagers in Britain at the time, had had his life changed when he first heard Elvis Presley, and he had soon become a rock and roll obsessive -- Elvis was always his absolute favourite, but he also loved Little Richard, who he thought was almost as good, and he admired Buddy Holly, who had a special place in Lennon's heart as Holly wore glasses on stage, something that Lennon, who was extremely short-sighted, could never bring himself to do, but which at least showed him that it was a possibility.\n\nLennon was, by his mid-teens, recreating a relationship with his mother, and one of the things they bonded over was music -- she taught him how to play the banjo, and together they worked out the chords to \"That'll Be the Day\", and Lennon later switched to the guitar, playing banjo chords on five of the six strings.\n\nLike many, many, teenagers of the time, Lennon also formed a skiffle group, which he called the Quarrymen, after a line in his school song. The group tended to have a rotating lineup, but Lennon was the unquestioned leader. The group had a repertoire consisting of the same Lonnie Donegan songs that every other skiffle group was playing, plus any Elvis and Buddy Holly songs that could sound reasonable with a lineup of guitars, teachest bass, and washboard.\n\nThe moment that changed the history of the music, though, came on July the sixth, 1957, when Ivan Vaughan, a friend of Lennon's, invited his friend Paul McCartney to go and see the Quarry Men perform at Woolton Village Fete. That day has gone down in history as \"the day John met Paul\", although Mark Lewisohn has since discovered that Lennon and McCartney had briefly met once before. It is, though, the day on which Lennon and McCartney first impressed each other musically.\n\nMcCartney talks about being particularly impressed that the Quarry Men's lead singer was changing the lyrics to the songs he was performing, making up new words when he forgot the originals -- he says in particular that he remembers Lennon singing \"Come Go With Me\" by the Del-Vikings:\n\n[Excerpt: The Del-Vikings, \"Come Go With Me\"]\n\nMcCartney remembers Lennon as changing the lyrics to \"come go with me, right down to the penitentiary\", and thinking that was clever.\n\nAstonishingly, some audio recording actually exists of the Quarry Men's second performance that day -- they did two sets, and this second one comes just after Lennon met McCartney rather than just before. The recording only seems to exist in a very fragmentary form, which has snatches of Lennon singing \"Baby Let's Play House\" and Lonnie Donegan's hit \"Puttin' on the Style\", which was number one on the charts at the time, but that even those fragments have survived, given how historic a day this was, is almost miraculous:\n\n[Excerpt: The Quarrymen, \"Puttin' on the Style\"]\n\nAfter the first set, Lennon met McCartney, who was nearly two years younger, but a more accomplished musician -- for a start, he knew how to tune the guitar with all six strings, and to proper guitar tuning, rather than tuning five strings like a banjo. Lennon and his friends were a little nonplussed by McCartney holding his guitar upside-down at first -- McCartney is left-handed -- but despite having an upside-down guitar with the wrong tuning, McCartney managed to bash out a version of Eddie Cochran's \"Twenty-Flight Rock\", a song he would often perform in later decades when reminding people of this story:\n\n[Excerpt: Paul McCartney, \"Twenty-Flight Rock\"]\n\nThis was impressive to Lennon for three reasons. The first was that McCartney was already a strong, confident performer -- he perhaps seemed a little more confident than he really was, showing off in front of the bigger boys like this. The second was that \"Twenty-Flight Rock\" was a moderately obscure song -- it hadn't charted, but it *had* appeared in The Girl Can't Help It, a film which every rock and roll lover in Britain had watched at the cinema over and over. Choosing that song rather than, say, \"Be-Bop-A-Lula\", was a way of announcing a kind of group affiliation -- \"I am one of you, I am a real rock and roll fan, not just a casual listener to what's in the charts\".\n\nI stress that second point because it's something that's very important in the history of the Beatles generally -- they were *music fans*, and often fans of relatively obscure records. That's something that bound Lennon and McCartney, and later the other members, together from the start, and something they always noted about other musicians. They weren't the kind of systematic scholars who track down rare pressings and memorise every session musician's name, but they were constantly drawn to find the best new music, and to seek it out wherever they could.\n\nBut the most impressive thing for Lennon -- and one that seems a little calculated on McCartney's part, though he's never said that he thought about this that I'm aware of -- was that this was an extremely wordy song, and McCartney *knew all the words*. Remember that McCartney had noticed Lennon forgetting the words to a song with lyrics as simple as \"come, come, come, come, come into my heart/Tell me darling we will never part\", and here's McCartney singing this fast-paced, almost patter song, and getting the words right.\n\nFrom the beginning, McCartney was showing how he could complement Lennon -- if Lennon could impress McCartney by improvising new lyrics when he forgot the old ones, then McCartney could impress Lennon by remembering the lyrics that Lennon couldn't -- and by writing them down for Lennon, sharing his knowledge freely.\n\nMcCartney went on to show off more, and in particular impressed Lennon by going to a piano and showing off his Little Richard imitation. Little Richard was the only serious rival to Elvis in Lennon's affections, and McCartney could do a very decent imitation of him. This was someone special, clearly.\n\nBut this put Lennon in a quandary. McCartney was clearly far, far, better than any of the Quarry Men -- at least Lennon's equal, and light years ahead of the rest of them. Lennon had a choice -- invite this young freak of nature into his band, and improve the band dramatically, but no longer be the unquestioned centre of the group, or remain in absolute control but not have someone in the group who *knew the words* and *knew how to tune a guitar*, and other such magical abilities that no mere mortals had.\n\nThose who only know of Lennon from his later reputation as a massive egoist would be surprised, but he decided fairly quickly that he had to make the group better at his own expense. He invited McCartney to join the group, and McCartney said yes.\n\nOver the next few months the membership of the Quarry Men changed. They'd been formed while they were all at Quarry Bank Grammar School, but that summer Lennon moved on to art school. I'm going to have to talk about the art school system, and the British education system of the fifties and early sixties a lot over the next few months, but here's an extremely abbreviated and inaccurate version that's good enough for now.\n\nBetween the ages of eleven and sixteen, people in Britain -- at least those without extremely rich parents, who had a different system -- went to two kinds of school depending on the result of an exam they took aged eleven, which was based on some since-discredited eugenic research about children's potential. If you passed the exam, you were considered academically apt, and went to a grammar school, which was designed to filter you through to university and the professions. If you failed the exam, you went to a secondary modern, which was designed to give you the skills to get a trade and make a living working with your hands. And for the most part, people followed the pipeline that was set up for them. You go to grammar school, go to university, become a lawyer or a doctor or a teacher. You go to secondary modern, leave school at fourteen, become a plumber or a builder or a factory worker.\n\nBut there are always those people who don't properly fit into the neat categories that the world tries to put them in. And for people in their late teens and early twenties, people who'd been through the school system but not been shaped properly by it, there was another option at this time. If you were bright and creative, but weren't suited for university because you'd failed your exams, you could go to art school.\n\nThe supposed purpose of the art schools was to teach people to do commercial art, and they would learn skills like lettering and basic draughtsmanship. But what the art schools really did was give creative people space to explore ideas, to find out about areas of art and culture that would otherwise have been closed to them. Keith Richards, Pete Townshend, Ian Dury, Ray Davies, Bryan Ferry, Syd Barrett, and many more people we'll be seeing over the course of this story went to art school, and as David Bowie would put it later, the joke at the time was that you went to art school to learn to play blues guitar.\n\nWith Lennon and his friends all moving on from the school that had drawn them together, the group stabilised for a time on a lineup of Lennon, McCartney, Colin Hanton, Len Garry, and Eric Griffiths. But the first time this version of the group played live, while McCartney sang well, he totally fluffed his lead guitar lines on stage. While there were three guitarists in the band at this point, they needed someone who could play lead fluently and confidently on stage.\n\nEnter George Harrison, who had suddenly become a close friend of McCartney. Harrison went to the same school as McCartney -- a grammar school called the Liverpool Institute, but was in the year below McCartney, and so the two had always been a bit distant. However, at the same time as Lennon was moving on to art school after failing his exams, McCartney was being kept back a year for failing Latin -- which his father always thought was deliberate, so he wouldn't have to go to university. Now he was in the same year at school as Harrison, and they started hanging out together.\n\nThe two bonded strongly over music, and would do things like take a bus journey to another part of town, where someone lived who they heard owned a copy of \"Searchin'\" by the Coasters:\n\n[Excerpt: The Coasters, \"Searchin'\"]\n\nThe two knocked on this stranger's door, asked if he'd play them this prized record, and he agreed -- and then they stole it from him as they left his house. Another time they took the bus to another part of town again, because they'd heard that someone in that part of town knew how to play a B7 chord on his guitar, and sat there as he showed them.\n\nSo now the Quarrymen needed a lead guitarist, McCartney volunteered his young mate. There are a couple of stories about how Harrison came to join the band -- apparently he auditioned for Lennon at least twice, because Lennon was very unsure about having such a young kid in his band -- but the story I like best is that Harrison took his guitar to a Quarry Men gig at Wilson Hall -- he'd apparently often take his guitar to gigs and just see if he could sit in with the bands. On the bill with the Quarry Men was another group, the Eddie Clayton Skiffle Group, who were generally regarded as the best skiffle band in Liverpool. Lennon told Harrison that he could join the band if he could play as well as Clayton, and Harrison took out his guitar and played \"Raunchy\":\n\n[Excerpt: Bill Justis, \"Raunchy\"]\n\nI like this story rather than the other story that the members would tell later -- that Harrison played \"Raunchy\" on a bus for Lennon -- for one reason. The drummer in the Eddie Clayton Skiffle Group was one Richy Starkey, and if it happened that way, the day that George joined the Quarry Men was also the day that John, Paul, George, and Ringo were all in the same place for the first time.\n\nGeorge looked up to John and essentially idolised him, though Lennon thought of him as a little annoying at times -- he'd follow John everywhere, and not take a hint when he wasn't wanted sometimes, just eager to be with his big cool new mate. But despite this tiny bit of tension, John, Paul, and George quickly became a solid unit -- helped by the fact that the school that Paul and George went to was part of the same complex of buildings as Lennon's art college, so they'd all get the bus there and back together.\n\nGeorge was not only younger, he was a notch or two further down the social class ladder than John or Paul, and he spoke more slowly, which made him seem less intelligent. He came from Speke, which was a rougher area, and he would dress even more like a juvenile delinquent than the others.\n\nMeanwhile, Len Garry and Eric Griffiths left the group -- Len Garry because he became ill and had to spend time in hospital, and anyway they didn't really need a teachest bass. What they did need was an electric bass, and since they had four guitars now they tried to persuade Eric to get one, but he didn't want to pay that much money, and he was always a little on the outside of the main three members, as he didn't share their sense of humour. So the group got Nigel Walley, who was acting as the group's manager, to fire him. The group was now John, Paul, and George all on guitars, and Colin Hanton on drums. Sometimes, if they played a venue that had a piano, they'd also bring along a schoolfriend of Paul's, John \"Duff\" Lowe, to play piano.\n\nMeanwhile, the group were growing in other ways. Both John and Paul had started writing songs, together and apart. McCartney seems to have been the first, writing a song called \"I Lost My Little Girl\" which he would eventually record more than thirty years later:\n\n[Excerpt: Paul McCartney, \"I Lost My Little Girl\"]\n\nLennon's first song likewise sang about a little girl, this time being \"Hello, Little Girl\".\n\nBy the middle of 1958, this five-piece group was ready to cut their first record -- at a local studio that would cut a single copy of a disc for you. They went into this studio at some time around July 1958, and recorded two songs. The first was their version of \"That'll Be the Day\":\n\n[Excerpt: The Quarry Men, \"That'll be the Day\"]\n\nThe B-side was a song that McCartney had written, with a guitar solo that George had come up with, so the label credit read \"McCartney/Harrison\". \"In Spite of All the Danger\" seems to have been inspired by Elvis' \"Trying to Get to You\":\n\n[Excerpt: Elvis Presley, \"Trying to Get to You\"]\n\nIt's a rough song, but a good attempt for a teenager who had only just started writing songs:\n\n[Excerpt: The Quarry Men, \"In Spite of All the Danger\"]\n\nApparently Lowe and Hanton hadn't heard the song before they started playing, but they make a decent enough fist of it in the circumstances. Lennon took the lead even though it was McCartney's song -- he said later \"I was such a bully in those days I didn’t even let Paul sing his own song.\"\n\nThat was about the last time that this lineup of Quarry Men played together. In July, the month that seems likely for the recording, Lowe finished at the Liverpool Institute, and so he drifted away from McCartney and Harrison. Meanwhile Hanton had a huge row with the others after a show, and they fell out and never spoke again. The Quarry Men were reduced to a trio of Lennon, McCartney, and Harrison.\n\nBut -- possibly the very day after that recording if an unreliable plaque at the studio where they recorded it is to be believed -- something happened which was to have far more impact on the group than the drummer leaving. John Lennon's mother, with whom he'd slowly been repairing his relationship, had called round to visit Mimi. She left the house, and bumped into Nigel Walley, who was calling round to see John. She told him he wasn't there, and that he could walk with her to the bus stop. They walked a little while, then went off in different directions. Walley heard a thump and turned round -- Julia Lennon had been hit by a car and killed instantly.\n\nAs you can imagine, John's mother dying caused him a huge amount of distress, but it also gave him a bond with McCartney, whose own mother had died of cancer shortly before they met. Neither really spoke about it to each other, and to the extent they did it was with ultra-cynical humour -- but the two now shared something deeper than just the music, even though the music itself was deep enough.\n\nLennon became a much harder, nastier, person after this, at least for a time, his natural wit taking on a dark edge, and he would often drink too much and get aggressive. But life still went on, and John, Paul, and George kept trying to perform -- though the gigs dried up, and they didn't have a drummer any more. They'd just say \"the rhythm's in the guitars\" when asked why they didn't have one. They were also no longer the Quarry Men -- they didn't have a name.\n\nAt one point late in the year, they also only had two guitars between the three of them -- Lennon seems to have smashed his in a fit of fury after his mother's death. But he stole one backstage at a talent contest, and soon they were back to having three.\n\nThat talent show was one run by Carroll Levis, who we talked about before in the episode on \"Shakin' All Over\". The three boys went on Levis' show, this time performing as Johnny & The Moondogs -- &nbsp;in Manchester, at the Hippodrome in Ancoats, singing Buddy Holly's \"Think it Over\":\n\n[Excerpt: The Crickets, \"Think it Over\"]\n\nLennon sang lead with his arms draped over the shoulders of Paul and George, who sang backing vocals and played guitar. They apparently did quite well, but had to leave before the show finished to get the last train back to Liverpool, and so never found out whether the audience would have made them the winner, with the possibility of a TV appearance. They did well enough, though, to impress a couple of other young lads on the bill, two Manchester singers named Allan Clarke and Graham Nash.\n\nBut in general, the Japage Three, a portmanteau of their names that they settled on as their most usual group name at this point, played very little in 1959 -- indeed, George spent much of the early part of the year moonlighting in the Les Stewart Quartet, another group, though he still thought of Lennon and McCartney as his musical soulmates; the Les Stewart Quartet were just a gig.\n\nThe three of them would spend much of their time at the Jacaranda, a coffee bar opened by a Liverpool entrepreneur, Allan Williams, in imitation of the 2is, which was owned by a friend of his. Lennon was also spending a lot of time with an older student at his art school, Stuart Sutcliffe, one of the few people in the world that Lennon himself looked up to.\n\nThe Les Stewart Quartet would end up indirectly being key to the Beatles' development, because after one of their shows at a local youth club they were approached by a woman named Mona Best. Mona's son Pete liked to go to the youth club, but she was fairly protective of him, and also wanted him to have more friends -- he was a quiet boy who didn't make friends easily. So she'd hit upon a plan -- she'd open her own club in her cellar, since the Best family were rich enough to have a big house. If there was a club *in Pete's house* he'd definitely make lots of friends. They needed a band, and she asked the Les Stewart Quartet if they'd like to be the resident band at this new club, the Casbah, and also if they'd like to help decorate it.\n\nThey said yes, but then Paul and George went on a hitch-hiking holiday around Wales for a few days, and George didn't get back in time to play a gig the quartet had booked. Ken Brown, the other guitarist, didn't turn up either, and Les Stewart got into a rage and split the group. Suddenly, the Casbah had no group -- George and Ken were willing to play, but neither was a lead singer -- and no decorators either. So George roped in John and Paul, who helped decorate the place, and with the addition of Ken Brown, the group returned to the Quarry Men name for their regular Saturday night gig at the Casbah.\n\nThe group had no bass player or drummer, and they all kept pestering everyone they knew to get a bass or a drum kit, but nobody would bite. But then Stuart Sutcliffe got half a painting in an exhibition put on by John Moores, the millionaire owner of Littlewoods, who was a big patron of the arts in Liverpool. I say he got half a painting in the exhibition, because the painting was done on two large boards -- Stuart and his friends took the first half of the painting down to the gallery, went back to get the other half, and got distracted by the pub and never brought it.\n\nBut Moores was impressed enough with the abstract painting that he bought it at the end of the exhibition's run, for ninety pounds -- about two thousand pounds in today's money. And so Stuart's friends gave him a choice -- he could either buy a bass or a drum kit, either would be fine. He chose the bass.\n\nBut the same week that Stuart joined, Ken Brown was out, and they lost their gig at the Casbah. John, Paul, George and Ken had turned up one Saturday, and Ken hadn't felt well, so instead of performing he just worked on the door. At the end of the show, Mona Best insisted on giving Ken an equal share of the money, as agreed. John, Paul, and George wouldn't stand for that, and so Ken was out of the group, and they were no longer playing for Mona Best.\n\nStuart joining the group caused tensions -- George was fine with him, thinking that a bass player who didn't yet know how to play was better than no bass player at all, but Paul was much less keen. Partly this was because he thought the group needed to get better, which would be hard with someone who couldn't play, but also he was getting jealous of Sutcliffe's closeness to Lennon, especially when the two became flatmates. But John wanted him in the group, and what John wanted, he got.\n\nThere are recordings of the group around this time that circulate -- only one has been released officially, a McCartney instrumental called \"Cayenne\", but the others are out there if you look:\n\n[Excerpt: The Quarry Men, \"Cayenne\"]\n\nThe gigs had dried up again, but they did have one new advantage -- they now had a name they actually liked. John and Stuart had come up with it, inspired by Buddy Holly's Crickets. They were going to be Beatles, with an a.\n\nShortly after the Beatles' first appearance under that name, at the art school student union, came the Liverpool gig which was to have had Eddie Cochran and Gene Vincent headlining, before Cochran died. A lot of Liverpool groups were booked to play on the bill there, but not the Beatles -- though Richy Starkey was going to play the gig, with his latest group Rory Storm and the Hurricanes. Allan Williams, the local promoter, added extra groups to fill out the bill, including Gerry and the Pacemakers, and suddenly everyone who loved rock and roll in Liverpool realised that there were others out there like them. Overnight, a scene had been born.\n\nAnd where there's a scene, there's money to be made. Larry Parnes, who had been the national promoter of the tour, was at the show and realised that there were a lot of quite proficient musicians in Liverpool. And it so happened that he needed backing bands for three of his artists who were going on tour, separately -- two minor stars, Duffy Power and Johnny Gentle, and one big star, Billy Fury. And both Gentle and Fury were from Liverpool themselves. So Parnes asked Allan Williams to set up auditions with some of the local groups. Williams invited several groups, and one he asked along was the Beatles, largely because Lennon and Sutcliffe begged him. He also found them a drummer, Tommy Moore, who was a decade older than the rest of them -- though Moore didn't turn up to the audition because he had to work, and so Johnny \"Hutch\" Hutchinson of Cass and the Cassanovas sat in with them, much to Hutch's disgust -- he hated the Beatles, and especially Lennon.\n\nCass of the Cassanovas also insisted that \"the Beatles\" was a stupid name, and that the group needed to be Something and the Somethings, and he suggested Long John and the Silver Beatles, and that stuck for a couple of shows before they reverted to their proper name.\n\nThe Beatles weren't chosen for any of the main tours that were being booked, but then Parnes phoned Williams up -- there were some extra dates on the Johnny Gentle tour that he hadn't yet booked a group for. Could Williams find him a band who could be in Scotland that Friday night for a nine-day tour? Williams tried Cass and the Cassanovas, Rory Storm and the Hurricanes, and Gerry and the Pacemakers, but none of them could go on tour at such short notice. They all had gigs booked, or day jobs they had to book time off with.\n\nThe Beatles had no gigs booked, and only George had a day job, and he didn't mind just quitting that. They were off to Scotland. They were so inspired by being on tour with a Larry Parnes artist that most of them took on new names just like those big stars -- George became Carl Harrison, after Carl Perkins, Stuart became Stuart de Staël, after his favourite painter, and Paul became Paul Ramon, which he thought sounded mysterious and French. There's some question about whether John took on a new name -- some sources have him becoming \"Long John\", while others say he was \"Johnny\" Lennon rather than John. Tommy Moore, meanwhile, was just Thomas Moore.\n\nIt was on this tour, of course, that Lennon helped Johnny Gentle write \"I've Just Fallen For Someone\", which we talked about last week:\n\n[Excerpt: Darren Young, \"I've Just Fallen For Someone\"]\n\nThe tour was apparently fairly miserable, with horrible accommodation, poor musicianship from the group, and everyone getting on everyone's nerves -- George and Stuart got into fistfights, John bullied Stuart a bit because of his poor playing, and John particularly didn't get on well with Moore -- a man who was a decade older, didn't share their taste in music, and worked in a factory rather than having the intellectual aspirations of the group. The two hated each other by the end of the tour.\n\nBut the tour did also give the group the experience of signing autographs, and of feeling like stars in at least a minor way. When they got back to Liverpool, George moved in with John and Stuart, to get away from his mum telling him to get a proper job, and they got a few more bookings thanks to Williams, but they soon became drummerless -- they turned up to a gig one time to find that Tommy Moore wasn't there. They went round to his house, and his wife shouted from an upstairs window, \"Yez can piss off, he's had enough of yez and gone back to work at the bottle factory\". The now four-piece group carried on, however, and recordings exist of them in this period, sounding much more professional than only a few months before, including performances of some of their own songs. The most entertaining of these is probably \"You'll Be Mine\", an Ink Spots parody with some absurd wordplay from Lennon:\n\n[Excerpt: The Beatles, \"You'll Be Mine\"]\n\nSoon enough the group found another drummer, Norm Chapman, and carried on as before, getting regular bookings thanks to Williams.\n\nThere was soon a temporary guest at the flat John, Stuart, and George shared with several other people -- Royston Ellis, the Beat poet and friend of the Shadows, had turned up in Liverpool and latched on to the group, partly because he fancied George. He performed with them a couple of times, crashed at the flat, and provided them with two formative experiences -- he gave them their first national press, talking in Record and Show Mirror about how he wanted them to be his full-time group, and he gave them their first drug experience, showing them how to get amphetamines out of inhalers.\n\nWhile the group's first national press was positive, there was soon some very negative press indeed associated with them. A tabloid newspaper wanted to do a smear story about the dangerous Beatnik menace. The article talked about how \"they revel in filth\", and how beatniks were \"a dangerous menace to our young people… a corrupting influence of drug addicts and peddlers, degenerates who specialise in obscene orgies\". And for some reason -- it's never been made clear exactly how -- the beatnik \"pad\" they chose to photograph for this story was the one that John, Stuart, and George lived in, though they weren't there at the time -- several of their friends and associates are in the pictures though.\n\nThey were all kicked out of their flat, and moved back in with their families, and around this time they lost Chapman from the group too -- he was called up to do his National Service, one of the last people to be conscripted before conscription ended for good. They were back to a four-piece again, and for a while Paul was drumming.\n\nBut then, as seems to have happened so often with this group, a bizarre coincidence happened.\n\nA while earlier, Allan Williams had travelled to Hamburg, with the idea of trying to get Liverpool groups booked there. He'd met up with Bruno Koschmider, the owner of a club called the Kaiserkeller. Koschmider had liked the idea, but nothing had come of it, partly because neither could speak the other's language well. A little while later, Koschmider had remembered the idea and come over to the UK to find musicians. He didn't remember where Williams was from, so of course he went to London, to the 2is, and there he found a group of musicians including Tony Sheridan, who we talked about back in the episode on \"Brand New Cadillac\", the man who'd been Vince Taylor's lead guitarist and had a minor solo career:\n\n[Excerpt: Tony Sheridan, \"Why?\"]\n\nSheridan was one of the most impressive musicians in Britain, but he also wanted to skip the country -- he'd just bought a guitar on credit in someone else's name, and he also had a wife and six-month-old baby he wanted rid of. He eagerly went off with Koschmider, and a scratch group called the Jets soon took up residence at the Kaiserkeller.\n\nMeanwhile, in Liverpool, Derry and the Seniors were annoyed. Larry Parnes had booked them for a tour, but then he'd got annoyed at the unprofessionalism of the Liverpool bands he was booking and cancelled the booking, severing his relationship with Williams. The Seniors wanted to know what Williams was going to do about it.\n\nThere was no way to get them enough gigs in Liverpool, so Williams, being a thoroughly decent man who had a sense of obligation, offered to drive the group down to London to see if they could get work there. He took them to the 2is, and they were allowed to get up and play there, since Williams was a friend of the owner.\n\nAnd Bruno Koschmider was there. The Jets hadn't liked playing at Williams' club, and they'd scarpered to another one with better working conditions, which they helped get off the ground and renamed the Top Ten, after Vince Taylor's club in London. So Bruno had come back to find another group, and there in the same club at the same time was the man who'd given him the idea in the first place, with a group. Koschmider immediately signed up Derry and the Seniors to play at the Kaiserkeller.\n\nMeanwhile, the best gig the Beatles could get, also through Williams, was backing a stripper, where they played whatever instrumentals they knew, no matter how inappropriate, things like the theme from The Third Man:\n\n[Excerpt: Anton Karas, \"Theme from The Third Man\"]\n\nA tune guaranteed to get the audience into a sexy mood, I'm sure you'll agree.\n\nBut then Allan Williams got a call from Koschmider. Derry and the Seniors were doing great business, and he'd decided to convert another of his clubs to be a rock and roll club. Could Williams have a group for him by next Friday? Oh, and it needed to be five people.\n\nWilliams tried Rory Storm and the Hurricanes. They were busy. He tried Cass and the Cassanovas. They were busy. He tried Gerry and the Pacemakers. They were busy. Finally, he tried the Beatles. They weren't busy, and said yes they could go to Hamburg that week. There were a few minor issues, like there not being five of them, none of them having passports, and them not having a drummer. The passports could be sorted quickly -- there's a passport office in Liverpool -- but the lack of a fifth Beatle was more of a problem. In desperation, they turned eventually to Pete Best, Mrs. Best's son, because they knew he had a drum kit. He agreed.\n\nAllan Williams drove the group to Hamburg, and they started playing six-hour sets every night at the Indra, not finishing til three in the morning, at which point they'd make their way to their lodgings -- the back of a filthy cinema.\n\nBy this time, the Beatles had already got good -- Howie Casey, of Derry and the Seniors, who'd remembered the Beatles as being awful at the Johnny Gentle audition, came over to see them and make fun of them, but found that they were far better than they had been. But playing six hours a night got them *very* good *very* quickly -- especially as they decided that they weren't going to play the same song twice in a night, meaning they soon built up a vast repertoire.\n\nBut right from the start, there was a disconnect between Pete Best and the other four -- they socialised together, and he went off on his own. He was also a weak player -- he was only just starting to learn -- and so the rest of the group would stamp their feet to keep him in time. That, though, also gave them a bit more of a stage act than they might otherwise have had.\n\nThere are lots of legendary stories about the group's time in Hamburg, and it's impossible to sort fact from fiction, and the bits we can sort out would get this podcast categorised as adult content, but they were teenagers, away from home for a long period for the first time, living in a squalid back room in the red light district of a city with a reputation for vice. I'm sure whatever you imagine is probably about right.\n\nAfter a relatively short time, they were moved from the Indra, which had to stop putting on rock and roll shows, to the Kaiserkeller, where they shared the bill with Rory Storm & the Hurricanes, up to that point considered Liverpool's best band. There's a live recording of the Hurricanes from 1960, which shows that they were certainly powerful:\n\n[Excerpt: Rory Storm and the Hurricanes, \"Brand New Cadillac\"]\n\nThat recording doesn't have the Hurricanes' normal drummer on, who was sick for that show.\n\nBut compared to what the Beatles had become -- a stomping powerhouse with John Lennon, whose sense of humour was both cruel and pointed, doing everything he could to get a rise out of the audience -- they were left in the dust. A letter home that George Harrison wrote sums it up -- \"Rory Storm & the Hurricanes came out here the other week, and they are crumby. He does a bit of dancing around but it still doesn’t make up for his phoney group. The only person who is any good in the group is the drummer.\"\n\nThat drummer was Richy Starkey from the Eddie Clayton Skiffle Group, now performing as Ringo Starr. They struck up a friendship, and even performed together at least once -- John, Paul, George, and Ringo acting as the backing group for Lu Walters of the Hurricanes on a demo, which is frustratingly missing and hasn't been heard since.\n\nThey were making other friends, too. There was Tony Sheridan, who they'd seen on TV, but who would now sometimes jam with them as equals. And there was a trio of arty bohemian types who had stumbled across the club, where they were very out of place -- Astrid Kirscherr, Klaus Voormann, and Jurgen Vollmer. They all latched on to the Beatles, and especially to Stuart, who soon started dating Astrid, despite her speaking no English and him speaking no German.\n\nBut relations between Koschmider and the Beatles had worsened, and he reported to the police that George, at only seventeen, was under-age. George got deported. The rest of the group decided to move over to the Top Ten Club, and as a parting gift, Paul and Pete nailed some condoms to their bedroom wall and set fire to them. Koschmider decided to report this to the police as attempted arson, and those two were deported as well. John followed a week later, while Stuart stayed in Hamburg for a while, to spend more time with Astrid, who he planned to marry.\n\nThe other four regrouped, getting in a friend, Chas Newby, as a temporary bass player while Stuart was away. And on the twenty-seventh of December, 1960, when they played Litherland Town Hall, they changed the Liverpool music scene. They were like nothing anyone had ever seen, and the audience didn't dance -- they just rushed to the stage, to be as close to the performance as possible. The Beatles had become the best band in Liverpool. Mark Lewisohn goes further, and suggests that the three months of long nights playing different songs in Hamburg had turned them into the single most experienced rock band *in the world* -- which seems vanishingly unlikely to me, but Lewisohn is not a man given to exaggeration.\n\nBy this time, Mona Best had largely taken over the group's bookings, and there were a lot of them, as well as a regular spot at the Casbah. Neil Aspinall, a friend of Pete's, started driving them to gigs, while they also had a regular MC, Bob Wooler, who ran many local gigs, and who gave the Beatles their own theme music -- he'd introduce them with the fanfare from Rossini's William Tell Overture:\n\n[Excerpt: Rossini, \"William Tell Overture\"]\n\nStuart came over from Hamburg in early January, and once again the Beatles were a five-piece -- and by now, he could play quite well, well enough, at any rate, that it didn't destroy the momentum the group had gathered. The group were getting more and more bookings, including the venue that would become synonymous with them, the Cavern, a tiny little warehouse cellar that had started as a jazz club, and that the Quarry Men had played once a couple of years earlier, but had been banned from for playing too much rock and roll.\n\nNow, the Beatles were getting bookings at the Cavern's lunchtime sessions, and that meant more than it seemed. Most of the gigs they played otherwise were on the outskirts of the city, but the Cavern was in the city centre. And that meant that for the lunchtime sessions, commuters from outside the city were coming to see them -- which meant that the group got fans from anywhere within commuting distance, fans who wanted them to play in their towns.\n\nMeanwhile, the group were branching out musically -- they were particularly becoming fascinated by the new R&B, soul, and girl-group records that were coming out in the US. After already having loved \"Money\" by Barrett Strong, John was also obsessed with the Miracles, and would soon become a fervent fan of anything Motown, and the group were all big fans of the Shirelles. As they weren't playing original material live, and as every group would soon learn every other group's best songs, there was an arms race on to find the most exciting songs to cover. As well as Elvis and Buddy and Eddie, they were now covering the Shirelles and Ray Charles and Gary US Bonds.\n\nThe group returned to Hamburg in April, Paul and Pete's immigration status having been resolved and George now having turned eighteen, and started playing at the Top Ten club, where they played even longer sets, and more of them, than they had at the Kaiserkeller and the Indra. Tony Sheridan started regularly joining them on stage at this time, and Paul switched to piano while Sheridan added the third guitar. This was also when they started using Preludin, a stimulant related to amphetamines which was prescribed as a diet drug -- Paul would take one pill a night, George a couple, and John would gobble them down. But Pete didn't take them -- one more way in which he was different from the others -- and he started having occasional micro-sleeps in the middle of songs as the long nights got to him, much to the annoyance of the rest of the group. But despite Pete's less than stellar playing they were good enough that Sheridan -- the single most experienced musician in the British rock and roll scene -- described them as the best R&B band he'd ever heard.\n\nOnce they were there, they severed their relationship with Allan Williams, refusing to pay him his share of the money, and just cutting him out of their careers.\n\nMeanwhile, Stuart was starting to get ill. He was having headaches all the time, and had to miss shows on occasion. He was also the only Beatle with a passion for anything else, and he managed to get a scholarship to study art with the famous sculptor Eduardo Paolozzi, who was now working in Hamburg. Paul subbed for Stuart on bass, and eventually Stuart left the group, though on good terms with everyone other than Paul.\n\nSo it was John, Paul, George and Pete who ended up making the Beatles' first records. Bert Kaempfert, the most important man in the German music industry, had been to see them all at the Top Ten and liked what he saw. Outside Germany, Kaempfert was probably best known for co-writing Elvis' \"Wooden Heart\", which the Beatles had in their sets at this time:\n\n[Excerpt: Elvis Presley, \"Wooden Heart\"]\n\nKaempfert had signed Tony Sheridan to a contract, and he wanted the Beatles to back him in the studio -- and he was also interested in recording a couple of tracks with them on their own. The group eagerly agreed, and their first session started at eight in the morning on the twenty-second of June 1961, after they had finished playing all night at the club, and all of them but Pete were on Preludin for the session. Stuart came along for moral support, but didn't play.\n\nPete was a problem, though. He wasn't keeping time properly, and Kaempfert eventually insisted on removing his bass drum and toms, leaving only a snare, hi-hat, and ride cymbal for Pete to play.\n\nThey recorded seven songs at that session in total. Two of them were just by the Beatles. One was a version of \"Ain't She Sweet\", an old standard which Gene Vincent had recorded fairly recently, but the other was the only track ever credited to Lennon and Harrison as cowriters. On their first trip to Hamburg, they'd wanted to learn \"Man of Mystery\" by the Shadows:\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nBut there was a slight problem in that they didn't have a copy of the record, and had never heard it -- it came out in the UK while they were in Germany. So they asked Rory Storm to hum it for them. He hummed a few notes, and Lennon and Harrison wrote a parody of what Storm had sung, which they named \"Beatle Bop\" but by this point they'd renamed \"Cry For a Shadow\":\n\n[Excerpt: The Beatles, \"Cry For a Shadow\"]\n\nThe other five songs at the session were given over to Tony Sheridan, with the Beatles backing him, and the song that Kaempfert was most interested in recording was one the group had been performing on stage -- a rocked-up version of the old folk song \"My Bonnie\":\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"My Bonnie\"]\n\nThat was the record chosen as the single, but it was released not as by Tony Sheridan and the Beatles, but by Tony Sheridan and the Beat Brothers -- \"Beatles\", to German ears, sounded a little like \"piedels\", a childish slang term for penises. The Beatles had made their first record, but it wasn't one they thought much of. They knew they could do better.\n\nThe next week, the now four-piece Beatles returned to Liverpool, with much crying at Stuart staying behind -- even Paul, now Stuart was no longer a threat for John's attention, was contrite and tried to make amends to him.\n\nOn their return to Liverpool, they picked up where they had left off, playing almost every night, and spending the days trying to find new records -- often listening to the latest releases at NEMS, a department store with an extensive record selection. Brian Epstein, the shop's manager, prided himself on being able to get any record a customer wanted, and whenever anyone requested anything he'd buy a second copy for the shelves. As a result, you could find records there that you wouldn't get anywhere else in Liverpool, and the Beatles were soon adding more songs by the Shirelles and Gary US Bonds to their sets, as well as more songs by the Coasters and Ben E. King's \"Stand By Me\".\n\nThey were playing gigs further afield, and Neil Aspinall was now driving them everywhere. Aspinall was Pete Best's closest friend -- and was having an affair with Pete's mother -- but unlike Pete himself he also became close to the other Beatles, and would remain so for the rest of his life.\n\nBy this point, the group were so obviously the best band on the Liverpool scene that they were starting to get bored -- there was no competition. And by this point it really was a proper scene -- John's old art school friend Bill Harry had started up a magazine, Mersey Beat, which may be the first magazine anywhere in the world to focus on one area's local music scene. Brian Epstein from NEMS had a column, as did Bob Wooler, and often John's humorous writing would appear as well. The Beatles were featured in most issues -- although Paul McCartney's name was misspelled almost every time it appeared -- and not just because Lennon and Harry were friends. By this point there were the Beatles, and there were all the other groups in the area.\n\nFor several months this continued -- they learned new songs, they played almost every day, and they continued to be the best. They started to find it boring. The one big change that came at this point was when John and Paul went on holiday to Paris, saw Vince Taylor, bumped into their friend Jurgen from Hamburg, and got Jurgen to do their hair like his -- the story we told in the episode on \"Brand New Cadillac\". They now had the Beatles haircut, though they were still wearing leather. When they got back, George copied their new style straight away, but Pete decided to leave his hair in a quiff.\n\nThere was nowhere else to go without a manager to look after them. They needed management -- and they found it because of \"My Bonnie\":\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"My Bonnie\"]\n\n\"My Bonnie\" was far from a great record, but it was what led to everything that followed. The Beatles had mentioned from the stage at the Cavern that they had a record out, and a young man named Raymond Jones walked into NEMS and asked for a copy of it. Brian Epstein couldn't find it in the record company catalogues, and asked Jones for more information -- Jones explained that they were a Liverpool group, but the record had come out in Germany. A couple of days later, two young girls came into the shop asking for the same record, and now Epstein was properly intrigued -- in his view, if *two* people asked for a record, that probably meant a lot more than just two people wanted it. He decided to check these Beatles out for himself.\n\nEpstein was instantly struck by the group, and this has led to a lot of speculation over the years, because his tastes ran more to Sibelius than to Little Richard. As Epstein was also gay, many people have assumed that the attraction was purely physical. And it might well have been, at least in part, but the suggestion that everything that followed was just because of that seems unlikely -- Epstein was also someone who had a long interest in the arts, and had trained as an actor at RADA, the most prestigious actors' college in the UK, before taking up his job at the family store. Given that the Beatles were soon to become the most popular musicians in the history of the world, and were already the most popular musicians in the Liverpool area, the most reasonable assumption must be that Epstein was impressed by the same things that impressed roughly a billion other people over the next sixty years.\n\nEpstein started going to the Cavern regularly, to watch the Beatles and to make plans -- the immaculately dressed, public-school-educated, older rich man stood out among the crowd, and the Beatles already knew his face from his record shop, and so they knew something was going on. By late November, Brian had managed to obtain a box of twenty-five copies of \"My Bonnie\", and they'd sold out within hours. He set up a meeting with the Beatles, and even before he got them signed to a management contract he was using his contacts with the record industry in London to push the Beatles at record companies. Those companies listened to Brian, because NEMS was one of their biggest customers.\n\nDecember 1961, the month they signed with Brian Epstein, was also the month that they finally started including Lennon/McCartney songs in their sets. &nbsp;And within a couple of weeks of becoming their manager, even before he'd signed them to a contract, Brian had managed to persuade Mike Smith, an A&R man from Decca, to come to the Cavern to see the group in person. He was impressed, and booked them in for a studio session.\n\nDecember 61 was also the first time that John, Paul, George, and Ringo played together in that lineup, without any other musicians, when on the twenty-seventh of December Pete called in sick for a show, and the others got in their friend to cover for him. It wouldn't be the last time they would play together.\n\nOn New Year's Day 1962, the Beatles made the trek down to London to record fifteen songs at the Decca studios. The session was intended for two purposes -- to see if they sounded as good on tape as they did in the Cavern, and if they did to produce their first single. Those recordings included the core of their Cavern repertoire, songs like \"Money\":\n\n[Excerpt: The Beatles, \"Money (Decca version)\"]\n\nThey also recorded three Lennon/McCartney songs, two by Paul -- \"Love of the Loved\" and \"Like Dreamers Do\":\n\n[Excerpt: The Beatles, \"Like Dreamers Do\"]\n\nAnd one by Lennon -- \"Hello Little Girl\":\n\n[Excerpt: The Beatles, \"Hello Little Girl\"]\n\nAnd they were Lennon/McCartney songs, even though they were written separately -- the two agreed that they were going to split the credit on anything either of them wrote.\n\nThe session didn't go well -- the group's equipment wasn't up to standard and they had to use studio amps, and they're all audibly nervous -- but Mike Smith was still fairly confident that they'd be releasing something through Decca -- he just had to work out the details with his boss, Dick Rowe.\n\nMeanwhile, the group were making other changes. Brian suggested that they could get more money if they wore suits, and so they agreed -- though they didn't want just any suits, they wanted stylish mohair suits, like the black American groups they loved so much.\n\nThe Beatles were now a proper professional group -- but unfortunately, Decca turned them down. Dick Rowe, Mike Smith's boss, didn't think that electric guitars were going to become a big thing -- he was very tuned in to the American trends, and nothing with guitars was charting at the time. Smith was considering two groups -- the Beatles, and Brian Poole and the Tremeloes, and wanted to sign both. Rowe told him that he could sign one, but only one, of them. The Tremeloes had been better in the studio, and they lived round the corner from Smith and were friendly with him. There was no contest -- much as Smith wanted to sign both groups, the Tremeloes were the better prospect.\n\nRowe did make an offer to Epstein: if Epstein would pay a hundred pounds (a *lot* of money in those days), Tony Meehan, formerly of the Shadows, would produce the group in another session, and Decca would release that. Brian wasn't interested -- if the Beatles were going to make a record, they were going to make it with people who they weren't having to pay for the privilege.\n\nJohn, Paul, and George were devastated, but for their own reasons they didn't bother to tell Pete they'd been turned down.\n\nBut they did have a tape of themselves, at least -- a professional-quality recording that they could use to attract other labels. And their career was going forward in other ways. The same day Brian had his second meeting with Decca, they had an audition with the BBC in Manchester, where they were accepted to perform on Teenager's Turn, a radio programme hosted by the Northern Dance Orchestra. A few weeks later, on the seventh of March, they went to Manchester to record four songs in front of an audience, of which three would be broadcast:\n\n[Excerpt: The Beatles, \"Please Mr. Postman (Teenager's Turn)\"]\n\nThat recording of John singing \"Please Mr. Postman\" is historic for another reason, which shows just how on the cutting edge of musical taste the Beatles actually were -- it was the first time ever that a Motown song was played on the BBC.\n\nNow we get to the part of the story that, before Mark Lewisohn's work in his book a few years back, had always been shrouded in mystery. What Lewisohn shows is that George Martin was in fact forced to sign the Beatles, against his will, and that this may have been as a punishment.\n\nThe Beatles had already been turned down by Parlophone once, based on \"My Bonnie\", when Brian Epstein walked into the HMV store on Oxford Street in London in mid-February. HMV is now mostly known as a retail chain, Britain's biggest chain of physical media stores, but at the time it was owned by EMI, and was associated with their label of the same name -- HMV stood for \"His Master's Voice\", and its logo was the same one as America's RCA, with whom it had a mutual distribution deal for many years.\n\nAs a record retailer, Epstein naturally had a professional interest in other record shops, and he had a friend at HMV, who suggested to him that they could use a disc-cutting machine that the shop had to turn his copy of the Decca tapes into acetate discs, which would be much more convenient for taking round and playing to record labels. That disc-cutter was actually in a studio that musicians used for making records for themselves, much as the Quarry Men had years earlier -- it was in fact the studio where Cliff Richard had cut *his* first private demo, the one he'd used to get signed to EMI.\n\nJim Foy, the man who worked the lathe cutter, liked what he heard, and he talked with Brian about the group. Brian mentioned that some of the songs were originals, and Foy told him that EMI also owned a publishing company, Ardmore & Beechwood, and the office was upstairs -- would Brian like to meet with them to discuss publishing? Brian said he would like that.\n\nArdmore & Beechwood wanted the original songs on the demo. They were convinced that Lennon and McCartney had potential as songwriters, and that songs like \"Like Dreamers Do\" could become hits in the right hands. And Brian Epstein agreed with them -- but he also knew that the Beatles had no interest in becoming professional songwriters. They wanted to make records, not write songs for other people to record.\n\nBrian took his new discs round to George Martin at EMI -- who wasn't very impressed, and basically said \"Don't call us, we'll call you\". Brian went back to Liverpool, and got on with the rest of the group's career, including setting up another Hamburg residency for them, this time at a new club called the Star Club.\n\nThat Star Club residency, in April, would be devastating for the group -- on Tuesday the tenth of April, the same day John, Paul, and Pete got to Hamburg (George was ill and flew over the next day), Stuart Sutcliffe, who'd been having headaches and feeling ill for months, collapsed and died, aged only twenty-one. The group found out the next day -- they got to the airport to meet George, and bumped into Klaus and Astrid, who were there to meet Stuart's mother from the same flight. They asked where Stuart was, and heard the news from Astrid.\n\nJohn basically went off the rails. Most of the stories about Lennon's bad behaviour in Hamburg come from this trip in particular -- a young man dealing with his trauma by taking amphetamines and drinking too much, and resorting to cruel humour to mask the fact that he was traumatised by the death of his closest friend.\n\nBut the music still continued, and they even did another session for Tony Sheridan. Sheridan wasn't actually in the studio -- his vocal was overdubbed later -- but the four Beatles went into the studio along with the piano player Roy Brown -- the one who had taught Adam Faith how to sing like Buddy Holly, and who often joined them on stage during this period -- to record rock and roll versions of old standards for Sheridan to sing on:\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"Sweet Georgia Brown\"]\n\nBut it was while they were in Hamburg on this trip that the Beatles finally got a record contract.\n\nArdmore & Beechwood really wanted those songs, and they knew that the Beatles were only interested in making records. Then a song plugger called Kim Bennett hit upon the idea that would lead to the Beatles' success, and to almost everything that follows in subsequent episodes of this podcast. Ardmore and Beechwood were a subsidiary of EMI, and they had a budget for promoting songs. They could use that song-promoting budget... to pay for a record to be made. EMI could put it out, but the costs wouldn't be charged to whichever EMI label put the record out, but to Ardmore & Beechwood's promotional budget for the songs in question. The publishing company would then get two copyrights that it could perhaps use for a successful artist like Cliff Richard or Adam Faith, and the Beatles would get to make a record.\n\nEMI didn't like the idea at first -- publishers should stick to publishing and record companies to records -- but eventually they were worn down by Bennett's persistence. The only question was which of the subsidiary labels -- all of which had already turned the group down -- would be forced to sign them. And that had a solution. It was going to be George Martin.\n\nGeorge Martin was a real musician -- an oboeist with a strong classical background -- and he'd worked on every kind of record, including producing some of the Vipers' records, but he had his greatest successes with novelty and comedy records. He was the producer of the Temperance Seven, a comedy trad group:\n\n[Excerpt: The Temperance Seven, \"You're Driving Me Crazy\"]\n\nBernard Cribbins:\n\n[Excerpt: Bernard Cribbins, \"Hole in the Ground\"]\n\nFlanders & Swann:\n\n[Excerpt: Flanders & Swann, \"A Gnu\"]\n\nPeter Sellers, Beyond the Fringe, and more.\n\nGeorge Martin was in the bad books of Len Wood, the Managing Director of EMI. For several years, Martin, who was married, had been having an affair with his secretary -- Martin's marriage had failed and he and Judy, the secretary in question, were deeply in love and would later marry. But Wood had very strict religious views, and had discovered Martin's infidelity. Not only that, but Martin was getting far too big for his boots -- he was pushing to get an actual *royalty* on the records he produced!\n\nWood couldn't fire Martin -- Martin was too respected by Wood's own boss, Sir Joseph Lockwood -- but he could make Martin's life difficult. And so, in order to shut Kim Bennett at Ardmore & Beechwood up, George Martin was ordered, against his own better instincts, to offer a contract to the Beatles. Martin arranged a meeting with Brian Epstein, who then sent a telegram to the Beatles -- they were going to make a record. Their first session was going to be on the sixth of June.\n\nJohn and Paul got to work -- they had no idea that they had been signed on the basis of their songwriting, and it seems that neither they nor Epstein were ever told what had actually happened to lead to the contract. As far as everyone was concerned, George Martin had made his own decision. They didn't know what it was they would be recording, but they decided to write some new material in case they had a chance to do something of their own.\n\nThey came up with two songs while they were there. One, \"P.S. I Love You\", was a totally new song by Paul, inspired by \"Soldier Boy\" by the Shirelles:\n\n[Excerpt: The Shirelles, \"Soldier Boy\"]\n\nThe other, \"Love Me Do\", was a half-finished song of Paul's from years earlier that they dug out and finished up. The main changes they made to the song were to add a new bridge by Lennon, and an instrumental hook, also Lennon's work. The big sound of that summer was the harmonica -- Bruce Channel had used it on his massive hit \"Hey Baby!\":\n\n[Excerpt: Bruce Channel, \"Hey Baby!\"]\n\nA bunch of other records came out with harmonica on around that time, and Lennon was playing harmonica on stage. They added a harmonica hook to their song in the hope that that would make it more commercial.\n\nWhile they were at the Star Club, they also spent some time with Gene Vincent, who came over just as they were about to leave, and shared a bill with them for four days. They were hugely impressed to be working with one of their real idols, although by this time he was seriously out of control -- Harrison would later remember Vincent dragging him along to a hotel room where Vincent was convinced his wife was having an affair, pulling a gun out and handing it to Harrison to hold for him while he banged on the door. Harrison quickly passed the gun back to Vincent and left -- if there was going to be a murder committed, he didn't want to be involved. Thankfully, Vincent didn't shoot his wife.\n\nA few days after their return to Liverpool, they headed down to the session that they were sure would be to record their first single, still not knowing what they were going to be recording. Ron Richards, George Martin's assistant, was in charge of that initial session, and they started by cutting a version of the old standard \"Besame Mucho\". They then recorded three originals -- John's Miracles-styled \"Ask Me Why\", plus \"P.S. I Love You\" and \"Love Me Do\". George Martin turned up at some point during the session, and suggested that Paul, rather than John, sing the solo lead line on \"Love Me Do\", as the harmonica part overlapped with that line:\n\n[Excerpt: The Beatles, \"Love Me Do (6 June 1962 version)\"]\n\nAt that session, the Beatles and Martin clicked as people -- he was still unimpressed with them as musicians, but he found that he shared a sense of humour with them. They were people he could work with, and vice versa.\n\nOr at least, three of them were. Pete Best didn't say a single word to Martin, and he also played quite amazingly shoddily. After the session, Martin came to a couple of conclusions -- Ron Richards was going to have to look for a better song for the group to perform, and any further recordings would *not* feature Pete Best.\n\nJohn, Paul, and George were coming to similar conclusions, but for the moment Pete was still a Beatle, and a few days later the four of them made another appearance on \"Teenager's Turn\", where they performed an original on the radio for the first time -- John's \"Ask Me Why\":\n\n[Excerpt: The Beatles, \"Ask Me Why (Teenager's Turn)\"]\n\nAfter that show, someone mentioned to Pete that the Beatles were thinking of kicking him out of the band. He didn't believe them, but it was true, as he'd find out a few weeks later.\n\nThe sacking of Pete Best is one of the saddest episodes in rock and roll history. It was absolutely necessary -- he simply wasn't a competent drummer -- but it crushed him. From the point of view of the other three, as well, it made sense -- they'd never felt particularly close to him -- but he doesn't seem to have realised that they didn't think of him as close. He wasn't really close with *anyone* -- that's just who he was. It's not his fault. Nobody disliked him, they just didn't know him that well. He wasn't one of them.\n\nAnyone who's ever had a friendship that meant more to them than it did to the other person will be able to sympathise with how Pete felt on that level, but it's hard to imagine just how much it must have hurt to be dropped from a band that was his whole life, which he considered himself an equal member of, and which then went on to be the most successful band in the world so soon after he was out. It didn't help that the other three left Brian Epstein to do their dirty work. Nor did it help that his best mate Neil Aspinall -- the man who lived in his house, and who had just fathered Pete's younger half-brother, carried on working for them, telling him \"They sacked *you*, they didn't sack me.\"\n\nOne reason they chose that particular moment to sack Pete, and get in Ringo, who was widely regarded as either the best drummer in Liverpool or the second best after Johnny Hutch (who hated and despised John Lennon so much that he was never even considered, while Ringo was good friends with all of them) was because the next week, on the 22nd of August, there was going to be a TV crew coming to the Cavern to film them for local TV:\n\n[Excerpt: The Beatles, \"Some Other Guy\"]\n\nPete Best was in the audience, watching his replacement.\n\nThe day after that came another big change -- John's girlfriend, Cynthia, was pregnant, and they married on the 23rd of August, in a small ceremony. Brian Epstein gave the happy couple the use of his flat rent-free until they could find a place of their own.\n\nOn the fourth of September, the group went down to London to record what was sure to be their first real single. They'd been given a song to learn by George Martin -- a song written by the songwriter Mitch Murray, published by Dick James, a friend of Martin's, which had already been turned down by Brian Poole and the Tremeloes and Adam Faith, called \"How Do You Do It?\"\n\nThey despised the song, but they did what they were told. That was to be the A-side:\n\n[Excerpt: The Beatles, \"How Do You Do It?\"]\n\nFor the B-side, they cut another version of \"Love Me Do\", this time with Ringo on drums:\n\n[Excerpt: The Beatles, \"Love Me Do (single version)\"]\n\nThey also made an attempt at cutting a new song of John's, \"Please Please Me\", but Ringo didn't know the song that well, and he was also showing off a bit in the studio due to nerves. He messed up, and George Martin determined that the next session -- if there was even going to be a next session -- he'd get in a session drummer rather than keep relying on whoever the Beatles brought in.\n\nIt turned out that that next session would be sooner than he'd imagined. John and Paul begged him to not put out \"How Do You Do It?\", saying they could do better, but Martin stood firm, saying \"When you can write something as good as that, I'll consider it\". But then Ardmore & Beechwood went ballistic. The purpose of the session was to get Lennon/McCartney songs recorded for Ardmore & Beechwood, not Dick James songs. They at least wanted the A-side of the record to be \"Love Me Do\". But Dick James wouldn't let \"How Do You Do It?\" be relegated to a B-side either, and Mitch Murray, once he heard the recording, wasn't even sure if he wanted it to come out at all.\n\nSo George Martin called the group back into the studio yet again a week later, telling them he was graciously agreeing to their requests, and this time he also brought in a session drummer, Andy White, much to Ringo's disgust.\n\nThey recorded two songs for consideration as the B-side, with Ron Richards running the session -- \"P.S. I Love You\", and John's new one \"Please Please Me\", and then cut a reworking of \"Love Me Do\", this time with White on drums while Ringo played a tambourine:\n\n[Excerpt: The Beatles, \"Love Me Do (album version)\"]\n\nIn the end, \"P.S. I Love You\" was chosen for the B-side, and \"Please Please Me\" kept back to be reworked at a future date. George Martin was now, despite all the difficulty they'd caused him, on the Beatles' side. He knew they were good, and he knew \"Please Please Me\" could be a hit. He just had to get this record that he didn't think much of out of the way first. The record was released with the earlier version of \"Love Me Do\" on the A-side -- Ringo, not Andy White, playing drums -- although when the group's first album came out the Andy White version would be included instead.\n\n\"Love Me Do\" wasn't expected to be a success, but it surprised everyone, due mostly to its sales in Liverpool and the North-West of England. It crept into the top fifty, and slowly made its way up the charts to number seventeen. John, Paul, George, and Ringo had a hit record, and the sixties had finally started.",
  "itunes:subtitle": "This week there are&nbsp;two episodes of the podcast going up, both of them longer than normal. This one, episode one hundred, is the hundredth-episode special and is an hour and a half long. It looks at the early career of the Beatles, and at the three ",
  "itunes:keywords": "Allan Williams,Andy White,Ardmore and Beechwood,art school,Bert Kaempfert,Brian Epstein,British rock,Carrol Levis,Decca Records,Dick James,Dick Rowe,Eddie Cochran,EMI,Gene Vincent,George Harrison,George Martin,Gerry and the Pacemakers,Hamburg,John Lennon,Johnny Gentle,Klaus Voorman,Larry Parnes,Liverpool,Merseybeat,Neil Aspinall,Parlophone,Paul McCartney,Pete Best,Ringo Starr,Royston Ellis,skiffle,Stuart Sutcliffe,The Beatles,The Quarrymen,Tony Meehan,Tony Sheridan",
  "itunes:episodeType": "full",
  "itunes:episode": 100,
  "content:encoded": "This week there are&nbsp;<em>two</em> episodes of the podcast going up, both of them longer than normal. This one, episode one hundred, is the hundredth-episode special and is an hour and a half long. It looks at the early career of the Beatles, and at the three recordings of \"Love Me Do\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42023843\">&nbsp;on \"Misirlou\" by Dick Dale and the Deltones</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nWhile there are many books on the Beatles, and I have read dozens of them, only one needs to be mentioned as a reference for this episode (others will be used for others).&nbsp;<em>All These Years Vol 1: Tune In</em>&nbsp;by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out.\n\nThere are two versions of the book -- <a href=\"https://amzn.to/340FVAD\">a nine-hundred page mass-market version</a> and <a href=\"https://amzn.to/3j508vz\">a 1700-page expanded edition</a>. I recommend the latter. The information in this podcast is almost all from Lewisohn's book, but I must emphasise that the opinions are mine, and so are any errors -- Lewisohn's book only has one error that I'm aware of (a joke attributed to the comedian Jasper Carrott in a footnote that has since been traced to an earlier radio show). I am only mortal, and so have doubtless misunderstood or oversimplified things and introduced errors where he had none.\n\nThe single version of \"Love Me Do\" can be found on <em><a href=\"https://amzn.to/2S1gc5q\">Past Masters</a>,</em> a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides. The version with Andy White playing on can be found on&nbsp;<a href=\"https://amzn.to/2FRymEx\"><em>Please Please Me</em></a>. The version with Pete Best, and many of the other early tracks used here, is on <a href=\"https://amzn.to/3kSPFUx\"><em>Anthology 1</em></a>.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Errata</strong>\n\nI pronounce the name of Lewisohn's book as \"All Those Years\" instead of \"All These Years\".\n\nI say \" The Jets hadn't liked playing at Williams' club\" at one point. I meant \"at Koschmider's club\"\n\n<strong>Transcript</strong>\n\nThe Beatles came closer than most people realise to never making a record.\n\nUntil the publication of Mark Lewisohn's seminal biography All These Years vol 1: Tune In, in 2013 everyone thought they knew the true story -- John met Paul at Woolton Village Fete in 1957, and Paul joined the Quarrymen, who later became the Beatles. They played Hamburg and made a demo, and after the Beatles' demo was turned down by Decca, their manager Brian Epstein shopped it around every record label without success, until finally George Martin heard the potential in it and signed them to Parlophone, a label which was otherwise known for comedy records. Martin was, luckily, the one producer in the whole of the UK who could appreciate the Beatles' music, and he signed them up, and the rest was history.\n\nThe problem is, as Lewisohn showed, that's not what happened. Today I'm going to tell, as best I can the story of how the Beatles actually became the band that they became, and how they got signed to EMI records. I'm going to tell you the story of \"Love Me Do\":\n\n[Excerpt: The Beatles, \"Love Me Do (single version)\"]\n\nAs I mentioned at the beginning, this episode owes a *huge* debt to Mark Lewisohn's book. I like to acknowledge my sources, anyway, but I've actually had difficulty with this episode because Lewisohn's book is *so* detailed, *so* full, and written *so* well that much of the effort in writing this episode came from paring down the information, rather than finding more, and from reworking things so I was not just paraphrasing bits of his writing. Normally I rely on many sources, and integrate the material myself, but Lewisohn has done all that work far better than any other biographer of any other musician. Were the Beatles not such an important part of music history, I would just skip this episode because there is nothing for me to add. As it is, I *obviously* have to cover this, but I almost feel like I'm cheating in doing so. If you find this episode interesting at all, please do yourself a favour and buy that book.\n\nThis episode is going to be a long one -- much longer than normal. I won't know the precise length until after I've recorded and edited it, of course, but I'm guessing it's going to be about ninety minutes. This is the hundredth episode, the end of the second year of the podcast, the end of the second book based on the podcast, and the introduction of the single most important band in the whole story, so I'm going to stretch out a bit. I should also mention that there are a couple of discussions of sudden, traumatic, deaths in this episode.\n\nWith all that said, settle in, this is going to take a while.\n\nEvery British act we've looked at so far -- and many of those we're going to look at in the next year or two -- was based in London. Either they grew up there, or they moved there before their musical career really took off. The Beatles, during the time we're covering in this episode, were based in Liverpool. While they did eventually move to London, it wasn't until after they'd started having hits. And what listeners from outside the UK might not realise is what that means in terms of attitudes and perceptions. Liverpool is a large city -- it currently has a population of around half a million, and the wider Liverpool metropolitan area is closer to two million -- but like all British cities other than London, it was regarded largely as a joke in the British media, and so in return the people of Liverpool had a healthy contempt for London.\n\nTo give Americans some idea of how London dominates in Britain, and thus how it's thought of outside London, imagine that New York, Washington DC, and Los Angeles were all the same city -- that the financial, media, and political centres of the country were all the same place. Now further imagine that Silicon Valley and all the Ivy League universities were half an hour's drive from that city. Now, imagine how much worse the attitudes that that city would have about so-called \"flyover states\" would be, and imagine in return how people in large Midwestern cities like Detroit or Chicago would think about that big city.\n\nIn this analogy, Liverpool is Detroit, and like Detroit, it was very poor and had produced a few famous musicians, most notably Billy Fury, who was from an impoverished area of Liverpool called the Dingle:\n\n[Excerpt: Billy Fury, \"Halfway to Paradise\"]\n\nBut Fury had, of course, moved to London to have his career. That's what you did.\n\nBut in general, Liverpool, if people in London thought of it at all, was thought of as a provincial backwater full of poor people, many of them Irish, and all of them talking with a ridiculous accent. Liverpool was ignored by London, and that meant that things could develop there out of sight.\n\nThe story of the Beatles starts in the 1950s, with two young men in their mid-teens. John Winston Lennon was born in 1940, and had had a rather troubled childhood. His father had been a merchant seaman who had been away in the war, and his parents' relationship had deteriorated for that and other reasons. As a result, Lennon had barely known his father, and when his mother met another man, Lennon's aunt, Mary Smith, who he always called Mimi, had taken him in, believing that his mother \"living in sin\" would be a bad influence on the young boy.\n\nThe Smith family were the kind of lower middle class family that seemed extremely rich to the impoverished families in Liverpool, but were not well off by any absolute standard. Mimi, in particular, was torn between two very different urges. On one hand, she had strongly bohemian, artistic, urges -- as did all of her sisters. She was a voracious reader, and a lover of art history, and encouraged these tendencies in John. But at the same time, she was of that class which has a little status, but not much security, and so she was extremely wary of the need to appear respectable. This tension between respectability and rebellion was something that would appear in many of the people who Lennon later worked with, such as Brian Epstein and George Martin, and it was something that Lennon would always respond to -- those people would be the only ones who Lennon would ever view as authority figures he could respect, though he would also resent them at times.\n\nAnd it might be that combination of rebellion and respectability that Lennon saw in Paul McCartney. McCartney was from a family who, in the Byzantine world of the British class system of the time, were a notch or so lower than the Smith family who raised Lennon, but he was academically bright, and his family had big plans for him -- they thought that it might even be possible that he might become a teacher if he worked very hard at school. McCartney was a far less openly rebellious person than Lennon was, but he was still just as caught up in the music and fashions of the mid-fifties that his father associated with street gangs and hooliganism.\n\nLennon, like many teenagers in Britain at the time, had had his life changed when he first heard Elvis Presley, and he had soon become a rock and roll obsessive -- Elvis was always his absolute favourite, but he also loved Little Richard, who he thought was almost as good, and he admired Buddy Holly, who had a special place in Lennon's heart as Holly wore glasses on stage, something that Lennon, who was extremely short-sighted, could never bring himself to do, but which at least showed him that it was a possibility.\n\nLennon was, by his mid-teens, recreating a relationship with his mother, and one of the things they bonded over was music -- she taught him how to play the banjo, and together they worked out the chords to \"That'll Be the Day\", and Lennon later switched to the guitar, playing banjo chords on five of the six strings.\n\nLike many, many, teenagers of the time, Lennon also formed a skiffle group, which he called the Quarrymen, after a line in his school song. The group tended to have a rotating lineup, but Lennon was the unquestioned leader. The group had a repertoire consisting of the same Lonnie Donegan songs that every other skiffle group was playing, plus any Elvis and Buddy Holly songs that could sound reasonable with a lineup of guitars, teachest bass, and washboard.\n\nThe moment that changed the history of the music, though, came on July the sixth, 1957, when Ivan Vaughan, a friend of Lennon's, invited his friend Paul McCartney to go and see the Quarry Men perform at Woolton Village Fete. That day has gone down in history as \"the day John met Paul\", although Mark Lewisohn has since discovered that Lennon and McCartney had briefly met once before. It is, though, the day on which Lennon and McCartney first impressed each other musically.\n\nMcCartney talks about being particularly impressed that the Quarry Men's lead singer was changing the lyrics to the songs he was performing, making up new words when he forgot the originals -- he says in particular that he remembers Lennon singing \"Come Go With Me\" by the Del-Vikings:\n\n[Excerpt: The Del-Vikings, \"Come Go With Me\"]\n\nMcCartney remembers Lennon as changing the lyrics to \"come go with me, right down to the penitentiary\", and thinking that was clever.\n\nAstonishingly, some audio recording actually exists of the Quarry Men's second performance that day -- they did two sets, and this second one comes just after Lennon met McCartney rather than just before. The recording only seems to exist in a very fragmentary form, which has snatches of Lennon singing \"Baby Let's Play House\" and Lonnie Donegan's hit \"Puttin' on the Style\", which was number one on the charts at the time, but that even those fragments have survived, given how historic a day this was, is almost miraculous:\n\n[Excerpt: The Quarrymen, \"Puttin' on the Style\"]\n\nAfter the first set, Lennon met McCartney, who was nearly two years younger, but a more accomplished musician -- for a start, he knew how to tune the guitar with all six strings, and to proper guitar tuning, rather than tuning five strings like a banjo. Lennon and his friends were a little nonplussed by McCartney holding his guitar upside-down at first -- McCartney is left-handed -- but despite having an upside-down guitar with the wrong tuning, McCartney managed to bash out a version of Eddie Cochran's \"Twenty-Flight Rock\", a song he would often perform in later decades when reminding people of this story:\n\n[Excerpt: Paul McCartney, \"Twenty-Flight Rock\"]\n\nThis was impressive to Lennon for three reasons. The first was that McCartney was already a strong, confident performer -- he perhaps seemed a little more confident than he really was, showing off in front of the bigger boys like this. The second was that \"Twenty-Flight Rock\" was a moderately obscure song -- it hadn't charted, but it *had* appeared in The Girl Can't Help It, a film which every rock and roll lover in Britain had watched at the cinema over and over. Choosing that song rather than, say, \"Be-Bop-A-Lula\", was a way of announcing a kind of group affiliation -- \"I am one of you, I am a real rock and roll fan, not just a casual listener to what's in the charts\".\n\nI stress that second point because it's something that's very important in the history of the Beatles generally -- they were *music fans*, and often fans of relatively obscure records. That's something that bound Lennon and McCartney, and later the other members, together from the start, and something they always noted about other musicians. They weren't the kind of systematic scholars who track down rare pressings and memorise every session musician's name, but they were constantly drawn to find the best new music, and to seek it out wherever they could.\n\nBut the most impressive thing for Lennon -- and one that seems a little calculated on McCartney's part, though he's never said that he thought about this that I'm aware of -- was that this was an extremely wordy song, and McCartney *knew all the words*. Remember that McCartney had noticed Lennon forgetting the words to a song with lyrics as simple as \"come, come, come, come, come into my heart/Tell me darling we will never part\", and here's McCartney singing this fast-paced, almost patter song, and getting the words right.\n\nFrom the beginning, McCartney was showing how he could complement Lennon -- if Lennon could impress McCartney by improvising new lyrics when he forgot the old ones, then McCartney could impress Lennon by remembering the lyrics that Lennon couldn't -- and by writing them down for Lennon, sharing his knowledge freely.\n\nMcCartney went on to show off more, and in particular impressed Lennon by going to a piano and showing off his Little Richard imitation. Little Richard was the only serious rival to Elvis in Lennon's affections, and McCartney could do a very decent imitation of him. This was someone special, clearly.\n\nBut this put Lennon in a quandary. McCartney was clearly far, far, better than any of the Quarry Men -- at least Lennon's equal, and light years ahead of the rest of them. Lennon had a choice -- invite this young freak of nature into his band, and improve the band dramatically, but no longer be the unquestioned centre of the group, or remain in absolute control but not have someone in the group who *knew the words* and *knew how to tune a guitar*, and other such magical abilities that no mere mortals had.\n\nThose who only know of Lennon from his later reputation as a massive egoist would be surprised, but he decided fairly quickly that he had to make the group better at his own expense. He invited McCartney to join the group, and McCartney said yes.\n\nOver the next few months the membership of the Quarry Men changed. They'd been formed while they were all at Quarry Bank Grammar School, but that summer Lennon moved on to art school. I'm going to have to talk about the art school system, and the British education system of the fifties and early sixties a lot over the next few months, but here's an extremely abbreviated and inaccurate version that's good enough for now.\n\nBetween the ages of eleven and sixteen, people in Britain -- at least those without extremely rich parents, who had a different system -- went to two kinds of school depending on the result of an exam they took aged eleven, which was based on some since-discredited eugenic research about children's potential. If you passed the exam, you were considered academically apt, and went to a grammar school, which was designed to filter you through to university and the professions. If you failed the exam, you went to a secondary modern, which was designed to give you the skills to get a trade and make a living working with your hands. And for the most part, people followed the pipeline that was set up for them. You go to grammar school, go to university, become a lawyer or a doctor or a teacher. You go to secondary modern, leave school at fourteen, become a plumber or a builder or a factory worker.\n\nBut there are always those people who don't properly fit into the neat categories that the world tries to put them in. And for people in their late teens and early twenties, people who'd been through the school system but not been shaped properly by it, there was another option at this time. If you were bright and creative, but weren't suited for university because you'd failed your exams, you could go to art school.\n\nThe supposed purpose of the art schools was to teach people to do commercial art, and they would learn skills like lettering and basic draughtsmanship. But what the art schools really did was give creative people space to explore ideas, to find out about areas of art and culture that would otherwise have been closed to them. Keith Richards, Pete Townshend, Ian Dury, Ray Davies, Bryan Ferry, Syd Barrett, and many more people we'll be seeing over the course of this story went to art school, and as David Bowie would put it later, the joke at the time was that you went to art school to learn to play blues guitar.\n\nWith Lennon and his friends all moving on from the school that had drawn them together, the group stabilised for a time on a lineup of Lennon, McCartney, Colin Hanton, Len Garry, and Eric Griffiths. But the first time this version of the group played live, while McCartney sang well, he totally fluffed his lead guitar lines on stage. While there were three guitarists in the band at this point, they needed someone who could play lead fluently and confidently on stage.\n\nEnter George Harrison, who had suddenly become a close friend of McCartney. Harrison went to the same school as McCartney -- a grammar school called the Liverpool Institute, but was in the year below McCartney, and so the two had always been a bit distant. However, at the same time as Lennon was moving on to art school after failing his exams, McCartney was being kept back a year for failing Latin -- which his father always thought was deliberate, so he wouldn't have to go to university. Now he was in the same year at school as Harrison, and they started hanging out together.\n\nThe two bonded strongly over music, and would do things like take a bus journey to another part of town, where someone lived who they heard owned a copy of \"Searchin'\" by the Coasters:\n\n[Excerpt: The Coasters, \"Searchin'\"]\n\nThe two knocked on this stranger's door, asked if he'd play them this prized record, and he agreed -- and then they stole it from him as they left his house. Another time they took the bus to another part of town again, because they'd heard that someone in that part of town knew how to play a B7 chord on his guitar, and sat there as he showed them.\n\nSo now the Quarrymen needed a lead guitarist, McCartney volunteered his young mate. There are a couple of stories about how Harrison came to join the band -- apparently he auditioned for Lennon at least twice, because Lennon was very unsure about having such a young kid in his band -- but the story I like best is that Harrison took his guitar to a Quarry Men gig at Wilson Hall -- he'd apparently often take his guitar to gigs and just see if he could sit in with the bands. On the bill with the Quarry Men was another group, the Eddie Clayton Skiffle Group, who were generally regarded as the best skiffle band in Liverpool. Lennon told Harrison that he could join the band if he could play as well as Clayton, and Harrison took out his guitar and played \"Raunchy\":\n\n[Excerpt: Bill Justis, \"Raunchy\"]\n\nI like this story rather than the other story that the members would tell later -- that Harrison played \"Raunchy\" on a bus for Lennon -- for one reason. The drummer in the Eddie Clayton Skiffle Group was one Richy Starkey, and if it happened that way, the day that George joined the Quarry Men was also the day that John, Paul, George, and Ringo were all in the same place for the first time.\n\nGeorge looked up to John and essentially idolised him, though Lennon thought of him as a little annoying at times -- he'd follow John everywhere, and not take a hint when he wasn't wanted sometimes, just eager to be with his big cool new mate. But despite this tiny bit of tension, John, Paul, and George quickly became a solid unit -- helped by the fact that the school that Paul and George went to was part of the same complex of buildings as Lennon's art college, so they'd all get the bus there and back together.\n\nGeorge was not only younger, he was a notch or two further down the social class ladder than John or Paul, and he spoke more slowly, which made him seem less intelligent. He came from Speke, which was a rougher area, and he would dress even more like a juvenile delinquent than the others.\n\nMeanwhile, Len Garry and Eric Griffiths left the group -- Len Garry because he became ill and had to spend time in hospital, and anyway they didn't really need a teachest bass. What they did need was an electric bass, and since they had four guitars now they tried to persuade Eric to get one, but he didn't want to pay that much money, and he was always a little on the outside of the main three members, as he didn't share their sense of humour. So the group got Nigel Walley, who was acting as the group's manager, to fire him. The group was now John, Paul, and George all on guitars, and Colin Hanton on drums. Sometimes, if they played a venue that had a piano, they'd also bring along a schoolfriend of Paul's, John \"Duff\" Lowe, to play piano.\n\nMeanwhile, the group were growing in other ways. Both John and Paul had started writing songs, together and apart. McCartney seems to have been the first, writing a song called \"I Lost My Little Girl\" which he would eventually record more than thirty years later:\n\n[Excerpt: Paul McCartney, \"I Lost My Little Girl\"]\n\nLennon's first song likewise sang about a little girl, this time being \"Hello, Little Girl\".\n\nBy the middle of 1958, this five-piece group was ready to cut their first record -- at a local studio that would cut a single copy of a disc for you. They went into this studio at some time around July 1958, and recorded two songs. The first was their version of \"That'll Be the Day\":\n\n[Excerpt: The Quarry Men, \"That'll be the Day\"]\n\nThe B-side was a song that McCartney had written, with a guitar solo that George had come up with, so the label credit read \"McCartney/Harrison\". \"In Spite of All the Danger\" seems to have been inspired by Elvis' \"Trying to Get to You\":\n\n[Excerpt: Elvis Presley, \"Trying to Get to You\"]\n\nIt's a rough song, but a good attempt for a teenager who had only just started writing songs:\n\n[Excerpt: The Quarry Men, \"In Spite of All the Danger\"]\n\nApparently Lowe and Hanton hadn't heard the song before they started playing, but they make a decent enough fist of it in the circumstances. Lennon took the lead even though it was McCartney's song -- he said later \"I was such a bully in those days I didn’t even let Paul sing his own song.\"\n\nThat was about the last time that this lineup of Quarry Men played together. In July, the month that seems likely for the recording, Lowe finished at the Liverpool Institute, and so he drifted away from McCartney and Harrison. Meanwhile Hanton had a huge row with the others after a show, and they fell out and never spoke again. The Quarry Men were reduced to a trio of Lennon, McCartney, and Harrison.\n\nBut -- possibly the very day after that recording if an unreliable plaque at the studio where they recorded it is to be believed -- something happened which was to have far more impact on the group than the drummer leaving. John Lennon's mother, with whom he'd slowly been repairing his relationship, had called round to visit Mimi. She left the house, and bumped into Nigel Walley, who was calling round to see John. She told him he wasn't there, and that he could walk with her to the bus stop. They walked a little while, then went off in different directions. Walley heard a thump and turned round -- Julia Lennon had been hit by a car and killed instantly.\n\nAs you can imagine, John's mother dying caused him a huge amount of distress, but it also gave him a bond with McCartney, whose own mother had died of cancer shortly before they met. Neither really spoke about it to each other, and to the extent they did it was with ultra-cynical humour -- but the two now shared something deeper than just the music, even though the music itself was deep enough.\n\nLennon became a much harder, nastier, person after this, at least for a time, his natural wit taking on a dark edge, and he would often drink too much and get aggressive. But life still went on, and John, Paul, and George kept trying to perform -- though the gigs dried up, and they didn't have a drummer any more. They'd just say \"the rhythm's in the guitars\" when asked why they didn't have one. They were also no longer the Quarry Men -- they didn't have a name.\n\nAt one point late in the year, they also only had two guitars between the three of them -- Lennon seems to have smashed his in a fit of fury after his mother's death. But he stole one backstage at a talent contest, and soon they were back to having three.\n\nThat talent show was one run by Carroll Levis, who we talked about before in the episode on \"Shakin' All Over\". The three boys went on Levis' show, this time performing as Johnny & The Moondogs -- &nbsp;in Manchester, at the Hippodrome in Ancoats, singing Buddy Holly's \"Think it Over\":\n\n[Excerpt: The Crickets, \"Think it Over\"]\n\nLennon sang lead with his arms draped over the shoulders of Paul and George, who sang backing vocals and played guitar. They apparently did quite well, but had to leave before the show finished to get the last train back to Liverpool, and so never found out whether the audience would have made them the winner, with the possibility of a TV appearance. They did well enough, though, to impress a couple of other young lads on the bill, two Manchester singers named Allan Clarke and Graham Nash.\n\nBut in general, the Japage Three, a portmanteau of their names that they settled on as their most usual group name at this point, played very little in 1959 -- indeed, George spent much of the early part of the year moonlighting in the Les Stewart Quartet, another group, though he still thought of Lennon and McCartney as his musical soulmates; the Les Stewart Quartet were just a gig.\n\nThe three of them would spend much of their time at the Jacaranda, a coffee bar opened by a Liverpool entrepreneur, Allan Williams, in imitation of the 2is, which was owned by a friend of his. Lennon was also spending a lot of time with an older student at his art school, Stuart Sutcliffe, one of the few people in the world that Lennon himself looked up to.\n\nThe Les Stewart Quartet would end up indirectly being key to the Beatles' development, because after one of their shows at a local youth club they were approached by a woman named Mona Best. Mona's son Pete liked to go to the youth club, but she was fairly protective of him, and also wanted him to have more friends -- he was a quiet boy who didn't make friends easily. So she'd hit upon a plan -- she'd open her own club in her cellar, since the Best family were rich enough to have a big house. If there was a club *in Pete's house* he'd definitely make lots of friends. They needed a band, and she asked the Les Stewart Quartet if they'd like to be the resident band at this new club, the Casbah, and also if they'd like to help decorate it.\n\nThey said yes, but then Paul and George went on a hitch-hiking holiday around Wales for a few days, and George didn't get back in time to play a gig the quartet had booked. Ken Brown, the other guitarist, didn't turn up either, and Les Stewart got into a rage and split the group. Suddenly, the Casbah had no group -- George and Ken were willing to play, but neither was a lead singer -- and no decorators either. So George roped in John and Paul, who helped decorate the place, and with the addition of Ken Brown, the group returned to the Quarry Men name for their regular Saturday night gig at the Casbah.\n\nThe group had no bass player or drummer, and they all kept pestering everyone they knew to get a bass or a drum kit, but nobody would bite. But then Stuart Sutcliffe got half a painting in an exhibition put on by John Moores, the millionaire owner of Littlewoods, who was a big patron of the arts in Liverpool. I say he got half a painting in the exhibition, because the painting was done on two large boards -- Stuart and his friends took the first half of the painting down to the gallery, went back to get the other half, and got distracted by the pub and never brought it.\n\nBut Moores was impressed enough with the abstract painting that he bought it at the end of the exhibition's run, for ninety pounds -- about two thousand pounds in today's money. And so Stuart's friends gave him a choice -- he could either buy a bass or a drum kit, either would be fine. He chose the bass.\n\nBut the same week that Stuart joined, Ken Brown was out, and they lost their gig at the Casbah. John, Paul, George and Ken had turned up one Saturday, and Ken hadn't felt well, so instead of performing he just worked on the door. At the end of the show, Mona Best insisted on giving Ken an equal share of the money, as agreed. John, Paul, and George wouldn't stand for that, and so Ken was out of the group, and they were no longer playing for Mona Best.\n\nStuart joining the group caused tensions -- George was fine with him, thinking that a bass player who didn't yet know how to play was better than no bass player at all, but Paul was much less keen. Partly this was because he thought the group needed to get better, which would be hard with someone who couldn't play, but also he was getting jealous of Sutcliffe's closeness to Lennon, especially when the two became flatmates. But John wanted him in the group, and what John wanted, he got.\n\nThere are recordings of the group around this time that circulate -- only one has been released officially, a McCartney instrumental called \"Cayenne\", but the others are out there if you look:\n\n[Excerpt: The Quarry Men, \"Cayenne\"]\n\nThe gigs had dried up again, but they did have one new advantage -- they now had a name they actually liked. John and Stuart had come up with it, inspired by Buddy Holly's Crickets. They were going to be Beatles, with an a.\n\nShortly after the Beatles' first appearance under that name, at the art school student union, came the Liverpool gig which was to have had Eddie Cochran and Gene Vincent headlining, before Cochran died. A lot of Liverpool groups were booked to play on the bill there, but not the Beatles -- though Richy Starkey was going to play the gig, with his latest group Rory Storm and the Hurricanes. Allan Williams, the local promoter, added extra groups to fill out the bill, including Gerry and the Pacemakers, and suddenly everyone who loved rock and roll in Liverpool realised that there were others out there like them. Overnight, a scene had been born.\n\nAnd where there's a scene, there's money to be made. Larry Parnes, who had been the national promoter of the tour, was at the show and realised that there were a lot of quite proficient musicians in Liverpool. And it so happened that he needed backing bands for three of his artists who were going on tour, separately -- two minor stars, Duffy Power and Johnny Gentle, and one big star, Billy Fury. And both Gentle and Fury were from Liverpool themselves. So Parnes asked Allan Williams to set up auditions with some of the local groups. Williams invited several groups, and one he asked along was the Beatles, largely because Lennon and Sutcliffe begged him. He also found them a drummer, Tommy Moore, who was a decade older than the rest of them -- though Moore didn't turn up to the audition because he had to work, and so Johnny \"Hutch\" Hutchinson of Cass and the Cassanovas sat in with them, much to Hutch's disgust -- he hated the Beatles, and especially Lennon.\n\nCass of the Cassanovas also insisted that \"the Beatles\" was a stupid name, and that the group needed to be Something and the Somethings, and he suggested Long John and the Silver Beatles, and that stuck for a couple of shows before they reverted to their proper name.\n\nThe Beatles weren't chosen for any of the main tours that were being booked, but then Parnes phoned Williams up -- there were some extra dates on the Johnny Gentle tour that he hadn't yet booked a group for. Could Williams find him a band who could be in Scotland that Friday night for a nine-day tour? Williams tried Cass and the Cassanovas, Rory Storm and the Hurricanes, and Gerry and the Pacemakers, but none of them could go on tour at such short notice. They all had gigs booked, or day jobs they had to book time off with.\n\nThe Beatles had no gigs booked, and only George had a day job, and he didn't mind just quitting that. They were off to Scotland. They were so inspired by being on tour with a Larry Parnes artist that most of them took on new names just like those big stars -- George became Carl Harrison, after Carl Perkins, Stuart became Stuart de Staël, after his favourite painter, and Paul became Paul Ramon, which he thought sounded mysterious and French. There's some question about whether John took on a new name -- some sources have him becoming \"Long John\", while others say he was \"Johnny\" Lennon rather than John. Tommy Moore, meanwhile, was just Thomas Moore.\n\nIt was on this tour, of course, that Lennon helped Johnny Gentle write \"I've Just Fallen For Someone\", which we talked about last week:\n\n[Excerpt: Darren Young, \"I've Just Fallen For Someone\"]\n\nThe tour was apparently fairly miserable, with horrible accommodation, poor musicianship from the group, and everyone getting on everyone's nerves -- George and Stuart got into fistfights, John bullied Stuart a bit because of his poor playing, and John particularly didn't get on well with Moore -- a man who was a decade older, didn't share their taste in music, and worked in a factory rather than having the intellectual aspirations of the group. The two hated each other by the end of the tour.\n\nBut the tour did also give the group the experience of signing autographs, and of feeling like stars in at least a minor way. When they got back to Liverpool, George moved in with John and Stuart, to get away from his mum telling him to get a proper job, and they got a few more bookings thanks to Williams, but they soon became drummerless -- they turned up to a gig one time to find that Tommy Moore wasn't there. They went round to his house, and his wife shouted from an upstairs window, \"Yez can piss off, he's had enough of yez and gone back to work at the bottle factory\". The now four-piece group carried on, however, and recordings exist of them in this period, sounding much more professional than only a few months before, including performances of some of their own songs. The most entertaining of these is probably \"You'll Be Mine\", an Ink Spots parody with some absurd wordplay from Lennon:\n\n[Excerpt: The Beatles, \"You'll Be Mine\"]\n\nSoon enough the group found another drummer, Norm Chapman, and carried on as before, getting regular bookings thanks to Williams.\n\nThere was soon a temporary guest at the flat John, Stuart, and George shared with several other people -- Royston Ellis, the Beat poet and friend of the Shadows, had turned up in Liverpool and latched on to the group, partly because he fancied George. He performed with them a couple of times, crashed at the flat, and provided them with two formative experiences -- he gave them their first national press, talking in Record and Show Mirror about how he wanted them to be his full-time group, and he gave them their first drug experience, showing them how to get amphetamines out of inhalers.\n\nWhile the group's first national press was positive, there was soon some very negative press indeed associated with them. A tabloid newspaper wanted to do a smear story about the dangerous Beatnik menace. The article talked about how \"they revel in filth\", and how beatniks were \"a dangerous menace to our young people… a corrupting influence of drug addicts and peddlers, degenerates who specialise in obscene orgies\". And for some reason -- it's never been made clear exactly how -- the beatnik \"pad\" they chose to photograph for this story was the one that John, Stuart, and George lived in, though they weren't there at the time -- several of their friends and associates are in the pictures though.\n\nThey were all kicked out of their flat, and moved back in with their families, and around this time they lost Chapman from the group too -- he was called up to do his National Service, one of the last people to be conscripted before conscription ended for good. They were back to a four-piece again, and for a while Paul was drumming.\n\nBut then, as seems to have happened so often with this group, a bizarre coincidence happened.\n\nA while earlier, Allan Williams had travelled to Hamburg, with the idea of trying to get Liverpool groups booked there. He'd met up with Bruno Koschmider, the owner of a club called the Kaiserkeller. Koschmider had liked the idea, but nothing had come of it, partly because neither could speak the other's language well. A little while later, Koschmider had remembered the idea and come over to the UK to find musicians. He didn't remember where Williams was from, so of course he went to London, to the 2is, and there he found a group of musicians including Tony Sheridan, who we talked about back in the episode on \"Brand New Cadillac\", the man who'd been Vince Taylor's lead guitarist and had a minor solo career:\n\n[Excerpt: Tony Sheridan, \"Why?\"]\n\nSheridan was one of the most impressive musicians in Britain, but he also wanted to skip the country -- he'd just bought a guitar on credit in someone else's name, and he also had a wife and six-month-old baby he wanted rid of. He eagerly went off with Koschmider, and a scratch group called the Jets soon took up residence at the Kaiserkeller.\n\nMeanwhile, in Liverpool, Derry and the Seniors were annoyed. Larry Parnes had booked them for a tour, but then he'd got annoyed at the unprofessionalism of the Liverpool bands he was booking and cancelled the booking, severing his relationship with Williams. The Seniors wanted to know what Williams was going to do about it.\n\nThere was no way to get them enough gigs in Liverpool, so Williams, being a thoroughly decent man who had a sense of obligation, offered to drive the group down to London to see if they could get work there. He took them to the 2is, and they were allowed to get up and play there, since Williams was a friend of the owner.\n\nAnd Bruno Koschmider was there. The Jets hadn't liked playing at Williams' club, and they'd scarpered to another one with better working conditions, which they helped get off the ground and renamed the Top Ten, after Vince Taylor's club in London. So Bruno had come back to find another group, and there in the same club at the same time was the man who'd given him the idea in the first place, with a group. Koschmider immediately signed up Derry and the Seniors to play at the Kaiserkeller.\n\nMeanwhile, the best gig the Beatles could get, also through Williams, was backing a stripper, where they played whatever instrumentals they knew, no matter how inappropriate, things like the theme from The Third Man:\n\n[Excerpt: Anton Karas, \"Theme from The Third Man\"]\n\nA tune guaranteed to get the audience into a sexy mood, I'm sure you'll agree.\n\nBut then Allan Williams got a call from Koschmider. Derry and the Seniors were doing great business, and he'd decided to convert another of his clubs to be a rock and roll club. Could Williams have a group for him by next Friday? Oh, and it needed to be five people.\n\nWilliams tried Rory Storm and the Hurricanes. They were busy. He tried Cass and the Cassanovas. They were busy. He tried Gerry and the Pacemakers. They were busy. Finally, he tried the Beatles. They weren't busy, and said yes they could go to Hamburg that week. There were a few minor issues, like there not being five of them, none of them having passports, and them not having a drummer. The passports could be sorted quickly -- there's a passport office in Liverpool -- but the lack of a fifth Beatle was more of a problem. In desperation, they turned eventually to Pete Best, Mrs. Best's son, because they knew he had a drum kit. He agreed.\n\nAllan Williams drove the group to Hamburg, and they started playing six-hour sets every night at the Indra, not finishing til three in the morning, at which point they'd make their way to their lodgings -- the back of a filthy cinema.\n\nBy this time, the Beatles had already got good -- Howie Casey, of Derry and the Seniors, who'd remembered the Beatles as being awful at the Johnny Gentle audition, came over to see them and make fun of them, but found that they were far better than they had been. But playing six hours a night got them *very* good *very* quickly -- especially as they decided that they weren't going to play the same song twice in a night, meaning they soon built up a vast repertoire.\n\nBut right from the start, there was a disconnect between Pete Best and the other four -- they socialised together, and he went off on his own. He was also a weak player -- he was only just starting to learn -- and so the rest of the group would stamp their feet to keep him in time. That, though, also gave them a bit more of a stage act than they might otherwise have had.\n\nThere are lots of legendary stories about the group's time in Hamburg, and it's impossible to sort fact from fiction, and the bits we can sort out would get this podcast categorised as adult content, but they were teenagers, away from home for a long period for the first time, living in a squalid back room in the red light district of a city with a reputation for vice. I'm sure whatever you imagine is probably about right.\n\nAfter a relatively short time, they were moved from the Indra, which had to stop putting on rock and roll shows, to the Kaiserkeller, where they shared the bill with Rory Storm & the Hurricanes, up to that point considered Liverpool's best band. There's a live recording of the Hurricanes from 1960, which shows that they were certainly powerful:\n\n[Excerpt: Rory Storm and the Hurricanes, \"Brand New Cadillac\"]\n\nThat recording doesn't have the Hurricanes' normal drummer on, who was sick for that show.\n\nBut compared to what the Beatles had become -- a stomping powerhouse with John Lennon, whose sense of humour was both cruel and pointed, doing everything he could to get a rise out of the audience -- they were left in the dust. A letter home that George Harrison wrote sums it up -- \"Rory Storm & the Hurricanes came out here the other week, and they are crumby. He does a bit of dancing around but it still doesn’t make up for his phoney group. The only person who is any good in the group is the drummer.\"\n\nThat drummer was Richy Starkey from the Eddie Clayton Skiffle Group, now performing as Ringo Starr. They struck up a friendship, and even performed together at least once -- John, Paul, George, and Ringo acting as the backing group for Lu Walters of the Hurricanes on a demo, which is frustratingly missing and hasn't been heard since.\n\nThey were making other friends, too. There was Tony Sheridan, who they'd seen on TV, but who would now sometimes jam with them as equals. And there was a trio of arty bohemian types who had stumbled across the club, where they were very out of place -- Astrid Kirscherr, Klaus Voormann, and Jurgen Vollmer. They all latched on to the Beatles, and especially to Stuart, who soon started dating Astrid, despite her speaking no English and him speaking no German.\n\nBut relations between Koschmider and the Beatles had worsened, and he reported to the police that George, at only seventeen, was under-age. George got deported. The rest of the group decided to move over to the Top Ten Club, and as a parting gift, Paul and Pete nailed some condoms to their bedroom wall and set fire to them. Koschmider decided to report this to the police as attempted arson, and those two were deported as well. John followed a week later, while Stuart stayed in Hamburg for a while, to spend more time with Astrid, who he planned to marry.\n\nThe other four regrouped, getting in a friend, Chas Newby, as a temporary bass player while Stuart was away. And on the twenty-seventh of December, 1960, when they played Litherland Town Hall, they changed the Liverpool music scene. They were like nothing anyone had ever seen, and the audience didn't dance -- they just rushed to the stage, to be as close to the performance as possible. The Beatles had become the best band in Liverpool. Mark Lewisohn goes further, and suggests that the three months of long nights playing different songs in Hamburg had turned them into the single most experienced rock band *in the world* -- which seems vanishingly unlikely to me, but Lewisohn is not a man given to exaggeration.\n\nBy this time, Mona Best had largely taken over the group's bookings, and there were a lot of them, as well as a regular spot at the Casbah. Neil Aspinall, a friend of Pete's, started driving them to gigs, while they also had a regular MC, Bob Wooler, who ran many local gigs, and who gave the Beatles their own theme music -- he'd introduce them with the fanfare from Rossini's William Tell Overture:\n\n[Excerpt: Rossini, \"William Tell Overture\"]\n\nStuart came over from Hamburg in early January, and once again the Beatles were a five-piece -- and by now, he could play quite well, well enough, at any rate, that it didn't destroy the momentum the group had gathered. The group were getting more and more bookings, including the venue that would become synonymous with them, the Cavern, a tiny little warehouse cellar that had started as a jazz club, and that the Quarry Men had played once a couple of years earlier, but had been banned from for playing too much rock and roll.\n\nNow, the Beatles were getting bookings at the Cavern's lunchtime sessions, and that meant more than it seemed. Most of the gigs they played otherwise were on the outskirts of the city, but the Cavern was in the city centre. And that meant that for the lunchtime sessions, commuters from outside the city were coming to see them -- which meant that the group got fans from anywhere within commuting distance, fans who wanted them to play in their towns.\n\nMeanwhile, the group were branching out musically -- they were particularly becoming fascinated by the new R&B, soul, and girl-group records that were coming out in the US. After already having loved \"Money\" by Barrett Strong, John was also obsessed with the Miracles, and would soon become a fervent fan of anything Motown, and the group were all big fans of the Shirelles. As they weren't playing original material live, and as every group would soon learn every other group's best songs, there was an arms race on to find the most exciting songs to cover. As well as Elvis and Buddy and Eddie, they were now covering the Shirelles and Ray Charles and Gary US Bonds.\n\nThe group returned to Hamburg in April, Paul and Pete's immigration status having been resolved and George now having turned eighteen, and started playing at the Top Ten club, where they played even longer sets, and more of them, than they had at the Kaiserkeller and the Indra. Tony Sheridan started regularly joining them on stage at this time, and Paul switched to piano while Sheridan added the third guitar. This was also when they started using Preludin, a stimulant related to amphetamines which was prescribed as a diet drug -- Paul would take one pill a night, George a couple, and John would gobble them down. But Pete didn't take them -- one more way in which he was different from the others -- and he started having occasional micro-sleeps in the middle of songs as the long nights got to him, much to the annoyance of the rest of the group. But despite Pete's less than stellar playing they were good enough that Sheridan -- the single most experienced musician in the British rock and roll scene -- described them as the best R&B band he'd ever heard.\n\nOnce they were there, they severed their relationship with Allan Williams, refusing to pay him his share of the money, and just cutting him out of their careers.\n\nMeanwhile, Stuart was starting to get ill. He was having headaches all the time, and had to miss shows on occasion. He was also the only Beatle with a passion for anything else, and he managed to get a scholarship to study art with the famous sculptor Eduardo Paolozzi, who was now working in Hamburg. Paul subbed for Stuart on bass, and eventually Stuart left the group, though on good terms with everyone other than Paul.\n\nSo it was John, Paul, George and Pete who ended up making the Beatles' first records. Bert Kaempfert, the most important man in the German music industry, had been to see them all at the Top Ten and liked what he saw. Outside Germany, Kaempfert was probably best known for co-writing Elvis' \"Wooden Heart\", which the Beatles had in their sets at this time:\n\n[Excerpt: Elvis Presley, \"Wooden Heart\"]\n\nKaempfert had signed Tony Sheridan to a contract, and he wanted the Beatles to back him in the studio -- and he was also interested in recording a couple of tracks with them on their own. The group eagerly agreed, and their first session started at eight in the morning on the twenty-second of June 1961, after they had finished playing all night at the club, and all of them but Pete were on Preludin for the session. Stuart came along for moral support, but didn't play.\n\nPete was a problem, though. He wasn't keeping time properly, and Kaempfert eventually insisted on removing his bass drum and toms, leaving only a snare, hi-hat, and ride cymbal for Pete to play.\n\nThey recorded seven songs at that session in total. Two of them were just by the Beatles. One was a version of \"Ain't She Sweet\", an old standard which Gene Vincent had recorded fairly recently, but the other was the only track ever credited to Lennon and Harrison as cowriters. On their first trip to Hamburg, they'd wanted to learn \"Man of Mystery\" by the Shadows:\n\n[Excerpt: The Shadows, \"Man of Mystery\"]\n\nBut there was a slight problem in that they didn't have a copy of the record, and had never heard it -- it came out in the UK while they were in Germany. So they asked Rory Storm to hum it for them. He hummed a few notes, and Lennon and Harrison wrote a parody of what Storm had sung, which they named \"Beatle Bop\" but by this point they'd renamed \"Cry For a Shadow\":\n\n[Excerpt: The Beatles, \"Cry For a Shadow\"]\n\nThe other five songs at the session were given over to Tony Sheridan, with the Beatles backing him, and the song that Kaempfert was most interested in recording was one the group had been performing on stage -- a rocked-up version of the old folk song \"My Bonnie\":\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"My Bonnie\"]\n\nThat was the record chosen as the single, but it was released not as by Tony Sheridan and the Beatles, but by Tony Sheridan and the Beat Brothers -- \"Beatles\", to German ears, sounded a little like \"piedels\", a childish slang term for penises. The Beatles had made their first record, but it wasn't one they thought much of. They knew they could do better.\n\nThe next week, the now four-piece Beatles returned to Liverpool, with much crying at Stuart staying behind -- even Paul, now Stuart was no longer a threat for John's attention, was contrite and tried to make amends to him.\n\nOn their return to Liverpool, they picked up where they had left off, playing almost every night, and spending the days trying to find new records -- often listening to the latest releases at NEMS, a department store with an extensive record selection. Brian Epstein, the shop's manager, prided himself on being able to get any record a customer wanted, and whenever anyone requested anything he'd buy a second copy for the shelves. As a result, you could find records there that you wouldn't get anywhere else in Liverpool, and the Beatles were soon adding more songs by the Shirelles and Gary US Bonds to their sets, as well as more songs by the Coasters and Ben E. King's \"Stand By Me\".\n\nThey were playing gigs further afield, and Neil Aspinall was now driving them everywhere. Aspinall was Pete Best's closest friend -- and was having an affair with Pete's mother -- but unlike Pete himself he also became close to the other Beatles, and would remain so for the rest of his life.\n\nBy this point, the group were so obviously the best band on the Liverpool scene that they were starting to get bored -- there was no competition. And by this point it really was a proper scene -- John's old art school friend Bill Harry had started up a magazine, Mersey Beat, which may be the first magazine anywhere in the world to focus on one area's local music scene. Brian Epstein from NEMS had a column, as did Bob Wooler, and often John's humorous writing would appear as well. The Beatles were featured in most issues -- although Paul McCartney's name was misspelled almost every time it appeared -- and not just because Lennon and Harry were friends. By this point there were the Beatles, and there were all the other groups in the area.\n\nFor several months this continued -- they learned new songs, they played almost every day, and they continued to be the best. They started to find it boring. The one big change that came at this point was when John and Paul went on holiday to Paris, saw Vince Taylor, bumped into their friend Jurgen from Hamburg, and got Jurgen to do their hair like his -- the story we told in the episode on \"Brand New Cadillac\". They now had the Beatles haircut, though they were still wearing leather. When they got back, George copied their new style straight away, but Pete decided to leave his hair in a quiff.\n\nThere was nowhere else to go without a manager to look after them. They needed management -- and they found it because of \"My Bonnie\":\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"My Bonnie\"]\n\n\"My Bonnie\" was far from a great record, but it was what led to everything that followed. The Beatles had mentioned from the stage at the Cavern that they had a record out, and a young man named Raymond Jones walked into NEMS and asked for a copy of it. Brian Epstein couldn't find it in the record company catalogues, and asked Jones for more information -- Jones explained that they were a Liverpool group, but the record had come out in Germany. A couple of days later, two young girls came into the shop asking for the same record, and now Epstein was properly intrigued -- in his view, if *two* people asked for a record, that probably meant a lot more than just two people wanted it. He decided to check these Beatles out for himself.\n\nEpstein was instantly struck by the group, and this has led to a lot of speculation over the years, because his tastes ran more to Sibelius than to Little Richard. As Epstein was also gay, many people have assumed that the attraction was purely physical. And it might well have been, at least in part, but the suggestion that everything that followed was just because of that seems unlikely -- Epstein was also someone who had a long interest in the arts, and had trained as an actor at RADA, the most prestigious actors' college in the UK, before taking up his job at the family store. Given that the Beatles were soon to become the most popular musicians in the history of the world, and were already the most popular musicians in the Liverpool area, the most reasonable assumption must be that Epstein was impressed by the same things that impressed roughly a billion other people over the next sixty years.\n\nEpstein started going to the Cavern regularly, to watch the Beatles and to make plans -- the immaculately dressed, public-school-educated, older rich man stood out among the crowd, and the Beatles already knew his face from his record shop, and so they knew something was going on. By late November, Brian had managed to obtain a box of twenty-five copies of \"My Bonnie\", and they'd sold out within hours. He set up a meeting with the Beatles, and even before he got them signed to a management contract he was using his contacts with the record industry in London to push the Beatles at record companies. Those companies listened to Brian, because NEMS was one of their biggest customers.\n\nDecember 1961, the month they signed with Brian Epstein, was also the month that they finally started including Lennon/McCartney songs in their sets. &nbsp;And within a couple of weeks of becoming their manager, even before he'd signed them to a contract, Brian had managed to persuade Mike Smith, an A&R man from Decca, to come to the Cavern to see the group in person. He was impressed, and booked them in for a studio session.\n\nDecember 61 was also the first time that John, Paul, George, and Ringo played together in that lineup, without any other musicians, when on the twenty-seventh of December Pete called in sick for a show, and the others got in their friend to cover for him. It wouldn't be the last time they would play together.\n\nOn New Year's Day 1962, the Beatles made the trek down to London to record fifteen songs at the Decca studios. The session was intended for two purposes -- to see if they sounded as good on tape as they did in the Cavern, and if they did to produce their first single. Those recordings included the core of their Cavern repertoire, songs like \"Money\":\n\n[Excerpt: The Beatles, \"Money (Decca version)\"]\n\nThey also recorded three Lennon/McCartney songs, two by Paul -- \"Love of the Loved\" and \"Like Dreamers Do\":\n\n[Excerpt: The Beatles, \"Like Dreamers Do\"]\n\nAnd one by Lennon -- \"Hello Little Girl\":\n\n[Excerpt: The Beatles, \"Hello Little Girl\"]\n\nAnd they were Lennon/McCartney songs, even though they were written separately -- the two agreed that they were going to split the credit on anything either of them wrote.\n\nThe session didn't go well -- the group's equipment wasn't up to standard and they had to use studio amps, and they're all audibly nervous -- but Mike Smith was still fairly confident that they'd be releasing something through Decca -- he just had to work out the details with his boss, Dick Rowe.\n\nMeanwhile, the group were making other changes. Brian suggested that they could get more money if they wore suits, and so they agreed -- though they didn't want just any suits, they wanted stylish mohair suits, like the black American groups they loved so much.\n\nThe Beatles were now a proper professional group -- but unfortunately, Decca turned them down. Dick Rowe, Mike Smith's boss, didn't think that electric guitars were going to become a big thing -- he was very tuned in to the American trends, and nothing with guitars was charting at the time. Smith was considering two groups -- the Beatles, and Brian Poole and the Tremeloes, and wanted to sign both. Rowe told him that he could sign one, but only one, of them. The Tremeloes had been better in the studio, and they lived round the corner from Smith and were friendly with him. There was no contest -- much as Smith wanted to sign both groups, the Tremeloes were the better prospect.\n\nRowe did make an offer to Epstein: if Epstein would pay a hundred pounds (a *lot* of money in those days), Tony Meehan, formerly of the Shadows, would produce the group in another session, and Decca would release that. Brian wasn't interested -- if the Beatles were going to make a record, they were going to make it with people who they weren't having to pay for the privilege.\n\nJohn, Paul, and George were devastated, but for their own reasons they didn't bother to tell Pete they'd been turned down.\n\nBut they did have a tape of themselves, at least -- a professional-quality recording that they could use to attract other labels. And their career was going forward in other ways. The same day Brian had his second meeting with Decca, they had an audition with the BBC in Manchester, where they were accepted to perform on Teenager's Turn, a radio programme hosted by the Northern Dance Orchestra. A few weeks later, on the seventh of March, they went to Manchester to record four songs in front of an audience, of which three would be broadcast:\n\n[Excerpt: The Beatles, \"Please Mr. Postman (Teenager's Turn)\"]\n\nThat recording of John singing \"Please Mr. Postman\" is historic for another reason, which shows just how on the cutting edge of musical taste the Beatles actually were -- it was the first time ever that a Motown song was played on the BBC.\n\nNow we get to the part of the story that, before Mark Lewisohn's work in his book a few years back, had always been shrouded in mystery. What Lewisohn shows is that George Martin was in fact forced to sign the Beatles, against his will, and that this may have been as a punishment.\n\nThe Beatles had already been turned down by Parlophone once, based on \"My Bonnie\", when Brian Epstein walked into the HMV store on Oxford Street in London in mid-February. HMV is now mostly known as a retail chain, Britain's biggest chain of physical media stores, but at the time it was owned by EMI, and was associated with their label of the same name -- HMV stood for \"His Master's Voice\", and its logo was the same one as America's RCA, with whom it had a mutual distribution deal for many years.\n\nAs a record retailer, Epstein naturally had a professional interest in other record shops, and he had a friend at HMV, who suggested to him that they could use a disc-cutting machine that the shop had to turn his copy of the Decca tapes into acetate discs, which would be much more convenient for taking round and playing to record labels. That disc-cutter was actually in a studio that musicians used for making records for themselves, much as the Quarry Men had years earlier -- it was in fact the studio where Cliff Richard had cut *his* first private demo, the one he'd used to get signed to EMI.\n\nJim Foy, the man who worked the lathe cutter, liked what he heard, and he talked with Brian about the group. Brian mentioned that some of the songs were originals, and Foy told him that EMI also owned a publishing company, Ardmore & Beechwood, and the office was upstairs -- would Brian like to meet with them to discuss publishing? Brian said he would like that.\n\nArdmore & Beechwood wanted the original songs on the demo. They were convinced that Lennon and McCartney had potential as songwriters, and that songs like \"Like Dreamers Do\" could become hits in the right hands. And Brian Epstein agreed with them -- but he also knew that the Beatles had no interest in becoming professional songwriters. They wanted to make records, not write songs for other people to record.\n\nBrian took his new discs round to George Martin at EMI -- who wasn't very impressed, and basically said \"Don't call us, we'll call you\". Brian went back to Liverpool, and got on with the rest of the group's career, including setting up another Hamburg residency for them, this time at a new club called the Star Club.\n\nThat Star Club residency, in April, would be devastating for the group -- on Tuesday the tenth of April, the same day John, Paul, and Pete got to Hamburg (George was ill and flew over the next day), Stuart Sutcliffe, who'd been having headaches and feeling ill for months, collapsed and died, aged only twenty-one. The group found out the next day -- they got to the airport to meet George, and bumped into Klaus and Astrid, who were there to meet Stuart's mother from the same flight. They asked where Stuart was, and heard the news from Astrid.\n\nJohn basically went off the rails. Most of the stories about Lennon's bad behaviour in Hamburg come from this trip in particular -- a young man dealing with his trauma by taking amphetamines and drinking too much, and resorting to cruel humour to mask the fact that he was traumatised by the death of his closest friend.\n\nBut the music still continued, and they even did another session for Tony Sheridan. Sheridan wasn't actually in the studio -- his vocal was overdubbed later -- but the four Beatles went into the studio along with the piano player Roy Brown -- the one who had taught Adam Faith how to sing like Buddy Holly, and who often joined them on stage during this period -- to record rock and roll versions of old standards for Sheridan to sing on:\n\n[Excerpt: Tony Sheridan and the Beat Brothers, \"Sweet Georgia Brown\"]\n\nBut it was while they were in Hamburg on this trip that the Beatles finally got a record contract.\n\nArdmore & Beechwood really wanted those songs, and they knew that the Beatles were only interested in making records. Then a song plugger called Kim Bennett hit upon the idea that would lead to the Beatles' success, and to almost everything that follows in subsequent episodes of this podcast. Ardmore and Beechwood were a subsidiary of EMI, and they had a budget for promoting songs. They could use that song-promoting budget... to pay for a record to be made. EMI could put it out, but the costs wouldn't be charged to whichever EMI label put the record out, but to Ardmore & Beechwood's promotional budget for the songs in question. The publishing company would then get two copyrights that it could perhaps use for a successful artist like Cliff Richard or Adam Faith, and the Beatles would get to make a record.\n\nEMI didn't like the idea at first -- publishers should stick to publishing and record companies to records -- but eventually they were worn down by Bennett's persistence. The only question was which of the subsidiary labels -- all of which had already turned the group down -- would be forced to sign them. And that had a solution. It was going to be George Martin.\n\nGeorge Martin was a real musician -- an oboeist with a strong classical background -- and he'd worked on every kind of record, including producing some of the Vipers' records, but he had his greatest successes with novelty and comedy records. He was the producer of the Temperance Seven, a comedy trad group:\n\n[Excerpt: The Temperance Seven, \"You're Driving Me Crazy\"]\n\nBernard Cribbins:\n\n[Excerpt: Bernard Cribbins, \"Hole in the Ground\"]\n\nFlanders & Swann:\n\n[Excerpt: Flanders & Swann, \"A Gnu\"]\n\nPeter Sellers, Beyond the Fringe, and more.\n\nGeorge Martin was in the bad books of Len Wood, the Managing Director of EMI. For several years, Martin, who was married, had been having an affair with his secretary -- Martin's marriage had failed and he and Judy, the secretary in question, were deeply in love and would later marry. But Wood had very strict religious views, and had discovered Martin's infidelity. Not only that, but Martin was getting far too big for his boots -- he was pushing to get an actual *royalty* on the records he produced!\n\nWood couldn't fire Martin -- Martin was too respected by Wood's own boss, Sir Joseph Lockwood -- but he could make Martin's life difficult. And so, in order to shut Kim Bennett at Ardmore & Beechwood up, George Martin was ordered, against his own better instincts, to offer a contract to the Beatles. Martin arranged a meeting with Brian Epstein, who then sent a telegram to the Beatles -- they were going to make a record. Their first session was going to be on the sixth of June.\n\nJohn and Paul got to work -- they had no idea that they had been signed on the basis of their songwriting, and it seems that neither they nor Epstein were ever told what had actually happened to lead to the contract. As far as everyone was concerned, George Martin had made his own decision. They didn't know what it was they would be recording, but they decided to write some new material in case they had a chance to do something of their own.\n\nThey came up with two songs while they were there. One, \"P.S. I Love You\", was a totally new song by Paul, inspired by \"Soldier Boy\" by the Shirelles:\n\n[Excerpt: The Shirelles, \"Soldier Boy\"]\n\nThe other, \"Love Me Do\", was a half-finished song of Paul's from years earlier that they dug out and finished up. The main changes they made to the song were to add a new bridge by Lennon, and an instrumental hook, also Lennon's work. The big sound of that summer was the harmonica -- Bruce Channel had used it on his massive hit \"Hey Baby!\":\n\n[Excerpt: Bruce Channel, \"Hey Baby!\"]\n\nA bunch of other records came out with harmonica on around that time, and Lennon was playing harmonica on stage. They added a harmonica hook to their song in the hope that that would make it more commercial.\n\nWhile they were at the Star Club, they also spent some time with Gene Vincent, who came over just as they were about to leave, and shared a bill with them for four days. They were hugely impressed to be working with one of their real idols, although by this time he was seriously out of control -- Harrison would later remember Vincent dragging him along to a hotel room where Vincent was convinced his wife was having an affair, pulling a gun out and handing it to Harrison to hold for him while he banged on the door. Harrison quickly passed the gun back to Vincent and left -- if there was going to be a murder committed, he didn't want to be involved. Thankfully, Vincent didn't shoot his wife.\n\nA few days after their return to Liverpool, they headed down to the session that they were sure would be to record their first single, still not knowing what they were going to be recording. Ron Richards, George Martin's assistant, was in charge of that initial session, and they started by cutting a version of the old standard \"Besame Mucho\". They then recorded three originals -- John's Miracles-styled \"Ask Me Why\", plus \"P.S. I Love You\" and \"Love Me Do\". George Martin turned up at some point during the session, and suggested that Paul, rather than John, sing the solo lead line on \"Love Me Do\", as the harmonica part overlapped with that line:\n\n[Excerpt: The Beatles, \"Love Me Do (6 June 1962 version)\"]\n\nAt that session, the Beatles and Martin clicked as people -- he was still unimpressed with them as musicians, but he found that he shared a sense of humour with them. They were people he could work with, and vice versa.\n\nOr at least, three of them were. Pete Best didn't say a single word to Martin, and he also played quite amazingly shoddily. After the session, Martin came to a couple of conclusions -- Ron Richards was going to have to look for a better song for the group to perform, and any further recordings would *not* feature Pete Best.\n\nJohn, Paul, and George were coming to similar conclusions, but for the moment Pete was still a Beatle, and a few days later the four of them made another appearance on \"Teenager's Turn\", where they performed an original on the radio for the first time -- John's \"Ask Me Why\":\n\n[Excerpt: The Beatles, \"Ask Me Why (Teenager's Turn)\"]\n\nAfter that show, someone mentioned to Pete that the Beatles were thinking of kicking him out of the band. He didn't believe them, but it was true, as he'd find out a few weeks later.\n\nThe sacking of Pete Best is one of the saddest episodes in rock and roll history. It was absolutely necessary -- he simply wasn't a competent drummer -- but it crushed him. From the point of view of the other three, as well, it made sense -- they'd never felt particularly close to him -- but he doesn't seem to have realised that they didn't think of him as close. He wasn't really close with *anyone* -- that's just who he was. It's not his fault. Nobody disliked him, they just didn't know him that well. He wasn't one of them.\n\nAnyone who's ever had a friendship that meant more to them than it did to the other person will be able to sympathise with how Pete felt on that level, but it's hard to imagine just how much it must have hurt to be dropped from a band that was his whole life, which he considered himself an equal member of, and which then went on to be the most successful band in the world so soon after he was out. It didn't help that the other three left Brian Epstein to do their dirty work. Nor did it help that his best mate Neil Aspinall -- the man who lived in his house, and who had just fathered Pete's younger half-brother, carried on working for them, telling him \"They sacked *you*, they didn't sack me.\"\n\nOne reason they chose that particular moment to sack Pete, and get in Ringo, who was widely regarded as either the best drummer in Liverpool or the second best after Johnny Hutch (who hated and despised John Lennon so much that he was never even considered, while Ringo was good friends with all of them) was because the next week, on the 22nd of August, there was going to be a TV crew coming to the Cavern to film them for local TV:\n\n[Excerpt: The Beatles, \"Some Other Guy\"]\n\nPete Best was in the audience, watching his replacement.\n\nThe day after that came another big change -- John's girlfriend, Cynthia, was pregnant, and they married on the 23rd of August, in a small ceremony. Brian Epstein gave the happy couple the use of his flat rent-free until they could find a place of their own.\n\nOn the fourth of September, the group went down to London to record what was sure to be their first real single. They'd been given a song to learn by George Martin -- a song written by the songwriter Mitch Murray, published by Dick James, a friend of Martin's, which had already been turned down by Brian Poole and the Tremeloes and Adam Faith, called \"How Do You Do It?\"\n\nThey despised the song, but they did what they were told. That was to be the A-side:\n\n[Excerpt: The Beatles, \"How Do You Do It?\"]\n\nFor the B-side, they cut another version of \"Love Me Do\", this time with Ringo on drums:\n\n[Excerpt: The Beatles, \"Love Me Do (single version)\"]\n\nThey also made an attempt at cutting a new song of John's, \"Please Please Me\", but Ringo didn't know the song that well, and he was also showing off a bit in the studio due to nerves. He messed up, and George Martin determined that the next session -- if there was even going to be a next session -- he'd get in a session drummer rather than keep relying on whoever the Beatles brought in.\n\nIt turned out that that next session would be sooner than he'd imagined. John and Paul begged him to not put out \"How Do You Do It?\", saying they could do better, but Martin stood firm, saying \"When you can write something as good as that, I'll consider it\". But then Ardmore & Beechwood went ballistic. The purpose of the session was to get Lennon/McCartney songs recorded for Ardmore & Beechwood, not Dick James songs. They at least wanted the A-side of the record to be \"Love Me Do\". But Dick James wouldn't let \"How Do You Do It?\" be relegated to a B-side either, and Mitch Murray, once he heard the recording, wasn't even sure if he wanted it to come out at all.\n\nSo George Martin called the group back into the studio yet again a week later, telling them he was graciously agreeing to their requests, and this time he also brought in a session drummer, Andy White, much to Ringo's disgust.\n\nThey recorded two songs for consideration as the B-side, with Ron Richards running the session -- \"P.S. I Love You\", and John's new one \"Please Please Me\", and then cut a reworking of \"Love Me Do\", this time with White on drums while Ringo played a tambourine:\n\n[Excerpt: The Beatles, \"Love Me Do (album version)\"]\n\nIn the end, \"P.S. I Love You\" was chosen for the B-side, and \"Please Please Me\" kept back to be reworked at a future date. George Martin was now, despite all the difficulty they'd caused him, on the Beatles' side. He knew they were good, and he knew \"Please Please Me\" could be a hit. He just had to get this record that he didn't think much of out of the way first. The record was released with the earlier version of \"Love Me Do\" on the A-side -- Ringo, not Andy White, playing drums -- although when the group's first album came out the Andy White version would be included instead.\n\n\"Love Me Do\" wasn't expected to be a success, but it surprised everyone, due mostly to its sales in Liverpool and the North-West of England. It crept into the top fifty, and slowly made its way up the charts to number seventeen. John, Paul, George, and Ringo had a hit record, and the sixties had finally started.",
  "enclosure": "",
  "itunes:summary": "This week there are&nbsp;two episodes of the podcast going up, both of them longer than normal. This one, episode one hundred, is the hundredth-episode special and is an hour and a half long. It looks at the early career of the Beatles, and at the three recordings of \"Love Me Do\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Misirlou\" by Dick Dale and the Deltones.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nWhile there are many books on the Beatles, and I have read dozens of them, only one needs to be mentioned as a reference for this episode (others will be used for others).&nbsp;All These Years Vol 1: Tune In&nbsp;by Mark Lewisohn is simply the *only* book worth reading on the Beatles' career up to the end of 1962. It is the most detailed, most accurate, biography imaginable, and the gold standard by which all other biographies of musicians should be measured. I only wish volumes two and three were available already so I could not expect my future episodes on the Beatles to be obsolete when they do come out.\n\nThere are two versions of the book -- a nine-hundred page mass-market version and a 1700-page expanded edition. I recommend the latter. The information in this podcast is almost all from Lewisohn's book, but I must emphasise that the opinions are mine, and so are any errors -- Lewisohn's book only has one error that I'm aware of (a joke attributed to the comedian Jasper Carrott in a footnote that has since been traced to an earlier radio show). I am only mortal, and so have doubtless misunderstood or oversimplified things and introduced errors where he had none.\n\nThe single version of \"Love Me Do\" can be found on Past Masters, a 2-CD compilation of the Beatles' non-album tracks that includes the majority of their singles and B-sides. The version with Andy White playing on can be found on&nbsp;Please Please Me. The version with Pete Best, and many of the other early tracks used here, is on Anthology 1.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nErrata\n\nI pronounce the name of Lewisohn's book as \"All Those Years\" instead of \"All These Years\".\n\nI say \" The Jets hadn't liked playing at Williams' club\" at one point. I meant \"at Koschmider's club\"\n\nTranscript\n\nThe Beatles came closer than most people realise to never making a record.\n\nUntil the publication of Mark Lewisohn's seminal biography All These Years vol 1: Tune In, in 2013 everyone thought they knew the true story -- John met Paul at Woolton Village Fete in 1957, and Paul joined the Quarrymen, who later became the Beatles. They played Hamburg and made a demo, and after the Beatles' demo was turned down by Decca, their manager Brian Epstein shopped it around every record label without success, until finally George Martin heard the potential in it and signed them to Parlophone, a label which was otherwise known for comedy records. Martin was, luckily, the one producer in the whole of the UK who could appreciate the Beatles' music, and he signed them up, and the rest was history.\n\nThe problem is, as Lewisohn showed, that's not what happened. Today I'm going to tell, as best I can the story of how the Beatles actually became the band that they became, and how they got signed to EMI records. I'm going to tell you the story of \"Love Me Do\":\n\n[Excerpt: The Beatles, \"Love Me Do (single version)\"]\n\nAs I mentioned at the beginning, this episode owes a *huge* debt to Mark Lewisohn's book. I like to acknowledge my sources, anyway, but I've actually had diffi",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week there are&nbsp;two episodes of the podcast going up, both of them longer than normal. This one, episode one hundred, is the hundredth-episode special and is an hour and a half long. It looks at the early career of the Beatles, and at the three recordings of \"Love Me Do\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,&nbsp;on \"Misirlou\" by Dick Dale and the Deltones.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nNo Mixclouds this week, as both episodes have far too many songs by one artist. The mixclouds will be back with episode 101.\n\nWhile there are many books on the Beatles, and I have read dozens of them, only one needs to be mentioned as a reference for ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}