{
  "title": "502: All The Ways Hogwarts Is A Security Nightmare",
  "link": "https://audioboom.com/posts/7806423",
  "itunes:episode": 502,
  "itunes:title": "All The Ways Hogwarts Is A Security Nightmare",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4498,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Did Wizards Unite finally confirm a long-standing theory about Lavender Brown?</li>\n<li>Main Discussion: All The Ways That Hogwarts Is A Security Nightmare</li>\n<li>For decades, students and teachers have been lied to about Hogwarts safety! </li>\n<li>Are moving staircases really a good idea?</li>\n<li>The Forbidden Forest & Black Lake are no place for students of any age!</li>\n<li>The Triwizard Tournament? Ask Cedric Diggory how that turned out!</li>\n<li>Background check, anyone? We discuss how professors like Quirrell, Lockhart, Hagrid & Impostor Moody endangered the students year-after-year.</li>\n<li>Quidditch... need we say more?</li>\n<li>Dear Dumbledore, you REALLY couldn't find the the Chamber of Secrets? Or the giant snake?</li>\n<li>The Whomping Willow (emphasis on whomping)</li>\n<li>Mental health check: should students really be experiencing their worst fears (Boggarts) in  front of each other?</li>\n<li>Remember that year Dementors \"safeguarded\" the school?</li>\n<li>Listeners weigh in with their security concerns, including The Room of Requirement, Portraits, Secret Passages and more!</li>\n<li>Are parents ever notified about all of the dangers at Hogwarts?</li>\n<li>Quizzitch: After Neville falls off his broom in Year 1 who tells Malfoy to shut up? Visit <a href=\"http://www.MuggleCast.com/Quizzitch\">MuggleCast.com/Quizzitch</a> to submit your answer!</li>\n<li>This week's episode is sponsored by <a href=\"http://www.mdacne.com/mugglecast\">MDAcne</a> (take the quiz and get your first month's supply for free, just pay shipping) and <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp</a> (receive 10% off your first month)!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Support us on Patreon</a> and receive magical benefits, like a personalized thank you video from one of the hosts and Bonus MuggleCast!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 23 Feb 2021 12:00:00 +0000",
  "guid": "tag:audioboom.com,2021-02-22:/posts/7806423",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}