{
  "id": "yt:video:X6Qfkj2Nso4",
  "yt:videoId": "X6Qfkj2Nso4",
  "yt:channelId": "UC3WoPalcYf7d_x4DC2BXAfw",
  "title": "Dead Space is an absolute masterpiece in 2022",
  "link": "",
  "author": {
    "name": "jayvee",
    "uri": "https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw"
  },
  "published": "2022-10-12T14:00:19+00:00",
  "updated": "2022-10-15T20:12:00+00:00",
  "media:group": {
    "media:title": "Dead Space is an absolute masterpiece in 2022",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video is sponsored by Outplayed. Download the app free here: https://www.influencerlink.org/SHEfe #sponsored\n\nSubscribe to jayveeonYT for more videos!\n► ​https://www.youtube.com/channel/UC3WoPalcYf7d_x4DC2BXAfw?sub_confirmation=1\n\nWatch more videos on jayveeonYT! \n► https://youtube.com/playlist?list=PLGdQpBjWmxqVuXKKNVcccm81dpDwsJPvH\n\n- - - - - - - - - - - - - - - -\n\nFollow jayveeonYT!\n► Twitter: https://twitter.com/jayveeonYT​\n► Discord: https://discord.gg/jayveeonyt\n► Instagram: https://www.instagram.com/jayvee.yt/​\n\nWatch More jayveeonYT!\nLatest Uploads:  \n\nSo I ranked ALL the AC games...\n► https://youtu.be/Z9_Tb_TcPYI\n\nSo I played AC Rogue in 2021...\n► https://youtu.be/LUmOm2whuvY\n\nSo I played AC Syndicate in 2021...\n► https://youtu.be/swJN5NO2gJ8\n\nSo I played AC Unity in 2021...\n► https://youtu.be/UjTt4KtAZO8\n\nSo I played AC Odyssey in 2021…\n► https://youtu.be/guMObmtv54s\n\n- - - - - - - - - - - - - - - -\n\nAbout jayveeonYT:\nNews, reactions, and gameplay of all the biggest RPGs, open world, and action-adventure video games! Jayvee covers Assassin's Creed, Cyberpunk, Fallout, and more!\n\n- - - - - - - - - - - - - - - -\n\nDead Space is a 2008 survival horror video game developed by EA Redwood Shores and published by Electronic Arts. It was released for PlayStation 3, Xbox 360, and Microsoft Windows as the debut entry in the Dead Space series. Set on a mining spaceship overrun by deadly monsters called Necromorphs following the discovery of an artifact called the Marker. the player controls engineer Isaac Clarke as he navigates the spaceship and fights the Necromorphs while struggling with growing psychosis. Gameplay has Isaac exploring different areas through its narrative, solving environmental puzzles and finding ammunition and equipment to survive.\n\nDead Space was pitched in early 2006, with an early prototype running on Xbox. Creator Glen Schofield wanted to make the most frightening horror game he could imagine, drawing inspiration from the video game Resident Evil 4 and films including Event Horizon and Solaris. The team pushed for innovation and realism in their design, ranging from procedural enemy placement to removing HUD elements. The sound design was a particular focus during production, with the score by Jason Graves designed to evoke tension and unease.\n\nDead Space debuted to slow sales but eventually sold over a million copies worldwide. Critics praised its atmosphere, gameplay and sound design. It won and was nominated for multiple industry awards and has been ranked by journalists as one of the greatest video games ever made. The series spawned two numbered sequels (released in 2011 and 2013), several spin-off titles, and other related media, including a comic book prequel and an animated film. A remake is currently in development by EA's Motive Studios and set for release in 2023.\n\nDead Space is a science fiction action horror video game. Players take on the role of Isaac Clarke, controlling him through a third-person perspective. Players navigate level-based sections of the spaceship Ishimura, completing narrative-driven missions, solving physics puzzles within the environment, and fighting monsters dubbed Necromorphs.[1][2][3] In the vacuum Isaac has a limited air supply, which can be replenished by finding air tanks within the environment. Some areas are subject to zero-G, with both Isaac and specific enemy types able to jump between surfaces; these areas have dedicated puzzles.[2][4] During exploration of the Ishimura, Isaac finds ammunition, health pickups, and Nodes that are used to both unlock special doors and upgrade weapons and Isaac's suit. At certain points in the ship, Isaac can access a store to buy supplies and ammunition.[5][6] Isaac can use a navigation line to find the next mission objective.[7]\n\nIsaac can stomp to break supply crates and attack enemies, and punch to kill smaller enemies and repel larger ones. Two more abilities unlocked during the game are Kinesis, which can move or pull objects in the environment, and Stasis, which slows movement for a limited time.[7] All gameplay displays are diegetic, appearing in-world as holographic projections. Isaac's health and energy levels are displayed on the back of his suit, and ammunition count appears when weapons are raised. All information displays—control prompts, pick-ups, video calls, the game map, inventory, store fronts—appear as holographic displays. While the player is browsing menus, time in the game does not pause.[6][7]\n\n#gaming #jayvee #deadspace",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}