{
  "title": "#427: Connecting Sorcerer's Stone to Deathly Hallows",
  "link": "https://audioboom.com/posts/7328253",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4986,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We're going to be in Orlando this August - if you're in the neighborhood, come say hi! Visit our site to fill out our brief survey.</li>\n<li>There's never been a better time to support the show! <a href=\"http://www.patreon.com/mugglecast\">Become a Patron</a> by July 31 and get this year's TWO physical gifts - signed album art and a MuggleCast tote bag!</li>\n<li>Our main discussion is The Secrets of Sorcerer's Stone: We expose the little things in the first book that ended up playing a larger role later in the series -- especially within Deathly Hallows.</li>\n<li>Does Dumbledore govern Harry's existence from the very beginning of the series?</li>\n<li>What protected Harry overnight on the Privet Drive stoop? #SecurityNightmare</li>\n<li>Did Rowling know the role Sirius would play in later books?</li>\n<li>Why are wizards so willing to risk exposing themselves following Voldemort's downfall?</li>\n<li>Why does Dumbledore think Harry's scar will come in handy? Does Dumbledore suspect a Horcrux connection exists this early on?</li>\n<li>We connect the MANY threads between Sorcerer's Stone and Deathly Hallows</li>\n<li>The importance of Gringotts and Griphook</li>\n<li>King's Cross and the Doorway Between Worlds</li>\n<li>Dumbledore's Chocolate Frog Card and what it means for Fantastic Beasts</li>\n<li>We discuss Centaurs, Harry's Magical Protection and Snape's Loyalties</li>\n<li>The Sorcerer's Stone, the Deathly Hallows and the Quest for Immortality </li>\n<li>The Golden Snitch and Neville's bravery</li>\n<li>Patrons question the \"Lost 24 Hours\" between Voldemort killing Harry's parents and Harry's arrival at Privet Drive, Dudley's tail, and school attendance</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 29 Jul 2019 15:32:33 +0000",
  "guid": "tag:audioboom.com,2019-07-29:/posts/7328253",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}