{
  "title": "Burning Down Rothbard",
  "link": "https://mises.org/node/60782",
  "description": "<p><strong><em>Burning Down the House: How Libertarian Philosophy Was Corrupted by Delusion and Greed</em><br />by Andrew Koppelman<br />St. Martin’s Press, 2022, 320 pp.</strong></p>\n<p>Andrew Koppelman, a distinguished legal academic who teaches law and political science at Northwestern University, has a quality that few of his fellow academics possess. He is able to find merit in views he strongly opposes, and he tries as best he can to be fair to these views. This quality is much in evidence in “<a href=\"https://balkin.blogspot.com/2017/10/corrupting-national-book-award.html\">Corrupting the National Book Award</a>,” his critical review of Nancy MacLean’s <em>Democracy in Chains</em>: though he agrees with her that libertarian policies pose a danger, he will not countenance her shoddy scholarship. He also is a skilled philosopher who advances many interesting arguments in <em>Burning Down the House</em>.</p>\n<p>That said, I do not think his characterization of libertarianism is altogether accurate, and this vitiates many of the criticisms he makes of it; and others of his critical remarks rest on contestable grounds. In suggesting that he is inaccurate, though, I must guard against inaccuracy myself. Koppelman distinguishes Hayekian libertarianism, which stresses the immense capacity for economic growth that the free market makes possible and accepts the need for government welfare programs of a limited sort, from what he takes to be the more extreme sort of libertarianism, defended by Murray Rothbard, Robert Nozick, and Ayn Rand, which accords absolute, or near-absolute, primacy to rights. He rejects only the latter kind, but he is a qualified admirer of F.A. Hayek, though Koppelman allows substantially more government intervention than Hayek would approve.</p>\n<p>He acknowledges the strength of Hayek’s case for the free market, and indeed, Hayek’s contention that the market necessarily results in inequalities in wealth and income leads Koppelman to accept more inequality than he otherwise would have:</p>\n<blockquote><p>Central planners must depend on a set of definite, specified goals. Since they cannot know all the purposes that individuals are pursuing, Hayek observed, they must impose their own. Tyrannical power is thus inherent in socialism. In short, Hayek argued that a centrally planned economy must be both wasteful and dictatorial. It would deliver neither prosperity nor freedom. In retrospect, it is remarkable how right he was. (p. 34)</p></blockquote>\n<p>For Koppelman, it is crucial that Hayek does not contend that those who come out “on top” in market competition deserve their rewards: to the contrary, success depends substantially on luck. Contrary to Koppelman, though, this is not a point that separates Hayek from the rights-based libertarians, possibly excepting Rand. Koppelman says,</p>\n<blockquote><p>Moreover, no producer creates the market value of what she produces. That value depends on the environment she happens to occupy. Your matchless ability to play professional basketball commands a high price only because you were lucky enough to be born into a world in which that skill happened to be wanted (and in which most others happened to lack your aptitude). That added value thus is not attributable to you alone. It is a social product, based on the contingent scarcity of your contribution to the division of labor. It is largely an accidental monopoly, like being the owner of the only oasis in a desert. (p. 90)</p></blockquote>\n<p>Nozick’s famous Wilt Chamberlain case does not depend on denying this. Rather, Lockean accounts of property acquisition like those of Nozick and Rothbard bypass the question of entitlement to economic value. Once physical assets are acquired in the way the theories mandate, economic value depends on the market decisions of the owners of these assets. There is no space left for further questions about how value is owned. Koppelman goes wrong, I think, because he takes the libertarian rights argument to be that if you have acquired property according to the theory, then you deserve the economic value your ownership of the property gives you, and then objects, “You don’t deserve this value if this means that the value comes to you owing to your moral merit; your economic success, whether because of property you own or ‘natural assets’ you possess, is to a great extent a matter of luck.” Koppelman’s mistake is that the argument about entitlement to economic value doesn’t go through a step about “desert,” in his sense, at all.</p>\n<p>Koppelman is guilty of a more serious misunderstanding of Rothbard. He repeats several times that Rothbard is so strongly committed to the “absolute” character of rights that he holds you would have a duty to starve yourself to death if your survival depended on a rights violation. Koppelman says, for example, “No one could sanely agree to Rothbard’s notion of an obligation to starve if one has no money for food” (p. 115). His reference is to a passage in <a href=\"https://cdn.mises.org/The%20Ethics%20of%20Liberty%2020191108.pdf\"><em>Ethics of Liberty</em></a> in which Rothbard says the owner of water in a desert oasis is under no obligation to sell or give water to those who need it to survive; the owner does not violate their rights by refusing. But it does not follow from this that someone who needs the water is under a moral obligation to respect the owner’s rights. Koppelman hasn’t taken account of the section in <em>Ethics of Liberty</em> that deals with “lifeboat cases.” Rothbard <a href=\"https://cdn.mises.org/The%20Ethics%20of%20Liberty%2020191108.pdf\">says</a>,</p>\n<blockquote><p>Many libertarians who otherwise believe in property rights gravely weaken them on behalf of the “contextualist” contention that, given a choice between his life and aggressing against someone else’s property or even life, it is moral for him to commit the aggression and that therefore in such a situation, these property rights cease to exist. The error here on the part of the “contextualist” libertarians is to confuse the question of the moral course of action for the person in such a tragic situation with the totally separate question of whether or not his seizing of lifeboat or plank space by force constitutes an invasion of someone else’s property right.</p></blockquote>\n<p>Rothbard’s position amounts to no more and no less than that there is no affirmative legal duty to aid others, a controversial view, no doubt, but one hardly unique to him or to libertarians.</p>\n<p>The book contains an even more serious misreading of Rothbard, and I shall close with a discussion of it. This misunderstanding gives rise to the title of Koppelman’s book. He describes a case in which a county in Tennessee arranged for fire protection with a nearby city. Residents of the county had to pay an annual fee to the city fire department for the service. A man regularly paid the fee, but unfortunately for him, a fire broke out the one year he forgot to pay, and because the fire department wouldn’t come to his aid, he lost his house. Koppelman holds that Rothbard, and strict libertarians generally, would say that the fire department acted correctly. People have no right to have others protect them; they are responsible for their own mistakes and ought to suffer the consequences of them. People have no moral obligation to help others: it is “every man for himself,” unless someone freely decides to help.</p>\n<p>Koppelman is right that Rothbard holds people do not have the right to be protected, but it does not follow from this that he would have to take the hardhearted view that the farmer deserved what he got, or, in this case, failed to get. Rothbard could perfectly well hold, as I would myself, that the fire department ought to have come to the man’s aid, charging him a fee afterward. Perhaps Koppelman’s point is that this is how private fire departments might be expected to act, but in what way the monopolistic arrangement between two government agencies is supposed to show this I am unable to fathom. If the point of the example is that in cases where, in contrast to provision of services by contract, the government provides fire protection directly, without contracting it out, people have a legal right to be protected, the answer is that this is just not so. It is legally up to a “public” fire department to decide how to respond to a request for help.</p>\n<p>There is a great deal more in Koppelman’s stimulating book that merits discussion, such as the sections on drug legislation and antidiscrimination law, but I hope I have said enough to show that the book is worth sustained confrontation.</p>\n\n",
  "author": "David Gordon",
  "enclosure": "",
  "guid": 60782,
  "pubDate": "Fri, 28 Oct 2022 11:00:00 -0500",
  "source": "Mises Wire"
}