{
  "title": "Interview: “Freedom and democracy won’t come without effort”",
  "description": "Vietnamese lawyer Ngo Anh Tuan speaks to RFA about human rights objectives",
  "link": "https://www.rfa.org/english/news/vietnam/vietnam-lawyer-11042022172222.html",
  "guid": "https://www.rfa.org/english/news/vietnam/vietnam-lawyer-11042022172222.html",
  "media:content": {
    "media:description": "In this Oct. 2, 2013, photo, a security officer tries to stop a photographer working close to a courtroom in Hanoi, Vietnam.",
    "media:credit": "Source: AP"
  },
  "content:encoded": "\n        <p><i><span style=\"font-weight: 400;\">Vietnamese lawyer Ngo Anh Tuan spoke to RFA about a Nov. 1 meeting with U.S. officials in the run-up to the 26th U.S.-Vietnam Human Rights Dialogue. </span></i></p>\n<p></p>\n<p><i><span style=\"font-weight: 400;\">On Nov. 1, Vietnamese rights lawyer Ngo Anh Tuan attended a meeting between representatives from the U.S. State Department, the U.S. Embassy in Hanoi, the U.S. Consulate in Ho Chi Minh City and family members of several jailed political dissidents at the eve of the 26th U.S.-Vietnam Human Rights Dialogue held on Nov. 2. Radio Free Asia spoke to him about the meeting on Nov. 3. The interview has been edited for brevity and clarity. </span></i></p>\n<p></p>\n<p><b>RFA: What were your recommendations for the U.S. government at the meeting regarding human rights in Vietnam?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan:</b><span style=\"font-weight: 400;\">  The meeting was held on the eve of the annual U.S.-Vietnam Human Rights Dialogue. I came to the meeting at their [the U.S. government’s] invitation and was the only lawyer there. I can’t repeat what I said verbatim but here are the key things that I raised:</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Firstly, Vietnam should hold dialogues with political dissidents and utilize their knowledge and talents for the country’s development. President Ho Chi Minh did this after establishing the Democratic Republic of Vietnam, which had been seen as an appropriate policy. Unfortunately, they [the current Vietnamese government] don’t do it now.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Secondly, [Vietnam] has to amend or remove the harsh provisions relating to freedom of speech in its current Penal Code as they contradict Vietnam’s 2013 Constitution and human rights treaties to which Vietnam is a signatory.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Thirdly, [Vietnam] must immediately stop using its Departments of Information and Communications (DOICs) to assess people’s thoughts and ideologies and accuse them [instead of] investigation and procuracy agencies and judges. As long as these practices aren’t eliminated, DOIC assessors should be summoned to trials to clarify what they have assessed and respond to defense lawyers. Currently, DOIC assessors avoid attending hearings. While the current law stipulates that all the evidence to accuse a defendant must be clarified at the trial, I’ve never seen any judiciary assessors at any trials that I have attended.</span></p>\n<p></p>\n<p><b>RFA: Were there any lawyers giving similar recommendations? What are your expectations for the implementation of these recommendations?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan: </b><span style=\"font-weight: 400;\"> I did not ask how many lawyers they had invited but I was the only lawyer at the meeting.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">I don’t expect all of my recommendations will be implemented right away as it would be too ambitious for a dialogue like this. It would also be challenging to realize the easiest thing in my first recommendation. Some minor issues can be done at the moment.</span></p>\n<p></p>\n<p><b>RFA: Suppose they could only implement one of the three recommendations, which one would you like to prioritize?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan:</b><span style=\"font-weight: 400;\"> We want all of them to be implemented. However, what I think they can do now is the third one, i.e., the assessment of people’s thoughts and ideologies. I believe people from investigative agencies, the procuracy and the courts realize this legal flaw. If assessors are allowed to [freely] make accusations, they will be able to easily charge people for so many things. It is unacceptable that they [the assessors] examine the ideological side and then conclude the objective side of a crime. By doing so, they have made accusations before [the judicial system]. This goes against all legal principles of both Vietnam and the world.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Lawyers have raised this issue many times with them and I think they also want a change. However, they won’t be able to do so if the current regulations are not amended.</span></p>\n<p></p>\n<p><b>RFA: Lawyers often encounter unpleasant or even illegal acts from authorities. Why didn’t you raise this issue in your recommendations?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan: </b><span style=\"font-weight: 400;\"> I think the oppression against lawyers is not that serious but the disrespect for lawyers is a matter of fact. However, we [lawyers] put clients’ interests before ours. If we face difficulties, we still can fight against them while our clients are in much more disadvantaged situations. Our clients and ordinary people out there are much more vulnerable and disadvantaged than us. It is more appropriate for the Vietnam Bar Federation or provincial bar associations to speak up for lawyers' rights. I choose to speak up for people's rights as people's interests should outweigh lawyers'.</span></p>\n<p></p>\n<p><b>RFA:  You have said that freedom and democracy won’t come without effort and we have to create them and create opportunities for people around us instead of waiting for others to bring freedom and democracy to us. Could you elaborate on this?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan:</b><span style=\"font-weight: 400;\">  I believe most intellectuals are knowledgeable enough to realize this but they may think this is someone else’s job, not theirs. They also understand that we need to join hands to make the country a better place but they also think it’s OK if that does not include their hands. A Vietnamese saying goes: “Lead the charge if it’s a party. Follow others if it’s a march across waters.” They would think: As the pioneers have raised their hand, we can stand behind them and will raise our hand when success is almost there.</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">Politics is not something super. It affects everyone, including us and our family members. For example, an inappropriate administrative decision creates difficulties for ordinary people, including us. Familiar things like land and salary issues are also politics. Society will be better if everyone speaks up against injustice and wrongdoings. Everyone can make contributions but many chose to forgo their rights. If everyone thinks we don’t need to speak up since the person next to us will do it, society, of course, will be at a standstill.</span></p>\n<p></p>\n<p><b>RFA:  Do you hope that human rights in Vietnam will be improved after each human rights dialogue between the U.S. and Vietnam?</b></p>\n<p></p>\n<p><b>Ngo Anh Tuan: </b><span style=\"font-weight: 400;\">In this meeting, an officer asked me if they [the U.S. government] could help in any way. I bluntly asked back: Why did you ask that question? Can you really help?</span></p>\n<p></p>\n<p><span style=\"font-weight: 400;\">I also attended a similar meeting with the EU’s representatives before their human rights dialogue with Vietnam which seems to not have borne many fruits. Meanwhile, Ms. Erin Barclay, a senior official from the U.S. Bureau of Democracy, Human Rights and Labor, was very enthusiastic. She said that the U.S. government shared my thoughts and that she would make every effort regardless of whether the issue is small or big. She said she hoped that Vietnam would make progress and that positive changes would come.</span></p>\n<p></p>\n<p><b><i>RFA: </i></b><i><span style=\"font-weight: 400;\">Thank you very much.</span></i></p>\n<p></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 17:22:39 -0400"
}