{
  "title": "The Steady-State Multi-TeV Diffuse Gamma-Ray Emission Predicted with GALPROP and Prospects for the Cherenkov Telescope Array. (arXiv:2211.01619v1 [astro-ph.HE])",
  "link": "http://arxiv.org/abs/2211.01619",
  "description": "<p>Cosmic Rays (CRs) interact with the diffuse gas, radiation, and magnetic\nfields in the interstellar medium (ISM) to produce electromagnetic emissions\nthat are a significant component of the all-sky flux across a broad wavelength\nrange. The Fermi Large Area Telescope (LAT) has measured these emissions at GeV\n$\\gamma$-ray energies with high statistics. Meanwhile, the High-Energy\nStereoscopic System (H.E.S.S.) telescope array has observed large-scale\nGalactic diffuse emission in the TeV $\\gamma$-ray energy range. The emissions\nobserved at GeV and TeV energies are connected by the common origin of the CR\nparticles injected by the sources, but the energy dependence of the mixture\nfrom the general ISM (true `diffuse'), those emanating from the relatively\nnearby interstellar space about the sources, and the sources themselves, is not\nwell understood. In this paper, we investigate predictions of the broadband\nemissions using the GALPROP code over a grid of steady-state 3D models that\ninclude variations over CR sources, and other ISM target distributions. We\ncompare, in particular, the model predictions in the VHE ($\\geq$100 GeV)\n$\\gamma$-ray range with the H.E.S.S. Galactic plane survey (HGPS) after\ncarefully subtracting emission from catalogued $\\gamma$-ray sources. Accounting\nfor the unresolved source contribution, and the systematic uncertainty of the\nHGPS, we find that the GALPROP model predictions agree with lower estimates for\nthe HGPS source-subtracted diffuse flux. We discuss the implications of the\nmodelling results for interpretation of data from the next generation Cherenkov\nTelescope Array (CTA).\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Marinos_P/0/1/0/all/0/1\">P. D. Marinos</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rowell_G/0/1/0/all/0/1\">G. P. Rowell</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Porter_T/0/1/0/all/0/1\">T. A. Porter</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Johannesson_G/0/1/0/all/0/1\">G. J&#xf3;hannesson</a>"
}