{
  "title": "Episode 70: &#8220;Move It&#8221; by Cliff Richard and the Drifters",
  "link": "https://500songs.com/podcast/episode-70-move-it-by-cliff-richard-and-the-drifters/",
  "pubDate": "Mon, 17 Feb 2020 01:43:46 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-70-move-it-by-cliff-richard-and-the-drifters/",
  "description": "<p>Episode seventy of <em>A History of Rock Music in 500 Songs</em> looks at \"Move It\" by Cliff Richard, and the beginning of rock and roll TV in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34113648\">on \"Poor Little Fool\" by Ricky Nelson</a>, another artist whose career was made by TV, and one who influenced Cliff Richard hugely.</p>\n\n<p><strong> ERRATUM:</strong> I say Cliff Richard was sixteen when he first heard “Heartbreak Hotel”. He was fifteen.</p>\n<p><strong>Resources</strong></p>\n<p>As always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-70-move-it/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p><a href=\"https://amzn.to/31XL4rU\">This four-CD set</a> contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.</p>\n<p><a href=\"https://amzn.to/2lT8tty\">This MP3 compilation,</a> meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and gives far more detail about the historical background.</p>\n<p>And <a href=\"https://amzn.to/2SxaWaK\">Cliff Richard: The Biography by Steve Turner</a> is very positive towards Richard, but not at the expense of honesty.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>We've looked a little bit at the start of rock and roll in Britain, which was so different from the American music that it feels absurd to talk of the two in the same breath. But today we're going to have a look at the first really massive star of British rock and roll -- someone who is still going strong today, more than sixty years after he released his first record:</p>\n<p>[Excerpt: Cliff Richard, \"Move It\"]</p>\n<p>When we've looked at British rock and roll to this point, it's been rather lifeless, and there's a reason for that. There were, in the mid-fifties, two different streams of music in Britain that were aiming to appeal to young people. One was skiffle, and that's the branch of music that eventually led to all British rock and roll from the sixties onwards -- we looked at that with Lonnie Donegan, but the skiffle craze was a big, big thing for about two years, and when it finally died down it splintered into three different, overlapping, groups -- there were the folk revivalists, who we'll talk about when we get to Bob Dylan; the British blues people, who we'll look at when we get to the Rolling Stones; and the rock and rollers. Skiffle had everything that people found exciting and interesting about American rock and roll -- at least, it had much of the excitement of the rockabilly music. But it wasn't marketed as rock and roll, and it tended to aim at a slightly more bohemian audience.</p>\n<p>Meanwhile, British rock and roll proper -- the stuff that was being marketed as rock and roll -- was mostly being made by longtime professional musicians who had switched from playing anaemic copies of swing music to anaemic copies of Bill Haley and the Comets. Groups like Tony Crombie and the Rockets were making records like \"Let's You and I Rock\", which copied the formula of Haley's less good records:</p>\n<p>[Excerpt: Tony Crombie and the Rockets, \"Let's You and I Rock\"]</p>\n<p>The idea of rock and roll in the British music business in those early years came entirely from the film Rock Around the Clock, which had featured Haley, the Platters, and Freddie Bell and His Bellboys -- who were a second-rate clone of Haley's band. As we discussed in the episodes on Haley, his particular style of music had few imitators in American rock and roll, so while British groups were copying things like Freddie Bell's one hit, \"Giddy-Up A Ding-Dong\", British teenagers were instead listening to American records by Buddy Holly or Little Richard, the Everly Brothers or Elvis, none of whose recordings had anything to do with anything that was being made by the British commercial rock and roll industry.</p>\n<p>For British rock and roll to matter, it had to at least catch up to what the American records were doing. It needed its own Elvis -- and that Elvis would ideally be someone who came from the skiffle scene, but was more oriented towards rock and roll than most of the skifflers, who were very happy playing Lead Belly songs rather than \"Blue Suede Shoes\".</p>\n<p>Tommy Steele had been a good start, but he'd jumped the gun a little bit. He was essentially still a pre-Elvis performer, although he was one who followed the rockabilly pattern of a young man with a guitar. His records were still novelty songs with the word \"rock\" thrown in, like \"Rock With the Caveman\", and when he tried to copy Elvis' vocal mannerisms, while it brought him a number one hit, it didn't really sound particularly credible:</p>\n<p>[Excerpt: Tommy Steele, \"Singing the Blues\"]</p>\n<p>In the wake of Steele came a whole host of other teen idols along the same lines, most of them managed by Larry Parnes -- Adam Faith, Mary Wilde, Terry Dene, Vince Taylor, Johnny Gentle, Billy Fury, Duffy Power, Dickie Pride, and many more. Some of these went on to have interesting careers, and a few made records that we'll be looking at in future episodes, but one of them -- one of the few not managed by Parnes -- managed to have a career that would outlast almost all of his American contemporaries, and outsell many of them.</p>\n<p>[Excerpt: Cliff Richard, \"Move It\"]</p>\n<p>One of the things that will be a recurring theme in this podcast as Britain becomes a bigger part of rock history is the end of the British Empire. It is literally impossible to understand anything about Britain for the last eighty years without understanding that at the start of the 1940s the British Empire was the largest, most powerful empire that had ever been seen in human history, while by the early 1970s Britain was a tiny island that was desperately begging to be allowed into the EEC -- the precursor of the EU -- because it had no economic or political power at all on its own.</p>\n<p>The psychic shock this change in status gave to multiple generations of British people cannot be overstated, and almost all British history since at least 1945 can be explained in terms of Britain trying and failing to convince itself and the world that it was still important and still mattered. And one of the people whom that change in status hit most dramatically was a young boy named Harry Webb, who was born in India in 1940, to a family who were of British descent, but who had been in India for a couple of generations. Like most white people in India at the time they benefited hugely from the Empire -- although they were only moderately well off by white British standards in India, they lived in what for most people would seem absolute luxury, with servants looking after them, and the people of India being deferential to them.</p>\n<p>But then, after World War II came Indian independence and partition, and the Webb family found themselves in Britain, a country they'd never lived in, homeless and jobless. Harry, his parents, and his three sisters had to live in one room of a three-bedroom house, with the other rooms of the house occupied by another family of eight. Not only that, but while Harry had been a beneficiary of racism in India, in Britain he was a victim of it -- while he was white, he had a dark complexion, an Anglo-Indian accent, and came from India, so everyone assumed he was Indian -- except that the only Indians that his schoolmates knew anything about were the ones in cowboy films, so he kept getting asked where his wigwam was.</p>\n<p>Eventually the Webb family managed to get a house to themselves, and young Harry managed to get rid of his accent, ending up with an accent that reflected neither his Indian origins nor his London upbringing, but rather a generic regionless middle-class accent with a trace of the mid-Atlantic behind it. Webb's accent would later become almost the default for people in the media, edging out the received pronunciation that had dominated in previous decades, but at the time it gave him a distinct advantage when he finally became a pop star, because he didn't sound like he was from a particular place.</p>\n<p>When he was sixteen, he heard the record that would change his life:</p>\n<p>[Excerpt: Elvis Presley, “Heartbreak Hotel”]</p>\n<p>Young Harry became obsessed with Elvis Presley, and tried to make himself look as much like Elvis as possible. His first public performance was with a vocal group he formed at school, and he took a solo on \"Heartbreak Hotel\". On leaving school, having failed almost all his exams, he decided that he wanted to become a rock and roll star.</p>\n<p>He had no idea how he was going to go about it until one day his bike broke, and he had to get the bus into work. On the same bus was an old schoolfriend, Terry Smart, who was the drummer in a skiffle group. Their singer had recently been drafted, and they needed a new one. He remembered that Harry could sing, and invited him to join the group.</p>\n<p>Harry's musical tastes didn't really run to skiffle, which by this time had become a very formalised genre, with the instruments almost always consisting of acoustic guitar, teachest bass, and washboard, and a repertoire that was made up primarily of songs by Lead Belly, Woody Guthrie, and Big Bill Broonzy (who was the one blues musician that even the least knowledgable skiffler could name, despite his relative lack of commercial success in the US). There would also be a good chunk of traditional folk and sea shanties thrown in. A typical example of the style would be the Vipers Skiffle Group's version of \"Maggie May\":</p>\n<p>[Excerpt: The Vipers Skiffle Group, \"Maggie May\"]</p>\n<p>Skiffle was both too rowdy and too intellectual for young Harry Webb, whose main interest other than music was sports rather than digging up old folk songs. Other than Elvis and Jerry Lee Lewis, his tastes ran to smoother American soft-rockers like Ricky Nelson and the Everly Brothers -- he never had much time for the R&B styles of people like Little Richard, let alone for anything as raw as Lead Belly or Big Bill Broonzy.</p>\n<p>But Harry Webb was an unusual person. On the one hand, he was amazingly old-fashioned and prudish even for the period -- he refused to smoke, drink, or blaspheme, he was very softly spoken, and as a teenager when asked if he had a girlfriend he would say \"Yes, I've got a picture of her in my pocket\" and would pull out a photo of his mother.</p>\n<p>But on the other hand, he was incredibly driven, and was willing to make use of anyone around him for precisely as long as it would take for them to help him achieve his goals. If the musicians around him wanted to play skiffle, he would play skiffle -- for the moment.</p>\n<p>So Harry Webb joined Dick Teague's Skiffle Group, and became their lead singer. He applied himself diligently to learning the skiffle material -- songs like \"Rock Island Line\", \"This Train\", \"This Little Light of Mine\", and \"Don't You Rock Me Daddy-O\" -- and he would rehearse every single night, and got to know the material intimately. But he insisted on singing in an imitation of Elvis' voice, and thrusting his hips like Elvis did.</p>\n<p>But an Elvis-style vocal simply didn't work with songs like this:</p>\n<p>[Excerpt: The Vipers Skiffle Group, “Don't You Rock Me Daddy-O”]</p>\n<p>After a short period with the group, he started scheming with Terry Smart -- they were going to continue with the skiffle group for the moment, but they secretly put together their own rock and roll group. Harry's friend Norman Mitham started turning up to the group's rehearsals, and watching the guitarists' fingers intently -- he was learning their material for the new group.</p>\n<p>Webb and Smart left the Dick Teague Skiffle Group, and with Mitham they formed a new rock and roll group. Inspired by the recent launch of Sputnik, they thought of calling themselves The Planets. But they decided that wasn't quite right, and looked up the etymology of \"planet\", and found it came from the Greek for \"wanderer\" or \"drifter\", and so they became the Drifters, unaware there was an American group of the same name.</p>\n<p>On one of their very early gigs, a man named John Foster came up and introduced himself to them. Foster had no music business experience -- he worked in a sewage farm -- but he became the group's manager based on two important factors. The first was that he had a telephone, which in 1958 meant he was clearly a figure of some importance -- *no-one* in Britain had a telephone! And the second was that he was a nodding acquaintance of the managers of the 2is, the famous coffee bar where the Vipers used to play, and where both Tommy Steele and Terry Dene had been discovered, and he was pretty sure he could get them a gig there.</p>\n<p>He managed to get them a two-week residency at the 2is, and during the first week, a young man named Ian Samwell came up and asked them if they needed a lead guitarist. They said yes, and he was in the group.</p>\n<p>A booking agent who saw the group in their second week decided he wanted to book them for some shows in the North, but he had two problems. He didn't want them to be booked as a group, but as a lead singer and his backing group, and he thought Harry Webb wasn't a good enough name. So the Drifters became Cliff Richard and the Drifters, and Harry Webb soon told everyone in his life that he was only to be addressed as Cliff from now on.</p>\n<p>Foster and Samwell got the group an agent, and the agent in turn got them an audition with Norrie Paramor at Columbia Records. But there was one more thing to do. By this time Cliff *did* have a girlfriend -- while according to those around him he was never that interested in dating or sex, they did go out with each other for a little while and claimed to be in love with each other. But he knew that if he was going to be a rock and roll star, he had to appear available to the teenage girls, so he dumped her. She understood -- he'd had to choose between his career and love, and he'd chosen his career.</p>\n<p>Paramor was interested, and he wanted the group to record a song which had been a hit in the US for Bobby Helms:</p>\n<p>[Excerpt: Bobby Helms, \"Schoolboy Crush\"]</p>\n<p>That song was co-written by Aaron Schroeder, who we've seen before as the co-writer of some of Elvis' tracks for Jailhouse Rock, and of Carl Perkins' \"Glad All Over\".</p>\n<p>Cliff learned the song straight away, and soon the Drifters were in Abbey Road studios ready to record their first single -- but only Cliff Richard's name was on the recording contract. While the record label would say \"Cliff Richard and the Drifters\", the other group members were only going to get a flat session fee for the record, while Cliff was going to get artist royalties.</p>\n<p>Also, not all of the Drifters were present. Ian Samwell had persuaded Cliff that there was no need to keep Norman Mitham in the band. Mitham was just playing rhythm guitar like Cliff was, and Samwell thought there was no point having three guitarists and splitting the money three ways instead of two. So Mitham, who had been friends with Cliff since they were both nine, was out of the group.</p>\n<p>Cliff didn't play guitar especially well, so for the session Samwell switched to rhythm and a session player, Ernie Shear, was brought in to play lead. The group was also augmented in the studio by a double bass player, Frank Clarke, and the Mike Sammes singers on backing vocals.</p>\n<p>The track they cut that day was not hugely inspiring:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Schoolboy Crush\"]</p>\n<p>But the B-side was more interesting. It was the first song that Ian Samwell had ever written -- an angry response to an article in the Melody Maker arguing that rock and roll was dead. It was stuck on the B-side of the proposed single mostly for lack of anything better, and it was knocked off quickly. Indeed, the main engineer on the session didn't stick around for the recording -- he wanted to go to the opera, and so it was left to the junior engineer Malcolm Addey to actually record the song.</p>\n<p>And that made a big difference -- Addey was young enough to have some idea himself as to what a rock and roll record should sound like, and he came up with a much louder, more resonant, sound than anything that had been heard in a British recording session -- a record that didn't sound all that dissimilar to the records that Sun was putting out:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Move It\"]</p>\n<p>That track was still intended for the B-side, until the point that Jack Good heard it. Jack Good was possibly the most important person ever to be involved in music TV -- not just in Britain, but in the world. Good had been an actor, until he saw \"Rock Around the Clock\" in the cinema, and saw the way that the audiences reacted to the film. He became immediately convinced that the audience response was a crucial part of rock and roll, and that if done properly rock and roll performances could lead to the kind of catharsis that classical Greek drama aimed at.</p>\n<p>He took this idea to the BBC, who were at the time looking to put on a new teenage show. Up until mid 1956, the practice in British TV had been to stop transmitting for an hour, from six until seven in the evening, in order to let parents put their kids to bed -- this was known as the Toddlers' Truce. But after the commercial network ITV began broadcasting in 1955, the practice became controversial. While the BBC saved money by not putting on any programmes between six and seven -- they got the same amount in TV license fees however much they broadcast -- an hour without programmes for a commercial channel meant an hour without advertising fees.</p>\n<p>Eventually, ITV managed to get the rules changed, and the BBC decided that at five past six on a Saturday, they would put out a programme for young people, but young people allowed up that late -- and it was to be called Six-Five Special.</p>\n<p>[Excerpt: The Bob Cort Skiffle Group, \"The Six-Five Special\"]</p>\n<p>Six-Five Special embodied many of Good's ideas about how to broadcast rock and roll music -- it had the audience as an integral part of the programme -- there was very little distinction between the audience and the performers, who would perform among the crowd rather than separated from them. By all accounts it had some fantastic moments, including an appearance by Big Bill Broonzy, and a live broadcast from the 2Is coffee bar itself.</p>\n<p>But Good wasn't the sole producer, and he had to compromise his vision. As well as rock and roll and skiffle, the programme also included light music of a kind parents would approve of, educational items, and bits about sport. Good kept trying to persuade the people at the BBC to let him have the show be just about rock and roll, but his co-producer wanted Hungarian acrobats and features on stamp collecting.</p>\n<p>So Good moved over to ABC, one of the ITV stations, and started a rival show, \"Oh Boy!\"</p>\n<p>On \"Oh Boy!\" the focus was entirely on the music. Good had very strong ideas on what he wanted from the show, ideas he'd got from sources as varied as a theatrical company who put on performances of Shakespeare with all-black backgrounds and no sets, and a book he'd read on the physiology of brainwashing. He wanted to make something powerful. Unlike on Six-Five Special the audience wouldn't be mixing with the performers, but this time the performers would be picked out by a white spotlight on a black background.</p>\n<p>After two pilot episodes in June 1958, the programme started its run in September, with appearances from Marty Wilde, the John Barry Seven and more, and with instrumental backing for the solo performers provided by Lord Rockingham's Eleven, a studio group who would go on to have a novelty hit with \"Hoots Mon!\" as a result of their appearances on the show:</p>\n<p>[Excerpt: Lord Rockingham's XI, \"Hoots Mon!\"]</p>\n<p>And Cliff Richard was to be added to that show.</p>\n<p>It was Jack Good who, more than anyone else, came up with the image of the rock and roll star, and his influence can be seen in literally every visual depiction of rock and roll music from the early sixties on. And from the evidence of the two surviving episodes of Oh Boy! he, and the director Rita Gillespie, one of the very few female directors working in TV at the time, did a remarkable job of creating something truly exciting -- something all the more remarkable when you look at what they had to work with. Most of the British rock and roll acts at the time were small, malnourished, spotty, teenage boys, who were doing a sort of cargo-cult imitation of American rock and rollers without really understanding what they were meant to be doing.</p>\n<p>But the lighting and the visuals of the show were extraordinary -- and in Cliff Richard, Good had found someone who, if he was nowhere near as exciting as his American models, at least could be moulded into something that was the closest thing that could be found to a real British rock and roll star -- someone who might one day be almost as good as Gene Vincent.</p>\n<p>Good insisted that the song Cliff should perform on his show should be \"Move It\", and so the record label quickly flipped the single. Good worked with Cliff for a full week on his performance of the song, instructing him in every blink, every time he should clutch his arm as if in pain, the way he should look down , not straight at the audience, everything. Good chose his shocking pink outfit (not visible on black and white TV, but designed to send the girls in the audience into a frenzy) and had him restyle his hair to be less like Elvis'. And so in September 1958, a few weeks before his eighteenth birthday, Cliff Richard made his TV debut:</p>\n<p>[Excerpt: Cliff Richard, “Move It”]</p>\n<p>\"Oh Boy\" was the most fast-paced thing on TV -- on the evidence of the surviving episodes it was one song after another, non-stop, by different performers -- as many as seventeen songs in a twenty-five minute live show, with no artist doing two songs in a row. It was an immediate hit, and so was \"Move It\", which went to number two in the charts. There was a media outcry over Cliff's brazen sexuality, with the NME accusing him of \"crude exhibitionism\", while the Daily Sketch would ask \"Is this boy TV star too sexy?\"</p>\n<p>Cliff Richard was suddenly the biggest star and sex symbol in the UK, but there were problems with the band. Cliff was no longer playing guitar while he sang, and the group also needed a bass player, so Ian Samwell switched to bass, and they went looking for a new guitarist. The original intention was to audition a young player named Tony Sheridan, but while John Foster was waiting in the 2is to meet him, he started talking with someone who had just left the Vipers, and said that he and his friend would be happy to join the group, and so Cliff's backing group now consisted of Ian Samwell, Terry Smart, Hank Marvin and Bruce Welch.</p>\n<p>The new group recorded another Ian Samwell song, \"High Class Baby\":</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"High Class Baby\"]</p>\n<p>What Samwell didn't know when they recorded that was that Cliff was already planning to replace him, with Jet Harris, who had played with Marvin in the Vipers. Now he was playing with better musicians, Samwell's shortcomings were showing up. Cliff didn't tell Samwell himself -- he got John Foster to fire him. Samwell would go on to have some success as a songwriter and record producer, though, most famously producing “Horse With No Name” for America.</p>\n<p>Shortly after that, Foster was gone as well, first demoted from manager to roadie, then given two weeks' notice in a letter from Cliff's dad.</p>\n<p>And then finally, Cliff replaced Terry Smart, his old school friend, the person who had invited him into his group, with Tony Meehan, another ex-Viper.</p>\n<p>By Cliff's nineteenth birthday, the only thing left of the original Drifters was the name. And soon that would change too, as Cliff Richard and the Drifters became Cliff Richard and the Shadows.</p>",
  "itunes:subtitle": "Episode seventy of A History of Rock Music in 500 Songs looks at Move It by Cliff Richard, and the beginning of rock and roll TV in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backe",
  "itunes:keywords": "2is,Aaron Schroeder,British rock,Cliff Richard,Ian Samwell,Jack Good,Larry Parnes,Norrie Paramor,Oh Boy,Six-Five Special,skiffle,The Shadows,The Vipers Skiffle Group,Tommy Steele,Tony Crombie and the Rockets,Tony Meehan,Tony Sheridan",
  "itunes:episodeType": "full",
  "itunes:episode": 70,
  "content:encoded": "<p>Episode seventy of <em>A History of Rock Music in 500 Songs</em> looks at \"Move It\" by Cliff Richard, and the beginning of rock and roll TV in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/34113648\">on \"Poor Little Fool\" by Ricky Nelson</a>, another artist whose career was made by TV, and one who influenced Cliff Richard hugely.</p>\n\n<p><strong> ERRATUM:</strong> I say Cliff Richard was sixteen when he first heard “Heartbreak Hotel”. He was fifteen.</p>\n<p><strong>Resources</strong></p>\n<p>As always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-70-move-it/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.</p>\n<p><a href=\"https://amzn.to/31XL4rU\">This four-CD set</a> contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.</p>\n<p><a href=\"https://amzn.to/2lT8tty\">This MP3 compilation,</a> meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.</p>\n<p><a href=\"https://amzn.to/2lqg8PS\">Pete Frame's The Restless Generation</a> is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.</p>\n<p><a href=\"https://amzn.to/2lqpk6S\">Billy Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World</a> is one of the best books I've read on music at all, and gives far more detail about the historical background.</p>\n<p>And <a href=\"https://amzn.to/2SxaWaK\">Cliff Richard: The Biography by Steve Turner</a> is very positive towards Richard, but not at the expense of honesty.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>We've looked a little bit at the start of rock and roll in Britain, which was so different from the American music that it feels absurd to talk of the two in the same breath. But today we're going to have a look at the first really massive star of British rock and roll -- someone who is still going strong today, more than sixty years after he released his first record:</p>\n<p>[Excerpt: Cliff Richard, \"Move It\"]</p>\n<p>When we've looked at British rock and roll to this point, it's been rather lifeless, and there's a reason for that. There were, in the mid-fifties, two different streams of music in Britain that were aiming to appeal to young people. One was skiffle, and that's the branch of music that eventually led to all British rock and roll from the sixties onwards -- we looked at that with Lonnie Donegan, but the skiffle craze was a big, big thing for about two years, and when it finally died down it splintered into three different, overlapping, groups -- there were the folk revivalists, who we'll talk about when we get to Bob Dylan; the British blues people, who we'll look at when we get to the Rolling Stones; and the rock and rollers. Skiffle had everything that people found exciting and interesting about American rock and roll -- at least, it had much of the excitement of the rockabilly music. But it wasn't marketed as rock and roll, and it tended to aim at a slightly more bohemian audience.</p>\n<p>Meanwhile, British rock and roll proper -- the stuff that was being marketed as rock and roll -- was mostly being made by longtime professional musicians who had switched from playing anaemic copies of swing music to anaemic copies of Bill Haley and the Comets. Groups like Tony Crombie and the Rockets were making records like \"Let's You and I Rock\", which copied the formula of Haley's less good records:</p>\n<p>[Excerpt: Tony Crombie and the Rockets, \"Let's You and I Rock\"]</p>\n<p>The idea of rock and roll in the British music business in those early years came entirely from the film Rock Around the Clock, which had featured Haley, the Platters, and Freddie Bell and His Bellboys -- who were a second-rate clone of Haley's band. As we discussed in the episodes on Haley, his particular style of music had few imitators in American rock and roll, so while British groups were copying things like Freddie Bell's one hit, \"Giddy-Up A Ding-Dong\", British teenagers were instead listening to American records by Buddy Holly or Little Richard, the Everly Brothers or Elvis, none of whose recordings had anything to do with anything that was being made by the British commercial rock and roll industry.</p>\n<p>For British rock and roll to matter, it had to at least catch up to what the American records were doing. It needed its own Elvis -- and that Elvis would ideally be someone who came from the skiffle scene, but was more oriented towards rock and roll than most of the skifflers, who were very happy playing Lead Belly songs rather than \"Blue Suede Shoes\".</p>\n<p>Tommy Steele had been a good start, but he'd jumped the gun a little bit. He was essentially still a pre-Elvis performer, although he was one who followed the rockabilly pattern of a young man with a guitar. His records were still novelty songs with the word \"rock\" thrown in, like \"Rock With the Caveman\", and when he tried to copy Elvis' vocal mannerisms, while it brought him a number one hit, it didn't really sound particularly credible:</p>\n<p>[Excerpt: Tommy Steele, \"Singing the Blues\"]</p>\n<p>In the wake of Steele came a whole host of other teen idols along the same lines, most of them managed by Larry Parnes -- Adam Faith, Mary Wilde, Terry Dene, Vince Taylor, Johnny Gentle, Billy Fury, Duffy Power, Dickie Pride, and many more. Some of these went on to have interesting careers, and a few made records that we'll be looking at in future episodes, but one of them -- one of the few not managed by Parnes -- managed to have a career that would outlast almost all of his American contemporaries, and outsell many of them.</p>\n<p>[Excerpt: Cliff Richard, \"Move It\"]</p>\n<p>One of the things that will be a recurring theme in this podcast as Britain becomes a bigger part of rock history is the end of the British Empire. It is literally impossible to understand anything about Britain for the last eighty years without understanding that at the start of the 1940s the British Empire was the largest, most powerful empire that had ever been seen in human history, while by the early 1970s Britain was a tiny island that was desperately begging to be allowed into the EEC -- the precursor of the EU -- because it had no economic or political power at all on its own.</p>\n<p>The psychic shock this change in status gave to multiple generations of British people cannot be overstated, and almost all British history since at least 1945 can be explained in terms of Britain trying and failing to convince itself and the world that it was still important and still mattered. And one of the people whom that change in status hit most dramatically was a young boy named Harry Webb, who was born in India in 1940, to a family who were of British descent, but who had been in India for a couple of generations. Like most white people in India at the time they benefited hugely from the Empire -- although they were only moderately well off by white British standards in India, they lived in what for most people would seem absolute luxury, with servants looking after them, and the people of India being deferential to them.</p>\n<p>But then, after World War II came Indian independence and partition, and the Webb family found themselves in Britain, a country they'd never lived in, homeless and jobless. Harry, his parents, and his three sisters had to live in one room of a three-bedroom house, with the other rooms of the house occupied by another family of eight. Not only that, but while Harry had been a beneficiary of racism in India, in Britain he was a victim of it -- while he was white, he had a dark complexion, an Anglo-Indian accent, and came from India, so everyone assumed he was Indian -- except that the only Indians that his schoolmates knew anything about were the ones in cowboy films, so he kept getting asked where his wigwam was.</p>\n<p>Eventually the Webb family managed to get a house to themselves, and young Harry managed to get rid of his accent, ending up with an accent that reflected neither his Indian origins nor his London upbringing, but rather a generic regionless middle-class accent with a trace of the mid-Atlantic behind it. Webb's accent would later become almost the default for people in the media, edging out the received pronunciation that had dominated in previous decades, but at the time it gave him a distinct advantage when he finally became a pop star, because he didn't sound like he was from a particular place.</p>\n<p>When he was sixteen, he heard the record that would change his life:</p>\n<p>[Excerpt: Elvis Presley, “Heartbreak Hotel”]</p>\n<p>Young Harry became obsessed with Elvis Presley, and tried to make himself look as much like Elvis as possible. His first public performance was with a vocal group he formed at school, and he took a solo on \"Heartbreak Hotel\". On leaving school, having failed almost all his exams, he decided that he wanted to become a rock and roll star.</p>\n<p>He had no idea how he was going to go about it until one day his bike broke, and he had to get the bus into work. On the same bus was an old schoolfriend, Terry Smart, who was the drummer in a skiffle group. Their singer had recently been drafted, and they needed a new one. He remembered that Harry could sing, and invited him to join the group.</p>\n<p>Harry's musical tastes didn't really run to skiffle, which by this time had become a very formalised genre, with the instruments almost always consisting of acoustic guitar, teachest bass, and washboard, and a repertoire that was made up primarily of songs by Lead Belly, Woody Guthrie, and Big Bill Broonzy (who was the one blues musician that even the least knowledgable skiffler could name, despite his relative lack of commercial success in the US). There would also be a good chunk of traditional folk and sea shanties thrown in. A typical example of the style would be the Vipers Skiffle Group's version of \"Maggie May\":</p>\n<p>[Excerpt: The Vipers Skiffle Group, \"Maggie May\"]</p>\n<p>Skiffle was both too rowdy and too intellectual for young Harry Webb, whose main interest other than music was sports rather than digging up old folk songs. Other than Elvis and Jerry Lee Lewis, his tastes ran to smoother American soft-rockers like Ricky Nelson and the Everly Brothers -- he never had much time for the R&B styles of people like Little Richard, let alone for anything as raw as Lead Belly or Big Bill Broonzy.</p>\n<p>But Harry Webb was an unusual person. On the one hand, he was amazingly old-fashioned and prudish even for the period -- he refused to smoke, drink, or blaspheme, he was very softly spoken, and as a teenager when asked if he had a girlfriend he would say \"Yes, I've got a picture of her in my pocket\" and would pull out a photo of his mother.</p>\n<p>But on the other hand, he was incredibly driven, and was willing to make use of anyone around him for precisely as long as it would take for them to help him achieve his goals. If the musicians around him wanted to play skiffle, he would play skiffle -- for the moment.</p>\n<p>So Harry Webb joined Dick Teague's Skiffle Group, and became their lead singer. He applied himself diligently to learning the skiffle material -- songs like \"Rock Island Line\", \"This Train\", \"This Little Light of Mine\", and \"Don't You Rock Me Daddy-O\" -- and he would rehearse every single night, and got to know the material intimately. But he insisted on singing in an imitation of Elvis' voice, and thrusting his hips like Elvis did.</p>\n<p>But an Elvis-style vocal simply didn't work with songs like this:</p>\n<p>[Excerpt: The Vipers Skiffle Group, “Don't You Rock Me Daddy-O”]</p>\n<p>After a short period with the group, he started scheming with Terry Smart -- they were going to continue with the skiffle group for the moment, but they secretly put together their own rock and roll group. Harry's friend Norman Mitham started turning up to the group's rehearsals, and watching the guitarists' fingers intently -- he was learning their material for the new group.</p>\n<p>Webb and Smart left the Dick Teague Skiffle Group, and with Mitham they formed a new rock and roll group. Inspired by the recent launch of Sputnik, they thought of calling themselves The Planets. But they decided that wasn't quite right, and looked up the etymology of \"planet\", and found it came from the Greek for \"wanderer\" or \"drifter\", and so they became the Drifters, unaware there was an American group of the same name.</p>\n<p>On one of their very early gigs, a man named John Foster came up and introduced himself to them. Foster had no music business experience -- he worked in a sewage farm -- but he became the group's manager based on two important factors. The first was that he had a telephone, which in 1958 meant he was clearly a figure of some importance -- *no-one* in Britain had a telephone! And the second was that he was a nodding acquaintance of the managers of the 2is, the famous coffee bar where the Vipers used to play, and where both Tommy Steele and Terry Dene had been discovered, and he was pretty sure he could get them a gig there.</p>\n<p>He managed to get them a two-week residency at the 2is, and during the first week, a young man named Ian Samwell came up and asked them if they needed a lead guitarist. They said yes, and he was in the group.</p>\n<p>A booking agent who saw the group in their second week decided he wanted to book them for some shows in the North, but he had two problems. He didn't want them to be booked as a group, but as a lead singer and his backing group, and he thought Harry Webb wasn't a good enough name. So the Drifters became Cliff Richard and the Drifters, and Harry Webb soon told everyone in his life that he was only to be addressed as Cliff from now on.</p>\n<p>Foster and Samwell got the group an agent, and the agent in turn got them an audition with Norrie Paramor at Columbia Records. But there was one more thing to do. By this time Cliff *did* have a girlfriend -- while according to those around him he was never that interested in dating or sex, they did go out with each other for a little while and claimed to be in love with each other. But he knew that if he was going to be a rock and roll star, he had to appear available to the teenage girls, so he dumped her. She understood -- he'd had to choose between his career and love, and he'd chosen his career.</p>\n<p>Paramor was interested, and he wanted the group to record a song which had been a hit in the US for Bobby Helms:</p>\n<p>[Excerpt: Bobby Helms, \"Schoolboy Crush\"]</p>\n<p>That song was co-written by Aaron Schroeder, who we've seen before as the co-writer of some of Elvis' tracks for Jailhouse Rock, and of Carl Perkins' \"Glad All Over\".</p>\n<p>Cliff learned the song straight away, and soon the Drifters were in Abbey Road studios ready to record their first single -- but only Cliff Richard's name was on the recording contract. While the record label would say \"Cliff Richard and the Drifters\", the other group members were only going to get a flat session fee for the record, while Cliff was going to get artist royalties.</p>\n<p>Also, not all of the Drifters were present. Ian Samwell had persuaded Cliff that there was no need to keep Norman Mitham in the band. Mitham was just playing rhythm guitar like Cliff was, and Samwell thought there was no point having three guitarists and splitting the money three ways instead of two. So Mitham, who had been friends with Cliff since they were both nine, was out of the group.</p>\n<p>Cliff didn't play guitar especially well, so for the session Samwell switched to rhythm and a session player, Ernie Shear, was brought in to play lead. The group was also augmented in the studio by a double bass player, Frank Clarke, and the Mike Sammes singers on backing vocals.</p>\n<p>The track they cut that day was not hugely inspiring:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Schoolboy Crush\"]</p>\n<p>But the B-side was more interesting. It was the first song that Ian Samwell had ever written -- an angry response to an article in the Melody Maker arguing that rock and roll was dead. It was stuck on the B-side of the proposed single mostly for lack of anything better, and it was knocked off quickly. Indeed, the main engineer on the session didn't stick around for the recording -- he wanted to go to the opera, and so it was left to the junior engineer Malcolm Addey to actually record the song.</p>\n<p>And that made a big difference -- Addey was young enough to have some idea himself as to what a rock and roll record should sound like, and he came up with a much louder, more resonant, sound than anything that had been heard in a British recording session -- a record that didn't sound all that dissimilar to the records that Sun was putting out:</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"Move It\"]</p>\n<p>That track was still intended for the B-side, until the point that Jack Good heard it. Jack Good was possibly the most important person ever to be involved in music TV -- not just in Britain, but in the world. Good had been an actor, until he saw \"Rock Around the Clock\" in the cinema, and saw the way that the audiences reacted to the film. He became immediately convinced that the audience response was a crucial part of rock and roll, and that if done properly rock and roll performances could lead to the kind of catharsis that classical Greek drama aimed at.</p>\n<p>He took this idea to the BBC, who were at the time looking to put on a new teenage show. Up until mid 1956, the practice in British TV had been to stop transmitting for an hour, from six until seven in the evening, in order to let parents put their kids to bed -- this was known as the Toddlers' Truce. But after the commercial network ITV began broadcasting in 1955, the practice became controversial. While the BBC saved money by not putting on any programmes between six and seven -- they got the same amount in TV license fees however much they broadcast -- an hour without programmes for a commercial channel meant an hour without advertising fees.</p>\n<p>Eventually, ITV managed to get the rules changed, and the BBC decided that at five past six on a Saturday, they would put out a programme for young people, but young people allowed up that late -- and it was to be called Six-Five Special.</p>\n<p>[Excerpt: The Bob Cort Skiffle Group, \"The Six-Five Special\"]</p>\n<p>Six-Five Special embodied many of Good's ideas about how to broadcast rock and roll music -- it had the audience as an integral part of the programme -- there was very little distinction between the audience and the performers, who would perform among the crowd rather than separated from them. By all accounts it had some fantastic moments, including an appearance by Big Bill Broonzy, and a live broadcast from the 2Is coffee bar itself.</p>\n<p>But Good wasn't the sole producer, and he had to compromise his vision. As well as rock and roll and skiffle, the programme also included light music of a kind parents would approve of, educational items, and bits about sport. Good kept trying to persuade the people at the BBC to let him have the show be just about rock and roll, but his co-producer wanted Hungarian acrobats and features on stamp collecting.</p>\n<p>So Good moved over to ABC, one of the ITV stations, and started a rival show, \"Oh Boy!\"</p>\n<p>On \"Oh Boy!\" the focus was entirely on the music. Good had very strong ideas on what he wanted from the show, ideas he'd got from sources as varied as a theatrical company who put on performances of Shakespeare with all-black backgrounds and no sets, and a book he'd read on the physiology of brainwashing. He wanted to make something powerful. Unlike on Six-Five Special the audience wouldn't be mixing with the performers, but this time the performers would be picked out by a white spotlight on a black background.</p>\n<p>After two pilot episodes in June 1958, the programme started its run in September, with appearances from Marty Wilde, the John Barry Seven and more, and with instrumental backing for the solo performers provided by Lord Rockingham's Eleven, a studio group who would go on to have a novelty hit with \"Hoots Mon!\" as a result of their appearances on the show:</p>\n<p>[Excerpt: Lord Rockingham's XI, \"Hoots Mon!\"]</p>\n<p>And Cliff Richard was to be added to that show.</p>\n<p>It was Jack Good who, more than anyone else, came up with the image of the rock and roll star, and his influence can be seen in literally every visual depiction of rock and roll music from the early sixties on. And from the evidence of the two surviving episodes of Oh Boy! he, and the director Rita Gillespie, one of the very few female directors working in TV at the time, did a remarkable job of creating something truly exciting -- something all the more remarkable when you look at what they had to work with. Most of the British rock and roll acts at the time were small, malnourished, spotty, teenage boys, who were doing a sort of cargo-cult imitation of American rock and rollers without really understanding what they were meant to be doing.</p>\n<p>But the lighting and the visuals of the show were extraordinary -- and in Cliff Richard, Good had found someone who, if he was nowhere near as exciting as his American models, at least could be moulded into something that was the closest thing that could be found to a real British rock and roll star -- someone who might one day be almost as good as Gene Vincent.</p>\n<p>Good insisted that the song Cliff should perform on his show should be \"Move It\", and so the record label quickly flipped the single. Good worked with Cliff for a full week on his performance of the song, instructing him in every blink, every time he should clutch his arm as if in pain, the way he should look down , not straight at the audience, everything. Good chose his shocking pink outfit (not visible on black and white TV, but designed to send the girls in the audience into a frenzy) and had him restyle his hair to be less like Elvis'. And so in September 1958, a few weeks before his eighteenth birthday, Cliff Richard made his TV debut:</p>\n<p>[Excerpt: Cliff Richard, “Move It”]</p>\n<p>\"Oh Boy\" was the most fast-paced thing on TV -- on the evidence of the surviving episodes it was one song after another, non-stop, by different performers -- as many as seventeen songs in a twenty-five minute live show, with no artist doing two songs in a row. It was an immediate hit, and so was \"Move It\", which went to number two in the charts. There was a media outcry over Cliff's brazen sexuality, with the NME accusing him of \"crude exhibitionism\", while the Daily Sketch would ask \"Is this boy TV star too sexy?\"</p>\n<p>Cliff Richard was suddenly the biggest star and sex symbol in the UK, but there were problems with the band. Cliff was no longer playing guitar while he sang, and the group also needed a bass player, so Ian Samwell switched to bass, and they went looking for a new guitarist. The original intention was to audition a young player named Tony Sheridan, but while John Foster was waiting in the 2is to meet him, he started talking with someone who had just left the Vipers, and said that he and his friend would be happy to join the group, and so Cliff's backing group now consisted of Ian Samwell, Terry Smart, Hank Marvin and Bruce Welch.</p>\n<p>The new group recorded another Ian Samwell song, \"High Class Baby\":</p>\n<p>[Excerpt: Cliff Richard and the Drifters, \"High Class Baby\"]</p>\n<p>What Samwell didn't know when they recorded that was that Cliff was already planning to replace him, with Jet Harris, who had played with Marvin in the Vipers. Now he was playing with better musicians, Samwell's shortcomings were showing up. Cliff didn't tell Samwell himself -- he got John Foster to fire him. Samwell would go on to have some success as a songwriter and record producer, though, most famously producing “Horse With No Name” for America.</p>\n<p>Shortly after that, Foster was gone as well, first demoted from manager to roadie, then given two weeks' notice in a letter from Cliff's dad.</p>\n<p>And then finally, Cliff replaced Terry Smart, his old school friend, the person who had invited him into his group, with Tony Meehan, another ex-Viper.</p>\n<p>By Cliff's nineteenth birthday, the only thing left of the original Drifters was the name. And soon that would change too, as Cliff Richard and the Drifters became Cliff Richard and the Shadows.</p>",
  "enclosure": "",
  "itunes:summary": "Episode seventy of A History of Rock Music in 500 Songs looks at \"Move It\" by Cliff Richard, and the beginning of rock and roll TV in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Poor Little Fool\" by Ricky Nelson, another artist whose career was made by TV, and one who influenced Cliff Richard hugely.\n\n ERRATUM: I say Cliff Richard was sixteen when he first heard “Heartbreak Hotel”. He was fifteen.\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nThis four-CD set contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.\nThis MP3 compilation, meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll. Much of the music is not very good, but I can't imagine a better way of getting an understanding of the roots of British rock.\nPete Frame's The Restless Generation is the best book available looking at British 50s rock and roll from a historical perspective. Be warned, though -- his jokey and irreverent style can, when dealing with people like Larry Parnes (who was gay and Jewish) very occasionally tip over into reinforcing homophobic and anti-semitic stereotypes for an easy laugh.\nBilly Bragg's Roots, Radicals, and Rockers: How Skiffle Changed the World is one of the best books I've read on music at all, and gives far more detail about the historical background.\nAnd Cliff Richard: The Biography by Steve Turner is very positive towards Richard, but not at the expense of honesty.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nWe've looked a little bit at the start of rock and roll in Britain, which was so different from the American music that it feels absurd to talk of the two in the same breath. But today we're going to have a look at the first really massive star of British rock and roll -- someone who is still going strong today, more than sixty years after he released his first record:\n[Excerpt: Cliff Richard, \"Move It\"]\nWhen we've looked at British rock and roll to this point, it's been rather lifeless, and there's a reason for that. There were, in the mid-fifties, two different streams of music in Britain that were aiming to appeal to young people. One was skiffle, and that's the branch of music that eventually led to all British rock and roll from the sixties onwards -- we looked at that with Lonnie Donegan, but the skiffle craze was a big, big thing for about two years, and when it finally died down it splintered into three different, overlapping, groups -- there were the folk revivalists, who we'll talk about when we get to Bob Dylan; the British blues people, who we'll look at when we get to the Rolling Stones; and the rock and rollers. Skiffle had everything that people found exciting and interesting about American rock and roll -- at least, it had much of the excitement of the rockabilly music. But it wasn't marketed as rock and roll, and it tended to aim at a slightly more bohemian audience.\nMeanwhile, British rock and roll proper -- the stuff that was being marketed as rock and roll -- was mostly being made by longtime professional musicians who had switched from playing anaemic copies of swing music to anaemic copies of Bill Haley and the Comets. Groups like Tony Crombie and the Rockets were making records like \"Let's You and I Rock\", which copied the formula of Haley's less good records:\n[Excerpt: Tony Crombie and the Rockets, \"Let's You and I Rock\"]\nThe idea of rock and roll in the British music business in those early years came entirely from the film Rock Around the Clock, which had featured Haley, the Platters, and Freddie Bell and His Bellboys -- who were a second-rate clone of Haley's band. As we discussed in the episodes on Haley, his particular",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode seventy of A History of Rock Music in 500 Songs looks at \"Move It\" by Cliff Richard, and the beginning of rock and roll TV in the UK. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Poor Little Fool\" by Ricky Nelson, another artist whose career was made by TV, and one who influenced Cliff Richard hugely.\n\n ERRATUM: I say Cliff Richard was sixteen when he first heard “Heartbreak Hotel”. He was fifteen.\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\nThis four-CD set contains all the singles and EPs released by Cliff Richard and the Shadows, together and separately, between 1958 and 1962.\nThis MP3 compilation, meanwhile, contains a huge number of skiffle records and early British attempts at rock and roll. Much of the music is not very good, but I can't imagine a better way of getting an under",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}