{
  "title": "A Breath Test for Monitoring Glucose Levels",
  "link": "https://spectrum.ieee.org/glucose-test-e-nose",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-open-mouth.jpg?id=30132237&width=1245&height=700&coordinates=0%2C187%2C0%2C187\"/><br/><br/><p>\n<p>\n<em>This article is part of our exclusive <a href=\"https://spectrum.ieee.org/collections/journal-watch/\" rel=\"noopener noreferrer\" target=\"_self\">IEEE Journal Watch series</a> in partnership with IEEE Xplore.</em>\n</p>\n</p><p>\n\tDiabetes is a very common condition affecting roughly <a href=\"https://www.cdc.gov/diabetes/pdfs/data/statistics/national-diabetes-statistics-report.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">10 percent</a> of the U.S. population—and, <a href=\"https://www.who.int/health-topics/diabetes#tab=tab_1\" target=\"_blank\">according to the World Health Organization</a>, there are 422 million people living with diabetes around the world. To manage the disease, people must test their blood glucose levels several times a day, which often involves finger pricks and can be burdensome and painful.\n</p><p>\n\tIn recent years, some <a href=\"https://www.healthline.com/diabetesmine/non-invasive-diabetes-technology\" target=\"_blank\">noninvasive, wearable devices for measuring glucose</a> have hit the market, but these devices are typically expensive and still depend on direct sampling and interaction with blood. However, a newly designed e-nose that can measure glucose levels based on a person’s breath could offer people with diabetes a different noninvasive and low-cost solution. The e-nose is described in a <a href=\"https://ieeexplore.ieee.org/document/9789967\" rel=\"noopener noreferrer\" target=\"_blank\">study</a> published 7 June in <a href=\"https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7361\" rel=\"noopener noreferrer\" target=\"_blank\"><em>IEEE Sensors Journal</em></a>.\n</p><p>\n\tE-noses are devices that detect and analyze chemicals in the air in real time, determining the nature of the substance at hand. They are being designed for a wide range of tasks, including  <a href=\"https://spectrum.ieee.org/electronic-nose-whiskey\" target=\"_self\">sniffing out good whiskey</a>, monitoring crops, and detecting lung cancer.\n</p><p>\n\tQiliang Li is a Professor in the <a href=\"https://ece.gmu.edu/\" target=\"_blank\">Department of Electrical and Computer Engineering</a> at George Mason University who’s been interested in developing similar technology for measuring glucose levels on a person’s breath. Although glucose isn’t exhaled in breath, the concentration of <a href=\"https://pubs.rsc.org/en/content/articlelanding/2021/an/d1an00402f#:~:text=The%20levels%20of%20acetone%20and,dietary%20fat%20loss%20and%20diabetes.\" target=\"_blank\">acetone and other ketones</a> in the exhaled breath is associated with human metabolic conditions, including diabetes.\n</p><p>\n\t“To alleviate the pain and danger for the patients, we created an e-nose for noninvasive, painless, low-cost, and frequent diabetes testing,” says Li. “The e-nose is designed to identify the ‘smell’ of exhaled breath which contains certain level of acetone and other ketones. Therefore, the smell is an indicator of glucose level in the blood.”\n</p><p>\n\tThe e-nose designed by Li’s team contains an array of 12 different chemical sensors and a microprocessor. When the e-nose sniffs the exhaled breath, the chemical sensors will send electrical response to the microprocessor, which processes the signals into digital information. “The e-nose will then analyze the digital information with our database and give a correct number of glucose levels,” explains Dr. Xiangdong Zhou, a professor at the Respiratory Department of Nanjing Medical University, in Nanjing, China, who was also involved in the study.\n</p><p>\n\tIn their study, the researchers collected breath samples from 41 study participants with a range of glucose levels and used the data to train the e-nose with a range of machine-learning algorithms until they found a combination of models that could detect glucose levels on a person’s breath with 90.4 percent accuracy and an average error of 0.69 <a href=\"https://www.qeios.com/read/64WT29\" target=\"_blank\">millimoles per liter</a> (mmol/L) in blood glucose concentration.\n</p><p>\n\tLi notes that, although the system doesn’t directly measure glucose levels by blood, which is the current gold standard form of measurement, it offers several advantages. “The new e-nose enables noninvasive, painless, and low-cost measurement of glucose levels. It is designed for close monitoring of glucose levels for diabetes patients, especially for the patients with high blood sugar and Type 1 patients who need insulin medication frequently,” he says.\n</p><p>\n\tNext, Li says the team is interested in designing a new chip for the chemical sensor arrays to create a more precise e-nose. As well, he says, “We plan to recruit more patients with different body mass index (BMI), living styles, and diet for testing and build a comprehensive database of exhaled breath and glucose levels.”\n</p><p>\n<em>This article appears in the September 2022 print issue as “A Blood-Sugar Breathalyzer for Diabetics.”</em>\n</p>",
  "pubDate": "Fri, 15 Jul 2022 17:17:43 +0000",
  "guid": "https://spectrum.ieee.org/glucose-test-e-nose",
  "category": [
    "E-nose",
    "Machine learning",
    "Diabetes",
    "Journal watch"
  ],
  "dc:creator": "Michelle Hampson",
  "media:content": ""
}