{
  "title": "EPISODE 69: Capturing Mussolini",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Fri, 26 Mar 2021 15:36:17 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2021/3/26/episode-69-capturing-mussolini",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:605dfe92d0824b5331d9c13d",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616772907260-ACV7KN422OXFQ9KR3PIE/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"605dff2a544546740d4a44cc\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1616772907260-ACV7KN422OXFQ9KR3PIE/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“He must be handed over to a tribunal of the people so it can judge him quickly. We want this, even though we think an execution platoon is too much of an honor for this man. He would deserve to be killed like a mangy dog.” —</em> Future Italian President Sandro Pertini about Benito Mussolini </p><p class=\"\"><em>“The world unfortunately continues to be a battlefield where different egos clash, repeating the mistakes of the past.”  —</em> Federigo Giordano </p><p class=\"\"><em>“Death to the Nazi-Fascists.”</em> — The closing quote of most letters written by Federigo Giordano during WWII </p><p class=\"\">I am not done with stories of resistance from Italy during WW II. Today, I’ll tell the story of a friend, one of the very last partisan commanders to still be alive—Federigo Giordano (battle name “Gek.”) His name is still recognized in some towns in Northern Italy since he was the one to lead his men to liberate them from Fascists and Nazis. In this episode we’ll tackle the growth of racism within Fascist ideology, becoming a partisan in the mountains of Northern Italy, rejecting the Alexander Proclamation, saving American aviators, participating in the capture of Benito Mussolini, Mussolini ‘hanging’ in Piazzale Loreto, drunk Nazis in one room while partisans hide in the attic, having to explain to a 90+ year old lady why you killed her sister over 70 years earlier, and much more.</p>",
  "media:content": {
    "media:title": "EPISODE 69: Capturing Mussolini"
  }
}