{
  "title": "Maritime Policy and the Merchant Marine with Josh Hendrickson",
  "pubDate": "Thu, 27 Feb 2020 20:32:35 +0000",
  "guid": "902001a8-99ff-4a43-928d-d3eb5e6009bf",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP139Hendrickson_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today, <a href= \"https://sites.google.com/site/joshuarhendrickson\" target=\"_blank\" rel=\"noopener\">Josh Hendrickson</a> joins the show to discuss his paper, <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3486330\" target=\"_blank\" rel=\"noopener\">\"U.S. Maritime Policy and Economic Efficiency.\"</a> The paper discusses the controversial Jones Act, and how it (and similar policies) were designed to maintain a sovereign merchant marine for use in times of war. Te abstract reads as follows:</p> <blockquote>Critics argue that maritime policy is protectionist legislation that restricts competition and reduces economic efficiency. In this paper, I argue the contrary. I begin with the premise that the primary role of the state is to provide national defense. A country must be able to protect its wealth, and therefore its capital, from plunder and/or destruction. This implies that a sufficient level of defense spending is increasing in the capital stock. An efficient solution is to tax capital to finance defense. Nonetheless, there is reason to believe that capital devoted to shipping imposes a lower marginal defense cost than other forms of capital because ships can be used as a naval auxiliary. If so, then one would expect that the optimal tax rate on shipbuilding and the merchant marine would be lower than other capital-intensive firms. Put differently, maritime subsidies during peacetime can be understood as the result of a Coaseian bargain in which the government compensates shipbuilders and the merchant marine during peacetime in exchange for their services during wartime. I argue that the history of U.S. maritime policy is broadly consistent with my theory. I conclude by discussing the current state of the merchant marine and maritime policy.</blockquote> <hr />",
  "content:encoded": "<p>Today, <a href= \"https://sites.google.com/site/joshuarhendrickson\" target=\"_blank\" rel=\"noopener\">Josh Hendrickson</a> joins the show to discuss his paper, <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3486330\" target=\"_blank\" rel=\"noopener\">\"U.S. Maritime Policy and Economic Efficiency.\"</a> The paper discusses the controversial Jones Act, and how it (and similar policies) were designed to maintain a sovereign merchant marine for use in times of war. Te abstract reads as follows:</p> Critics argue that maritime policy is protectionist legislation that restricts competition and reduces economic efficiency. In this paper, I argue the contrary. I begin with the premise that the primary role of the state is to provide national defense. A country must be able to protect its wealth, and therefore its capital, from plunder and/or destruction. This implies that a sufficient level of defense spending is increasing in the capital stock. An efficient solution is to tax capital to finance defense. Nonetheless, there is reason to believe that capital devoted to shipping imposes a lower marginal defense cost than other forms of capital because ships can be used as a naval auxiliary. If so, then one would expect that the optimal tax rate on shipbuilding and the merchant marine would be lower than other capital-intensive firms. Put differently, maritime subsidies during peacetime can be understood as the result of a Coaseian bargain in which the government compensates shipbuilders and the merchant marine during peacetime in exchange for their services during wartime. I argue that the history of U.S. maritime policy is broadly consistent with my theory. I conclude by discussing the current state of the merchant marine and maritime policy. ",
  "enclosure": "",
  "itunes:duration": "53:14",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today,  joins the show to discuss his paper,  The paper discusses the controversial Jones Act, and how it (and similar policies) were designed to maintain a sovereign merchant marine for use in times of war. Te abstract reads as follows: Critics argue...",
  "itunes:episode": 139,
  "itunes:episodeType": "full"
}