{
  "title": "Episode 118: &#8220;Do-Wah-Diddy-Diddy&#8221; by Manfred Mann",
  "link": "https://500songs.com/podcast/episode-118-do-wah-diddy-diddy-by-manfred-mann/",
  "pubDate": "Sun, 28 Mar 2021 22:59:48 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-118-do-wah-diddy-diddy-by-manfred-mann/",
  "description": "Episode 118 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Do-Wah-Diddy-Diddy\" by Manfred Mann, and how a jazz group with a blues singer had one of the biggest bubblegum pop hits of the sixties.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/49325069\">Walk on By\" by Dionne Warwick.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n<strong>Resources</strong>\n\nNo Mixcloud this week due to the number of tracks by Manfred Mann.\n\nInformation on the group comes from&nbsp;<a href=\"https://amzn.to/39qjUim\"><em>Mannerisms: The Five Phases of Manfred Mann</em>, by Greg Russo</a>, and from the liner notes of <a href=\"https://amzn.to/2P6AdtN\">this eleven-CD box set of the group's work</a>.\n\nFor a much cheaper collection of the group's hits -- but without the jazz, blues, and baroque pop elements that made them more interesting than the average sixties singles band -- <a href=\"https://amzn.to/3tZCDsQ\">this</a> has all the hit singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript:</strong>\n\nSo far, when we've looked at the British blues and R&B scene, we've concentrated on the bands who were influenced by Chicago blues, and who kept to a straightforward guitar/bass/drums lineup.\n\nBut there was another, related, branch of the blues scene in Britain that was more musically sophisticated, and which while its practitioners certainly enjoyed playing songs by Howlin' Wolf or Muddy Waters, was also rooted in the jazz of people like Mose Allison. Today we're going to look at one of those bands, and at the intersection of jazz and the British R&B scene, and how a jazz band with a flute player and a vibraphonist briefly became bubblegum pop idols. We're going to look at \"Do Wah Diddy Diddy\" by Manfred Mann:\n\n[Excerpt: Manfred Mann, \"Do Wah Diddy Diddy\"]\n\nManfred Mann is, annoyingly when writing about the group, the name of both a band and of one of its members. Manfred Mann the human being, as opposed to Manfred Mann the group, was born Manfred Lubowitz in South Africa, and while he was from a wealthy family, he was very opposed to the vicious South African system of apartheid, and considered himself strongly anti-racist.\n\nHe was also a lover of jazz music, especially some of the most progressive music being made at the time -- musicians like Ornette Coleman, Charles Mingus, and John Coltrane -- and he soon became a very competent jazz pianist, playing with musicians like Hugh Masakela at a time when that kind of fraternisation between people of different races was very much frowned upon in South Africa.\n\nManfred desperately wanted to get out of South Africa, and he took his chance in June 1961, at the last point at which he was a Commonwealth citizen.\n\nThe Commonwealth, for those who don't know, is a political association of countries that were originally parts of the British Empire, and basically replaced the British Empire when the former colonies gained their independence. These days, the Commonwealth is of mostly symbolic importance, but in the fifties and sixties, as the Empire was breaking up, it was considered a real power in its own right, and in particular, until some changes to immigration law in the mid sixties, Commonwealth citizens had the right to move to the UK.\n\nAt that point, South Africa had just voted to become a republic, and there was a rule in the Commonwealth that countries with a head of state other than the Queen could only remain in the Commonwealth with the unanimous agreement of all the other members. And several of the other member states, unsurprisingly, objected to the continued membership of a country whose entire system of government was based on the most virulent racism imaginable.\n\nSo, as soon as South Africa became a republic, it lost its Commonwealth membership, and that meant that its citizens lost their automatic right to emigrate to the UK. But they were given a year's grace period, and so Manfred took that chance and moved over to England, where he started playing jazz keyboards, giving piano lessons, and making some money on the side by writing record reviews. For those reviews, rather than credit himself as Manfred Lubowitz, he decided to use a pseudonym taken from the jazz drummer Shelly Manne, and he became Manfred Manne -- spelled with a silent e on the end, which he later dropped.\n\nMann was rather desperate for gigs, and he ended up taking a job playing with a band at a Butlin's holiday camp. Graham Bond, who we've seen in several previous episodes as the leader of The Graham Bond Organisation, was at that time playing Hammond organ there, but only wanted to play a few days a week. Mann became the substitute keyboard player for that holiday camp band, and struck up a good musical rapport with the drummer and vibraphone player, Mike Hugg. When Bond went off to form his own band, Mann and Hugg decided to form their own band along the same lines, mixing the modern jazz that they liked with the more commercial R&B that Bond was playing.\n\nThey named their group the Mann-Hugg Blues Brothers, and it initially consisted of Mann on keyboards, Hugg on drums and vibraphone, Mike Vickers on guitar, flute, and saxophone, Dave Richmond on bass, Tony Roberts and Don Fay on saxophone and Ian Fenby on trumpet.\n\nAs their experiences were far more in the jazz field than in blues, they decided that they needed to get in a singer who was more familiar with the blues side of things. The person they chose was a singer who was originally named Paul Pond, and who had been friends for a long time with Brian Jones, before Jones had formed the Rolling Stones. While Jones had been performing under the name Elmo Lewis, his friend had taken on Jones' surname, as he thought \"Paul Pond\" didn't sound like a good name for a singer. He'd first kept his initials, and performed as P.P. Jones, but then he'd presumably realised that \"pee-pee\" is probably not the best stage name in the world, and so he'd become just Paul Jones, the name by which he's known to this day.\n\nJones, like his friend Brian, was a fan particularly of Chicago blues, and he had occasionally appeared with Alexis Korner. After auditioning for the group at a ska club called The Roaring 20s, Jones became the group's lead singer and harmonica player, and the group soon moved in Jones' musical direction, playing the kind of Chicago blues that was popular at the Marquee club, where they soon got a residency, rather than the soul style that was more popular at the nearby Flamingo club, and which would be more expected from a horn-centric lineup.\n\nUnsurprisingly, given this, the horn players soon left, and the group became a five-piece core of Jones, Mann, Hugg, Vickers, and Richmond. This group was signed to HMV records by John Burgess. Burgess was a producer who specialised in music of a very different style from what the Mann-Hugg Blues Brothers played. We've already heard some of his production work -- he was the producer for Adam Faith from \"What Do You Want?\" on:\n\n[Excerpt: Adam Faith, \"What Do You Want?\"]\n\nAnd at the time he signed the Mann-Hugg Blues Brothers, he was just starting to work with a new group, Freddie and the Dreamers, for whom he would produce several hits:\n\n[Excerpt: Freddie and the Dreamers, \"If You Gotta Make a Fool of Somebody\"]\n\nBurgess liked the group, but he insisted that they had to change their name -- and in fact, he insisted that the group change their name to Manfred Mann. None of the group members liked the idea -- even Mann himself thought that this seemed a little unreasonable, and Paul Jones in particular disagreed strongly with the idea, but they were all eventually mollified by the idea that all the publicity would emphasise that all five of them were equal members of the group, and that while the group might be named after their keyboard player, there were five members. The group members themselves always referred to themselves as \"the Manfreds\" rather than as Manfred Mann.\n\nThe group's first single showed that despite having become a blues band and then getting produced by a pop producer, they were still at heart a jazz group. \"Why Should We Not?\" is an instrumental led by Vickers' saxophone, Mann's organ, and Jones' harmonica:\n\n[Excerpt: Manfred Mann, \"Why Should We Not?\"]\n\nUnsurprisingly, neither that nor the B-side, a jazz instrumental version of \"Frere Jacques\", charted -- Britain in 1963 wanted Gerry and the Pacemakers and Freddie and the Dreamers, not jazz instrumentals. The next single, an R&B song called \"Cock-A-Hoop\" written by Jones, did little better.\n\nThe group's big breakthrough came from Ready, Steady, Go!, which at this point was using \"Wipe Out!\" by the Surfaris as its theme song:\n\n[Excerpt: The Surfaris, \"Wipe Out\"]\n\nWe've mentioned Ready, Steady, Go! in passing in previous episodes, but it was the most important pop music show of the early and mid sixties, just as Oh Boy! had been for the late fifties. Ready, Steady, Go! was, in principle at least, a general pop music programme, but in practice it catered primarily for the emerging mod subculture.\n\n\"Mod\" stood for \"modernist\", and the mods emerged from the group of people who liked modern jazz rather than trad, but by this point their primary musical interests were in soul and R&B. Mod was a working-class subculture, based in the South-East of England, especially London, and spurred on by the newfound comparative affluence of the early sixties, when for the first time young working-class people, while still living in poverty, had a small amount of disposable income to spend on clothes, music, and drugs. The Mods had a very particular sense of style, based around sharp Italian suits, pop art and op art, and Black American music or white British imitations of it. For them, music was functional, and primarily existed for the purposes of dancing, and many of them would take large amounts of amphetamines so they could spend the entire weekend at clubs dancing to soul and R&B music.\n\nAnd that entire weekend would kick off on Friday with Ready, Steady, Go!, whose catchphrase was \"the weekend starts here!\"\n\nReady, Steady, Go! featured almost every important pop act of the early sixties, but while groups like Gerry and the Pacemakers or the Beatles would appear on it, it became known for its promotion of Black artists, and it was the first major British TV exposure for Motown artists like the Supremes, the Temptations, and the Marvelettes, for Stax artists like Otis Redding, and for blues artists like John Lee Hooker and Sonny Boy Williamson. Ready Steady Go! was also the primary TV exposure for British groups who were inspired by those artists, and it's through Ready Steady Go! that the Animals, the Yardbirds, the Rolling Stones, Them, and the Who, among others reached national popularity -- all of them acts that were popular among the Mods in particular.\n\nBut \"Wipe Out\" didn't really fit with this kind of music, and so the producers of Ready Steady Go were looking for something more suitable for their theme music. They'd already tried commissioning the Animals to record something, as we saw a couple of weeks back, but that hadn't worked out, and instead they turned to Manfred Mann, who came up with a song that not only perfectly fit the style of the show, but also handily promoted the group themselves:\n\n[Excerpt: Manfred Mann, \"5-4-3-2-1\"]\n\nThat was taken on as Ready, Steady, Go!s theme song, and made the top five in the UK. But by the time it charted, the group had already changed lineup.\n\nDave Richmond was seen by the other members of the group as a problem at this point. Richmond was a great bass player, but he was a great *jazz* bass player -- he wanted to be Charles Mingus, and play strange cross-rhythms, and what the group needed at this point was someone who would just play straightforward blues basslines without complaint -- they needed someone closer to Willie Dixon than to Mingus.\n\nTom McGuinness, who replaced him, had already had a rather unusual career trajectory. He'd started out as a satirist, writing for the magazine Private Eye and the TV series That Was The Week That Was, one of the most important British comedy shows of the sixties, but he had really wanted to be a blues musician instead. He'd formed a blues band, The Roosters, with a guitarist who went to art school with his girlfriend, and they'd played a few gigs around London before the duo had been poached by the minor Merseybeat band Casey Jones and his Engineers, a group which had been formed by Brian Casser, formerly of Cass & The Cassanovas, the group that had become The Big Three. Casey Jones and his Engineers had just released the single \"One Way Ticket\":\n\n[Excerpt: Casey Jones and His Engineers, \"One-Way Ticket\"]\n\nHowever, the two guitarists soon realised, after just a handful of gigs, that they weren't right for that group, and quit. McGuinness' friend, Eric Clapton, went on to join the Yardbirds, and we'll be hearing more about him in a few weeks' time, but McGuinness was at a loose end, until he discovered that Manfred Mann were looking for a bass player. McGuinness was a guitarist, but bluffed to Paul Jones that he'd switched to bass, and got the job. He said later that the only question he'd been asked when interviewed by the group was \"are you willing to play simple parts?\" -- as he'd never played bass in his life until the day of his first gig with the group, he was more than happy to say yes to that.\n\nMcGuinness joined only days after the recording of \"5-4-3-2-1\", and Richmond was out -- though he would have a successful career as a session bass player, playing on, among others, \"Je t'Aime\" by Serge Gainsbourg and Jane Birkin, \"Your Song\" by Elton John, Labi Siffre's \"It Must Be Love\", and the music for the long-running sitcoms Only Fools and Horses and Last of the Summer Wine.\n\nAs soon as McGuinness joined, the group set out on tour, to promote their new hit, but also to act as the backing group for the Crystals, on a tour which also featured Johnny Kidd and the Pirates and Joe Brown and his Bruvvers.\n\nThe group's next single, \"Hubble Bubble Toil and Trouble\" was another original, and made number eleven on the charts, but the group saw it as a failure anyway, to the extent that they tried their best to forget it ever existed. In researching this episode I got an eleven-CD box set of the group's work, which contains every studio album or compilation they released in the sixties, a collection of their EPs, and a collection of their BBC sessions. In all eleven CDs, \"Hubble Bubble Toil and Trouble\" doesn't appear at all. Which is quite odd, as it's a perfectly serviceable, if unexceptional, piece of pop R&B:\n\n[Excerpt: Manfred Mann, \"Hubble Bubble Toil and Trouble\"]\n\nBut it's not just the group that were unimpressed with the record. John Burgess thought that the record only getting to number eleven was proof of his hypothesis that groups should not put out their own songs as singles. From this point on, with one exception in 1968, everything they released as an A-side would be a cover version or a song brought to them by a professional songwriter.\n\nThis worried Jones, who didn't want to be forced to start singing songs he disliked, which he saw as a very likely outcome of this edict. So he made it his role in the group to seek out records that the group could cover, which would be commercial enough that they could get hit singles from them, but which would be something he could sing while keeping his self-respect. His very first selection certainly met the first criterion.\n\nThe song which would become their biggest hit had very little to do with the R&B or jazz which had inspired the group. Instead, it was a perfect piece of Brill Building pop. The Exciters, who originally recorded it, were one of the great girl groups of the early sixties (though they also had one male member), and had already had quite an influence on pop music. They had been discovered by Leiber and Stoller, who had signed them to Red Bird Records, a label we'll be looking at in much more detail in an upcoming episode, and they'd had a hit in 1962 with a Bert Berns song, \"Tell Him\", which made the top five:\n\n[Excerpt: The Exciters, \"Tell Him\"]\n\nThat record had so excited a young British folk singer who was in the US at the time to record an album with her group The Springfields that she completely reworked her entire style, went solo, and kickstarted a solo career singing pop-soul songs under the name Dusty Springfield.\n\nThe Exciters never had another top forty hit, but they became popular enough among British music lovers that the Beatles asked them to open for them on their American tour in summer 1964. Most of the Exciters' records were of songs written by the more R&B end of the Brill Building songwriters -- they would record several more Bert Berns songs, and some by Ritchie Barrett, but the song that would become their most well-known legacy was actually written by Jeff Barry and Ellie Greenwich. Like many of Barry and Greenwich's songs, it was based around a nonsense phrase, but in this case the phrase they used had something of a longer history, though it's not apparent whether they fully realised that.\n\nIn African-American folklore of the early twentieth century, the imaginary town of Diddy Wah Diddy was something like a synonym for heaven, or for the Big Rock Candy Mountain of the folk song -- a place where people didn't have to work, and where food was free everywhere. This place had been sung about in many songs, like Blind Blake's \"Diddie Wah Diddie\":\n\n[Excerpt: Blind Blake, \"Diddie Wah Diddie\"]\n\nAnd a song written by Willie Dixon for Bo Diddley:\n\n[Excerpt: Bo Diddley, \"Diddy Wah Diddy\"]\n\nAnd \"Diddy\" and \"Wah\" had often been used by other Black artists, in various contexts, like Roy Brown and Dave Bartholomew's \"Diddy-Y-Diddy-O\":\n\n[Excerpt: Roy Brown and Dave Bartholomew, \"Diddy-Y-Diddy-O\"]\n\nAnd Junior and Marie's \"Boom Diddy Wah Wah\", a \"Ko Ko Mo\" knockoff produced by Johnny Otis:\n\n[Excerpt: Junior and Marie, \"Boom Diddy Wah Wah\"]\n\nSo when Jeff Barry and Ellie Greenwich wrote \"Do-Wah-Diddy\", as the song was originally called, they were, wittingly or not, tapping into a rich history of rhythm and blues music. But the song as Greenwich demoed it was one of the first examples of what would become known as \"bubblegum pop\", and is particularly notable in her demo for its very early use of the fuzz guitar that would be a stylistic hallmark of that subgenre:\n\n[Excerpt: Ellie Greenwich, \"Do-Wah-Diddy (demo)\"]\n\nThe Exciters' version of the song took it into more conventional girl-group territory, with a strong soulful vocal, but with the group's backing vocal call-and-response chant showing up the song's resemblance to the kind of schoolyard chanting games which were, of course, the basis of the very first girl group records:\n\n[Excerpt: The Exciters, \"Do-Wah-Diddy\"]\n\nSadly, that record only reached number seventy-eight on the charts, and the Exciters would have no more hits in the US, though a later lineup of the group would make the UK top forty in 1975 with a song written and produced by the Northern Soul DJ Ian Levine.\n\nBut in 1964 Jones had picked up on \"Do-Wah-Diddy\", and knew it was a potential hit.\n\nMost of the group weren't very keen on \"Do Wah Diddy Diddy\", as the song was renamed. There are relatively few interviews with any of them about it, but from what I can gather the only member of the band who thought anything much of the song was Paul Jones. However, the group did their best with the recording, and were particularly impressed with Manfred's Hammond organ solo -- which they later discovered was cut out of the finished recording by Burgess. The result was an organ-driven stomping pop song which had more in common with the Dave Clark Five than with anything else the group were doing:\n\n[Excerpt: Manfred Mann, \"Do Wah Diddy Diddy\"]\n\nThe record reached number one in both the UK and the US, and the group immediately went on an American tour, packaged with Peter & Gordon, a British duo who were having some success at the time because Peter Asher's sister was dating Paul McCartney, who'd given them a hit song, \"World Without Love\":\n\n[Excerpt: Peter and Gordon, \"World Without Love\"]\n\nThe group found the experience of touring the US a thoroughly miserable one, and decided that they weren't going to bother going back again, so while they would continue to have big hits in Britain for the rest of the decade, they only had a few minor successes in the States.\n\nAfter the success of \"Do Wah Diddy Diddy\", EMI rushed out an album by the group, The Five Faces of Manfred Mann, which must have caused some confusion for anyone buying it in the hope of more \"Do Wah Diddy Diddy\" style pop songs. Half the album's fourteen tracks were covers of blues and R&B, mostly by Chess artists -- there were covers of Muddy Waters, Howlin' Wolf, Bo Diddley, Ike & Tina Turner, and more. There were also five originals, written or co-written by Jones, in the same style as those songs, plus a couple of instrumentals, one written by the group and one a cover of Cannonball Adderly's jazz classic \"Sack O'Woe\", arranged to show off the group's skills at harmonica, saxophone, piano and vibraphone:\n\n[Excerpt: Manfred Mann, \"Sack O'Woe\"]\n\nHowever, the group realised that the formula they'd hit on with \"Do &nbsp;Wah Diddy Diddy\" was a useful one, and so for their next single they once again covered a girl-group track with a nonsense-word chorus and title -- their version of \"Sha La La\" by the Shirelles took them to number three on the UK charts, and number twelve in the US.\n\nThey followed that with a ballad, \"Come Tomorrow\", one of the few secular songs ever recorded by Marie Knight, the gospel singer who we discussed briefly way back in episode five, who was Sister Rosetta Tharpe's duet partner, and quite possibly her partner in other senses.\n\nThey released several more singles and were consistently charting, to the point that they actually managed to get a top ten hit with a self-written song despite their own material not being considered worth putting out as singles. Paul Jones had written \"The One in the Middle\" for his friends the Yardbirds, but when they turned it down, he rewrote the song to be about Manfred Mann, and especially about himself:\n\n[Excerpt: Manfred Mann, \"The One in the Middle\"]\n\nLike much of their material, that was released on an EP, and the EP was so successful that as well as making number one on the EP charts, it also made number ten on the regular charts, with \"The One in the Middle\" as the lead-off track.\n\nBut \"The One in the Middle\" was a clue to something else as well -- Jones was getting increasingly annoyed at the fact that the records the group was making were hits, and he was the frontman, the lead singer, the person picking the cover versions, and the writer of much of the original material, but all the records were getting credited to the group's keyboard player.\n\nBut Jones wasn't the next member of the group to leave. That was Mike Vickers, who went off to work in arranging film music and session work, including some work for the Beatles, the music for the film Dracula AD 1972, and the opening and closing themes for This Week in Baseball. The last single the group released while Vickers was a member was the aptly-titled \"If You Gotta Go, Go Now\". Mann had heard Bob Dylan performing that song live, and had realised that the song had never been released. He'd contacted Dylan's publishers, got hold of a demo, and the group became the first to release a version of the song, making number two in the charts:\n\n[Excerpt: Manfred Mann, \"If You Gotta Go, Go Now\"]\n\nBefore Vickers' departure, the group had recorded their second album, Mann Made, and that had been even more eclectic than the first album, combining versions of blues classics like \"Stormy Monday Blues\", Motown songs like \"The Way You Do The Things You Do\", country covers like \"You Don't Know Me\", and oddities like \"Bare Hugg\", an original jazz instrumental for flute and vibraphone:\n\n[Excerpt: Manfred Mann, \"Bare Hugg\"]\n\nMcGuinness took the opportunity of Vickers leaving the group to switch from bass back to playing guitar, which had always been his preferred instrument. To fill in the gap, on Graham Bond's recommendation they hired away Jack Bruce, who had just been playing in John Mayall's Bluesbreakers with McGuinness' old friend Eric Clapton, and it's Bruce who played bass on the group's next big hit, \"Pretty Flamingo\", the only UK number one that Bruce ever played on:\n\n[Excerpt: Manfred Mann, \"Pretty Flamingo\"]\n\nBruce stayed with the band for several months, before going off to play in another band who we'll be covering in a future episode. He was replaced in turn by Klaus Voorman. Voorman was an old friend of the Beatles from their Hamburg days, who had been taught the rudiments of bass by Stuart Sutcliffe, and had formed a trio, Paddy, Klaus, and Gibson, with two Merseybeat musicians, Paddy Chambers of the Big Three and Gibson Kemp of Kingsize Taylor and the Dominoes:\n\n[Excerpt: Paddy, Klaus, and Gibson, \"No Good Without You Baby\"]\n\nLike Vickers, Voorman could play the flute, and his flute playing would become a regular part of the group's later singles.\n\nThese lineup changes didn't affect the group as either a chart act or as an act who were playing a huge variety of different styles of music. While the singles were uniformly catchy pop, on album tracks, B-sides or EPs you'd be likely to find versions of folk songs collected by Alan Lomax, like \"John Hardy\", or things like \"Driva Man\", a blues song about slavery in 5/4 time, originally by the jazz greats Oscar Brown and Max Roach:\n\n[Excerpt: Manfred Mann, \"Driva Man\"]\n\nBut by the time that track was released, Paul Jones was out of the group. He actually announced his intention to quit the group at the same time that Mike Vickers left, but the group had persuaded him to stay on for almost a year while they looked for his replacement, auditioning singers like Rod Stewart and Long John Baldry with little success.\n\nThey eventually decided on Mike d'Abo, who had previously been the lead singer of a group called A Band of Angels:\n\n[Excerpt: A Band of Angels, \"(Accept My) Invitation\"]\n\nBy the point d'Abo joined, relations &nbsp;between the rest of the group and Jones were so poor that they didn't tell Jones that they were thinking of d'Abo -- Jones would later recollect that the group decided to stop at a pub on the way to a gig, ostensibly to watch themselves on TV, but actually to watch A Band of Angels on the same show, without explaining to Jones that that was what they were doing – Jones actually mentioned d'Abo to his bandmates as a possible replacement, not realising he was already in the group. Mann has talked about how on the group's last show with Jones, they drove to the gig in silence, and their first single with the new singer, a version of Dylan's \"Just Like a Woman\", came on the radio.\n\nThere was a lot of discomfort in the band at this time, because their record label had decided to stick with Jones as a solo performer, and the rest of the group had had to find another label, and were worried that without Jones their career was over. Luckily for everyone involved, \"Just Like a Woman\" made the top ten, and the group's career was able to continue. Meanwhile, Jones' first single as a solo artist made the top five:\n\n[Excerpt: Paul Jones, \"High Time\"]\n\nBut after that and his follow-up, \"I've Been a Bad, Bad, Boy\", which made number five, the best he could do was to barely scrape the top forty.\n\nManfred Mann, on the other hand, continued having hits, though there was a constant struggle to find new material. d'Abo was himself a songwriter, and it shows the limitations of the \"no A-sides by group members\" rule that while d'Abo was the lead singer of Manfred Mann, he wrote two hit singles which the group never recorded. The first, \"Handbags and Gladrags\", was a hit for Chris Farlowe:\n\n[Excerpt: Chris Farlowe, \"Handbags and Gladrags\"]\n\nThat was only a minor hit, but was later recorded successfully by Rod Stewart, with d'Abo arranging, and the Stereophonics. d'Abo also co-wrote, and played piano on, \"Build Me Up Buttercup\" by the Foundations:\n\n[Excerpt: The Foundations, \"Build Me Up Buttercup\"]\n\nBut the group continued releasing singles written by other people. &nbsp;Their second post-Jones single, from the perspective of a spurned lover insulting their ex's new fiancee, had to have its title changed from what the writers intended, as the group felt that a song insulting \"semi-detached suburban Mr. Jones\" might be taken the wrong way. Lightly retitled, \"Semi-Detached Suburban Mr. James\" made number two, while the follow-up, \"Ha Ha! Said the Clown\", made number four.\n\nThe two singles after that did significantly less well, though, and seemed to be quite bizarre choices -- an instrumental Hammond organ version of Tommy Roe's \"Sweet Pea\", which made number thirty-six, and a version of Randy Newman's bitterly cynical \"So Long, Dad\", which didn't make the charts at all.\n\nAfter this lack of success, the group decided to go back to what had worked for them before. They'd already had two hits with Dylan songs, and Mann had got hold of a copy of Dylan's Basement Tapes, a bootleg which we'll be talking about later. He picked up on one song from it, and got permission to release \"The Mighty Quinn\", which became the group's third number one:\n\n[Excerpt: Manfred Mann, \"The Mighty Quinn\"]\n\nThe album from which that came, Mighty Garvey, is the closest thing the group came to an actual great album. While the group's earlier albums were mostly blues covers, this was mostly made up of original material by either Hugg or d'Abo, in a pastoral baroque pop style that invites comparisons to the Kinks or the Zombies' material of that period, but with a self-mocking comedy edge in several songs that was closer to the Bonzo Dog Doo-Dah Band. Probably the highlight of the album was the mellotron-driven \"It's So Easy Falling\":\n\n[Excerpt: Manfred Mann, \"It's So Easy Falling\"]\n\nBut Mighty Garvey didn't chart, and it was the last gasp of the group as a creative entity. They had three more top-ten hits, all of them good examples of their type, but by January 1969, Tom McGuinness was interviewed saying \"It's not a group any more. It's just five people who come together to make hit singles. That's the only aim of the group at the moment -- to make hit singles -- it's the only reason the group exists. Commercial success is very important to the group. It gives us financial freedom to do the things we want.\"\n\nThe group split up in 1969, and went their separate ways. d'Abo appeared on the original Jesus Christ Superstar album, and then went into writing advertising jingles, most famously writing \"a finger of fudge is just enough\" for Cadbury's. McGuinness formed McGuinness Flint, with the songwriters Gallagher and Lyle, and had a big hit with \"When I'm Dead and Gone\":\n\n[Excerpt: McGuinness Flint, \"When I'm Dead and Gone\"]\n\nHe later teamed up again with Paul Jones, to form a blues band imaginatively named \"the Blues Band\", who continue performing to this day:\n\n[Excerpt: The Blues Band, \"Mean Ol' Frisco\"]\n\nJones became a born-again Christian in the eighties, and also starred in a children's TV show, Uncle Jack, and presented the BBC Radio 2 Blues Programme for thirty-two years.\n\nManfred Mann and Mike Hugg formed another group, Manfred Mann Chapter Three, who released two albums before splitting. Hugg went on from that to write for TV and films, most notably writing the theme music to \"Whatever Happened to the Likely Lads?\":\n\n[Excerpt: Highly Likely, \"Whatever Happened to the Likely Lads?\"]\n\nMann went on to form Manfred Mann's Earth Band, who had a number of hits, the biggest of which was the Bruce Springsteen song \"Blinded by the Light\":\n\n[Excerpt: Manfred Mann's Earth Band, \"Blinded by the Light\"]\n\nAlmost uniquely for a band from the early sixties, all the members of the classic lineup of Manfred Mann are still alive.\n\nManfred Mann continues to perform with various lineups of his Earth Band. Hugg, Jones, McGuinness, and d'Abo reunited as The Manfreds in the 1990s, with Vickers also in the band until 1999, and continue to tour together -- I still have a ticket to see them which was originally for a show in April 2020, but has just been rescheduled to 2022. McGuinness and Jones also still tour with the Blues Band. And Mike Vickers now spends his time creating experimental animations.\n\nManfred Mann were a band with too many musical interests to have a coherent image, and their reliance on outside songwriters and their frequent lineup changes meant that they never had the consistent sound of many of their contemporaries. But partly because of this, they created a catalogue that rewards exploration in a way that several more well-regarded bands' work doesn't, and I wouldn't be at all surprised to see a major critical reassessment of them at some point. But whether that happens or not, almost sixty years on people around the world still respond instantly to the opening bars of their biggest hit, and \"Do Wah Diddy Diddy\" remains one of the most fondly remembered singles of the early sixties.",
  "itunes:subtitle": "Episode 118 of A History of Rock Music in Five Hundred Songs looks at Do-Wah-Diddy-Diddy by Manfred Mann, and how a jazz group with a blues singer had one of the biggest bubblegum pop hits of the sixties.\n\nClick the full post to read liner notes, links t",
  "itunes:keywords": "Adam Faith,Alexis Korner,Bert Berns,Blind Blake,Bo Diddley,Bob Dylan,Brian Jones,Brill Building,British rock,Dusty Springfield,Ellie Greenwich,Eric Clapton,Graham Bond,Jack Bruce,jazz,Jeff Barry,Klaus Voorman,Manfred Mann,Mike d&#039;Abo,mods,Paul Jones,racism,Ready Steady Go,Richie Barrett,Rod Stewart,South Africa,the blues,the Exciters,Tom McGuinness,Willie Dixon",
  "itunes:episodeType": "full",
  "itunes:episode": 118,
  "content:encoded": "Episode 118 of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Do-Wah-Diddy-Diddy\" by Manfred Mann, and how a jazz group with a blues singer had one of the biggest bubblegum pop hits of the sixties.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"<a href=\"https://www.patreon.com/posts/49325069\">Walk on By\" by Dionne Warwick.</a>\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n<strong>Resources</strong>\n\nNo Mixcloud this week due to the number of tracks by Manfred Mann.\n\nInformation on the group comes from&nbsp;<a href=\"https://amzn.to/39qjUim\"><em>Mannerisms: The Five Phases of Manfred Mann</em>, by Greg Russo</a>, and from the liner notes of <a href=\"https://amzn.to/2P6AdtN\">this eleven-CD box set of the group's work</a>.\n\nFor a much cheaper collection of the group's hits -- but without the jazz, blues, and baroque pop elements that made them more interesting than the average sixties singles band -- <a href=\"https://amzn.to/3tZCDsQ\">this</a> has all the hit singles.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript:</strong>\n\nSo far, when we've looked at the British blues and R&B scene, we've concentrated on the bands who were influenced by Chicago blues, and who kept to a straightforward guitar/bass/drums lineup.\n\nBut there was another, related, branch of the blues scene in Britain that was more musically sophisticated, and which while its practitioners certainly enjoyed playing songs by Howlin' Wolf or Muddy Waters, was also rooted in the jazz of people like Mose Allison. Today we're going to look at one of those bands, and at the intersection of jazz and the British R&B scene, and how a jazz band with a flute player and a vibraphonist briefly became bubblegum pop idols. We're going to look at \"Do Wah Diddy Diddy\" by Manfred Mann:\n\n[Excerpt: Manfred Mann, \"Do Wah Diddy Diddy\"]\n\nManfred Mann is, annoyingly when writing about the group, the name of both a band and of one of its members. Manfred Mann the human being, as opposed to Manfred Mann the group, was born Manfred Lubowitz in South Africa, and while he was from a wealthy family, he was very opposed to the vicious South African system of apartheid, and considered himself strongly anti-racist.\n\nHe was also a lover of jazz music, especially some of the most progressive music being made at the time -- musicians like Ornette Coleman, Charles Mingus, and John Coltrane -- and he soon became a very competent jazz pianist, playing with musicians like Hugh Masakela at a time when that kind of fraternisation between people of different races was very much frowned upon in South Africa.\n\nManfred desperately wanted to get out of South Africa, and he took his chance in June 1961, at the last point at which he was a Commonwealth citizen.\n\nThe Commonwealth, for those who don't know, is a political association of countries that were originally parts of the British Empire, and basically replaced the British Empire when the former colonies gained their independence. These days, the Commonwealth is of mostly symbolic importance, but in the fifties and sixties, as the Empire was breaking up, it was considered a real power in its own right, and in particular, until some changes to immigration law in the mid sixties, Commonwealth citizens had the right to move to the UK.\n\nAt that point, South Africa had just voted to become a republic, and there was a rule in the Commonwealth that countries with a head of state other than the Queen could only remain in the Commonwealth with the unanimous agreement of all the other members. And several of the other member states, unsurprisingly, objected to the continued membership of a country whose entire system of government was based on the most virulent racism imaginable.\n\nSo, as soon as South Africa became a republic, it lost its Commonwealth membership, and that meant that its citizens lost their automatic right to emigrate to the UK. But they were given a year's grace period, and so Manfred took that chance and moved over to England, where he started playing jazz keyboards, giving piano lessons, and making some money on the side by writing record reviews. For those reviews, rather than credit himself as Manfred Lubowitz, he decided to use a pseudonym taken from the jazz drummer Shelly Manne, and he became Manfred Manne -- spelled with a silent e on the end, which he later dropped.\n\nMann was rather desperate for gigs, and he ended up taking a job playing with a band at a Butlin's holiday camp. Graham Bond, who we've seen in several previous episodes as the leader of The Graham Bond Organisation, was at that time playing Hammond organ there, but only wanted to play a few days a week. Mann became the substitute keyboard player for that holiday camp band, and struck up a good musical rapport with the drummer and vibraphone player, Mike Hugg. When Bond went off to form his own band, Mann and Hugg decided to form their own band along the same lines, mixing the modern jazz that they liked with the more commercial R&B that Bond was playing.\n\nThey named their group the Mann-Hugg Blues Brothers, and it initially consisted of Mann on keyboards, Hugg on drums and vibraphone, Mike Vickers on guitar, flute, and saxophone, Dave Richmond on bass, Tony Roberts and Don Fay on saxophone and Ian Fenby on trumpet.\n\nAs their experiences were far more in the jazz field than in blues, they decided that they needed to get in a singer who was more familiar with the blues side of things. The person they chose was a singer who was originally named Paul Pond, and who had been friends for a long time with Brian Jones, before Jones had formed the Rolling Stones. While Jones had been performing under the name Elmo Lewis, his friend had taken on Jones' surname, as he thought \"Paul Pond\" didn't sound like a good name for a singer. He'd first kept his initials, and performed as P.P. Jones, but then he'd presumably realised that \"pee-pee\" is probably not the best stage name in the world, and so he'd become just Paul Jones, the name by which he's known to this day.\n\nJones, like his friend Brian, was a fan particularly of Chicago blues, and he had occasionally appeared with Alexis Korner. After auditioning for the group at a ska club called The Roaring 20s, Jones became the group's lead singer and harmonica player, and the group soon moved in Jones' musical direction, playing the kind of Chicago blues that was popular at the Marquee club, where they soon got a residency, rather than the soul style that was more popular at the nearby Flamingo club, and which would be more expected from a horn-centric lineup.\n\nUnsurprisingly, given this, the horn players soon left, and the group became a five-piece core of Jones, Mann, Hugg, Vickers, and Richmond. This group was signed to HMV records by John Burgess. Burgess was a producer who specialised in music of a very different style from what the Mann-Hugg Blues Brothers played. We've already heard some of his production work -- he was the producer for Adam Faith from \"What Do You Want?\" on:\n\n[Excerpt: Adam Faith, \"What Do You Want?\"]\n\nAnd at the time he signed the Mann-Hugg Blues Brothers, he was just starting to work with a new group, Freddie and the Dreamers, for whom he would produce several hits:\n\n[Excerpt: Freddie and the Dreamers, \"If You Gotta Make a Fool of Somebody\"]\n\nBurgess liked the group, but he insisted that they had to change their name -- and in fact, he insisted that the group change their name to Manfred Mann. None of the group members liked the idea -- even Mann himself thought that this seemed a little unreasonable, and Paul Jones in particular disagreed strongly with the idea, but they were all eventually mollified by the idea that all the publicity would emphasise that all five of them were equal members of the group, and that while the group might be named after their keyboard player, there were five members. The group members themselves always referred to themselves as \"the Manfreds\" rather than as Manfred Mann.\n\nThe group's first single showed that despite having become a blues band and then getting produced by a pop producer, they were still at heart a jazz group. \"Why Should We Not?\" is an instrumental led by Vickers' saxophone, Mann's organ, and Jones' harmonica:\n\n[Excerpt: Manfred Mann, \"Why Should We Not?\"]\n\nUnsurprisingly, neither that nor the B-side, a jazz instrumental version of \"Frere Jacques\", charted -- Britain in 1963 wanted Gerry and the Pacemakers and Freddie and the Dreamers, not jazz instrumentals. The next single, an R&B song called \"Cock-A-Hoop\" written by Jones, did little better.\n\nThe group's big breakthrough came from Ready, Steady, Go!, which at this point was using \"Wipe Out!\" by the Surfaris as its theme song:\n\n[Excerpt: The Surfaris, \"Wipe Out\"]\n\nWe've mentioned Ready, Steady, Go! in passing in previous episodes, but it was the most important pop music show of the early and mid sixties, just as Oh Boy! had been for the late fifties. Ready, Steady, Go! was, in principle at least, a general pop music programme, but in practice it catered primarily for the emerging mod subculture.\n\n\"Mod\" stood for \"modernist\", and the mods emerged from the group of people who liked modern jazz rather than trad, but by this point their primary musical interests were in soul and R&B. Mod was a working-class subculture, based in the South-East of England, especially London, and spurred on by the newfound comparative affluence of the early sixties, when for the first time young working-class people, while still living in poverty, had a small amount of disposable income to spend on clothes, music, and drugs. The Mods had a very particular sense of style, based around sharp Italian suits, pop art and op art, and Black American music or white British imitations of it. For them, music was functional, and primarily existed for the purposes of dancing, and many of them would take large amounts of amphetamines so they could spend the entire weekend at clubs dancing to soul and R&B music.\n\nAnd that entire weekend would kick off on Friday with Ready, Steady, Go!, whose catchphrase was \"the weekend starts here!\"\n\nReady, Steady, Go! featured almost every important pop act of the early sixties, but while groups like Gerry and the Pacemakers or the Beatles would appear on it, it became known for its promotion of Black artists, and it was the first major British TV exposure for Motown artists like the Supremes, the Temptations, and the Marvelettes, for Stax artists like Otis Redding, and for blues artists like John Lee Hooker and Sonny Boy Williamson. Ready Steady Go! was also the primary TV exposure for British groups who were inspired by those artists, and it's through Ready Steady Go! that the Animals, the Yardbirds, the Rolling Stones, Them, and the Who, among others reached national popularity -- all of them acts that were popular among the Mods in particular.\n\nBut \"Wipe Out\" didn't really fit with this kind of music, and so the producers of Ready Steady Go were looking for something more suitable for their theme music. They'd already tried commissioning the Animals to record something, as we saw a couple of weeks back, but that hadn't worked out, and instead they turned to Manfred Mann, who came up with a song that not only perfectly fit the style of the show, but also handily promoted the group themselves:\n\n[Excerpt: Manfred Mann, \"5-4-3-2-1\"]\n\nThat was taken on as Ready, Steady, Go!s theme song, and made the top five in the UK. But by the time it charted, the group had already changed lineup.\n\nDave Richmond was seen by the other members of the group as a problem at this point. Richmond was a great bass player, but he was a great *jazz* bass player -- he wanted to be Charles Mingus, and play strange cross-rhythms, and what the group needed at this point was someone who would just play straightforward blues basslines without complaint -- they needed someone closer to Willie Dixon than to Mingus.\n\nTom McGuinness, who replaced him, had already had a rather unusual career trajectory. He'd started out as a satirist, writing for the magazine Private Eye and the TV series That Was The Week That Was, one of the most important British comedy shows of the sixties, but he had really wanted to be a blues musician instead. He'd formed a blues band, The Roosters, with a guitarist who went to art school with his girlfriend, and they'd played a few gigs around London before the duo had been poached by the minor Merseybeat band Casey Jones and his Engineers, a group which had been formed by Brian Casser, formerly of Cass & The Cassanovas, the group that had become The Big Three. Casey Jones and his Engineers had just released the single \"One Way Ticket\":\n\n[Excerpt: Casey Jones and His Engineers, \"One-Way Ticket\"]\n\nHowever, the two guitarists soon realised, after just a handful of gigs, that they weren't right for that group, and quit. McGuinness' friend, Eric Clapton, went on to join the Yardbirds, and we'll be hearing more about him in a few weeks' time, but McGuinness was at a loose end, until he discovered that Manfred Mann were looking for a bass player. McGuinness was a guitarist, but bluffed to Paul Jones that he'd switched to bass, and got the job. He said later that the only question he'd been asked when interviewed by the group was \"are you willing to play simple parts?\" -- as he'd never played bass in his life until the day of his first gig with the group, he was more than happy to say yes to that.\n\nMcGuinness joined only days after the recording of \"5-4-3-2-1\", and Richmond was out -- though he would have a successful career as a session bass player, playing on, among others, \"Je t'Aime\" by Serge Gainsbourg and Jane Birkin, \"Your Song\" by Elton John, Labi Siffre's \"It Must Be Love\", and the music for the long-running sitcoms Only Fools and Horses and Last of the Summer Wine.\n\nAs soon as McGuinness joined, the group set out on tour, to promote their new hit, but also to act as the backing group for the Crystals, on a tour which also featured Johnny Kidd and the Pirates and Joe Brown and his Bruvvers.\n\nThe group's next single, \"Hubble Bubble Toil and Trouble\" was another original, and made number eleven on the charts, but the group saw it as a failure anyway, to the extent that they tried their best to forget it ever existed. In researching this episode I got an eleven-CD box set of the group's work, which contains every studio album or compilation they released in the sixties, a collection of their EPs, and a collection of their BBC sessions. In all eleven CDs, \"Hubble Bubble Toil and Trouble\" doesn't appear at all. Which is quite odd, as it's a perfectly serviceable, if unexceptional, piece of pop R&B:\n\n[Excerpt: Manfred Mann, \"Hubble Bubble Toil and Trouble\"]\n\nBut it's not just the group that were unimpressed with the record. John Burgess thought that the record only getting to number eleven was proof of his hypothesis that groups should not put out their own songs as singles. From this point on, with one exception in 1968, everything they released as an A-side would be a cover version or a song brought to them by a professional songwriter.\n\nThis worried Jones, who didn't want to be forced to start singing songs he disliked, which he saw as a very likely outcome of this edict. So he made it his role in the group to seek out records that the group could cover, which would be commercial enough that they could get hit singles from them, but which would be something he could sing while keeping his self-respect. His very first selection certainly met the first criterion.\n\nThe song which would become their biggest hit had very little to do with the R&B or jazz which had inspired the group. Instead, it was a perfect piece of Brill Building pop. The Exciters, who originally recorded it, were one of the great girl groups of the early sixties (though they also had one male member), and had already had quite an influence on pop music. They had been discovered by Leiber and Stoller, who had signed them to Red Bird Records, a label we'll be looking at in much more detail in an upcoming episode, and they'd had a hit in 1962 with a Bert Berns song, \"Tell Him\", which made the top five:\n\n[Excerpt: The Exciters, \"Tell Him\"]\n\nThat record had so excited a young British folk singer who was in the US at the time to record an album with her group The Springfields that she completely reworked her entire style, went solo, and kickstarted a solo career singing pop-soul songs under the name Dusty Springfield.\n\nThe Exciters never had another top forty hit, but they became popular enough among British music lovers that the Beatles asked them to open for them on their American tour in summer 1964. Most of the Exciters' records were of songs written by the more R&B end of the Brill Building songwriters -- they would record several more Bert Berns songs, and some by Ritchie Barrett, but the song that would become their most well-known legacy was actually written by Jeff Barry and Ellie Greenwich. Like many of Barry and Greenwich's songs, it was based around a nonsense phrase, but in this case the phrase they used had something of a longer history, though it's not apparent whether they fully realised that.\n\nIn African-American folklore of the early twentieth century, the imaginary town of Diddy Wah Diddy was something like a synonym for heaven, or for the Big Rock Candy Mountain of the folk song -- a place where people didn't have to work, and where food was free everywhere. This place had been sung about in many songs, like Blind Blake's \"Diddie Wah Diddie\":\n\n[Excerpt: Blind Blake, \"Diddie Wah Diddie\"]\n\nAnd a song written by Willie Dixon for Bo Diddley:\n\n[Excerpt: Bo Diddley, \"Diddy Wah Diddy\"]\n\nAnd \"Diddy\" and \"Wah\" had often been used by other Black artists, in various contexts, like Roy Brown and Dave Bartholomew's \"Diddy-Y-Diddy-O\":\n\n[Excerpt: Roy Brown and Dave Bartholomew, \"Diddy-Y-Diddy-O\"]\n\nAnd Junior and Marie's \"Boom Diddy Wah Wah\", a \"Ko Ko Mo\" knockoff produced by Johnny Otis:\n\n[Excerpt: Junior and Marie, \"Boom Diddy Wah Wah\"]\n\nSo when Jeff Barry and Ellie Greenwich wrote \"Do-Wah-Diddy\", as the song was originally called, they were, wittingly or not, tapping into a rich history of rhythm and blues music. But the song as Greenwich demoed it was one of the first examples of what would become known as \"bubblegum pop\", and is particularly notable in her demo for its very early use of the fuzz guitar that would be a stylistic hallmark of that subgenre:\n\n[Excerpt: Ellie Greenwich, \"Do-Wah-Diddy (demo)\"]\n\nThe Exciters' version of the song took it into more conventional girl-group territory, with a strong soulful vocal, but with the group's backing vocal call-and-response chant showing up the song's resemblance to the kind of schoolyard chanting games which were, of course, the basis of the very first girl group records:\n\n[Excerpt: The Exciters, \"Do-Wah-Diddy\"]\n\nSadly, that record only reached number seventy-eight on the charts, and the Exciters would have no more hits in the US, though a later lineup of the group would make the UK top forty in 1975 with a song written and produced by the Northern Soul DJ Ian Levine.\n\nBut in 1964 Jones had picked up on \"Do-Wah-Diddy\", and knew it was a potential hit.\n\nMost of the group weren't very keen on \"Do Wah Diddy Diddy\", as the song was renamed. There are relatively few interviews with any of them about it, but from what I can gather the only member of the band who thought anything much of the song was Paul Jones. However, the group did their best with the recording, and were particularly impressed with Manfred's Hammond organ solo -- which they later discovered was cut out of the finished recording by Burgess. The result was an organ-driven stomping pop song which had more in common with the Dave Clark Five than with anything else the group were doing:\n\n[Excerpt: Manfred Mann, \"Do Wah Diddy Diddy\"]\n\nThe record reached number one in both the UK and the US, and the group immediately went on an American tour, packaged with Peter & Gordon, a British duo who were having some success at the time because Peter Asher's sister was dating Paul McCartney, who'd given them a hit song, \"World Without Love\":\n\n[Excerpt: Peter and Gordon, \"World Without Love\"]\n\nThe group found the experience of touring the US a thoroughly miserable one, and decided that they weren't going to bother going back again, so while they would continue to have big hits in Britain for the rest of the decade, they only had a few minor successes in the States.\n\nAfter the success of \"Do Wah Diddy Diddy\", EMI rushed out an album by the group, The Five Faces of Manfred Mann, which must have caused some confusion for anyone buying it in the hope of more \"Do Wah Diddy Diddy\" style pop songs. Half the album's fourteen tracks were covers of blues and R&B, mostly by Chess artists -- there were covers of Muddy Waters, Howlin' Wolf, Bo Diddley, Ike & Tina Turner, and more. There were also five originals, written or co-written by Jones, in the same style as those songs, plus a couple of instrumentals, one written by the group and one a cover of Cannonball Adderly's jazz classic \"Sack O'Woe\", arranged to show off the group's skills at harmonica, saxophone, piano and vibraphone:\n\n[Excerpt: Manfred Mann, \"Sack O'Woe\"]\n\nHowever, the group realised that the formula they'd hit on with \"Do &nbsp;Wah Diddy Diddy\" was a useful one, and so for their next single they once again covered a girl-group track with a nonsense-word chorus and title -- their version of \"Sha La La\" by the Shirelles took them to number three on the UK charts, and number twelve in the US.\n\nThey followed that with a ballad, \"Come Tomorrow\", one of the few secular songs ever recorded by Marie Knight, the gospel singer who we discussed briefly way back in episode five, who was Sister Rosetta Tharpe's duet partner, and quite possibly her partner in other senses.\n\nThey released several more singles and were consistently charting, to the point that they actually managed to get a top ten hit with a self-written song despite their own material not being considered worth putting out as singles. Paul Jones had written \"The One in the Middle\" for his friends the Yardbirds, but when they turned it down, he rewrote the song to be about Manfred Mann, and especially about himself:\n\n[Excerpt: Manfred Mann, \"The One in the Middle\"]\n\nLike much of their material, that was released on an EP, and the EP was so successful that as well as making number one on the EP charts, it also made number ten on the regular charts, with \"The One in the Middle\" as the lead-off track.\n\nBut \"The One in the Middle\" was a clue to something else as well -- Jones was getting increasingly annoyed at the fact that the records the group was making were hits, and he was the frontman, the lead singer, the person picking the cover versions, and the writer of much of the original material, but all the records were getting credited to the group's keyboard player.\n\nBut Jones wasn't the next member of the group to leave. That was Mike Vickers, who went off to work in arranging film music and session work, including some work for the Beatles, the music for the film Dracula AD 1972, and the opening and closing themes for This Week in Baseball. The last single the group released while Vickers was a member was the aptly-titled \"If You Gotta Go, Go Now\". Mann had heard Bob Dylan performing that song live, and had realised that the song had never been released. He'd contacted Dylan's publishers, got hold of a demo, and the group became the first to release a version of the song, making number two in the charts:\n\n[Excerpt: Manfred Mann, \"If You Gotta Go, Go Now\"]\n\nBefore Vickers' departure, the group had recorded their second album, Mann Made, and that had been even more eclectic than the first album, combining versions of blues classics like \"Stormy Monday Blues\", Motown songs like \"The Way You Do The Things You Do\", country covers like \"You Don't Know Me\", and oddities like \"Bare Hugg\", an original jazz instrumental for flute and vibraphone:\n\n[Excerpt: Manfred Mann, \"Bare Hugg\"]\n\nMcGuinness took the opportunity of Vickers leaving the group to switch from bass back to playing guitar, which had always been his preferred instrument. To fill in the gap, on Graham Bond's recommendation they hired away Jack Bruce, who had just been playing in John Mayall's Bluesbreakers with McGuinness' old friend Eric Clapton, and it's Bruce who played bass on the group's next big hit, \"Pretty Flamingo\", the only UK number one that Bruce ever played on:\n\n[Excerpt: Manfred Mann, \"Pretty Flamingo\"]\n\nBruce stayed with the band for several months, before going off to play in another band who we'll be covering in a future episode. He was replaced in turn by Klaus Voorman. Voorman was an old friend of the Beatles from their Hamburg days, who had been taught the rudiments of bass by Stuart Sutcliffe, and had formed a trio, Paddy, Klaus, and Gibson, with two Merseybeat musicians, Paddy Chambers of the Big Three and Gibson Kemp of Kingsize Taylor and the Dominoes:\n\n[Excerpt: Paddy, Klaus, and Gibson, \"No Good Without You Baby\"]\n\nLike Vickers, Voorman could play the flute, and his flute playing would become a regular part of the group's later singles.\n\nThese lineup changes didn't affect the group as either a chart act or as an act who were playing a huge variety of different styles of music. While the singles were uniformly catchy pop, on album tracks, B-sides or EPs you'd be likely to find versions of folk songs collected by Alan Lomax, like \"John Hardy\", or things like \"Driva Man\", a blues song about slavery in 5/4 time, originally by the jazz greats Oscar Brown and Max Roach:\n\n[Excerpt: Manfred Mann, \"Driva Man\"]\n\nBut by the time that track was released, Paul Jones was out of the group. He actually announced his intention to quit the group at the same time that Mike Vickers left, but the group had persuaded him to stay on for almost a year while they looked for his replacement, auditioning singers like Rod Stewart and Long John Baldry with little success.\n\nThey eventually decided on Mike d'Abo, who had previously been the lead singer of a group called A Band of Angels:\n\n[Excerpt: A Band of Angels, \"(Accept My) Invitation\"]\n\nBy the point d'Abo joined, relations &nbsp;between the rest of the group and Jones were so poor that they didn't tell Jones that they were thinking of d'Abo -- Jones would later recollect that the group decided to stop at a pub on the way to a gig, ostensibly to watch themselves on TV, but actually to watch A Band of Angels on the same show, without explaining to Jones that that was what they were doing – Jones actually mentioned d'Abo to his bandmates as a possible replacement, not realising he was already in the group. Mann has talked about how on the group's last show with Jones, they drove to the gig in silence, and their first single with the new singer, a version of Dylan's \"Just Like a Woman\", came on the radio.\n\nThere was a lot of discomfort in the band at this time, because their record label had decided to stick with Jones as a solo performer, and the rest of the group had had to find another label, and were worried that without Jones their career was over. Luckily for everyone involved, \"Just Like a Woman\" made the top ten, and the group's career was able to continue. Meanwhile, Jones' first single as a solo artist made the top five:\n\n[Excerpt: Paul Jones, \"High Time\"]\n\nBut after that and his follow-up, \"I've Been a Bad, Bad, Boy\", which made number five, the best he could do was to barely scrape the top forty.\n\nManfred Mann, on the other hand, continued having hits, though there was a constant struggle to find new material. d'Abo was himself a songwriter, and it shows the limitations of the \"no A-sides by group members\" rule that while d'Abo was the lead singer of Manfred Mann, he wrote two hit singles which the group never recorded. The first, \"Handbags and Gladrags\", was a hit for Chris Farlowe:\n\n[Excerpt: Chris Farlowe, \"Handbags and Gladrags\"]\n\nThat was only a minor hit, but was later recorded successfully by Rod Stewart, with d'Abo arranging, and the Stereophonics. d'Abo also co-wrote, and played piano on, \"Build Me Up Buttercup\" by the Foundations:\n\n[Excerpt: The Foundations, \"Build Me Up Buttercup\"]\n\nBut the group continued releasing singles written by other people. &nbsp;Their second post-Jones single, from the perspective of a spurned lover insulting their ex's new fiancee, had to have its title changed from what the writers intended, as the group felt that a song insulting \"semi-detached suburban Mr. Jones\" might be taken the wrong way. Lightly retitled, \"Semi-Detached Suburban Mr. James\" made number two, while the follow-up, \"Ha Ha! Said the Clown\", made number four.\n\nThe two singles after that did significantly less well, though, and seemed to be quite bizarre choices -- an instrumental Hammond organ version of Tommy Roe's \"Sweet Pea\", which made number thirty-six, and a version of Randy Newman's bitterly cynical \"So Long, Dad\", which didn't make the charts at all.\n\nAfter this lack of success, the group decided to go back to what had worked for them before. They'd already had two hits with Dylan songs, and Mann had got hold of a copy of Dylan's Basement Tapes, a bootleg which we'll be talking about later. He picked up on one song from it, and got permission to release \"The Mighty Quinn\", which became the group's third number one:\n\n[Excerpt: Manfred Mann, \"The Mighty Quinn\"]\n\nThe album from which that came, Mighty Garvey, is the closest thing the group came to an actual great album. While the group's earlier albums were mostly blues covers, this was mostly made up of original material by either Hugg or d'Abo, in a pastoral baroque pop style that invites comparisons to the Kinks or the Zombies' material of that period, but with a self-mocking comedy edge in several songs that was closer to the Bonzo Dog Doo-Dah Band. Probably the highlight of the album was the mellotron-driven \"It's So Easy Falling\":\n\n[Excerpt: Manfred Mann, \"It's So Easy Falling\"]\n\nBut Mighty Garvey didn't chart, and it was the last gasp of the group as a creative entity. They had three more top-ten hits, all of them good examples of their type, but by January 1969, Tom McGuinness was interviewed saying \"It's not a group any more. It's just five people who come together to make hit singles. That's the only aim of the group at the moment -- to make hit singles -- it's the only reason the group exists. Commercial success is very important to the group. It gives us financial freedom to do the things we want.\"\n\nThe group split up in 1969, and went their separate ways. d'Abo appeared on the original Jesus Christ Superstar album, and then went into writing advertising jingles, most famously writing \"a finger of fudge is just enough\" for Cadbury's. McGuinness formed McGuinness Flint, with the songwriters Gallagher and Lyle, and had a big hit with \"When I'm Dead and Gone\":\n\n[Excerpt: McGuinness Flint, \"When I'm Dead and Gone\"]\n\nHe later teamed up again with Paul Jones, to form a blues band imaginatively named \"the Blues Band\", who continue performing to this day:\n\n[Excerpt: The Blues Band, \"Mean Ol' Frisco\"]\n\nJones became a born-again Christian in the eighties, and also starred in a children's TV show, Uncle Jack, and presented the BBC Radio 2 Blues Programme for thirty-two years.\n\nManfred Mann and Mike Hugg formed another group, Manfred Mann Chapter Three, who released two albums before splitting. Hugg went on from that to write for TV and films, most notably writing the theme music to \"Whatever Happened to the Likely Lads?\":\n\n[Excerpt: Highly Likely, \"Whatever Happened to the Likely Lads?\"]\n\nMann went on to form Manfred Mann's Earth Band, who had a number of hits, the biggest of which was the Bruce Springsteen song \"Blinded by the Light\":\n\n[Excerpt: Manfred Mann's Earth Band, \"Blinded by the Light\"]\n\nAlmost uniquely for a band from the early sixties, all the members of the classic lineup of Manfred Mann are still alive.\n\nManfred Mann continues to perform with various lineups of his Earth Band. Hugg, Jones, McGuinness, and d'Abo reunited as The Manfreds in the 1990s, with Vickers also in the band until 1999, and continue to tour together -- I still have a ticket to see them which was originally for a show in April 2020, but has just been rescheduled to 2022. McGuinness and Jones also still tour with the Blues Band. And Mike Vickers now spends his time creating experimental animations.\n\nManfred Mann were a band with too many musical interests to have a coherent image, and their reliance on outside songwriters and their frequent lineup changes meant that they never had the consistent sound of many of their contemporaries. But partly because of this, they created a catalogue that rewards exploration in a way that several more well-regarded bands' work doesn't, and I wouldn't be at all surprised to see a major critical reassessment of them at some point. But whether that happens or not, almost sixty years on people around the world still respond instantly to the opening bars of their biggest hit, and \"Do Wah Diddy Diddy\" remains one of the most fondly remembered singles of the early sixties.",
  "enclosure": "",
  "itunes:summary": "Episode 118 of A History of Rock Music in Five Hundred Songs looks at \"Do-Wah-Diddy-Diddy\" by Manfred Mann, and how a jazz group with a blues singer had one of the biggest bubblegum pop hits of the sixties.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"Walk on By\" by Dionne Warwick.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\nResources\n\nNo Mixcloud this week due to the number of tracks by Manfred Mann.\n\nInformation on the group comes from&nbsp;Mannerisms: The Five Phases of Manfred Mann, by Greg Russo, and from the liner notes of this eleven-CD box set of the group's work.\n\nFor a much cheaper collection of the group's hits -- but without the jazz, blues, and baroque pop elements that made them more interesting than the average sixties singles band -- this has all the hit singles.\n\nPatreon\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\nTranscript:\n\nSo far, when we've looked at the British blues and R&B scene, we've concentrated on the bands who were influenced by Chicago blues, and who kept to a straightforward guitar/bass/drums lineup.\n\nBut there was another, related, branch of the blues scene in Britain that was more musically sophisticated, and which while its practitioners certainly enjoyed playing songs by Howlin' Wolf or Muddy Waters, was also rooted in the jazz of people like Mose Allison. Today we're going to look at one of those bands, and at the intersection of jazz and the British R&B scene, and how a jazz band with a flute player and a vibraphonist briefly became bubblegum pop idols. We're going to look at \"Do Wah Diddy Diddy\" by Manfred Mann:\n\n[Excerpt: Manfred Mann, \"Do Wah Diddy Diddy\"]\n\nManfred Mann is, annoyingly when writing about the group, the name of both a band and of one of its members. Manfred Mann the human being, as opposed to Manfred Mann the group, was born Manfred Lubowitz in South Africa, and while he was from a wealthy family, he was very opposed to the vicious South African system of apartheid, and considered himself strongly anti-racist.\n\nHe was also a lover of jazz music, especially some of the most progressive music being made at the time -- musicians like Ornette Coleman, Charles Mingus, and John Coltrane -- and he soon became a very competent jazz pianist, playing with musicians like Hugh Masakela at a time when that kind of fraternisation between people of different races was very much frowned upon in South Africa.\n\nManfred desperately wanted to get out of South Africa, and he took his chance in June 1961, at the last point at which he was a Commonwealth citizen.\n\nThe Commonwealth, for those who don't know, is a political association of countries that were originally parts of the British Empire, and basically replaced the British Empire when the former colonies gained their independence. These days, the Commonwealth is of mostly symbolic importance, but in the fifties and sixties, as the Empire was breaking up, it was considered a real power in its own right, and in particular, until some changes to immigration law in the mid sixties, Commonwealth citizens had the right to move to the UK.\n\nAt that point, South Africa had just voted to become a republic, and there was a rule in the Commonwealth that countries with a head of state other than the Queen could only remain in the Commonwealth with the unanimous agreement of all the other members. And several of the other member states, unsurprisingly, objected to the continued membership of a country whose entire system of government was based on the most virulent racism imaginable.\n\nSo, as soon as South Africa became a republic, it lost its Commonwealth membership, an",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 118 of A History of Rock Music in Five Hundred Songs looks at \"Do-Wah-Diddy-Diddy\" by Manfred Mann, and how a jazz group with a blues singer had one of the biggest bubblegum pop hits of the sixties.\n\nClick the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a thirteen-minute bonus episode available, on \"Walk on By\" by Dionne Warwick.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\nResources\n\nNo Mixcloud this week due to the number of tracks by Manfred Mann.\n\nInformation on the group comes from&nbsp;Mannerisms: The Five Phases of Manfred Mann, by Greg Russo, and from the liner notes of this eleven-CD box set of the group's work.\n\nFor a much cheaper collection of the group's hits -- but without the jazz, blues, and baroque po",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}