{
  "title": "Writing and Thinking Less Badly with Mike Munger",
  "pubDate": "Fri, 14 Oct 2016 18:32:17 +0000",
  "guid": "be7d70fc0245aea55c08a432d08736fb",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EPMunger_EDR.mp3",
  "itunes:image": "",
  "description": "<p>In this episode, I discuss the process of writing and being successful with Mike Munger. What follows is an edited transcript of our conversation.</p> <hr /> <p><strong>Petersen:</strong> My guest today is Mike Munger of Duke University. Mike, welcome to Economics Detective Radio!</p> <p><strong>Munger:</strong> It's a pleasure to be on your show!</p> <p><strong>Petersen:</strong> So first I stole EconTalk's format and now I have stolen Mike Munger as well, so if Russ Roberts sends me a cease and desist letter, I'll completely understand why.</p> <p><strong>Munger:</strong> Russ and I have an open relationship. We both date other people.</p> <p><strong>Petersen:</strong> Oh good, good. I have many jokes I could make about that, but I won't!</p> <p><strong>Munger:</strong> Thank you for not.</p> <p><strong>Petersen:</strong> So, our topic today is going to be writing and thinking. Let's say that because, as we'll go through, the two are intimately related. So Mike wrote a piece titled <a href= \"http://www.chronicle.com/article/10-Tips-on-How-to-Write-Less/124268/\" target=\"_blank\">\"Ten Tips on How to Write Less Badly.\"</a> Now you may be thinking to yourself, \"Hey I thought this was an economics podcast! What does writing have to do with economics?\"</p> <p>Well, writing is what economists do and if you write either for your career, or your hobbies, I'm sure you'll find something in this discussion that will be helpful to you. So Mike, you start your piece by saying that you've seen many talented people fail because they couldn't or didn't write. I think the impression a lot of people get while growing up is that writing is the easy subject and that math and science are hard, so how is it that these talented people get tripped up by writing of all things?</p> <p><strong>Munger:</strong> Well, writing at all is not that difficult, I suppose like running at all is not that difficult. Most of us can at least run 10 meters. The point is that, if you want to be a professional economist, you are one of those people who actually found math pretty easy and you may not have practiced writing very much. So, I said, I've seen a lot of talented people fail because I was Department Chair here at Duke for 10 years and it's hard to get tenure at Duke, it's not a reward for past behavior, it's a hire. We are trying to guess if you're going to continue to produce interesting and important research after all material incentive to do that has been removed. Because once you have tenure you basically can't be fired. It's not quite true, but it's pretty close to true.</p> <p>So you get six years, I've watched 8 people doing this while I was Chair. You get six years to develop your research agenda and to show that you are going to continue to publish after you no longer have any incentive to do that. Now, what a lot of people do is, for four years they'll work on a few things but not very assiduously and the last two years they will work furiously and they'll have two or three things forthcoming and say, well, like it's a video game, I've done enough to get tenure. What they're saying is, if you ever give me tenure I will never publish anything ever again, which not surprisingly doesn't work out well. So six of the eight people who came up were fired. And when I, as Chair, had to tell them this, they cried, they were surprised, which probably means that I am a bad Chair, but I had tried to communicate over and over again that they needed to develop a research agenda and the way to do that is to write about it, and to write about it every day. That doesn't mean that everything that you'll write will eventually be used, but again, I would go back to the running analogy. Or let's say a soccer game.</p> <p>Suppose you knew those six months from now, you'll have a very important soccer game. You wouldn't wait until the night before the soccer game and practice all night. You would practice for an hour or two every day, recover, think about it, try to get better, but that's not how we do writing. All of us, who are at the level of thinking about graduate school and economics, are clever monkeys. We have always been good enough, that we can wait until the night before and write some bunch of crap and have it be good enough, because we're smarter than the other people. Well, now you're in with a group of people all of whom have always been able to do that and some of them are going to figure out that if you actually starts six months in advance, and work on the thing every day, and throw away most of it, time after time, and start over, your paper is going to be a lot better. And if you look at the books and articles that you think are important, the very things that got you excited about being in economics in the first place, none of those, not one, did the author stay up the night before it was due and write it.</p> <p>Adam Smith worked for years on 'The Wealth of Nations.' He showed it to people, he talked to people, he went for walks and muttered to himself. At one point he was so obsessed with what he was thinking about, he walked right into a noisome sump, that is the chemicals leftover after you have tanned leather. He didn't even notice where he was going! It smelled terrible, he didn't even notice by sight or smell because he was so busy thinking about this stuff, that he had been working on for years and would continue to work on for years. So part of this is my own cri de coeur, my own cry from the heart saying, it's so hard to watch talented people fail when they could have succeeded, because they didn't get this simple message---you have to teach other people. Sometimes you do it in the classroom, most of the time you do it through your writing. If you don't get good at that, you're going to fail. So don't start. If you don't think you want to write, don't become an academic in the first place.</p> <p><strong>Petersen:</strong> Yeah, I guess another analogy is, you can be very naturally adept at swimming and that can make you an above average swimmer, but not one of those people swimming at the Olympics isn't both an above average swimmer naturally, and someone who has trained day after day, after day to be there.</p> <p><strong>Munger:</strong> Not just at the Olympics. This is if you want to enter a swimming contest at the local YMCA, those other people are on the top one half of one percent. They're not near the Olympics, but they're going to kick your butt unless you've been practicing and practicing and practicing.</p> <p><strong>Petersen:</strong> Yeah, and I guess undergraduate education is less like the YMCA; it's sort of the kiddie pool. You really can get by without practice, but you won't necessarily get much out of it.</p> <p><strong>Munger:</strong> You won't learn much about writing, and what you write won't be very good, it will just be good enough, that because you're clever and good at this you can produce something that the professor is going to read and say \"Ok, I sort of see what the argument is, that's better than the others: A.\" So that's not a 'good enough' it's just a 'better that the other losers' who aren't going to get to graduate school in the first place. And by losers I mean, people who are going to have successful lives.</p> <p><strong>Petersen:</strong> Yeah, we have a funny definition of winning in academia.</p> <p><strong>Munger:</strong> It's not clear you're really want to win. Although, to be fair getting tenure someplace and having the ability to write every day about the stuff you are interested in, there really is no better life. The problem is with the six or eight and in my case ten years, because I had a hard time finding a job, that went before that.</p> <p><strong>Petersen:</strong> Yeah, so that's covered your first tip in that essay, which was, \"writing is an exercise.\" The second tip was to set goals based on an output, not input. Can you explain that?</p> <p><strong>Munger:</strong> One of the things that junior people do and that graduate students also do is to define how hard they're working by how long they spend outside of their apartment and in their office and they might even be at their desk, they might be in a coffee shop. What they're not doing, is facing the terrors of that blinking cursor. So the difficulty with any metric based on inputs is that you're not thinking, \"am I actually doing something?\" A metric that's based on output focuses more on writing. Now, that can be misleading because you can write badly but the same thing would be true of running or swimming. Sometimes when you have a workout it doesn't go that well but at least you're doing it so you wouldn't define how hard you work out by how much time you spent in the gym. You would say what exercises you actually did. It makes no more sense than that to define how hard you work by how much time you spent in the office, going to other offices, drinking coffee, talking to people, checking Facebook. None of that actually counts. So you have to set very high goal, five hundred, seven hundred fifty words per day, every day, five days a week and you will be a famous and successful academic. That again is the sort of dirty secret since no one does this. A lot of economics articles are only ten or twelve thousand words. So if you write five hundred words a day and you end up throwing away three hundred of those words you're still every ten days going to have two thousand usable words. So twice or three times a year you're going to have enough to have a journal article even if you're throwing away 60% of what you write. And here's the other thing: you learn by writing. What I find frustrating is a lot of people will count reading as work and it's not.</p> <p>Reading is an important input to work just like sleep and having a good breakfast. But in order to be an academic you have to write and the nice thing about writing is, you're writing along and you think, \"oh right I understand this.\" You're trying to summarize the argument of some thinker and you realize \"I don't understand it!\" Now you go back and you read it, but you read it in a way that allows you to engage in a conversation with that writer. The nice thing about writing is that it allows you to communicate over time and space. I can look at something that was written 300 years ago and try to divine what was in the mind of that writer, what is he or she trying to communicate. And good writing creates in my mind an image or a logic similar to what was in that person's mind even though they're distant in time and space. So when I'm writing I read things differently. I've seen people count as reading, they go through a book, they go through an article they have three different colors of highlighting and they always think they're going to come back. None of that actually went through their brain. But if you're writing then you go to read something, you're looking for a specific question. You read better. So I actually ask my graduate students when they're working on their dissertation, on their third or fourth year, to put up a three by five card in their workspace that says: \"Don't read, write! If you're writing you'll become a better reader.\"</p> <p><strong>Petersen:</strong> Yeah, there's an irony in someone who has gone through years of economics education, who could explain to you exactly why the labor theory of value is not correct, applying it to their own work implicitly.</p> <p><strong>Munger:</strong> Absolutely, it's \"My day was valuable, I spent 11 hours at the office. Holy cow!\"</p> <p><strong>Petersen:</strong> Yeah, my own version of that was at the end of my first year of my PhD, I spent a lot of time in the office and I realized that I spent so little time at home that I actually only went through I think one full roll of toilet paper. So it's sort of the metric being what I didn't do which was spend time at home and therefore in my own bathroom.</p> <p><strong>Munger:</strong> We get it. We get it Garrett. But it is interesting, that's necessary but not sufficient for success. Jim Buchanan always said, \"The key to success is apply the behind.\" He didn't say \"behind,\" he used a different word, but apply your behind to the chair. So you're actually in the chair at your desk and you are writing. Now for him that meant moving a pen across a piece of paper, for us it means typing on a keyboard. Either way, if you apply your behind to the chair---the actual chair at your desk, not the one in front of the desk of one of your friends so you can drink coffee and talk---you'll get a lot done. You'll learn a lot and you'll notice after just a couple of years that there's a divergence, not only in your ability to write but in your understanding of a lot of key issues because you've thought of these things pretty deeply. And the thing that's interesting about that is other people who haven't been writing may at one point have been ahead of you. Maybe they were better at classes but you have to learn to make the transition between being good at taking classes---which is why many of us want to go to graduate school---to being good at expressing our thoughts on paper in a way that other people find interesting. So the emphasis on classes is misleading, your first year in class, second year in class---you get A's but you haven't really developed your own research agenda. That's not as good as the person that actually practices, works on writing and after a year or two has developed a talent.</p> <p>Adam Smith has an interesting story about this with <a href= \"http://www.econlib.org/library/Smith/smWN1.html\" target= \"_blank\">the Street Porter and the Philosopher</a>. So the Street Porter and the Philosopher are not as different as the Philosopher wants to think. The difference was the Street Porter spent a lot of time carrying bags and the Philosopher spent a lot of time reading and writing. Well after just a few years they seem like different people but it's because, hour by hour, the philosopher spent time writing. You can be the Philosopher. If you don't write, you're going to stay the Street Porter.</p> <p><strong>Petersen:</strong> Another tip you give is to find a voice. Don't just get published. But isn't getting published the point? What's wrong with making that your end goal?</p> <p><strong>Munger:</strong> Let's think about entrepreneurs. Suppose you have two people who fancy themselves to be entrepreneurs. One of them says, \"I want to make profits, I don't care how.\" The other one says \"I have a vision of this great product that's going to transform this industry.\" Who's more likely to make profit? The second, paradoxically the second. Well if I say \"I don't care about what I write I just want to get published,\" my work is going to suck. It's going to lack any kind of imagination or motivation or the reader is going to look at it and say \"I don't even understand why this guy is writing.\" But the person that's found something that he or she is passionate about is actually more likely to get stuff published. So paradoxically the way to be published is to be passionate about what you're writing. If all you're trying to do is get published, that's going to come through. It will just seem instrumental and not very interesting.</p> <p><strong>Petersen:</strong> Yes. So Scott Alexander writing at Slate Star Codex had an article recently where he made the distinction between what he called <a href= \"http://slatestarcodex.com/2016/07/18/pushing-and-pulling-goals/\" target=\"_blank\">pushing and pulling goals</a>, where a pull goal is when you want to achieve something so you come up with a plan and a structure. Whereas a push goal is where you have a plan and a structure so you'd scramble to try to find something to achieve. This strikes me as another version of the same thing where to just \"get published,\" you know you want thirty pages double spaced with some graphs in there and you don't really care what your message is. That's just not a good way to write is what I'm hearing.</p> <p><strong>Munger:</strong> Right. It's not a good way to write good things and again Jim Buchanan, who is one of my heroes, when he would interview perspective job candidates, particularly people who were young, he would pose them a question. I'm not quoting him exactly but it was something close to this: Supposed you have three choices. A) You could be for or five years the most famous economist writing for The New York Times and be on talk shows. B) You can win a Nobel Prize. C) You can write something that people are still going to read one hundred years from now. Which one would you pick? And Jim was---he actually achieved B obviously, he won the Nobel Prize---but he was interested in people who at least had some aspiration to write something that someone's going to want to read a hundred years from now. Now you may fail in that, but if there's not something that you're working on that at least has that aspiration, then it's going to come across that your work is just shallow, superficial, not very important and honestly not really worth doing.</p> <p><strong>Petersen:</strong> That has got to be the hardest interview question I've ever heard.</p> <p><strong>Munger:</strong> Well he was pretty scary, I actually interviewed at George Mason and talked to him and I was desperate for this job. I really wanted the position at George Mason and it turns out Jim Buchanan found me wanting, so I went through this and ended up on the wrong side of that line and it has stuck with me. So, now I do try to have some answers to that question at least to myself. So I try to work on things that are of some importance, but it was terrifying to be interviewed by him anyway. And when he asked that question, you're really just trying to get a job, you haven't published anything, you're trying to finish your thesis, that sort of seems far away. But he was absolutely right to want people who have that kind of mindset.</p> <p><strong>Petersen:</strong> One of your tips is that everyone's unwritten work is brilliant. How is it brilliant?</p> <p><strong>Munger:</strong> Well in my mind I have an argument and the premises make sense. The logic by which those premises are developed and integrated makes good sense and the conclusion is important. Now the problem is when I write it down. It turns out there's some holes in it, and when I examine those holes and sort of work at them---it's like you're thinking about moving into an apartment and you touch the wall, the wall gives way and a bunch of cockroaches come out. Ahhh it's pretty scary! Most of us, these are the arguments that we have in mind, particularly if you haven't really been writing, and by writing I would count a model. So I have an intuition about how something's going to work. I work out the steps in the model and it turns out step four is \"a miracle occurs here.\" Well you can't actually use a miracle as a step in an argument and that means the argument is not very good but you don't know that until you write it out. But that's why many people don't write it out. And one of the things that I talk about in the article is \"don't be that guy,\" and the guy that I have in mind, I actually knew a person like this.</p> <p>Most graduate students when I talk to them say, \"oh yeah, I know that guy.\" The guy is a third or fourth or eighth year graduate student and you meet him in a bar or somebody's house and he's got a cigarette and in the other hand he has a drink. He takes a long hole in the cigarette and then for two or three minutes he tells you what his dissertation is about. And you say, \"Holy smokes that's amazing! What you're going to do is so important!\" And you tell somebody else that the next day at the office and they just laugh and say, \"Yeah he's been working on that two-hundred-word speech for five years. He's never written anything.\" So you know, the young people are all terrified of this guy. The older people realize he's a loser because the older people all realize they have trouble summarizing their argument because they're in the middle of writing it and there are several places, where it says \"a miracle occurs here.\" He hasn't thought about it enough to know where the impossible miracles will be required in his argument, he's just smoothed this over and he's practiced this pat little pathetic speech.</p> <p>So if you're working as hard as you need to be you're going to be confused and miserable and not sure that it's right because only unwritten work is brilliant. If you're actually working on it you know better than anyone else where all the holes are and where all the places where if you touch the wall the cockroaches come pouring out. So don't be that guy. It's easy to be the hero. And notice that this 8th year grade student only hangs out with the first and second year grad student because these are the only people that still believe his crap.</p> <p><strong>Petersen:</strong> Yeah one of the most frustrating things about being human is how little connection there is between the way our brains seem to work, from when we're sort of observing ourselves from the inside, and the way they actually work. So when psychology really came into its own as a field, the psychologists quickly discovered that introspection really wouldn't get them very far because it's so misleading trying to study a brain from the inside and part of this is your brain can come up with some really half-baked ideas that seem so brilliant.</p> <p><strong>Munger:</strong> There's a lot of plausible things. It just turns out that a lot of those possible things seem to be false. And if what you do is practice making them sound more plausible, you can fool people but that's why we have con artists. So you're exactly right. Human beings are basically set up to accept confidence for authority but they're not the same thing. Authority is someone who's really thought about it has developed an argument. Confidence is someone who has refused to develop the argument and just believes out of faith that they're correct and they practice their little thought. So another way to put it, and you're right to bring up psychology because we can be fooled by confidence into thinking that it's authority.</p> <p><strong>Petersen:</strong> Yeah. If you've ever had a dream where you had a great idea in the dream and then you wake up and think, \"Oh my God, that idea is so brilliant I've got to write it down!\" And it's always just total nonsense because your sleepy monkey brain just made you think it was great.</p> <p><strong>Munger:</strong> That actually happened to me. I went to college in the 70's and there were substances involved and so under the influence of some substance I would have an idea which I was convinced was brilliant and would write it down and of course the next morning I thought, \"Wow, that's really stupid.\"</p> <p><strong>Petersen:</strong> Oh no. At least you wrote it down. You didn't spend years pursuing it.</p> <p><strong>Munger:</strong> Even then I wrote it, yes.</p> <p><strong>Petersen:</strong> So one of the tips you have is to pick a puzzle. What do you mean by that?</p> <p><strong>Munger:</strong> Well it's often hard to get started. So there are two reasons to pick a puzzle, one is that it's actually interesting, and the other is that it's rhetorically useful to be able to engage the attention of the reader. So I give examples of different puzzles in economics. One of the most common is \"Theory says this, empirical results say this, they are contradictory. What's missing from the theory or how has the empirical test been conducted badly?\" Another would be \"Person A and Person B have the same set of assumptions but they come to a different conclusion. What is it about their models that causes this divergence?\"</p> <p>So if you have a puzzle like that, and the most important one. The third one, the most important one is \"Suppose that there's this phenomenon and we don't really understand it and then there's this other apparently unrelated phenomenon, we don't really understand that. What turns out when you think of it correctly, both of them are the result of this economic principle and no one has recognized the fact that we can tie all this together.\" So as theories become stronger, they generally become simpler and more general. So an increase in simplicity and generality means that you can bring more apparently different phenomenon under a single explanatory umbrella and that's interesting to say, you think this is different but it's the same. So it's both a good research technique if you can do it, and it's engaging to the reader. So if you're not sure how to start thinking in those terms then the easiest one here is \"Theory says this thing, empirical results say this. Do we need a better theory or better testing?\" Anybody can do that because the journals are just full of those kinds of contradictions. I'm not saying that's perfect but it's a good way to get started.</p> <p><strong>Petersen:</strong> Yeah, and economics has a lot of theories and a lot of empirical work and a lot of them point in different directions. So you don't have to look far to find those kind of contradictions. So another tip you give is to write and then to squeeze other things in. This is a scheduling thing. What would be the wrong way to schedule your writing?</p> <p><strong>Munger:</strong> Well there's the sort of macro or general approach and the micro part of it. The macro approach is to think, \"I need big blocks of time to write. And since I have to teach a class and go to a class, I have to teach a section of a class, or I have a meeting that I have to go to, or there's a talk this afternoon, I can't write because I don't have time.\" Actually you can only write for about 20 minutes at a time. The problem is it takes you ten minutes of thinking to get to the point where you're thinking clearly enough to write so it takes you 30 minutes to write for 20 minutes and if you get interrupted you can't start again. It usually takes another 10 minutes to get started.</p> <p>So it is true that you do need some blocks of time. But if you can just find an hour somewhere, that's enough for two of those 30 minute blocks, you can get quite a bit done. After you've been writing for 20 minutes you have probably have to stop get up and get a cup of tea, walk around because you can't concentrate for that long. So all you need is an hour or so to be able to write.</p> <p>So the macro consideration is---don't think, \"Well since I have two meetings this day I can't write anything.\" The micro consideration is when to find the particular hour or two that you're going to write. And what many people do is they schedule their meetings or classes they have to teach at times when they're the sharpest mentally and that's a mistake. What you need to do is find the time that you're sharpest mentally, for me it's first thing in the morning, for many people it might be late at night. I'm a little skeptical of the late night because they waste all the time between 9 PM and 1 AM and then they write for one hour and say, \"Man I really worked 'till 2 o'clock. That was great!\" Yeah but what about the four hours between 9 PM and 1 AM? So I'm not so sure about the late night people, but OK fair enough. Let's suppose they actually are using their time wisely.</p> <p>Pick the time that you're the most mentally sharp and schedule your time to the extent that you can control it to make sure that is reserved for writing and schedule everything else around it and what I found is that I can take the time when I am least mentally sharp which is between about 3 and 7 PM and I try to schedule my teaching then. Now that seems cynical, but I like teaching so much. And there's the energy that you get back from students that are interested and interesting, it's like super caffeine. So you can actually get up for teaching or leading discussion sections or maybe even go in for a talk---at times that you otherwise would have wasted or would be down time because those are social. Those are things where you're getting feedback. Writing there is no feedback. There's no one saying, \"yes that's interesting.\" It's just you thinking, \"Lord, I can't finish this paragraph. I'm an idiot.\" So you need to be at your mental best to be able to get through that.</p> <p><strong>Petersen:</strong> I think for me it probably would be the morning. I've got to jot down all these tips. Of course, I'm a graduate student so this is especially relevant to me. When should I be writing, how should I be writing.</p> <p><strong>Munger:</strong> You're still forming habits and learning about yourself, but thinking in these terms means that you'll get a head start.</p> <p><strong>Petersen:</strong> You mentioned that taking 10 minutes to get into writing and then doing 20 minutes of good writing. I think that lines up with the research people have done on flow. The idea that people self-hypnotize into a very productive, very focused state. And then if you break your flow then it actually takes a while to get back into it. You're self-aware for a while you're not as focused, as productive.</p> <p><strong>Munger:</strong> So a two-minute interruption doesn't cost you two minutes it costs you 12.</p> <p><strong>Petersen:</strong> Yeah, you need to find a place and a time where those two minute interruptions don't happen.</p> <p><strong>Munger:</strong> Yes and it doesn't take long. If you can get an hour and a half or two hours 4-5 days a week, you will be a famous and successful academic.</p> <p><strong>Petersen:</strong> Yay! That's what we want to hear.</p> <p><strong>Munger:</strong> The good news is anybody can do this. I find it so frustrating that they don't. By that I mean anyone smart enough to get into graduate school has plenty of good ideas, they just don't write them.</p> <p><strong>Petersen:</strong> That is sad, because there's such a high payoff to getting the writing done. But I guess it's sort of a delayed reward where you need a lot of self-control to be able to seize that payoff.</p> <p><strong>Munger:</strong> Garrett, you're going to graduate school! Clearly you are interested in delayed reward because you could have a job at a Donut Shop and have your own apartment and have money be able to go to bars not worry at weekends. Graduate school by its nature is one of the most, the strongest ways of putting off any sort of satisfaction into the distant future. So yes, it's a later payoff. But why would you go to graduate school and then not do the thing that actually will result in the payoff that you've apparently planned for. Here's the thing, a journal article---when you're in graduate, when you're starting your career---a refereed journal article will inflect upward your career trajectory and earnings by at least ten thousand dollars, one article. If it's in a pretty top journal, it's twenty-five thousand dollars. So, if you write an article and publish it, that's twenty-five thousand dollars. There's nothing else you're doing that has a higher payoff. Yes, it's delayed but it's not delayed that much and you're already in graduate school; you're already living a miserable existence.</p> <p><strong>Petersen:</strong> I'm lucky because my wife actually works in the real world. So I'm covered but (chuckles).</p> <p><strong>Munger:</strong> All right. Yes, you can remind her that you married better than she did.</p> <p><strong>Petersen:</strong> Yeah, I mean I'm sure she doesn't need much reminding.</p> <p><strong>Munger:</strong> As long as she doesn't remind you of that.</p> <p><strong>Petersen:</strong> Oh yeah. Try to avoid that.</p> <p><strong>Munger:</strong> Well I see graduate students who will teach during the summer and get paid $4000. You can write an article in the summer. That's at least $10,000. It makes no sense, your discount rate would be have to be awful high. If your discount rate is that high, why are you spending six years in graduate school in the first place?</p> <p><strong>Petersen:</strong> Yeah, that is the question. But yeah, I suppose you could be credit constrained, but that's a whole other issue.</p> <p><strong>Munger:</strong> You'd have to be really constrained for that to make sense because you can probably eat just beans and oatmeal for a couple of months. And the payoffs to writing an article really are huge because the way that it works out is, the first job that you get is a 2-2 teaching load at a research school and smart colleagues and the ability to go to conferences because they'll pay for it, or a 4-4 teaching load with colleagues that hate you and their own existence and give no support, no outside talk. So even if the same person, a clone of the same person, starts in those two jobs, the difference in their career trajectory is going to be enormous! Plus you already have a journal article published, so you'll start with a higher salary. So that first job makes a big difference to where you'll be in ten years. So you have to be pretty credit constrained not to take that into consideration</p> <p><strong>Petersen:</strong> The way it works with the ten thousand, it's not that you get a ten thousand dollars payment it's that you get a bigger raise or a bigger starting salary.</p> <p><strong>Munger:</strong> With better colleagues, more articles, you have the ten thousand as the present value. Well, but again, an economist should understand present value and they're in graduate school so they must have a low discount rate. So those are the ones I would expect to say I'm not going to teach. I'm going to borrow against my own future earnings. I'm going to loan myself this money and live really cheaply and write an article instead of teaching.</p> <p><strong>Petersen:</strong> Oh man, I'm just jotting all this down. OK, \"don't teach in the summer.\" Of course some teaching is important, you do need to become a good teacher.</p> <p><strong>Munger:</strong> Yes, the kind of teaching that we tend to do, in the summer is pretty different, but you should. There's no question, you should be able to point to one class that you have yourself designed the syllabus for and have primary responsibility for teaching and grading when you go on the market. So I'll give you one---over five years, yes you should have taught one class yourself.</p> <p><strong>Petersen:</strong> But TA'ing is not good. It pays but it doesn't pay as well as writing.</p> <p><strong>Munger:</strong> Right, and when you go on the market and they say what teaching experience do you have and you say well I TA'd four times, they're going to stare at you like you're an idiot because you are.</p> <p><strong>Petersen:</strong> OK so one tip you give in the article is to edit your work over and over. So what is the editing process like for you?</p> <p><strong>Munger:</strong> Well it's terrible. I've written a number of books, I just was yesterday working on an analytical book review that's about 15 pages long and I looked at it this morning and said, \"half of this is unusable.\" So I crossed it out and started over, I was thinking it was almost done and then I thought, oh no this is stupid. So even just one day later, I looked at it with much more critical eyes. So I would say it takes me at least ten complete rewrites to get to the point where I think my article is worth showing to someone else and then they usually have comments that require me to rewrite it at least two more times.</p> <p>So the difficulty is everybody's first drafts are bad. Now I do have a talent. I write extremely fast but badly. If you had to pick that would be a pretty good way to be an academic because I also edit fast so I can go through, I can do a rewrite pretty quickly and every time I rewrite it becomes dramatically better. So there are people who write very slowly but well, they are going to have more trouble because a lot of times you don't know enough about your subject. It's well written but the subject is not very good because you need to learn more about it. So I have to admit I learned this in some ways from a master. Douglas North was one of my dissertation advisors and Douglas North won the Nobel Prize in Economics in 1993. And Doug was famous for going and giving a talk, and it would be twelve pages long and have four citations, two to Douglas North, one to Adam Smith and one to more a recent economics paper. And the people in the audience would say, \"Doug, this is terrible. If you were going to do this, here's what you have to do. You need to go read these five papers, all of them have written on your subject and they're better than yours.\" And he would write it down. He would write down their names he would make sure he got the citations. And next time he presented the paper, now it would have nine citations, before he started out with a five that had been suggested to him and he had added all of the suggestions and the paper actually wasn't terrible now but still people would see it and say, \"Oh no, no, no, here's what you need to do.\" So he would go around---and it was almost as if he was outsourcing the references because he didn't read anything unless somebody said it was relevant---and he was outsourcing a lot of the ideas. And he would thank everyone, I'm not saying he was plagiarizing. He would gratefully acknowledge the suggestions of so and so in a footnote he might say this was suggested by so and so. But you write it, you go present it, you get comments, you think about it, you write it again, that is the way to be successful. And when it comes to editing, one of the things that you can avail yourself of---and this actually has become kind of a meme---people argue about whether they're \"Munger compliant.\"</p> <p>Munger compliant means that you have three articles in journals, and if you don't have three articles in journals all the time, you're not Munger compliant. Well the reason that that's important is, think in comparison to computer programming. So if I'm going to write a program or a job and send it to a computer, I don't stare at the code and try to make sure that the logic and syntax are correct. I submit the job and then it will come back with error message: here at this step you've left out a semi colon. So it won't run. You can't compile the code that you've written and it won't run. Nobody stares at the code to figure it out. They submit it to the computer and get back the error message. That's how journals work; you get this off your desk. You don't stare at the paper over and over again to make sure the code works, you send it to a journal. Now yes it takes a few months, that's why you have to have three papers out at all times, you have to diversify your portfolio of risk because there's a random element to this. Some good papers get turned down but some not very good papers get accepted because you get a lucky draw on the referee. So you send it out, it comes back, the referee says, \"no no here's what you should do, add these five references.\" It's sort of like what Doug North did. And you do it, it becomes a much better paper. I've had some of my better papers turned down at five journals before they were finally published. And when they were published, they were pretty good, but that was because I had outsourced a lot of the research to smart referees. So you should think of that as machine-intensive debugging. Machine-intensive debugging means I don't debug my own program. I submit it to the computer and it comes back with an error message. Well I submit my articles to journals, they come back with three really smart people working unpaid as my research assistants. Now yes, they do say that \"you're an idiot and your mother should never have been born,\" they make comments you want to ignore but by and large their suggestions improve your paper dramatically. So you should always try to be Munger compliant.</p> <p>I told some of my graduate students, there will come a day when you will be upset when one of your papers is accepted because you will no longer be compliant. And a good friend of mine who is now a tenured full professor in England just wrote me and said, \"Darn it, that finally happened. I got a paper accepted and I woke up in the middle of the night and I said, 'I only have two papers at journals! I have to go write something!'\" That's a sign you're a success.</p> <p><strong>Petersen:</strong> Yeah, when you think about, I like what you said about the research assistants. If you wanted to hire twenty tenured faculty as research assistants you'd have to pay them thousands upon thousands of dollars. But you walk into a seminar room and give a bad talk and suddenly they're all throwing out suggestions and comments and they're being your research assistants for free.</p> <p><strong>Munger:</strong> And very helpful and they're grateful if you take their comment seriously. So that's actually---there's nothing wrong with doing that. The research enterprise is more collaborative than most people are willing to admit even to themselves, and the reason is because those useful comments come wrapped in, \"you're an idiot.\" But if you can unwrap that and just take the kernel, the content of the message---because a lot of times when you give a seminar one of the problems with giving a seminar is you learn all the problems with the paper. And economists are pretty harsh and aggressive about making their criticism. Think of them as research assistants and it makes you much more receptive. I was surprised, Doug North---this was after he won the Nobel Prize---people would just viciously say, \"This is completely worthless. I would be embarrassed to write this and I don't have a Nobel Prize. I don't see how you can do this.\" And Doug would just nod and then they would say, \"Here's what you should do.\" He'd write it down and thank them it didn't make him mad at all, he didn't care.</p> <p><strong>Petersen:</strong> OK, so developing a thick skin seems to be an asset here.</p> <p><strong>Munger:</strong> No what you said is right. Think of them as research assistants. What do you care what your research assistant thinks of you as long as they help.</p> <p><strong>Petersen:</strong> Yeah, they do a good job they give you your suggestions, you sift through them and make your work better.</p> <p><strong>Munger:</strong> Often when I get back referee reports and they're harsh, it'll take me a day to get over them. Oh man, I thought this was a good paper and they didn't like it. But then I will literally take a printout and take a black magic marker and redact the parts that are just ad hominem attacks. I don't care about those. And then if you look at what's left, it's usually a pretty good structure for revising your paper.</p> <p><strong>Petersen:</strong> OK, yeah I'll have to do that.</p> <p><strong>Munger:</strong> It sounds simple and hokey, but you don't care about the things that are just saying this is terrible. I had one referee report that said I would rather hack my way through the jungle with a penknife than have to read this paper again and I thought \"Ow!\" And then I took a black magic marker and marked it out and the rest of the report was pretty useful. The question is why you would put someone else in charge of how you feel? So don't do that, you're going to be in charge of how you feel and you're going to use, to your own benefit, the fact that smart people made good comments on your paper.</p> <p><strong>Petersen:</strong> We have this sort of mythology of the solitary genius. Are you saying that that is not a way to live your life?</p> <p><strong>Munger:</strong> Oh no that's exactly how you should live your life, if you're a genius.</p> <p><strong>Petersen:</strong> But most of us aren't.</p> <p><strong>Munger:</strong> For the rest of us who are not, no, that's not the way to live your life. So absolutely, I know I have friends, in fact one of my colleagues, Melvin Hinich, with whom I had three books, was unbelievably smart. He was able to do things with very little effort and he would often just throw out ideas and let someone else write them up because he was bored with writing them. So if you're smart enough, yes you can totally do that. My message is, all you have to be is basically average intelligence for a graduate student and if you spend a lot of time learning how to write you will also be a success. Maybe more successful than that solitary genius. It's not fair but it's true.</p> <p><strong>Petersen:</strong> A part of it is humility. To realize when you are not a solitary genius and when you need help. But couldn't the genius also do better if he used other people as his research assistants and did all the things that a non-genius would do?</p> <p><strong>Munger:</strong> Sure. Yes, but they're not willing to spend the effort for the most part because they've never had to. There are people that are just so good at sprinting or so good at swimming, that as long as they practice pretty hard, they don't need to worry about learning other techniques. So, one of the reasons that I am a coach about writing is that I was such a terrible writer. Most people who are really, really good at something are terrible coaches because they have a knack for it. It's the people who had to scrap at the margin, and who weren't really all that good but managed to be at least somewhat of a success because they thought about technique and they focused on getting better. Those are the best coaches. In almost every sport that I know of, the best coaches were the marginal players and I was a marginal player. So the reason that I talk about writing is that I was terrible at it</p> <p><strong>Petersen:</strong> But you are now a success and we can all learn from your example.</p> <p><strong>Munger:</strong> I am now a Philosopher and not a Street Porter.</p> <p><strong>Petersen:</strong> Yes. So do you have any closing thoughts about writing? What's the core message you want people to take away from this.</p> <p><strong>Munger:</strong> Well, William Riker, who was one of the founders of the rational choice school of public choice in political science, said that most of the people who get into academics do it because they're interested in teaching. And a lot of times they're confused and they think that teaching involves work in a classroom with students. And that's important, but the real teaching is the one that takes place through writing because once you've learned something, if you actually understand it, you can explain it to someone else and the advantage of writing it is that you can communicate this teaching to someone distant in time or someone distant in space. So the most important teaching is writing and if you think of yourself as a teacher, it's really important that you work on your writing because that's how you're going to be able to communicate this understanding that you have. Understanding is ephemeral. A lot of times when you work on something for a long time, you think \"Oh now I see it! That's actually simple.\" Well if you don't write that down it's going to be hard for someone else to replicate that moment of understanding. But if you do write it down and you explain it clearly, you've added something to the human capital of the world: what we're able to hand down, the things that we no longer have to think about because we understand them. The more you understand, the simpler things become.</p> <p><strong>Petersen:</strong> My guest today has been Mike Munger. Mike, thanks for being on Economics Detective Radio.</p> <p><strong>Munger:</strong> It was a pleasure Garrett, thank you.</p> <hr /> <p> </p>",
  "content:encoded": "<p>In this episode, I discuss the process of writing and being successful with Mike Munger. What follows is an edited transcript of our conversation.</p>  <p>Petersen: My guest today is Mike Munger of Duke University. Mike, welcome to Economics Detective Radio!</p> <p>Munger: It's a pleasure to be on your show!</p> <p>Petersen: So first I stole EconTalk's format and now I have stolen Mike Munger as well, so if Russ Roberts sends me a cease and desist letter, I'll completely understand why.</p> <p>Munger: Russ and I have an open relationship. We both date other people.</p> <p>Petersen: Oh good, good. I have many jokes I could make about that, but I won't!</p> <p>Munger: Thank you for not.</p> <p>Petersen: So, our topic today is going to be writing and thinking. Let's say that because, as we'll go through, the two are intimately related. So Mike wrote a piece titled <a href= \"http://www.chronicle.com/article/10-Tips-on-How-to-Write-Less/124268/\" target=\"_blank\">\"Ten Tips on How to Write Less Badly.\"</a> Now you may be thinking to yourself, \"Hey I thought this was an economics podcast! What does writing have to do with economics?\"</p> <p>Well, writing is what economists do and if you write either for your career, or your hobbies, I'm sure you'll find something in this discussion that will be helpful to you. So Mike, you start your piece by saying that you've seen many talented people fail because they couldn't or didn't write. I think the impression a lot of people get while growing up is that writing is the easy subject and that math and science are hard, so how is it that these talented people get tripped up by writing of all things?</p> <p>Munger: Well, writing at all is not that difficult, I suppose like running at all is not that difficult. Most of us can at least run 10 meters. The point is that, if you want to be a professional economist, you are one of those people who actually found math pretty easy and you may not have practiced writing very much. So, I said, I've seen a lot of talented people fail because I was Department Chair here at Duke for 10 years and it's hard to get tenure at Duke, it's not a reward for past behavior, it's a hire. We are trying to guess if you're going to continue to produce interesting and important research after all material incentive to do that has been removed. Because once you have tenure you basically can't be fired. It's not quite true, but it's pretty close to true.</p> <p>So you get six years, I've watched 8 people doing this while I was Chair. You get six years to develop your research agenda and to show that you are going to continue to publish after you no longer have any incentive to do that. Now, what a lot of people do is, for four years they'll work on a few things but not very assiduously and the last two years they will work furiously and they'll have two or three things forthcoming and say, well, like it's a video game, I've done enough to get tenure. What they're saying is, if you ever give me tenure I will never publish anything ever again, which not surprisingly doesn't work out well. So six of the eight people who came up were fired. And when I, as Chair, had to tell them this, they cried, they were surprised, which probably means that I am a bad Chair, but I had tried to communicate over and over again that they needed to develop a research agenda and the way to do that is to write about it, and to write about it every day. That doesn't mean that everything that you'll write will eventually be used, but again, I would go back to the running analogy. Or let's say a soccer game.</p> <p>Suppose you knew those six months from now, you'll have a very important soccer game. You wouldn't wait until the night before the soccer game and practice all night. You would practice for an hour or two every day, recover, think about it, try to get better, but that's not how we do writing. All of us, who are at the level of thinking about graduate school and economics, are clever monkeys. We have always been good enough, that we can wait until the night before and write some bunch of crap and have it be good enough, because we're smarter than the other people. Well, now you're in with a group of people all of whom have always been able to do that and some of them are going to figure out that if you actually starts six months in advance, and work on the thing every day, and throw away most of it, time after time, and start over, your paper is going to be a lot better. And if you look at the books and articles that you think are important, the very things that got you excited about being in economics in the first place, none of those, not one, did the author stay up the night before it was due and write it.</p> <p>Adam Smith worked for years on 'The Wealth of Nations.' He showed it to people, he talked to people, he went for walks and muttered to himself. At one point he was so obsessed with what he was thinking about, he walked right into a noisome sump, that is the chemicals leftover after you have tanned leather. He didn't even notice where he was going! It smelled terrible, he didn't even notice by sight or smell because he was so busy thinking about this stuff, that he had been working on for years and would continue to work on for years. So part of this is my own cri de coeur, my own cry from the heart saying, it's so hard to watch talented people fail when they could have succeeded, because they didn't get this simple message---you have to teach other people. Sometimes you do it in the classroom, most of the time you do it through your writing. If you don't get good at that, you're going to fail. So don't start. If you don't think you want to write, don't become an academic in the first place.</p> <p>Petersen: Yeah, I guess another analogy is, you can be very naturally adept at swimming and that can make you an above average swimmer, but not one of those people swimming at the Olympics isn't both an above average swimmer naturally, and someone who has trained day after day, after day to be there.</p> <p>Munger: Not just at the Olympics. This is if you want to enter a swimming contest at the local YMCA, those other people are on the top one half of one percent. They're not near the Olympics, but they're going to kick your butt unless you've been practicing and practicing and practicing.</p> <p>Petersen: Yeah, and I guess undergraduate education is less like the YMCA; it's sort of the kiddie pool. You really can get by without practice, but you won't necessarily get much out of it.</p> <p>Munger: You won't learn much about writing, and what you write won't be very good, it will just be good enough, that because you're clever and good at this you can produce something that the professor is going to read and say \"Ok, I sort of see what the argument is, that's better than the others: A.\" So that's not a 'good enough' it's just a 'better that the other losers' who aren't going to get to graduate school in the first place. And by losers I mean, people who are going to have successful lives.</p> <p>Petersen: Yeah, we have a funny definition of winning in academia.</p> <p>Munger: It's not clear you're really want to win. Although, to be fair getting tenure someplace and having the ability to write every day about the stuff you are interested in, there really is no better life. The problem is with the six or eight and in my case ten years, because I had a hard time finding a job, that went before that.</p> <p>Petersen: Yeah, so that's covered your first tip in that essay, which was, \"writing is an exercise.\" The second tip was to set goals based on an output, not input. Can you explain that?</p> <p>Munger: One of the things that junior people do and that graduate students also do is to define how hard they're working by how long they spend outside of their apartment and in their office and they might even be at their desk, they might be in a coffee shop. What they're not doing, is facing the terrors of that blinking cursor. So the difficulty with any metric based on inputs is that you're not thinking, \"am I actually doing something?\" A metric that's based on output focuses more on writing. Now, that can be misleading because you can write badly but the same thing would be true of running or swimming. Sometimes when you have a workout it doesn't go that well but at least you're doing it so you wouldn't define how hard you work out by how much time you spent in the gym. You would say what exercises you actually did. It makes no more sense than that to define how hard you work by how much time you spent in the office, going to other offices, drinking coffee, talking to people, checking Facebook. None of that actually counts. So you have to set very high goal, five hundred, seven hundred fifty words per day, every day, five days a week and you will be a famous and successful academic. That again is the sort of dirty secret since no one does this. A lot of economics articles are only ten or twelve thousand words. So if you write five hundred words a day and you end up throwing away three hundred of those words you're still every ten days going to have two thousand usable words. So twice or three times a year you're going to have enough to have a journal article even if you're throwing away 60% of what you write. And here's the other thing: you learn by writing. What I find frustrating is a lot of people will count reading as work and it's not.</p> <p>Reading is an important input to work just like sleep and having a good breakfast. But in order to be an academic you have to write and the nice thing about writing is, you're writing along and you think, \"oh right I understand this.\" You're trying to summarize the argument of some thinker and you realize \"I don't understand it!\" Now you go back and you read it, but you read it in a way that allows you to engage in a conversation with that writer. The nice thing about writing is that it allows you to communicate over time and space. I can look at something that was written 300 years ago and try to divine what was in the mind of that writer, what is he or she trying to communicate. And good writing creates in my mind an image or a logic similar to what was in that person's mind even though they're distant in time and space. So when I'm writing I read things differently. I've seen people count as reading, they go through a book, they go through an article they have three different colors of highlighting and they always think they're going to come back. None of that actually went through their brain. But if you're writing then you go to read something, you're looking for a specific question. You read better. So I actually ask my graduate students when they're working on their dissertation, on their third or fourth year, to put up a three by five card in their workspace that says: \"Don't read, write! If you're writing you'll become a better reader.\"</p> <p>Petersen: Yeah, there's an irony in someone who has gone through years of economics education, who could explain to you exactly why the labor theory of value is not correct, applying it to their own work implicitly.</p> <p>Munger: Absolutely, it's \"My day was valuable, I spent 11 hours at the office. Holy cow!\"</p> <p>Petersen: Yeah, my own version of that was at the end of my first year of my PhD, I spent a lot of time in the office and I realized that I spent so little time at home that I actually only went through I think one full roll of toilet paper. So it's sort of the metric being what I didn't do which was spend time at home and therefore in my own bathroom.</p> <p>Munger: We get it. We get it Garrett. But it is interesting, that's necessary but not sufficient for success. Jim Buchanan always said, \"The key to success is apply the behind.\" He didn't say \"behind,\" he used a different word, but apply your behind to the chair. So you're actually in the chair at your desk and you are writing. Now for him that meant moving a pen across a piece of paper, for us it means typing on a keyboard. Either way, if you apply your behind to the chair---the actual chair at your desk, not the one in front of the desk of one of your friends so you can drink coffee and talk---you'll get a lot done. You'll learn a lot and you'll notice after just a couple of years that there's a divergence, not only in your ability to write but in your understanding of a lot of key issues because you've thought of these things pretty deeply. And the thing that's interesting about that is other people who haven't been writing may at one point have been ahead of you. Maybe they were better at classes but you have to learn to make the transition between being good at taking classes---which is why many of us want to go to graduate school---to being good at expressing our thoughts on paper in a way that other people find interesting. So the emphasis on classes is misleading, your first year in class, second year in class---you get A's but you haven't really developed your own research agenda. That's not as good as the person that actually practices, works on writing and after a year or two has developed a talent.</p> <p>Adam Smith has an interesting story about this with <a href= \"http://www.econlib.org/library/Smith/smWN1.html\" target= \"_blank\">the Street Porter and the Philosopher</a>. So the Street Porter and the Philosopher are not as different as the Philosopher wants to think. The difference was the Street Porter spent a lot of time carrying bags and the Philosopher spent a lot of time reading and writing. Well after just a few years they seem like different people but it's because, hour by hour, the philosopher spent time writing. You can be the Philosopher. If you don't write, you're going to stay the Street Porter.</p> <p>Petersen: Another tip you give is to find a voice. Don't just get published. But isn't getting published the point? What's wrong with making that your end goal?</p> <p>Munger: Let's think about entrepreneurs. Suppose you have two people who fancy themselves to be entrepreneurs. One of them says, \"I want to make profits, I don't care how.\" The other one says \"I have a vision of this great product that's going to transform this industry.\" Who's more likely to make profit? The second, paradoxically the second. Well if I say \"I don't care about what I write I just want to get published,\" my work is going to suck. It's going to lack any kind of imagination or motivation or the reader is going to look at it and say \"I don't even understand why this guy is writing.\" But the person that's found something that he or she is passionate about is actually more likely to get stuff published. So paradoxically the way to be published is to be passionate about what you're writing. If all you're trying to do is get published, that's going to come through. It will just seem instrumental and not very interesting.</p> <p>Petersen: Yes. So Scott Alexander writing at Slate Star Codex had an article recently where he made the distinction between what he called <a href= \"http://slatestarcodex.com/2016/07/18/pushing-and-pulling-goals/\" target=\"_blank\">pushing and pulling goals</a>, where a pull goal is when you want to achieve something so you come up with a plan and a structure. Whereas a push goal is where you have a plan and a structure so you'd scramble to try to find something to achieve. This strikes me as another version of the same thing where to just \"get published,\" you know you want thirty pages double spaced with some graphs in there and you don't really care what your message is. That's just not a good way to write is what I'm hearing.</p> <p>Munger: Right. It's not a good way to write good things and again Jim Buchanan, who is one of my heroes, when he would interview perspective job candidates, particularly people who were young, he would pose them a question. I'm not quoting him exactly but it was something close to this: Supposed you have three choices. A) You could be for or five years the most famous economist writing for The New York Times and be on talk shows. B) You can win a Nobel Prize. C) You can write something that people are still going to read one hundred years from now. Which one would you pick? And Jim was---he actually achieved B obviously, he won the Nobel Prize---but he was interested in people who at least had some aspiration to write something that someone's going to want to read a hundred years from now. Now you may fail in that, but if there's not something that you're working on that at least has that aspiration, then it's going to come across that your work is just shallow, superficial, not very important and honestly not really worth doing.</p> <p>Petersen: That has got to be the hardest interview question I've ever heard.</p> <p>Munger: Well he was pretty scary, I actually interviewed at George Mason and talked to him and I was desperate for this job. I really wanted the position at George Mason and it turns out Jim Buchanan found me wanting, so I went through this and ended up on the wrong side of that line and it has stuck with me. So, now I do try to have some answers to that question at least to myself. So I try to work on things that are of some importance, but it was terrifying to be interviewed by him anyway. And when he asked that question, you're really just trying to get a job, you haven't published anything, you're trying to finish your thesis, that sort of seems far away. But he was absolutely right to want people who have that kind of mindset.</p> <p>Petersen: One of your tips is that everyone's unwritten work is brilliant. How is it brilliant?</p> <p>Munger: Well in my mind I have an argument and the premises make sense. The logic by which those premises are developed and integrated makes good sense and the conclusion is important. Now the problem is when I write it down. It turns out there's some holes in it, and when I examine those holes and sort of work at them---it's like you're thinking about moving into an apartment and you touch the wall, the wall gives way and a bunch of cockroaches come out. Ahhh it's pretty scary! Most of us, these are the arguments that we have in mind, particularly if you haven't really been writing, and by writing I would count a model. So I have an intuition about how something's going to work. I work out the steps in the model and it turns out step four is \"a miracle occurs here.\" Well you can't actually use a miracle as a step in an argument and that means the argument is not very good but you don't know that until you write it out. But that's why many people don't write it out. And one of the things that I talk about in the article is \"don't be that guy,\" and the guy that I have in mind, I actually knew a person like this.</p> <p>Most graduate students when I talk to them say, \"oh yeah, I know that guy.\" The guy is a third or fourth or eighth year graduate student and you meet him in a bar or somebody's house and he's got a cigarette and in the other hand he has a drink. He takes a long hole in the cigarette and then for two or three minutes he tells you what his dissertation is about. And you say, \"Holy smokes that's amazing! What you're going to do is so important!\" And you tell somebody else that the next day at the office and they just laugh and say, \"Yeah he's been working on that two-hundred-word speech for five years. He's never written anything.\" So you know, the young people are all terrified of this guy. The older people realize he's a loser because the older people all realize they have trouble summarizing their argument because they're in the middle of writing it and there are several places, where it says \"a miracle occurs here.\" He hasn't thought about it enough to know where the impossible miracles will be required in his argument, he's just smoothed this over and he's practiced this pat little pathetic speech.</p> <p>So if you're working as hard as you need to be you're going to be confused and miserable and not sure that it's right because only unwritten work is brilliant. If you're actually working on it you know better than anyone else where all the holes are and where all the places where if you touch the wall the cockroaches come pouring out. So don't be that guy. It's easy to be the hero. And notice that this 8th year grade student only hangs out with the first and second year grad student because these are the only people that still believe his crap.</p> <p>Petersen: Yeah one of the most frustrating things about being human is how little connection there is between the way our brains seem to work, from when we're sort of observing ourselves from the inside, and the way they actually work. So when psychology really came into its own as a field, the psychologists quickly discovered that introspection really wouldn't get them very far because it's so misleading trying to study a brain from the inside and part of this is your brain can come up with some really half-baked ideas that seem so brilliant.</p> <p>Munger: There's a lot of plausible things. It just turns out that a lot of those possible things seem to be false. And if what you do is practice making them sound more plausible, you can fool people but that's why we have con artists. So you're exactly right. Human beings are basically set up to accept confidence for authority but they're not the same thing. Authority is someone who's really thought about it has developed an argument. Confidence is someone who has refused to develop the argument and just believes out of faith that they're correct and they practice their little thought. So another way to put it, and you're right to bring up psychology because we can be fooled by confidence into thinking that it's authority.</p> <p>Petersen: Yeah. If you've ever had a dream where you had a great idea in the dream and then you wake up and think, \"Oh my God, that idea is so brilliant I've got to write it down!\" And it's always just total nonsense because your sleepy monkey brain just made you think it was great.</p> <p>Munger: That actually happened to me. I went to college in the 70's and there were substances involved and so under the influence of some substance I would have an idea which I was convinced was brilliant and would write it down and of course the next morning I thought, \"Wow, that's really stupid.\"</p> <p>Petersen: Oh no. At least you wrote it down. You didn't spend years pursuing it.</p> <p>Munger: Even then I wrote it, yes.</p> <p>Petersen: So one of the tips you have is to pick a puzzle. What do you mean by that?</p> <p>Munger: Well it's often hard to get started. So there are two reasons to pick a puzzle, one is that it's actually interesting, and the other is that it's rhetorically useful to be able to engage the attention of the reader. So I give examples of different puzzles in economics. One of the most common is \"Theory says this, empirical results say this, they are contradictory. What's missing from the theory or how has the empirical test been conducted badly?\" Another would be \"Person A and Person B have the same set of assumptions but they come to a different conclusion. What is it about their models that causes this divergence?\"</p> <p>So if you have a puzzle like that, and the most important one. The third one, the most important one is \"Suppose that there's this phenomenon and we don't really understand it and then there's this other apparently unrelated phenomenon, we don't really understand that. What turns out when you think of it correctly, both of them are the result of this economic principle and no one has recognized the fact that we can tie all this together.\" So as theories become stronger, they generally become simpler and more general. So an increase in simplicity and generality means that you can bring more apparently different phenomenon under a single explanatory umbrella and that's interesting to say, you think this is different but it's the same. So it's both a good research technique if you can do it, and it's engaging to the reader. So if you're not sure how to start thinking in those terms then the easiest one here is \"Theory says this thing, empirical results say this. Do we need a better theory or better testing?\" Anybody can do that because the journals are just full of those kinds of contradictions. I'm not saying that's perfect but it's a good way to get started.</p> <p>Petersen: Yeah, and economics has a lot of theories and a lot of empirical work and a lot of them point in different directions. So you don't have to look far to find those kind of contradictions. So another tip you give is to write and then to squeeze other things in. This is a scheduling thing. What would be the wrong way to schedule your writing?</p> <p>Munger: Well there's the sort of macro or general approach and the micro part of it. The macro approach is to think, \"I need big blocks of time to write. And since I have to teach a class and go to a class, I have to teach a section of a class, or I have a meeting that I have to go to, or there's a talk this afternoon, I can't write because I don't have time.\" Actually you can only write for about 20 minutes at a time. The problem is it takes you ten minutes of thinking to get to the point where you're thinking clearly enough to write so it takes you 30 minutes to write for 20 minutes and if you get interrupted you can't start again. It usually takes another 10 minutes to get started.</p> <p>So it is true that you do need some blocks of time. But if you can just find an hour somewhere, that's enough for two of those 30 minute blocks, you can get quite a bit done. After you've been writing for 20 minutes you have probably have to stop get up and get a cup of tea, walk around because you can't concentrate for that long. So all you need is an hour or so to be able to write.</p> <p>So the macro consideration is---don't think, \"Well since I have two meetings this day I can't write anything.\" The micro consideration is when to find the particular hour or two that you're going to write. And what many people do is they schedule their meetings or classes they have to teach at times when they're the sharpest mentally and that's a mistake. What you need to do is find the time that you're sharpest mentally, for me it's first thing in the morning, for many people it might be late at night. I'm a little skeptical of the late night because they waste all the time between 9 PM and 1 AM and then they write for one hour and say, \"Man I really worked 'till 2 o'clock. That was great!\" Yeah but what about the four hours between 9 PM and 1 AM? So I'm not so sure about the late night people, but OK fair enough. Let's suppose they actually are using their time wisely.</p> <p>Pick the time that you're the most mentally sharp and schedule your time to the extent that you can control it to make sure that is reserved for writing and schedule everything else around it and what I found is that I can take the time when I am least mentally sharp which is between about 3 and 7 PM and I try to schedule my teaching then. Now that seems cynical, but I like teaching so much. And there's the energy that you get back from students that are interested and interesting, it's like super caffeine. So you can actually get up for teaching or leading discussion sections or maybe even go in for a talk---at times that you otherwise would have wasted or would be down time because those are social. Those are things where you're getting feedback. Writing there is no feedback. There's no one saying, \"yes that's interesting.\" It's just you thinking, \"Lord, I can't finish this paragraph. I'm an idiot.\" So you need to be at your mental best to be able to get through that.</p> <p>Petersen: I think for me it probably would be the morning. I've got to jot down all these tips. Of course, I'm a graduate student so this is especially relevant to me. When should I be writing, how should I be writing.</p> <p>Munger: You're still forming habits and learning about yourself, but thinking in these terms means that you'll get a head start.</p> <p>Petersen: You mentioned that taking 10 minutes to get into writing and then doing 20 minutes of good writing. I think that lines up with the research people have done on flow. The idea that people self-hypnotize into a very productive, very focused state. And then if you break your flow then it actually takes a while to get back into it. You're self-aware for a while you're not as focused, as productive.</p> <p>Munger: So a two-minute interruption doesn't cost you two minutes it costs you 12.</p> <p>Petersen: Yeah, you need to find a place and a time where those two minute interruptions don't happen.</p> <p>Munger: Yes and it doesn't take long. If you can get an hour and a half or two hours 4-5 days a week, you will be a famous and successful academic.</p> <p>Petersen: Yay! That's what we want to hear.</p> <p>Munger: The good news is anybody can do this. I find it so frustrating that they don't. By that I mean anyone smart enough to get into graduate school has plenty of good ideas, they just don't write them.</p> <p>Petersen: That is sad, because there's such a high payoff to getting the writing done. But I guess it's sort of a delayed reward where you need a lot of self-control to be able to seize that payoff.</p> <p>Munger: Garrett, you're going to graduate school! Clearly you are interested in delayed reward because you could have a job at a Donut Shop and have your own apartment and have money be able to go to bars not worry at weekends. Graduate school by its nature is one of the most, the strongest ways of putting off any sort of satisfaction into the distant future. So yes, it's a later payoff. But why would you go to graduate school and then not do the thing that actually will result in the payoff that you've apparently planned for. Here's the thing, a journal article---when you're in graduate, when you're starting your career---a refereed journal article will inflect upward your career trajectory and earnings by at least ten thousand dollars, one article. If it's in a pretty top journal, it's twenty-five thousand dollars. So, if you write an article and publish it, that's twenty-five thousand dollars. There's nothing else you're doing that has a higher payoff. Yes, it's delayed but it's not delayed that much and you're already in graduate school; you're already living a miserable existence.</p> <p>Petersen: I'm lucky because my wife actually works in the real world. So I'm covered but (chuckles).</p> <p>Munger: All right. Yes, you can remind her that you married better than she did.</p> <p>Petersen: Yeah, I mean I'm sure she doesn't need much reminding.</p> <p>Munger: As long as she doesn't remind you of that.</p> <p>Petersen: Oh yeah. Try to avoid that.</p> <p>Munger: Well I see graduate students who will teach during the summer and get paid $4000. You can write an article in the summer. That's at least $10,000. It makes no sense, your discount rate would be have to be awful high. If your discount rate is that high, why are you spending six years in graduate school in the first place?</p> <p>Petersen: Yeah, that is the question. But yeah, I suppose you could be credit constrained, but that's a whole other issue.</p> <p>Munger: You'd have to be really constrained for that to make sense because you can probably eat just beans and oatmeal for a couple of months. And the payoffs to writing an article really are huge because the way that it works out is, the first job that you get is a 2-2 teaching load at a research school and smart colleagues and the ability to go to conferences because they'll pay for it, or a 4-4 teaching load with colleagues that hate you and their own existence and give no support, no outside talk. So even if the same person, a clone of the same person, starts in those two jobs, the difference in their career trajectory is going to be enormous! Plus you already have a journal article published, so you'll start with a higher salary. So that first job makes a big difference to where you'll be in ten years. So you have to be pretty credit constrained not to take that into consideration</p> <p>Petersen: The way it works with the ten thousand, it's not that you get a ten thousand dollars payment it's that you get a bigger raise or a bigger starting salary.</p> <p>Munger: With better colleagues, more articles, you have the ten thousand as the present value. Well, but again, an economist should understand present value and they're in graduate school so they must have a low discount rate. So those are the ones I would expect to say I'm not going to teach. I'm going to borrow against my own future earnings. I'm going to loan myself this money and live really cheaply and write an article instead of teaching.</p> <p>Petersen: Oh man, I'm just jotting all this down. OK, \"don't teach in the summer.\" Of course some teaching is important, you do need to become a good teacher.</p> <p>Munger: Yes, the kind of teaching that we tend to do, in the summer is pretty different, but you should. There's no question, you should be able to point to one class that you have yourself designed the syllabus for and have primary responsibility for teaching and grading when you go on the market. So I'll give you one---over five years, yes you should have taught one class yourself.</p> <p>Petersen: But TA'ing is not good. It pays but it doesn't pay as well as writing.</p> <p>Munger: Right, and when you go on the market and they say what teaching experience do you have and you say well I TA'd four times, they're going to stare at you like you're an idiot because you are.</p> <p>Petersen: OK so one tip you give in the article is to edit your work over and over. So what is the editing process like for you?</p> <p>Munger: Well it's terrible. I've written a number of books, I just was yesterday working on an analytical book review that's about 15 pages long and I looked at it this morning and said, \"half of this is unusable.\" So I crossed it out and started over, I was thinking it was almost done and then I thought, oh no this is stupid. So even just one day later, I looked at it with much more critical eyes. So I would say it takes me at least ten complete rewrites to get to the point where I think my article is worth showing to someone else and then they usually have comments that require me to rewrite it at least two more times.</p> <p>So the difficulty is everybody's first drafts are bad. Now I do have a talent. I write extremely fast but badly. If you had to pick that would be a pretty good way to be an academic because I also edit fast so I can go through, I can do a rewrite pretty quickly and every time I rewrite it becomes dramatically better. So there are people who write very slowly but well, they are going to have more trouble because a lot of times you don't know enough about your subject. It's well written but the subject is not very good because you need to learn more about it. So I have to admit I learned this in some ways from a master. Douglas North was one of my dissertation advisors and Douglas North won the Nobel Prize in Economics in 1993. And Doug was famous for going and giving a talk, and it would be twelve pages long and have four citations, two to Douglas North, one to Adam Smith and one to more a recent economics paper. And the people in the audience would say, \"Doug, this is terrible. If you were going to do this, here's what you have to do. You need to go read these five papers, all of them have written on your subject and they're better than yours.\" And he would write it down. He would write down their names he would make sure he got the citations. And next time he presented the paper, now it would have nine citations, before he started out with a five that had been suggested to him and he had added all of the suggestions and the paper actually wasn't terrible now but still people would see it and say, \"Oh no, no, no, here's what you need to do.\" So he would go around---and it was almost as if he was outsourcing the references because he didn't read anything unless somebody said it was relevant---and he was outsourcing a lot of the ideas. And he would thank everyone, I'm not saying he was plagiarizing. He would gratefully acknowledge the suggestions of so and so in a footnote he might say this was suggested by so and so. But you write it, you go present it, you get comments, you think about it, you write it again, that is the way to be successful. And when it comes to editing, one of the things that you can avail yourself of---and this actually has become kind of a meme---people argue about whether they're \"Munger compliant.\"</p> <p>Munger compliant means that you have three articles in journals, and if you don't have three articles in journals all the time, you're not Munger compliant. Well the reason that that's important is, think in comparison to computer programming. So if I'm going to write a program or a job and send it to a computer, I don't stare at the code and try to make sure that the logic and syntax are correct. I submit the job and then it will come back with error message: here at this step you've left out a semi colon. So it won't run. You can't compile the code that you've written and it won't run. Nobody stares at the code to figure it out. They submit it to the computer and get back the error message. That's how journals work; you get this off your desk. You don't stare at the paper over and over again to make sure the code works, you send it to a journal. Now yes it takes a few months, that's why you have to have three papers out at all times, you have to diversify your portfolio of risk because there's a random element to this. Some good papers get turned down but some not very good papers get accepted because you get a lucky draw on the referee. So you send it out, it comes back, the referee says, \"no no here's what you should do, add these five references.\" It's sort of like what Doug North did. And you do it, it becomes a much better paper. I've had some of my better papers turned down at five journals before they were finally published. And when they were published, they were pretty good, but that was because I had outsourced a lot of the research to smart referees. So you should think of that as machine-intensive debugging. Machine-intensive debugging means I don't debug my own program. I submit it to the computer and it comes back with an error message. Well I submit my articles to journals, they come back with three really smart people working unpaid as my research assistants. Now yes, they do say that \"you're an idiot and your mother should never have been born,\" they make comments you want to ignore but by and large their suggestions improve your paper dramatically. So you should always try to be Munger compliant.</p> <p>I told some of my graduate students, there will come a day when you will be upset when one of your papers is accepted because you will no longer be compliant. And a good friend of mine who is now a tenured full professor in England just wrote me and said, \"Darn it, that finally happened. I got a paper accepted and I woke up in the middle of the night and I said, 'I only have two papers at journals! I have to go write something!'\" That's a sign you're a success.</p> <p>Petersen: Yeah, when you think about, I like what you said about the research assistants. If you wanted to hire twenty tenured faculty as research assistants you'd have to pay them thousands upon thousands of dollars. But you walk into a seminar room and give a bad talk and suddenly they're all throwing out suggestions and comments and they're being your research assistants for free.</p> <p>Munger: And very helpful and they're grateful if you take their comment seriously. So that's actually---there's nothing wrong with doing that. The research enterprise is more collaborative than most people are willing to admit even to themselves, and the reason is because those useful comments come wrapped in, \"you're an idiot.\" But if you can unwrap that and just take the kernel, the content of the message---because a lot of times when you give a seminar one of the problems with giving a seminar is you learn all the problems with the paper. And economists are pretty harsh and aggressive about making their criticism. Think of them as research assistants and it makes you much more receptive. I was surprised, Doug North---this was after he won the Nobel Prize---people would just viciously say, \"This is completely worthless. I would be embarrassed to write this and I don't have a Nobel Prize. I don't see how you can do this.\" And Doug would just nod and then they would say, \"Here's what you should do.\" He'd write it down and thank them it didn't make him mad at all, he didn't care.</p> <p>Petersen: OK, so developing a thick skin seems to be an asset here.</p> <p>Munger: No what you said is right. Think of them as research assistants. What do you care what your research assistant thinks of you as long as they help.</p> <p>Petersen: Yeah, they do a good job they give you your suggestions, you sift through them and make your work better.</p> <p>Munger: Often when I get back referee reports and they're harsh, it'll take me a day to get over them. Oh man, I thought this was a good paper and they didn't like it. But then I will literally take a printout and take a black magic marker and redact the parts that are just ad hominem attacks. I don't care about those. And then if you look at what's left, it's usually a pretty good structure for revising your paper.</p> <p>Petersen: OK, yeah I'll have to do that.</p> <p>Munger: It sounds simple and hokey, but you don't care about the things that are just saying this is terrible. I had one referee report that said I would rather hack my way through the jungle with a penknife than have to read this paper again and I thought \"Ow!\" And then I took a black magic marker and marked it out and the rest of the report was pretty useful. The question is why you would put someone else in charge of how you feel? So don't do that, you're going to be in charge of how you feel and you're going to use, to your own benefit, the fact that smart people made good comments on your paper.</p> <p>Petersen: We have this sort of mythology of the solitary genius. Are you saying that that is not a way to live your life?</p> <p>Munger: Oh no that's exactly how you should live your life, if you're a genius.</p> <p>Petersen: But most of us aren't.</p> <p>Munger: For the rest of us who are not, no, that's not the way to live your life. So absolutely, I know I have friends, in fact one of my colleagues, Melvin Hinich, with whom I had three books, was unbelievably smart. He was able to do things with very little effort and he would often just throw out ideas and let someone else write them up because he was bored with writing them. So if you're smart enough, yes you can totally do that. My message is, all you have to be is basically average intelligence for a graduate student and if you spend a lot of time learning how to write you will also be a success. Maybe more successful than that solitary genius. It's not fair but it's true.</p> <p>Petersen: A part of it is humility. To realize when you are not a solitary genius and when you need help. But couldn't the genius also do better if he used other people as his research assistants and did all the things that a non-genius would do?</p> <p>Munger: Sure. Yes, but they're not willing to spend the effort for the most part because they've never had to. There are people that are just so good at sprinting or so good at swimming, that as long as they practice pretty hard, they don't need to worry about learning other techniques. So, one of the reasons that I am a coach about writing is that I was such a terrible writer. Most people who are really, really good at something are terrible coaches because they have a knack for it. It's the people who had to scrap at the margin, and who weren't really all that good but managed to be at least somewhat of a success because they thought about technique and they focused on getting better. Those are the best coaches. In almost every sport that I know of, the best coaches were the marginal players and I was a marginal player. So the reason that I talk about writing is that I was terrible at it</p> <p>Petersen: But you are now a success and we can all learn from your example.</p> <p>Munger: I am now a Philosopher and not a Street Porter.</p> <p>Petersen: Yes. So do you have any closing thoughts about writing? What's the core message you want people to take away from this.</p> <p>Munger: Well, William Riker, who was one of the founders of the rational choice school of public choice in political science, said that most of the people who get into academics do it because they're interested in teaching. And a lot of times they're confused and they think that teaching involves work in a classroom with students. And that's important, but the real teaching is the one that takes place through writing because once you've learned something, if you actually understand it, you can explain it to someone else and the advantage of writing it is that you can communicate this teaching to someone distant in time or someone distant in space. So the most important teaching is writing and if you think of yourself as a teacher, it's really important that you work on your writing because that's how you're going to be able to communicate this understanding that you have. Understanding is ephemeral. A lot of times when you work on something for a long time, you think \"Oh now I see it! That's actually simple.\" Well if you don't write that down it's going to be hard for someone else to replicate that moment of understanding. But if you do write it down and you explain it clearly, you've added something to the human capital of the world: what we're able to hand down, the things that we no longer have to think about because we understand them. The more you understand, the simpler things become.</p> <p>Petersen: My guest today has been Mike Munger. Mike, thanks for being on Economics Detective Radio.</p> <p>Munger: It was a pleasure Garrett, thank you.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "43:18",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "In this episode, I discuss the process of writing and being successful with Mike Munger. What follows is an edited transcript of our conversation.  Petersen: My guest today is Mike Munger of Duke University. Mike, welcome to Economics Detective Radio!..."
}