{
  "id": "tag:theatlantic.com,2020:50-613333",
  "content": "<p class=\"dropcap\" dir=\"ltr\">The unrelenting protests, the supportive statements from white leaders nationwide, and the early momentum behind policing policy changes are all indications that this might be a turning point in our nation’s battle against racism. Will we seize this opportunity or will we lose momentum, showing once again that America can be “a 10-day nation” that moves on too easily to the next crisis, as Martin Luther King Jr. warned a fellow civil-rights activist in 1963?</p><p dir=\"ltr\">My father, Emmett Rice, and I had hundreds of conversations about race and racism from the time I was a boy until a few weeks before he died, in 2011, at 91 years old. He was the most intellectually curious person I have ever known. He grew up in South Carolina in the Jim Crow era of the 1920s and ’30s. Despite losing his father when he was only 7, he graduated from college, served in World War II with the Tuskegee Airmen, earned a doctorate in economics, and became one of the seven governors of the Federal Reserve Board in the 1980s. Racism still chased him and burdened him every day of his life. So he armed me with the knowledge he’d amassed, in hopes I could do even more.</p><p dir=\"ltr\">Thirty years ago, my dad gave me his playbook to put racism to rest, and it inspired me to dedicate my career to executing his vision. Dad’s playbook included one insight that all Americans should hear, at least those who hope that when it comes to addressing racism, we can do better. As an economist, he told me that we have to “increase the cost of racist behavior.” Doing so, he said, would create the conditions for black people to harness the economic power essential to changing the narrative in white America’s mind about race.</p><p data-id=\"injected-recirculation-link\" dir=\"ltr\"><i>[<a href=\"https://www.theatlantic.com/magazine/archive/2020/07/trumps-collaborators/612250/?utm_source=feed\">Read: History will judge the complicit</a>]</i></p><p dir=\"ltr\">We can ratchet up that cost in several ways, starting today. The first step is to clarify what constitutes racist behavior. Defining it makes denying it or calling it something else that much harder. There are few things that white Americans fear more than being exposed as racist, especially when their white peers can’t afford to come to their defense. To be outed as a racist is to be convicted of America’s highest moral crime. Once we align on what racist behavior looks like, we can make those behaviors costly.</p><p dir=\"ltr\">The most well-understood dimension involves taking actions that people of color view as overtly prejudiced—policing black citizens much differently than whites, calling the police on a black bird-watcher in Central Park who is asking you to obey the law, calling somebody the N-word to show them who is boss. This is racism in the first degree. If officers anticipated that they would be held fully accountable for bad policing, they would do more good policing and we could begin healing the wounds they’ve inflicted on black people for centuries.</p><p dir=\"ltr\">Then there is opposing or turning one’s back on anti-racism efforts, often justified by the demonization of the people courageously tackling racist behavior. I call this racism in the second degree, akin to aiding and abetting. George Floyd’s death under yet another police officer’s knee exposed the NFL’s four-year effort to avoid confronting racist policing by way of demonizing Colin Kaepernick. When the NFL’s sponsors could no longer stay silent and its star players (both black and white) spoke out, the costs were so high that the commissioner felt compelled to apologize—though notably not to Kaepernick himself.</p><p data-id=\"injected-recirculation-link\" dir=\"ltr\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/06/nfls-amnesia-just-like-americas/612505/?utm_source=feed\">Jemele Hill: Suddenly the NFL cares about black lives</a>]</i></p><p dir=\"ltr\">The final, most pernicious category undergirds the everyday black experience. When employers, educational institutions, and governmental entities do not unwind practices that disadvantage people of color in the competition with whites for economic and career mobility, that is fundamentally racist—not to mention cancerous to our economy and inconsistent with the American dream. For example, the majority of white executives operate as if there is a tension between increasing racial diversity and maintaining the excellence-based “meritocracies” that have made their organizations successful. After all, who in their right mind would argue against the concept of meritocracy?</p><p dir=\"ltr\">When these executives are challenged on hiring practices, their first excuse is always “The pipeline of qualified candidates is too small, so we can only do so much right now.” Over the past 20 years, I have not once heard an executive follow up the “pipeline is too small” defense with a quantitative analysis of that pipeline. This argument is lazy and inaccurate, and it attempts to shift the responsibility to fix an institution’s problem onto black people and the organizations working to advance people of color. When asked why they have so few minorities in senior leadership roles, executives’ most common response is “There are challenges with performance and retention.” To reinforce their meritocracy narrative, white leaders point to the few black people they know who have made it to the top, concluding inaccurately that they were smarter and worked harder than the rest.</p><p dir=\"ltr\">Organizations cannot be meritocracies if their small number of black employees spend a third of their mental bandwidth in every meeting of every day distracted by questions of race and outcomes. Why are there not more people like me? Am I being treated differently? Do my white colleagues view me as less capable? Am I actually less capable? Will my mistakes reflect negatively on other black people in my firm? These questions detract from our energy to compete for promotions with white peers who have never spent a moment distracted in this way. I wager that 90 percent of the white executives who read these last sentences are now asking, particularly after recent events, “How did we miss that?” This dimension of racism is particularly hard to root out, because many of our most enlightened white leaders do not even realize what they are doing. This is racism in the third degree, akin to involuntary manslaughter: We are not trying to hurt anyone, but we create the conditions that shatter somebody else’s future aspirations. Eliminating third-degree racism is the catalyst to expanding economic power for people of color, so it merits focus at the most senior levels of education, government, and business.</p><p>Employers whose efforts to increase diversity lack the same analytical and executional rigor that is taken for granted in every other part of their business engage in practices that disadvantage black people in the competition for economic opportunity. By default, this behavior protects white people’s positions of power. The nonprofit organization that I have built over the past 20 years, Management Leadership for Tomorrow, has advanced more than 8,000 students and professionals of color toward leadership positions, and we partner with more than 120 of the most aspirational employers to support their diversity strategy, as well as their recruiting and advancement efforts. Yet I have not seen 10 diversity plans that have the foundational elements that organizations require everywhere else: a fact-based diagnosis of the underlying problems, quantifiable goals, prioritized areas for investment, interim progress metrics, and clear accountability for execution. Expanding diversity is not what compromises excellence; instead, it is our current approach to diversity that compromises excellence and becomes a self-fulfilling prophecy.</p><p>We can increase the cost of this behavior by calling on major employers to sign on to basic practices that demonstrate that black lives matter to them. These include: (1) acknowledging what constitutes third-degree racism so there is no hiding behind a lack of understanding or fuzzy math, (2) committing to developing and executing diversity plans that meet a carefully considered and externally defined standard of rigor, and (3) delivering outcomes in which the people of color have the same opportunities to advance.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2020/06/american-nightmare/612457/?utm_source=feed\">Read: To be black in America is to stare into the mirror of your own extinction</a>]</i></p><p>Companies that sign on will be recognized and celebrated. Senior management teams that decline to take these basic steps will no longer be able to hide, and they will struggle to recruit and retain top talent of all colors who will prefer firms that have signed on. The economic and reputational costs will increase enough for behavior and rhetoric to change. Then more people of color will become economically mobile, organizations will become more diverse and competitive, and there will be a critical mass of black leaders whose institutional influence leads to more racially equitable behavior. These leaders will also have the economic power to further elevate the cost of all other types of racist behavior, in policing, criminal justice, housing, K–12 education, and health care—systems that for decades have been putting knees on the necks of our most vulnerable citizens and communities.</p><p>Third-degree racism can be deadly. For at least the first few months of the COVID-19 pandemic, the Centers for Disease Control and Prevention mandated that in order to get tested, you had to go to a primary-care doctor to get a prescription and then, in some areas, also get a referral to a specialist who could approve a test, because they were in limited supply. That process made it much harder for minorities to access tests, because they are much less likely to have  primary-care physicians. This is one of several reasons the hospitalization and death rates for minorities are disproportionately higher than those for whites. If the people who designed that process knew up front that they would be exposed as racist, fired, and ostracized if their approach put minorities at a greater health risk than white people, they would have designed it differently and saved black lives. Just having a critical mass of minorities in decision-making roles regarding that test-qualification process would have also saved many lives.</p><p>Rooting out third-degree racism is what will ultimately change the narrative about race. When white people see more black people on the same path as they are, when white people are working in diverse organizations, and when they are proximate to black leaders beyond athletes and entertainers, only then will they stop fearing and feeling superior to the black people they don’t know.</p><p>This is the path that will finally lift racism’s enormous burden off the backs of black people—the burden that my dad spent his nine decades working to shed, and that he hoped to avoid passing down to me, and that I am trying not to pass down to my 18-year old son as he graduates from high school and moves away. But if I am fortunate enough to someday have a grandson, and if he can grow up in a world where he can dedicate his full energy to becoming the best American he can be—as white people have been doing for 400 years—then my dad, so many other black fathers, and maybe even George Floyd will be able to rest in peace.</p>",
  "author": {
    "name": "John Rice",
    "uri": "http://www.theatlantic.com/author/john-rice/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Getty / The Atlantic"
  },
  "title": "The Difference Between First-Degree Racism and Third-Degree Racism",
  "published": "2020-06-21T09:00:00-04:00",
  "updated": "2020-06-21T12:30:09-04:00",
  "summary": "Only when people align on what racist behavior looks like will we be able to take practical steps to make those behaviors costly.",
  "link": ""
}