{
  "title": "Pong Was Boring—And People Loved It",
  "link": "https://spectrum.ieee.org/pong-video-game",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-boxy-retro-game-console-with-a-crt-screen-with-the-word-pong-on-the-front.jpg?id=31999182&width=1245&height=700&coordinates=0%2C371%2C0%2C371\"/><br/><br/><p>\n<strong>November marks the</strong> 50th anniversary of \n\t<em>Pong</em>. Why should we care?\n</p><p>\n\tFor starters, \n\t<em>Pong</em> is the first video game that millions of people welcomed into their homes to play on their own televisions. <a href=\"https://spectrum.ieee.org/pong\" target=\"_self\"><em>Pong</em> kick-started a global video-game industry</a> that is now worth upwards of <a href=\"https://earthweb.com/how-much-is-the-gaming-industry-worth/\" rel=\"noopener noreferrer\" target=\"_blank\">US $300 billion</a>. And <em>Pong</em> still has a place in active research, for <a href=\"https://spectrum.ieee.org/ai-pong-uncertainty\" target=\"_self\">training AI algorithms</a>, <a href=\"https://spectrum.ieee.org/pong-in-a-dish\" target=\"_blank\">strengthening neural networks</a>, and developing the <a href=\"https://spectrum.ieee.org/elon-musk-brain-neuralink\" target=\"_self\">brain-machine interface called Neuralink</a>, among other things.\n</p><hr/><p>\n\tAnd yet as a Gen-Xer born too late to have enjoyed \n\t<em>Pong</em> as a child, I have trouble fathoming how anyone could sit in front of a TV watching a square dot—not even a round ball—bounce back and forth across the dark, featureless screen. Was this really fun? To celebrate the half-century persistence of <em>Pong</em>, I set out to discover why so many people love the most boring video game of all time.\n</p><h2>What is <em>Pong?</em></h2><p>\n\tIn case you have somehow never encountered \n\t<em>Pong</em>, it is simplicity itself—represented on screen as a moving dot, two vertical lines with which to hit the dot, and squared-off digits reflecting the score. The game mimics table tennis, with two people competing against each other to get the ball past their opponent. Players can move their paddle vertically (but not horizontally) to deflect the ball, and the ball can also bounce off the top and bottom of the screen. The ball speeds up the longer you rally, and each hit is accompanied by a satisfying “click” sound. If you miss, your opponent scores a point. The first player to reach 11 points wins.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"A bearded white man smiles as he stands in front of a retro game console.\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"abb9ec2384c41b0f49126f325550c83e\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"1c49d\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-bearded-white-man-smiles-as-he-stands-in-front-of-a-retro-game-console.jpg?id=31999194&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\" style=\"max-width: 100%;\">Allan Alcorn, shown here in 2011, designed Pong as an exercise, to learn about how to design video games.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\" style=\"max-width: 100%;\"><a href=\"https://commons.wikimedia.org/wiki/File:Al_Alcorn,_Pong,_CHM_2011.jpg\" rel=\"noopener noreferrer\" target=\"_blank\">vonguard/Wikipedia</a></small>\n</p><p>\n\tThe game was actually created as part of a training exercise to get a young engineer named \n\t<a href=\"https://archive.computerhistory.org/resources/access/text/2012/09/102658257-05-01-acc.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Allan Alcorn</a> acquainted with video-game development. <a href=\"https://www.si.edu/media/NMAH/NMAH-AC1498_Transcript_NolanBushnell.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Nolan Bushnell </a>and <a href=\"https://www.youtube.com/watch?v=6arAY7cUa5I&t=6s\" rel=\"noopener noreferrer\" target=\"_blank\">Samuel “Ted” Dabney</a> had recently started <a href=\"https://www.computerhistory.org/revolution/computer-games/16/185\" rel=\"noopener noreferrer\" target=\"_blank\">Atari</a>, and they hired Alcorn as their third employee. Alcorn had majored in electrical engineering and computer science at the University of California, Berkeley, but had never played a video game before. At the time, video games were mostly the domain of research laboratories and universities. Under the guise of a contract for General Electric, Bushnell asked Alcorn to design a game similar to ping-pong that could be played on a television.\n</p><p>\n\tBecause \n\t<em>Pong</em> was developed before the debut of microcontrollers, the circuit board consisted of hardwired, discrete logic components. The arcade version included 66 integrated circuits, a pair of <a href=\"https://spectrum.ieee.org/chip-hall-of-fame-signetics-ne555\" target=\"_self\">555 timers</a>, and a few transistors. (For a deeper dive into <em>Pong</em>’s design, see Hugo Holden’s article, “<a href=\"https://www.worldphaco.com/uploads/LAWN_TENNIS.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Atari Pong E Circuit Analysis & Lawn Tennis: Building a Digital Video Game with 74 Series TTL IC’s</a>,” Dan Boris’s <a href=\"http://atarihq.com/danb/files/PongSchematic.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">redraw of the circuit diagram</a>, and Ricardo Ramos’s account of <a href=\"https://ricardoramos.me/pong-board/\" rel=\"noopener noreferrer\" target=\"_blank\">building a <em>Pong</em> clone</a>.)\n</p><p class=\"pull-quote\">\n\tTo celebrate the half-century persistence of \n\t<em>Pong</em>, I set out to discover why so many people love the most boring video game of all time.\n</p><p>\n\tBushnell understood the economics of pinball machines and other arcade games, and so he decided to add a coin box to the \n\t<em>Pong</em> arcade console [pictured at top]. He beta tested it at Andy Capp’s Tavern in Sunnyvale, Calif. According to <em>Pong</em> lore, people lined up for their turn to stuff quarters into the machine and play. Eventually, the manager called Alcorn because the coin box was jammed to overflowing and the game had stopped working.\n</p><p>\n\tAtari sold \n\t<a href=\"https://www.computerhistory.org/revolution/computer-games/16/183\" rel=\"noopener noreferrer\" target=\"_blank\">about 35,000 consoles</a> for use in arcades, bars, and restaurants, but the real game changer, as it were, didn’t happen until 1975, when Atari introduced <em>Home Pong</em>, for play on your own TV set. The controller was a brown box with a dial on each side, forcing players to play shoulder to shoulder. It was advertised as working with any television set, but you could only play the one game. Later versions had individual controllers with long cords that allowed players to sit back more comfortably. Hundreds of thousands of <em>Pong</em> sets were distributed through the department store Sears. The game was also one of the original titles included with the <a href=\"https://spectrum.ieee.org/the-consumer-electronics-hall-of-fame-atari-2600\" target=\"_self\">Atari 2600</a>, a video-game system introduced in 1977 that let you play different games by swapping out the game cartridge.\n</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A game console for the video game Pong has two knobs and a digital readout that says Tele-Games.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"4def229fa141131475c291a823b38a21\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"740c5\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-game-console-for-the-video-game-pong-has-two-knobs-and-a-digital-readout-that-says-tele-games.jpg?id=31999216&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Atari’s home version of Pong was released through Sears in 1975.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\"><a href=\"https://commons.wikimedia.org/wiki/File:TeleGames-Atari-Pong.png\" rel=\"noopener noreferrer\" target=\"_blank\">Evan Amos/Wikipedia</a></small>\n</p><p>\n\tMeanwhile, Atari had to contend with the problems of \n\t<em>Pong</em>’s popularity. Back in 1972, Magnavox had introduced its Odyssey home video-game system, which included a game called <em>Table Tennis</em>. Two years later, it <a href=\"https://thinksetmag.com/insights/digital-detective-pong\" rel=\"noopener noreferrer\" target=\"_blank\">filed a lawsuit</a> against Atari alleging copyright infringement; that suit was settled out of court. Rival companies brought out similar <em>Pong</em>-like games, as did Atari itself. Bushnell wanted a one-player <em>Pong</em>-type game, so he worked with <a href=\"https://www.retrogamer.net/blog_post/remembering-steve-bristow/\" rel=\"noopener noreferrer\" target=\"_blank\">Steve Bristow</a> and <a href=\"https://www.thehenryford.org/explore/stories-of-innovation/visionaries/steve-wozniak/\" rel=\"noopener noreferrer\" target=\"_blank\">Steve Wozniak</a> to develop <a href=\"https://spectrum.ieee.org/atari-breakout\" target=\"_self\"><em>Breakout</em></a>, a brick-breaking game that also proved wildly popular. In 2015, the <a href=\"https://www.museumofplay.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Strong National Museum of Play</a>, in Rochester, N.Y., inducted <em>Pong</em> into its <a href=\"https://www.museumofplay.org/exhibits/world-video-game-hall-of-fame/inducted-games/\" rel=\"noopener noreferrer\" target=\"_blank\">World Video Game Hall of Fame</a>, citing its popularity and influence in launching the video-game industry.\n</p><p>\n<em>Pong</em> was not the first video game, nor the first table-tennis video game, nor the first home video game, and yet it was the one that introduced millions of children and their parents to the idea of video gaming.\n</p><h2>But was <em>Pong</em> fun?</h2><p>\n\tI first encountered \n\t<em>Pong</em> in the early 1980s, on an Atari 2600 at my kindergarten best friend’s house. I didn’t see the magic then, and I still don’t. How was this <em>the</em> game that launched a billion-dollar industry? I recently posed this question to friends of a certain age and was surprised to receive a resounding chorus of cheers for <em>Pong</em>. Yes, <em>Pong</em> really was fun! My curiosity piqued, I followed up with some informal interviews and an entirely unscientific sampling methodology, and I have compiled the top five reasons people seem to love <em>Pong</em>.\n</p><p>\n\tAbove all, the \n\t<strong>novelty factor</strong> seems to propel \n\t<em>Pong</em> to the top of the pantheon of video games. <a href=\"https://computerhistory.org/profile/david-brock/\" rel=\"noopener noreferrer\" target=\"_blank\">David C. Brock</a>, director of curatorial affairs at the Computer History Museum, fondly remembered playing <em>Pong</em> at home and in a restaurant in Pennsylvania. <em>Pong</em> was so new and different that it made an impression, Brock recalls. Pinball may literally have all the bells and whistles, but it was a game from the previous century. <em>Pong</em> was the future, even if that future was a black-and-white television screen.\n</p><h3></h3><br/><h2>Top 5 Reasons People Love Pong</h2><p>\n1. Novelty\n</p><p>\n2. Sociability\n</p><p>\n3. Calming Effect (ASMR)\n</p><p>\n4. The Challenge\n</p><p>\n5. Nostalgia\n</p><p>\n\tConnected to the novelty factor is that \n\t<em>Pong</em> is <strong>an inherently social game</strong>. No longer were players competing one by one to get the highest score. Now you could compete directly against your friends and family. My University of South Carolina colleague <a href=\"https://sc.edu/study/colleges_schools/artsandsciences/history/our_people/directory/risk.php\" rel=\"noopener noreferrer\" target=\"_blank\">James Risk</a> grew up in Mooresville, Indiana, a small town southwest of Indianapolis. His house was the first in the neighborhood to have a home version of <em>Pong</em>. James’s father would never relinquish his turn, even when he lost, so James and his siblings had to duke it out to be Player 2. Even the family cat would get into the action, chasing the moving dot on the screen.\n</p><p>\n\tLynn Heidelbaugh, a museum curator in Washington, D.C., remembers watching her older brothers play \n\t<em>Pong</em>. She found the game mesmerizing—watching the ball move back and forth, bouncing at angles off the paddles, each hit accompanied by a satisfying chirp. It’s not a stretch to think that <em>Pong</em> induces <strong>autonomous sensory meridian response, or ASMR</strong>, the calming and euphoric feeling triggered by repetitive auditory or visual stimuli. <em>Pong</em>’s distinctive sound was Alcorn’s response to Bushnell’s request for the roar of crowds. Alcorn crafted the sound from tones that already existed in the sync generator.\n</p><p>\n\tDespite the simplicity of the game, \n\t<em>Pong</em> was surprisingly <strong>challenging to play</strong>. The controllers were not particularly sensitive, and it was easy to miss a ball you thought you had. For many players, this imperfection made the game addictive, as they kept trying to improve. Another defect (or feature, as Alcorn preferred to think of it) was that the paddles did not move fully to the top or bottom of the screen. This was due to a problem in the circuitry. Alcorn could have fixed it, but it turned out to be a happy accident. Had the paddles reached the edges, really good players could have rallied indefinitely. Instead, the game inevitably ends after a few minutes, only to be started again by gamers intent on winning.\n</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"18155cb8154a8536878b40915cfea3ed\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/e4VRgY3tkh0?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>\n\tA final reason people love \n\t<em>Pong</em> is <strong>nostalgia</strong>, whether that’s a recalling of childhood memories or a wistfulness for a past they never had. <a href=\"https://www.eiu.edu/geoscience/faculty.php?id=kjlewandowski&subcat=\" rel=\"noopener noreferrer\" target=\"_blank\">Katherine Lewandowski</a>, now a geologist at Eastern Illinois University, didn’t play much <em>Pong</em> growing up, but was reintroduced to the game as an undergraduate at Vanderbilt in the 1990s. She says she was a novice compared to her friends, who had been playing for years, but she still enjoyed a spin at the console at Obie’s Pizza while waiting for their deep dish.\n</p><p>\n<em>IEEE Spectrum’s </em>special projects editor <a href=\"https://spectrum.ieee.org/u/stephen-cass\" target=\"_self\">Stephen Cass</a> grew up in Ireland. By the time arcade games arrived there, Cass says, <em>Pong</em> was not among the offerings—manufacturers had already moved on to other titles. His strongest <em>Pong</em> memory is thus not of the game but of the 1994 Frank Black song “Whatever Happened to Pong?,” which leveraged the ’90s trend of ’70s nostalgia. A few years later, <em>Pong</em> made a <a href=\"https://70s-show-diary.tumblr.com/post/118881047312/one-of-the-great-somewhat-reoccurring-plots-of\" rel=\"noopener noreferrer\" target=\"_blank\">recurring appearance</a> on season 1 of <em>That ’70s Show</em>, thereby cementing the nostalgia.\n</p><p>\n\tFor me, though, \n\t<em>Pong</em> doesn’t hold a candle to <em>Frogger</em>. My father, who was an early adopter of almost all things tech, never saw value in video games, so I had to run down the street to my friend’s house to play <em>Frogger</em> on her Atari. I love that pixelated frog and the many ways to die—I was not particularly good at the game and died frequently. To this day, references to <em>Frogger</em> inevitably surface whenever I make ill-timed attempts at jaywalking in the city.\n</p><p>\nI suspect that every generation of the past half century has its game, the one that introduced them to video games, that triggers waves of nostalgia and fond memories, the old favorite that people are excited to see when they serendipitously encounter it in a pizza parlor or on an emulator in a museum. It could be \n\t<em>Pong</em> or <em>Frogger</em> or <em>Pac-Man</em> or <em>Tetris</em> or <em>Super Mario Bros.</em> or <em>Space Invaders</em>—or the next big thing! What game do you think we will be talking about in 50 years?\n</p><p>\n<em>Part of a </em><a href=\"https://spectrum.ieee.org/collections/past-forward/\" target=\"_self\"><em>continuing series</em></a> <em>looking at photographs of historical artifacts that embrace the boundless potential of technology.</em>\n</p><p>\n<em>An abridged version of this article appears in the November 2022 print issue as “In Praise of Pong.” </em>\n</p>",
  "pubDate": "Sun, 30 Oct 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/pong-video-game",
  "category": [
    "Al alcorn",
    "Nolan bushnell",
    "Past forward",
    "Pong",
    "Type:departments",
    "Video games"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}