{
  "title": "Can you tackle systemic racism without confronting race?",
  "link": "https://publicintegrity.org/labor/can-you-tackle-systemic-racism-without-confronting-race/",
  "dc:creator": "April Simpson",
  "pubDate": "Fri, 21 Oct 2022 11:00:00 +0000",
  "category": [
    "Inequality",
    "Labor",
    "Watchdog newsletter"
  ],
  "guid": "https://publicintegrity.org/?p=116754",
  "description": "<figure><img width=\"300\" height=\"200\" src=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?fit=300%2C200&ssl=1\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?w=2560&ssl=1 2560w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=300%2C200&ssl=1 300w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1024%2C683&ssl=1 1024w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=768%2C512&ssl=1 768w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1536%2C1024&ssl=1 1536w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=2048%2C1365&ssl=1 2048w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1200%2C800&ssl=1 1200w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1568%2C1045&ssl=1 1568w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=400%2C267&ssl=1 400w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=150%2C100&ssl=1 150w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?w=2340&ssl=1 2340w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" /></figure>\n<p>It&#8217;s not a question of simple semantics. Words exercise power and consequences.&#160; In the governmental jargon that can turn rhetoric into reality, two words — “disadvantaged” and “underserved” — help to explain why one act of Congress failed to provide long sought financial assistance to Black farmers, but another may succeed. The American Rescue Plan [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://publicintegrity.org/labor/can-you-tackle-systemic-racism-without-confronting-race/\">Can you tackle systemic racism without confronting race?</a> appeared first on <a rel=\"nofollow\" href=\"https://publicintegrity.org\">Center for Public Integrity</a>.</p>\n",
  "content:encoded": "<figure><img width=\"300\" height=\"200\" src=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?fit=300%2C200&ssl=1\" class=\"attachment-medium size-medium wp-post-image\" alt=\"\" decoding=\"async\" loading=\"lazy\" srcset=\"https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?w=2560&ssl=1 2560w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=300%2C200&ssl=1 300w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1024%2C683&ssl=1 1024w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=768%2C512&ssl=1 768w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1536%2C1024&ssl=1 1536w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=2048%2C1365&ssl=1 2048w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1200%2C800&ssl=1 1200w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=1568%2C1045&ssl=1 1568w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=400%2C267&ssl=1 400w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?resize=150%2C100&ssl=1 150w, https://i0.wp.com/publicintegrity.org/wp-content/uploads/2022/10/GettyImages-1313715179-scaled.jpg?w=2340&ssl=1 2340w\" sizes=\"(max-width: 34.9rem) calc(100vw - 2rem), (max-width: 53rem) calc(8 * (100vw / 12)), (min-width: 53rem) calc(6 * (100vw / 12)), 100vw\" /></figure><span class=\"rt-reading-time\" style=\"display: block;\"><span class=\"rt-label rt-prefix\">Reading Time: </span> <span class=\"rt-time\">7</span> <span class=\"rt-label rt-postfix\">minutes</span></span>\n<p>It&#8217;s not a question of simple semantics. Words exercise power and consequences.&nbsp;</p>\n\n\n\n<p>In the governmental jargon that can turn rhetoric into reality, two words — “disadvantaged” and “underserved” — help to explain why one act of Congress failed to provide long sought financial assistance to Black farmers, but another may succeed.</p>\n\n\n\n<p>The <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/1319/text?q=%7B%22search%22%3A%5B%22american+rescue+plan%22%2C%22american%22%2C%22rescue%22%2C%22plan%22%5D%7D&r=7&s=1\">American Rescue Plan Act</a>, a bipartisan measure signed into law last year by President Joe Biden, set aside $4 billion for farmers considered socially disadvantaged.&nbsp;</p>\n\n\n\n<div class=\"is-layout-flow wp-block-group alignwide newspack-pattern subscribe__style-6 is-style-border compress-newsletter has-secondary-background-color has-background\"><div class=\"wp-block-group__inner-container\">\n<div class=\"is-layout-flex wp-container-39 wp-block-columns are-vertically-aligned-center\">\n<div class=\"is-layout-flow wp-block-column is-vertically-aligned-center\">\n<p class=\"has-white-color has-text-color\"><meta charset=\"utf-8\"><strong>Watchdog delivered </strong></p>\n\n\n\n<p class=\"has-white-color has-text-color has-small-font-size\">Want our investigations in your inbox? Subscribe to our Watchdog newsletter.</p>\n</div>\n\n\n\n<div class=\"is-layout-flow wp-block-column is-vertically-aligned-center\"><amp-layout id=\"n4a5\">\n\t<div class=\"wp-block-jetpack-mailchimp\" data-blog-id=\"201594328\">\n\t\t<form\n\t\t\taria-describedby=\"wp-block-jetpack-mailchimp_consent-text\"\n\t\t\t\t\t>\n\t\t\t<p>\n\t\t\t\t<input\n\t\t\t\t\taria-label=\"Enter your email\"\n\t\t\t\t\tplaceholder=\"Enter your email\"\n\t\t\t\t\trequired\n\t\t\t\t\ttitle=\"Enter your email\"\n\t\t\t\t\ttype=\"email\"\n\t\t\t\t\tname=\"email\"\n\t\t\t\t/>\n\t\t\t</p>\n\t\t\t\t\t\t\t<input\n\t\t\t\t\tname=\"interests[3f37dae637]\"\n\t\t\t\t\ttype=\"hidden\"\n\t\t\t\t\tclass=\"mc-submit-param\"\n\t\t\t\t\tvalue=\"1\"\n\t\t\t\t/>\n\t\t\t\t\t\t\t\t\t\n<div class=\"wp-block-jetpack-button wp-block-button\" style=\"\"><button class=\"wp-block-button__link has-background has-primary-background-color\" style=\"\" data-id-attr=\"mailchimp-button-block-37\" id=\"mailchimp-button-block-37\" type=\"submit\"><strong>Sign up</strong></button></div>\n\t\t\t<p id=\"wp-block-jetpack-mailchimp_consent-text\">\n\t\t\t\t\t\t\t</p>\n\n\t\t\t\n\t\t</form>\n\t\t\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_processing\" role=\"status\">\n\t\t\t\tProcessing…\t\t\t</div>\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_success\" role=\"status\">\n\t\t\t\tSuccess! You&#039;re on the list.\t\t\t</div>\n\t\t\t<div class=\"wp-block-jetpack-mailchimp_notification wp-block-jetpack-mailchimp_error\" role=\"alert\">\n\t\t\t\tWhoops! There was an error and we couldn&#039;t process your subscription. Please reload the page and try again.\t\t\t</div>\n\n\t\t\t</div>\n\t</amp-layout></div>\n</div>\n</div></div>\n\n\n\n<p>“A socially disadvantaged group,” according to U.S. Department of Agriculture <a href=\"https://uscode.house.gov/view.xhtml?req=(title:7%20section:2279%20edition:prelim)\">policy guidelines</a>, “is a group whose members have been subject to racial or ethnic prejudice because of their identity as members of a group without regard to their individual qualities.” They include African Americans, American Indians, Alaskan Natives, Asians, Hispanics, Native Hawaiians and Pacific Islanders.&nbsp;</p>\n\n\n\n<p>Within weeks, white farmers argued that it was unconstitutional for the $1.9 trillion rescue plan to authorize appropriations that excluded farmers based on their race or ethnicity. A federal judge in Florida later agreed and blocked implementation of the aid to farmers of color on grounds that it discriminated against white farmers.</p>\n\n\n\n<p>The U.S. has long been caught in a tug of war over whether race can be used as a remedy for racial discrimination. The U.S. Supreme Court, which has historically interpreted the Constitution to prohibit many race-specific measures, will hear oral arguments this fall in cases against Harvard University and the University of North Carolina at Chapel Hill on whether colleges and universities can consider students’ race and ethnicity in admissions.</p>\n\n\n\n<p>On his first day in office, Biden issued an executive order to advance racial equity across the federal government. The USDA program to cancel certain loan debts held by socially disadvantaged farmers was considered an important early step toward fulfilling that promise. But legal challenges prevented the program from taking effect.&nbsp;</p>\n\n\n\n<iframe title=\"Rates of Direct Loan Delinquency \" aria-label=\"Bar Chart\" id=\"datawrapper-chart-NItoD\" src=\"https://datawrapper.dwcdn.net/NItoD/3/\" scrolling=\"no\" frameborder=\"0\" style=\"width: 0; min-width: 100% !important; border: none;\" height=\"254\"></iframe><script type=\"text/javascript\">!function(){\"use strict\";window.addEventListener(\"message\",(function(e){if(void 0!==e.data[\"datawrapper-height\"]){var t=document.querySelectorAll(\"iframe\");for(var a in e.data[\"datawrapper-height\"])for(var r=0;r<t.length;r++){if(t[r].contentWindow===e.source)t[r].style.height=e.data[\"datawrapper-height\"][a]+\"px\"}}}))}();</script>\n\n\n\n<p>Then the $738 billion <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/5376/text\">Inflation Reduction Act</a>, passed on a sharply partisan vote and signed into law in August, presented a solution. It amends a section of the previous bill from benefiting “socially disadvantaged farmers” to “underserved farmers,” a broader category that can include veterans, beginning farmers and those in high poverty areas. Included in that section is $2.2 billion for farmers who can <a href=\"https://www.usda.gov/media/press-releases/2022/10/13/usda-seeking-public-comment-new-provision-provide-assistance\">prove they experienced discrimination</a> from the USDA. </p>\n\n\n\n<p>It separately appropriates another $3.1 billion for all borrowers who are behind on loan payments or face other financial risks. This week, USDA announced that it has distributed nearly $800 million under the program to more than 13,000 distressed borrowers, with plans to provide up to $500 million more to as many as 23,000 additional borrowers.&nbsp;</p>\n\n\n\n<p>And it repeals the debt cancellation program in the American Rescue Plan Act.</p>\n\n\n\n<p>\"We need to be clear about this. The Inflation Reduction Act, and the work that Congress did, charts a new pathway and a new set of tools for USDA to have,” USDA Secretary Tom Vilsack said on a call with reporters this week. “These tools are available to USDA borrowers regardless of race or gender or geography or size of operation or type of operation.”</p>\n\n\n\n<p>But the new measure has prompted legal challenge – this time, from Black farmers and other farmers of color.&nbsp;</p>\n\n\n\n<p>A class-action lawsuit filed this month alleges that the U.S. government broke its contract with the farmers when it agreed to cancel their loan debts, while in return the farmers accepted the government’s calculation of their debt and waived their right to appeal. The farmers were harmed because they made purchases and other investments in anticipation of the financial relief, according to the <a href=\"https://action.bencrump.com/wp-content/uploads/2022/10/Complaint-as-Filed_Socially-Disadvantaged-Farmers-00840987xE6B76.pdf\">suit</a> brought by civil rights attorney Ben Crump and others.</p>\n\n\n\n<p>Some Black farmers and their advocates have been skeptical, disappointed and frustrated because the Inflation Reduction Act does not directly address what they consider race-based difficulties, such as lower rates of loan approval and higher rates of delinquency.</p>\n\n\n\n<p>Others, however, are hopeful that the overall assistance to farmers of color will be equal to or perhaps even greater than it would have been under the previous bill.&nbsp;</p>\n\n\n\n<p>As it turned out, far fewer Black farmers were eligible to have their loans canceled under the American Rescue Plan provision than Black farmer advocates had initially estimated. About 3,100 Black farmers would have qualified, and their combined debt from those loans was less than $300 million, U.S. Rep. Alma Adams, D-N.C., vice chair of the House Agriculture Committee, noted in a July letter to Secretary Vilsack.&nbsp;</p>\n\n\n\n<p>That meant most Black farmers would have been left out. Overlooked is that “USDA is not providing loans to Blacks,” said Lloyd Wright, a former director of the USDA’s Office of Civil Rights., Wright is among those hopeful that far more Black farmers will receive financial assistance from the two provisions in the Inflation Reduction Act than they would have through the previous bill, although he worries about whether implementation will bear this out.&nbsp;</p>\n\n\n\n<p>In a broader context, though, the situation illustrates the difficult dilemma for efforts to address racial disparities. How can you ameliorate racial discrimination without spelling out its causes and effects?&nbsp;</p>\n\n\n\n<p>“It's like saying you want to address gender issues, but you can't do anything that specifically focuses on women,” Ralph Richard Banks, faculty director of the Stanford Center for Racial Justice at Stanford Law School, said in a recent interview.&nbsp;</p>\n\n\n\n<p>“In our society,” he said, “the legal norms are kind of opposed to focusing on race, per se. We want to have racial equality, equity and justice, and all this, but we don't want to single race out or treat people differently on account of race, and that does make it difficult to address race-based inequities if we don't take race into account directly.”&nbsp;</p>\n\n\n<h2 id=\"h-a-system-that-discriminates\">A system that discriminates</h2>\n\n\n<p>Cash flow is critical in the business of farming, where short- and long-term income and essential operating revenues can be determined more by the whims of Mother Nature than the desires of customers and abilities of farmers. The financial difficulties of one year can easily pass into the next, and this generation’s hardships can become those of the next generation as well.</p>\n\n\n\n<p>That makes loans essential to commercial farmers, and timely repayment of those loans more vulnerable to major disruptions in the economy, such as those related to the COVID-19 pandemic and the historic increases in the rate of inflation.</p>\n\n\n\n<p>Black farmers and their advocates contend that over the years they have received less than their fair share of assistance through the USDA program that provides low-interest direct loans for activities such as purchasing land, crops, livestock and equipment.&nbsp;</p>\n\n\n\n<p>That imbalance is ongoing, they say.</p>\n\n\n\n<p>“We are in a system that’s systematically biased and racist against those farmers,” said Kara Boyd, president of the Association of American Indian Farmers and a member of the National Black Farmers Association, led by her husband, John. The Boyds and two other Virginia farmers are the named plaintiffs in the class-action lawsuit.</p>\n\n\n\n<p>Advocates say that the current economic hardships help explain the racial differences in loan delinquency the Center for Public Integrity found in 2022 USDA data.</p>\n\n\n\n<p>“Unfortunately, some of the farmers who were struggling before, now, they’re struggling even more because of the repeal of the act,” Boyd said.</p>\n\n\n\n<p>But on the call with reporters Tuesday, Secretary Vilsack pointed to the $2.2 billion provision for farmers who feel that they have been unfairly treated in the past by the USDA. The department is currently seeking input on how to design and structure the program, which will be administered by one or more third parties. &nbsp;</p>\n\n\n<h2 id=\"h-the-case-for-and-against-colorblindness\">The case for (and against) colorblindness</h2>\n\n\n<p>The debate over “colorblind” remedies for racial discrimination has a history of more than 120 years in U.S. constitutional law.</p>\n\n\n\n<p>Justice John Marshall Harlan, the lone dissenter in the Supreme Court’s 1896 Plessy v. Ferguson decision that upheld “separate but equal” policies, said the Constitution prescribed color blindness in theory, but white supremacist policies were imposed in actuality.</p>\n\n\n\n<p>“The white race deems itself to be the dominant race in this country. And so it is in prestige, in achievements, in education and in power,” he wrote in his opposition to the 7-1 decision.</p>\n\n\n\n<p>“But in view of the Constitution, in the eye of the law, there is in this country no superior, dominant, ruling class of citizens. There is no caste here. Our Constitution is color-blind, and neither knows nor tolerates classes among citizens. In respect of civil rights, all citizens are equal before the law.”</p>\n\n\n\n\n\n<p>In 1978, the Supreme Court upheld affirmative action plans in the case of Regents of the University of California v. Bakke. In support of that decision, Justice Harry Blackmun agreed with fellow Justice Thurgood Marshall’s assertion that race must be considered.</p>\n\n\n\n<p>“In order to get beyond racism, we must first take account of race. There is no other way,” Blackmun wrote. “And in order to treat some persons equally, we must treat them differently. We cannot—we dare not—let the Equal Protection Clause [of the 14th Amendment] perpetuate racial superiority.”</p>\n\n\n\n<p>But others argue that colorblindness aligns with the country’s founding principles. Peter C. Myers, a professor emeritus of political science at the University of Wisconsin-Eau Claire, said Blackmun was “sorely mistaken when he declared in defense of modern race preferences.”&nbsp;</p>\n\n\n\n<p>Color-blindness requires that “distinctions of race or color play no proper part in the distributions of burdens and benefits in public law or policy” and “the recovery and secure establishment of the color-blindness principle in America’s public life are urgent moral and civic imperatives,” Myers wrote <a href=\"https://www.heritage.org/civil-society/report/the-case-color-blindness\">in a 2019 article</a> for the Heritage Foundation.</p>\n\n\n\n<p>Adia Harvey Wingfield, a sociology professor at Washington University in St. Louis, said some past efforts to remedy race-based problems in colorblind ways have widened or exacerbated racial inequality.</p>\n\n\n\n<p>Minimum wage and Social Security laws, for example, did not adequately address the situation of the disproportionately large number of Black Americans in low-pay domestic jobs.</p>\n\n\n\n<p>The G.I. Bill, which offered World War II veterans a range of financial benefits, including assistance for education and job training, was administered by states when segregation was the law in the South. Many state officials there steered Black veterans away from job training programs that could lead to higher-paying jobs, and to college degrees at Black schools that were underfunded rather than predominantly white institutions.</p>\n\n\n\n<p>And while legal school segregation was technically eliminated by the Supreme Court in 1954 and by subsequent civil rights legislation, it was effectively replaced by de facto segregation in schools drawing students from neighborhoods that still show the impacts of white supremacist efforts to keep people separated by race.</p>\n\n\n\n<p>“One of the things that’s so useful about historical research from that time period is that it shows multiple examples of race-blind public policy that still made sure racial inequality stayed in place,” Wingfield said in a recent interview.</p>\n\n\n\n<p>“Trying to solve racial inequality by not talking about racial inequality doesn’t reduce racial inequality,” she said. “It leaves it there to continue to be perpetuated in existing forms.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://publicintegrity.org/labor/can-you-tackle-systemic-racism-without-confronting-race/\">Can you tackle systemic racism without confronting race?</a> appeared first on <a rel=\"nofollow\" href=\"https://publicintegrity.org\">Center for Public Integrity</a>.</p>\n",
  "post-id": 116754
}