{
  "title": "Google Docs unveils one writer’s creative process to the world",
  "link": "https://blog.google/products/docs/google-docs-writer-process/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>When Viviana Rivero set out to write her short story “Just do it!” she decided to experiment with her process. Instead of writing alone and revealing her work to readers later, she invited thousands of people to watch her write—and comment on her writing—in real-time with Google Docs.</p><p>More than 10,000 people watched the Argentinian writer’s story come to life as she wrote it. We sat down with Rivero to learn more about how she incorporated technology into her creative process, and how it changed the final product.</p><p><b>Tell us about using Google Docs to publicly write your story.</b></p><p>Believe it or not, this was my first time using Google Docs. First, I created a new document and selected “comment-only” in the share permissions. Next, I hosted a few “live sessions” where I wrote a short story in the document and invited readers  to watch and comment. To my surprise, thousands of people contributed! The short story from this session became a part of a printed book called “Zafiros en la Piel” (“Sapphires on the skin”). The book’s back cover even has a QR code that takes the reader to the story on Google Docs, bringing these worlds together. </p><p><b>What was it like to write in front of other people?</b></p><p>It was a challenging thing to do. Usually, when a writer creates a story, they don’t find out what the reader thinks until afterward, and even then, there’s no way of gauging how people react the moment they read the words. It was different and exciting because it allowed me to see their reactions as they had them.</p><p><b>Did  your story change as a result of readers’ comments?</b></p><p>Yes! There’s a character in the story who talks with his dog. People fell in love with the dog—they wrote so many comments about it. I decided to make the dog more important to the story and gave him and his owner more dialogue.</p><p><b>Did using Google Docs affect your creative process?</b></p><p>Reading and writing can be lonely activities. While my creative process wasn’t necessarily altered (I already had the general idea for the story), the way in which we experienced the story changed. Docs helped bring the writer and reader together. These two things that are usually done in isolation were shared. It made the process much more enriching.</p><p>It also meant I showed everything that happens behind the scenes. For example, I don’t use punctuation when I write at first, just to make it faster. I typically put accents, periods and commas in after the story is written. At first I felt vulnerable because I didn’t want people to see unpolished work, but in the end, I think the readers appreciated seeing how a writer works. </p><p><b>Were there any interesting results from the experiment?</b></p><p>I was surprised by the amount of new readers who participated. I expected many people to be fans already, but there were many new readers who joined the live sessions by chance. Since writing the story, we’ve seen a 170 percent increase in sales of the paper book. It was also awarded a Bronze Lion at the Cannes Lions Film Festival. </p><p><b>Do you suggest other authors try using Google Docs and inviting readers to watch their process?</b></p><p>Many of my writer friends ask what it was like to write in front of thousands of people, something not many of them would dare to do. I tell them: Stories are something that will never die, and the way we tell them will continue to evolve. Before paper existed, people shared stories with their voices. And even if paper ceases to exist, the storyteller will remain, because people love stories. </p><p>Being able to interact with readers so closely motivated me; I hope to be able to do it again someday.</p></div></div></body></html>",
  "pubDate": "Fri, 13 Dec 2019 17:00:00 +0000",
  "guid": "https://blog.google/products/docs/google-docs-writer-process/",
  "category": [
    "Google Workspace",
    "Docs"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Google Docs unveils one writer’s creative process to the world",
    "description": "Viviana Rivero wrote a story in Google Docs, and invited readers to watch in real-time.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/Libro_Vivo_PpwoHnZ.gif",
    "site_name": "Google",
    "url": "https://blog.google/products/docs/google-docs-writer-process/"
  },
  "author": {
    "name": "Christin Parcerisa",
    "title": "Keyword Contributor",
    "department": "",
    "company": ""
  }
}