{
  "title": "BONUS: Question and Answer Episode 2",
  "link": "https://500songs.com/podcast/bonus-question-and-answer-episode-2/",
  "pubDate": "Mon, 30 Sep 2019 02:08:06 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/bonus-question-and-answer-episode-2/",
  "description": "This week's episode of <em>A History of Rock Music in Five Hundred Songs</em> is the second of two bonus episodes answering listener questions at the end of the first year of the podcast. Click the full post to read liner notes, links to more information, and a transcript of the episode. Patreon backers also have <a href=\"https://www.patreon.com/posts/30352014\">a bonus podcast,</a> answering even more questions.\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-supplemental-for-bonus-qa-2/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode. This one also includes the songs from the Patreon bonus episode, as that's even more questions and answers.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\nTranscript\n\nWelcome to the second and final part of this year's question and answer bonus podcasts. This week I'm actually going to do two of these. The one that's going on the main podcast is going to consist of those questions that my backers asked that have to do primarily with the podcast and the music, while the one that's going only to backers consists mostly of questions that have been asked about me and my life and so forth -- stuff that might be less interesting to the casual listener, but that clearly someone is interested in. Next week I get back to the main story, with an episode about Carl Perkins, but right now we're going to jump straight into the questions.\n\nMatthew Elmslie asks:\n\n\"It's not an issue you've had to confront yet, as you navigate the mid-'50s, but eventually you're going to come up against the clash between the concept of popular music where the basic unit is the song or single, and the one where the basic unit is the album. What are your thoughts on that and how do you plan to deal with it?\"\nThis is a question I had to give some consideration to when I was writing my book California Dreaming, which in many ways was sort of a trial run for the podcast, and which like the podcast told its story by looking at individual tracks. I think it can be a problem, but probably not in the way it first appears.\n\nFirst, the period where the album was dominant was a fairly short one -- it's only roughly from 1967 through about 1974 that the bands who were getting the most critical respect were primarily thinking in terms of albums rather than singles. After that, once punk starts, the pendulum swings back again, so it's not a long period of time that I have to think of in those terms. But it is something that has to be considered during that period.\nOn the other hand, even during that period, there were many acts who were still primarily singles acts -- the Monkees, Slade, the Move, T-Rex... many of whom, arguably, had more long-term influence than many of the album acts of the time.\n\nI think for the most part, though, even the big album acts were still working mostly in ways that allow themselves to be looked at through the lens of single tracks. Like even on something like Dark Side of the Moon, which is about as concept-albumy as it gets, there's still \"Money\" and \"Great Gig in the Sky\" which are individual tracks people know even if they don't necessarily know the album, and which could be used as the focus of an episode on the album. Even with Led Zeppelin, who never released singles at all, there are tracks that might as well have been singles, like \"Whole Lotta Love\" or \"Stairway to Heaven\". So for the most part it's fairly easy to find a single track I can focus on.\n\nThe real problem only comes in for a handful of albums -- records, mostly from that period in the late sixties and early seventies, which absolutely deserve to be considered as part of the podcast, but which don't have standout tracks. It's hard to pick one track from, say, Trout Mask Replica by Captain Beefheart or Astral Weeks by Van Morrison -- those two albums really do need considering as albums rather than as individual tracks -- there's no reason to choose, say, \"Frownland\" over \"The Dust Blows Forward 'n' the Dust Blows Back\" or vice versa, or \"Madame George\" over \"Slim Slow Slider\".\n\nWhat I'll do in those cases will probably vary from case to case. So with Trout Mask Replica I'd probably just pick one song as the title song for the episode but still talk about the whole album, while with Astral Weeks the most likely thing is for me to focus the episode on \"Brown-Eyed Girl\", which isn't on the album, but talk about the making of Astral Weeks after \"Brown-Eyed Girl\" was a success. That's assuming I cover both those albums at all, but I named them because I'm more likely to than not.\n\n[Excerpt: Van Morrison, “Brown-Eyed Girl”]\n\nRussell Stallings asks: \"Andrew, in [the] 60s it seems rock guitar was dominated by Stratocasters and Les Pauls, what was the guitar of choice in the period we are currently covering (1957) ?\"\n\nWell, 1957 is just about the point where this becomes an interesting question. Before this point the guitar hasn't played much of a part in the proceedings -- we've seen guitarists, but there've been more piano players -- 1957 is really the point where the guitar becomes the primary rock and roll instrument.\n\nBefore I go any further, I just want to say that I've never been a particular gearhead. There are people out there who can tell the difference instantly between different types of guitars based on a note or two. I'm not one of them -- I can sort of make out the difference between a Fendery sound and a Gibsony one and a Rickenbackery one, but not at a tremendous level of precision. I tend to care more about the technique of the player than the sound of the instrument, so this isn't my area of expertise. But I'll give this a go.\n\nNow, there wasn't a straightforward single most popular guitar at this point. It's true that from the late sixties on rock pretty much standardised around the Les Paul and the Stratocaster -- though it was from the late sixties, and you get a lot of people playing different guitars in the early and mid sixties -- but in the fifties people were still figuring things out as individuals. But at the same time, there is, sort of, an answer to this.\n\nThe Strat wasn't particularly popular in the 50s. The only first-rank 50s rocker who played a Strat was Buddy Holly, who always played one on stage, though he varied his guitars in the studio from what I've read. Buddy Holly is indirectly the reason the Strat later became so popular -- he inspired Hank Marvin of the Shadows to get one, and Marvin inspired pretty much every guitarist in Britain to copy him. But other than in surf music, the Strat wasn't really popular until around 1967. You'd occasionally get a Telecaster player in the 50s -- Buck Owens, who played on quite a few rockabilly sessions for people like Gene Vincent and Wanda Jackson before he became one of the greats of country music, played a Telecaster. And James Burton, who played in the fifties with Ricky Nelson and Dale Hawkins, among others, was another Telecaster player. But in general there weren't a lot of Fender players.\n\n[Excerpt: Ricky Nelson, “Hello, Mary Lou”, James Burton guitar solo]\n\nSome people did play Gibsons -- most of the Chicago electric blues people seem to have been Gibson people, and so was Chuck Berry. Scotty Moore also played a Gibson. But rather than go for the Les Paul, they'd mostly go for hollow-body models like the L5, which could be played as either electric or acoustic. Scotty Moore also used a custom-built Echosonic amp, so he could get a similar guitar sound on stage to the one he'd got in the studio with Sam Phillips, and he used the L5 and Echosonic combination on all the Elvis hits of the fifties. Carl Perkins did play a Les Paul at first, including on \"Blue Suede Shoes\", but he switched to a Gibson ES-5 (and got himself an Echosonic from the same person who made Scotty Moore's) after that.\n\n[Excerpt: Carl Perkins, “Matchbox”]\n\nFor acoustic guitar, people generally either used a Martin, like Elvis Presley or Ray Edenton, who was the session rhythm player who doubled Don Everly's guitar in the studio (Phil Everly would double it live, but he didn't play on the records), or they'd play a Gibson acoustic, as Don Everly and Buddy Holly did.\nBut overwhelmingly the most popular guitar on rockabilly sessions -- which means in rock and roll for these purposes, since with the exception of Chuck Berry the R&B side of rock and roll remained dominated by piano and sax -- the most popular rockabilly guitar was a Gretsch. There were various popular models of Gretsch guitar, like the Duo Jet, but the most popular were the 6120, the Country Gentleman, and the Tennessean, all of which were variants on the same basic design, and all of which were endorsed by Chet Atkins, which is why they became the pre-eminent guitars among rockabilly musicians, all of whom idolised Atkins.\nYou can hear how that guitar sounds when Atkins plays it here…\n\n[Excerpt: Chet Atkins, “Mr. Sandman”]\n\nAtkins himself played these guitars on sessions for Elvis (where he just played rhythm) and the Everly Brothers (for whom he played lead in the studio). Duane Eddy, Cliff Gallup of the Blue Caps, Eddie Cochran, and many more played Gretsch guitars in imitation of Atkins. Bo Diddley also played a Gretsch before he started playing his own custom-built guitar.\n\nThere was no default guitar choice in the 50s the way there was later, but the Gretsch seemed to be the choice of the guitarists who were most admired at the time, and so it also became the choice for anyone else who wanted that clean, country-style, rockabilly lead guitar sound. That sound went out of fashion in the later sixties, but George Harrison used a Gretsch for most of his early leads, and Michael Nesmith of the Monkees always played a Gretsch -- when they started doing twelve-strings, in 1966, they initially only made three, one for Chet Atkins, one for George Harrison, and one for Nesmith, though they later mass-produced them.\n\nBut anyway, yeah. No single answer, but Gretsch Country Gentleman, with a hollow-bodied Gibson in close second, is the closest you'll get.\n\nWilliam Maybury asks \"About when does the History of Soul divorce from the History of Rock, in your eyes?\"\nThat's a difficult question, and it's something I'll be dealing with in a lot more detail when we get to the 1970s, over a whole series of episodes. This is the grotesquely oversimplified version. The short answer is -- when \"soul\" stopped being the label that was applied to cutting-edge black music that white people could rip off. The history of rock is, at least in part, a history of white musicians incorporating innovations that first appeared in black musicians' work. It's not *just* that, of course, but that's a big part of it.\n\nNow, around 1970 or so, \"rock\" gets redefined specifically as music that is made by white men with guitars, and other people making identical music were something else. Like there's literally no difference, stylistically, between \"Maggot Brain\" by Funkadelic and things like Peter Green era Fleetwood Mac or \"Watermelon in Easter Hay\" by Frank Zappa, but people talk about P-Funk as a funk group rather than a rock group – I know the question was about soul, rather than funk, but in the early seventies there was a huge overlap between the two.\n\n[Excerpt: Funkadelic, “Maggot Brain”]\n\nBut as long as soul music remained at the forefront of musical innovations, those innovations were incorporated by white \"rock\" acts, and any attempt to tell the story of rock music which ignores George Clinton or Stevie Wonder or Sly Stone or Marvin Gaye would be a fundamentally dishonest one.\n\nBut some time around the mid-seventies, \"soul\" stops being a label that's applied to innovative new music, and becomes a label for music that's consciously retro or conservative, people like, say, Luther Vandross. Not that there's anything wrong with retro music -- and there's some great soul music made in the 80s and 90s -- but the music that was at the cutting edge was first disco and then hip-hop, and that's the music that was spawning the innovations that the rock musicians would incorporate into their work.\n\nAnd, indeed, after around 1980 rock itself becomes more consciously retro and less experimental, and so the rate of incorporation of new musical ideas slows down too, though never completely stops.\n\nBut there's always some fuzziness around genre labels. For example, if you consider Prince to be a soul musician, then obviously he's still part of the story. Same goes for Michael Jackson. I don't know if I'd consider either of them to be soul per se, but I could make a case for it, and obviously it's impossible to tell the story of rock in the eighties without those two, any more than you could tell it without, say, Bruce Springsteen.\n\nSo, really, there's a slow separation between the two genres over about a twenty-year period, starting in the mid-sixties and finishing in the mid-eighties. I *imagine* that Prince is probably the last new musician who might be described as soul who will be appearing in the podcast, but it really depends on where you draw the boundaries of what counts as soul. There'll be a few disco and hip-hop acts appearing over the last half of the series, and some of them might be considered soul by some people.\n\nThat's the best I can do at answering the question right now, but it's a vastly oversimplified version of the real answer, which is \"listen to all the podcasts for the seventies when I get to them\".\n\nOne from Jeff Stanzler:\n\n\"For me, the most surprising inclusion so far was the Janis Martin record. You did speak some about why you felt it warranted inclusion, but I'd love to hear more of your thinking on this, and maybe also on the larger philosophical question of including records that were more like significant signposts than records that had huge impact at the time.\"\n\n[Excerpt: Janis Martin, “Drugstore Rock & Roll”]\n\nSome of this goes back to some of the stuff I was talking about last week, about how there are multiple factors at play when it comes to any song I'm choosing, but the Janis Martin one makes a good example of how those factors play into each other.\n\nFirst, everything I said in that episode is true -- it *is* an important signpost in the transition of rock and roll into a music specifically aimed at white teenagers, and it is the first record I've come across that deals with the 1950s of Happy Days and American Graffiti rather than the other things that were going on in the culture. Even though \"Drugstore Rock and Roll\" wasn't a massively successful record, I think that makes it worth including.\n\nBut there were other factors that warranted its inclusion too. The first of these was simply that I wanted to include at least one song by a woman at that point. If you don't count the Platters, who had one female member, it had been three months since the last song by a woman. I knew I was going to be doing Wanda Jackson a few weeks later, but it's important to me that I show how women were always part of the story of rock and roll. The podcast is going to be biased towards men, because it's telling the story of an industry that was massively biased towards men, but where women did have the opportunity to break through I want to give them credit. This is not including \"token women\" or anything like that -- rather it's saying \"women have always been part of the story, their part of the story has been ignored, I want to do what I can to redress the balance a bit, so long as I don't move into actively misrepresenting history\".\n\nThen there's the fact that Janis Martin had what to my mind was a fascinating story, and one that allowed me to talk about a lot of social issues of the time, at least in brief.\n\nAnd finally there's the way that her story ties in with those of other people I've covered. Her admiration of Ruth Brown allowed me to tie the story in with the episode on \"Mama, He Treats Your Daughter Mean\", and also gave me a way to neatly bookend the story, while showing the influence of one of the songs I'd already covered. Her working for RCA and with the same musicians as Elvis meant that I could talk a bit more about those musicians, and her being marketed as \"the Female Elvis\" meant that I could talk about Elvis' larger cultural impact on the world in 1956, something that needed to be discussed in the series, but which I hadn't found space for in an episode on Elvis himself at that point. (And in talking about the various Elvis-based novelty records I was also able to mention a few figures who will turn up in future episodes, planting seeds for later).\n\n[Excerpt: Eddie Cochran and the Holly Twins, “I Want Elvis For Christmas”]\n\nSo that's the thinking there. Every episode has to serve a bunch of different purposes if I'm going to tell this story in only five hundred episodes, and the Janis Martin one, I think, did that better than many.\nAs to the larger question of signposts versus impact at the time -- I am trying, for the most part, to tell the story from the point of view of the time we're looking at, and look at what mattered to listeners and other musicians at the time. But you also have to fill in the details of stuff that's going to affect things in the future. So for example you can't talk about REM without first having covered people like Big Star, so even though Big Star weren't huge at the time, they'll definitely be covered. On the other hand someone like, say, Nick Drake, who had little influence until he was rediscovered decades later, won't be covered, except maybe in passing when talking about other artists Joe Boyd produced, because he didn't really have an effect on the wider story.\n\nIn general, the prime consideration for any song that I include is -- does it advance the overall story I'm telling? There'll be stuff left out that would be in if the only criterion was how people reacted to it at the time, and there'll be stuff included which, on its own merits, just wouldn't make the list at all. There's one Adam Faith album track, for example, that I'm going to talk about in roughly nine months, which I think is almost certainly not even the best track that Adam Faith recorded that day, which is about as low a bar as it gets. But it'll be in there because it's an important link in a larger story, even though it's not a song that mattered at all at the time.\n\nAnd a final question from Daniel Helton on whether I considered doing an episode on \"Ain't Got No Home\" by Clarence \"Frogman\" Henry.\n\n[Excerpt: Clarence “Frogman” Henry, “Ain't Got No Home”]\n\nIt's a great record, but much of what I'd have to say about it would be stuff about the New Orleans scene and Cosimo Matassa's studio and so forth -- stuff that I'd probably already covered in the episodes on Fats Domino and Lloyd Price (including the episode on Price that's coming up later), so it'd be covering too much of the same ground for me to devote a full episode to it.\n\nIf I was going to cover Frogman in the main podcast, it would *probably* be with \"I Don't Know Why (But I Do)\" because that came out at a time when there were far fewer interesting records being made, and I'd then cover his history including \"Ain't Got No Home\" as part of that, but I don't think that's likely.\n\nIn fact, yeah, I'll pencil in \"Ain't Got No Home\" for next week's Patreon episode. Don't expect much, because those are only ten-minute ones, but it came out at around the same time as next week's proper episode was recorded, and it *is* a great record. I'll see what I can do for that one.\n\nAnyway, between this and the Patreon bonus episode, I think that's all the questions covered. Thanks to everyone who asked one, and if I haven't answered your questions fully, please let me know and I'll try and reply in the comments to the Patreon post. We'll be doing this again next year, so sign up for the Patreon now if you want that. Next week we're back to the regular podcasts, with an episode on \"Matchbox\" by Carl Perkins.\nAlso, I'm *hoping* -- though not completely guaranteeing yet -- that I'll have the book based on the first fifty episodes done and out by this time next week. These things always take longer than I expect, but here's hoping there'll be an announcement next week. See you then.",
  "itunes:subtitle": "This weeks episode of A History of Rock Music in Five Hundred Songs is the second of two bonus episodes answering listener questions at the end of the first year of the podcast. Click the full post to read liner notes, links to more information, and a tr",
  "itunes:keywords": "bonus episodes",
  "itunes:episodeType": "bonus",
  "content:encoded": "This week's episode of <em>A History of Rock Music in Five Hundred Songs</em> is the second of two bonus episodes answering listener questions at the end of the first year of the podcast. Click the full post to read liner notes, links to more information, and a transcript of the episode. Patreon backers also have <a href=\"https://www.patreon.com/posts/30352014\">a bonus podcast,</a> answering even more questions.\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-supplemental-for-bonus-qa-2/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode. This one also includes the songs from the Patreon bonus episode, as that's even more questions and answers.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\nTranscript\n\nWelcome to the second and final part of this year's question and answer bonus podcasts. This week I'm actually going to do two of these. The one that's going on the main podcast is going to consist of those questions that my backers asked that have to do primarily with the podcast and the music, while the one that's going only to backers consists mostly of questions that have been asked about me and my life and so forth -- stuff that might be less interesting to the casual listener, but that clearly someone is interested in. Next week I get back to the main story, with an episode about Carl Perkins, but right now we're going to jump straight into the questions.\n\nMatthew Elmslie asks:\n\n\"It's not an issue you've had to confront yet, as you navigate the mid-'50s, but eventually you're going to come up against the clash between the concept of popular music where the basic unit is the song or single, and the one where the basic unit is the album. What are your thoughts on that and how do you plan to deal with it?\"\nThis is a question I had to give some consideration to when I was writing my book California Dreaming, which in many ways was sort of a trial run for the podcast, and which like the podcast told its story by looking at individual tracks. I think it can be a problem, but probably not in the way it first appears.\n\nFirst, the period where the album was dominant was a fairly short one -- it's only roughly from 1967 through about 1974 that the bands who were getting the most critical respect were primarily thinking in terms of albums rather than singles. After that, once punk starts, the pendulum swings back again, so it's not a long period of time that I have to think of in those terms. But it is something that has to be considered during that period.\nOn the other hand, even during that period, there were many acts who were still primarily singles acts -- the Monkees, Slade, the Move, T-Rex... many of whom, arguably, had more long-term influence than many of the album acts of the time.\n\nI think for the most part, though, even the big album acts were still working mostly in ways that allow themselves to be looked at through the lens of single tracks. Like even on something like Dark Side of the Moon, which is about as concept-albumy as it gets, there's still \"Money\" and \"Great Gig in the Sky\" which are individual tracks people know even if they don't necessarily know the album, and which could be used as the focus of an episode on the album. Even with Led Zeppelin, who never released singles at all, there are tracks that might as well have been singles, like \"Whole Lotta Love\" or \"Stairway to Heaven\". So for the most part it's fairly easy to find a single track I can focus on.\n\nThe real problem only comes in for a handful of albums -- records, mostly from that period in the late sixties and early seventies, which absolutely deserve to be considered as part of the podcast, but which don't have standout tracks. It's hard to pick one track from, say, Trout Mask Replica by Captain Beefheart or Astral Weeks by Van Morrison -- those two albums really do need considering as albums rather than as individual tracks -- there's no reason to choose, say, \"Frownland\" over \"The Dust Blows Forward 'n' the Dust Blows Back\" or vice versa, or \"Madame George\" over \"Slim Slow Slider\".\n\nWhat I'll do in those cases will probably vary from case to case. So with Trout Mask Replica I'd probably just pick one song as the title song for the episode but still talk about the whole album, while with Astral Weeks the most likely thing is for me to focus the episode on \"Brown-Eyed Girl\", which isn't on the album, but talk about the making of Astral Weeks after \"Brown-Eyed Girl\" was a success. That's assuming I cover both those albums at all, but I named them because I'm more likely to than not.\n\n[Excerpt: Van Morrison, “Brown-Eyed Girl”]\n\nRussell Stallings asks: \"Andrew, in [the] 60s it seems rock guitar was dominated by Stratocasters and Les Pauls, what was the guitar of choice in the period we are currently covering (1957) ?\"\n\nWell, 1957 is just about the point where this becomes an interesting question. Before this point the guitar hasn't played much of a part in the proceedings -- we've seen guitarists, but there've been more piano players -- 1957 is really the point where the guitar becomes the primary rock and roll instrument.\n\nBefore I go any further, I just want to say that I've never been a particular gearhead. There are people out there who can tell the difference instantly between different types of guitars based on a note or two. I'm not one of them -- I can sort of make out the difference between a Fendery sound and a Gibsony one and a Rickenbackery one, but not at a tremendous level of precision. I tend to care more about the technique of the player than the sound of the instrument, so this isn't my area of expertise. But I'll give this a go.\n\nNow, there wasn't a straightforward single most popular guitar at this point. It's true that from the late sixties on rock pretty much standardised around the Les Paul and the Stratocaster -- though it was from the late sixties, and you get a lot of people playing different guitars in the early and mid sixties -- but in the fifties people were still figuring things out as individuals. But at the same time, there is, sort of, an answer to this.\n\nThe Strat wasn't particularly popular in the 50s. The only first-rank 50s rocker who played a Strat was Buddy Holly, who always played one on stage, though he varied his guitars in the studio from what I've read. Buddy Holly is indirectly the reason the Strat later became so popular -- he inspired Hank Marvin of the Shadows to get one, and Marvin inspired pretty much every guitarist in Britain to copy him. But other than in surf music, the Strat wasn't really popular until around 1967. You'd occasionally get a Telecaster player in the 50s -- Buck Owens, who played on quite a few rockabilly sessions for people like Gene Vincent and Wanda Jackson before he became one of the greats of country music, played a Telecaster. And James Burton, who played in the fifties with Ricky Nelson and Dale Hawkins, among others, was another Telecaster player. But in general there weren't a lot of Fender players.\n\n[Excerpt: Ricky Nelson, “Hello, Mary Lou”, James Burton guitar solo]\n\nSome people did play Gibsons -- most of the Chicago electric blues people seem to have been Gibson people, and so was Chuck Berry. Scotty Moore also played a Gibson. But rather than go for the Les Paul, they'd mostly go for hollow-body models like the L5, which could be played as either electric or acoustic. Scotty Moore also used a custom-built Echosonic amp, so he could get a similar guitar sound on stage to the one he'd got in the studio with Sam Phillips, and he used the L5 and Echosonic combination on all the Elvis hits of the fifties. Carl Perkins did play a Les Paul at first, including on \"Blue Suede Shoes\", but he switched to a Gibson ES-5 (and got himself an Echosonic from the same person who made Scotty Moore's) after that.\n\n[Excerpt: Carl Perkins, “Matchbox”]\n\nFor acoustic guitar, people generally either used a Martin, like Elvis Presley or Ray Edenton, who was the session rhythm player who doubled Don Everly's guitar in the studio (Phil Everly would double it live, but he didn't play on the records), or they'd play a Gibson acoustic, as Don Everly and Buddy Holly did.\nBut overwhelmingly the most popular guitar on rockabilly sessions -- which means in rock and roll for these purposes, since with the exception of Chuck Berry the R&B side of rock and roll remained dominated by piano and sax -- the most popular rockabilly guitar was a Gretsch. There were various popular models of Gretsch guitar, like the Duo Jet, but the most popular were the 6120, the Country Gentleman, and the Tennessean, all of which were variants on the same basic design, and all of which were endorsed by Chet Atkins, which is why they became the pre-eminent guitars among rockabilly musicians, all of whom idolised Atkins.\nYou can hear how that guitar sounds when Atkins plays it here…\n\n[Excerpt: Chet Atkins, “Mr. Sandman”]\n\nAtkins himself played these guitars on sessions for Elvis (where he just played rhythm) and the Everly Brothers (for whom he played lead in the studio). Duane Eddy, Cliff Gallup of the Blue Caps, Eddie Cochran, and many more played Gretsch guitars in imitation of Atkins. Bo Diddley also played a Gretsch before he started playing his own custom-built guitar.\n\nThere was no default guitar choice in the 50s the way there was later, but the Gretsch seemed to be the choice of the guitarists who were most admired at the time, and so it also became the choice for anyone else who wanted that clean, country-style, rockabilly lead guitar sound. That sound went out of fashion in the later sixties, but George Harrison used a Gretsch for most of his early leads, and Michael Nesmith of the Monkees always played a Gretsch -- when they started doing twelve-strings, in 1966, they initially only made three, one for Chet Atkins, one for George Harrison, and one for Nesmith, though they later mass-produced them.\n\nBut anyway, yeah. No single answer, but Gretsch Country Gentleman, with a hollow-bodied Gibson in close second, is the closest you'll get.\n\nWilliam Maybury asks \"About when does the History of Soul divorce from the History of Rock, in your eyes?\"\nThat's a difficult question, and it's something I'll be dealing with in a lot more detail when we get to the 1970s, over a whole series of episodes. This is the grotesquely oversimplified version. The short answer is -- when \"soul\" stopped being the label that was applied to cutting-edge black music that white people could rip off. The history of rock is, at least in part, a history of white musicians incorporating innovations that first appeared in black musicians' work. It's not *just* that, of course, but that's a big part of it.\n\nNow, around 1970 or so, \"rock\" gets redefined specifically as music that is made by white men with guitars, and other people making identical music were something else. Like there's literally no difference, stylistically, between \"Maggot Brain\" by Funkadelic and things like Peter Green era Fleetwood Mac or \"Watermelon in Easter Hay\" by Frank Zappa, but people talk about P-Funk as a funk group rather than a rock group – I know the question was about soul, rather than funk, but in the early seventies there was a huge overlap between the two.\n\n[Excerpt: Funkadelic, “Maggot Brain”]\n\nBut as long as soul music remained at the forefront of musical innovations, those innovations were incorporated by white \"rock\" acts, and any attempt to tell the story of rock music which ignores George Clinton or Stevie Wonder or Sly Stone or Marvin Gaye would be a fundamentally dishonest one.\n\nBut some time around the mid-seventies, \"soul\" stops being a label that's applied to innovative new music, and becomes a label for music that's consciously retro or conservative, people like, say, Luther Vandross. Not that there's anything wrong with retro music -- and there's some great soul music made in the 80s and 90s -- but the music that was at the cutting edge was first disco and then hip-hop, and that's the music that was spawning the innovations that the rock musicians would incorporate into their work.\n\nAnd, indeed, after around 1980 rock itself becomes more consciously retro and less experimental, and so the rate of incorporation of new musical ideas slows down too, though never completely stops.\n\nBut there's always some fuzziness around genre labels. For example, if you consider Prince to be a soul musician, then obviously he's still part of the story. Same goes for Michael Jackson. I don't know if I'd consider either of them to be soul per se, but I could make a case for it, and obviously it's impossible to tell the story of rock in the eighties without those two, any more than you could tell it without, say, Bruce Springsteen.\n\nSo, really, there's a slow separation between the two genres over about a twenty-year period, starting in the mid-sixties and finishing in the mid-eighties. I *imagine* that Prince is probably the last new musician who might be described as soul who will be appearing in the podcast, but it really depends on where you draw the boundaries of what counts as soul. There'll be a few disco and hip-hop acts appearing over the last half of the series, and some of them might be considered soul by some people.\n\nThat's the best I can do at answering the question right now, but it's a vastly oversimplified version of the real answer, which is \"listen to all the podcasts for the seventies when I get to them\".\n\nOne from Jeff Stanzler:\n\n\"For me, the most surprising inclusion so far was the Janis Martin record. You did speak some about why you felt it warranted inclusion, but I'd love to hear more of your thinking on this, and maybe also on the larger philosophical question of including records that were more like significant signposts than records that had huge impact at the time.\"\n\n[Excerpt: Janis Martin, “Drugstore Rock & Roll”]\n\nSome of this goes back to some of the stuff I was talking about last week, about how there are multiple factors at play when it comes to any song I'm choosing, but the Janis Martin one makes a good example of how those factors play into each other.\n\nFirst, everything I said in that episode is true -- it *is* an important signpost in the transition of rock and roll into a music specifically aimed at white teenagers, and it is the first record I've come across that deals with the 1950s of Happy Days and American Graffiti rather than the other things that were going on in the culture. Even though \"Drugstore Rock and Roll\" wasn't a massively successful record, I think that makes it worth including.\n\nBut there were other factors that warranted its inclusion too. The first of these was simply that I wanted to include at least one song by a woman at that point. If you don't count the Platters, who had one female member, it had been three months since the last song by a woman. I knew I was going to be doing Wanda Jackson a few weeks later, but it's important to me that I show how women were always part of the story of rock and roll. The podcast is going to be biased towards men, because it's telling the story of an industry that was massively biased towards men, but where women did have the opportunity to break through I want to give them credit. This is not including \"token women\" or anything like that -- rather it's saying \"women have always been part of the story, their part of the story has been ignored, I want to do what I can to redress the balance a bit, so long as I don't move into actively misrepresenting history\".\n\nThen there's the fact that Janis Martin had what to my mind was a fascinating story, and one that allowed me to talk about a lot of social issues of the time, at least in brief.\n\nAnd finally there's the way that her story ties in with those of other people I've covered. Her admiration of Ruth Brown allowed me to tie the story in with the episode on \"Mama, He Treats Your Daughter Mean\", and also gave me a way to neatly bookend the story, while showing the influence of one of the songs I'd already covered. Her working for RCA and with the same musicians as Elvis meant that I could talk a bit more about those musicians, and her being marketed as \"the Female Elvis\" meant that I could talk about Elvis' larger cultural impact on the world in 1956, something that needed to be discussed in the series, but which I hadn't found space for in an episode on Elvis himself at that point. (And in talking about the various Elvis-based novelty records I was also able to mention a few figures who will turn up in future episodes, planting seeds for later).\n\n[Excerpt: Eddie Cochran and the Holly Twins, “I Want Elvis For Christmas”]\n\nSo that's the thinking there. Every episode has to serve a bunch of different purposes if I'm going to tell this story in only five hundred episodes, and the Janis Martin one, I think, did that better than many.\nAs to the larger question of signposts versus impact at the time -- I am trying, for the most part, to tell the story from the point of view of the time we're looking at, and look at what mattered to listeners and other musicians at the time. But you also have to fill in the details of stuff that's going to affect things in the future. So for example you can't talk about REM without first having covered people like Big Star, so even though Big Star weren't huge at the time, they'll definitely be covered. On the other hand someone like, say, Nick Drake, who had little influence until he was rediscovered decades later, won't be covered, except maybe in passing when talking about other artists Joe Boyd produced, because he didn't really have an effect on the wider story.\n\nIn general, the prime consideration for any song that I include is -- does it advance the overall story I'm telling? There'll be stuff left out that would be in if the only criterion was how people reacted to it at the time, and there'll be stuff included which, on its own merits, just wouldn't make the list at all. There's one Adam Faith album track, for example, that I'm going to talk about in roughly nine months, which I think is almost certainly not even the best track that Adam Faith recorded that day, which is about as low a bar as it gets. But it'll be in there because it's an important link in a larger story, even though it's not a song that mattered at all at the time.\n\nAnd a final question from Daniel Helton on whether I considered doing an episode on \"Ain't Got No Home\" by Clarence \"Frogman\" Henry.\n\n[Excerpt: Clarence “Frogman” Henry, “Ain't Got No Home”]\n\nIt's a great record, but much of what I'd have to say about it would be stuff about the New Orleans scene and Cosimo Matassa's studio and so forth -- stuff that I'd probably already covered in the episodes on Fats Domino and Lloyd Price (including the episode on Price that's coming up later), so it'd be covering too much of the same ground for me to devote a full episode to it.\n\nIf I was going to cover Frogman in the main podcast, it would *probably* be with \"I Don't Know Why (But I Do)\" because that came out at a time when there were far fewer interesting records being made, and I'd then cover his history including \"Ain't Got No Home\" as part of that, but I don't think that's likely.\n\nIn fact, yeah, I'll pencil in \"Ain't Got No Home\" for next week's Patreon episode. Don't expect much, because those are only ten-minute ones, but it came out at around the same time as next week's proper episode was recorded, and it *is* a great record. I'll see what I can do for that one.\n\nAnyway, between this and the Patreon bonus episode, I think that's all the questions covered. Thanks to everyone who asked one, and if I haven't answered your questions fully, please let me know and I'll try and reply in the comments to the Patreon post. We'll be doing this again next year, so sign up for the Patreon now if you want that. Next week we're back to the regular podcasts, with an episode on \"Matchbox\" by Carl Perkins.\nAlso, I'm *hoping* -- though not completely guaranteeing yet -- that I'll have the book based on the first fifty episodes done and out by this time next week. These things always take longer than I expect, but here's hoping there'll be an announcement next week. See you then.",
  "enclosure": "",
  "itunes:summary": "This week's episode of A History of Rock Music in Five Hundred Songs is the second of two bonus episodes answering listener questions at the end of the first year of the podcast. Click the full post to read liner notes, links to more information, and a transcript of the episode. Patreon backers also have a bonus podcast, answering even more questions.\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This one also includes the songs from the Patreon bonus episode, as that's even more questions and answers.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWelcome to the second and final part of this year's question and answer bonus podcasts. This week I'm actually going to do two of these. The one that's going on the main podcast is going to consist of those questions that my backers asked that have to do primarily with the podcast and the music, while the one that's going only to backers consists mostly of questions that have been asked about me and my life and so forth -- stuff that might be less interesting to the casual listener, but that clearly someone is interested in. Next week I get back to the main story, with an episode about Carl Perkins, but right now we're going to jump straight into the questions.\n\nMatthew Elmslie asks:\n\n\"It's not an issue you've had to confront yet, as you navigate the mid-'50s, but eventually you're going to come up against the clash between the concept of popular music where the basic unit is the song or single, and the one where the basic unit is the album. What are your thoughts on that and how do you plan to deal with it?\"\nThis is a question I had to give some consideration to when I was writing my book California Dreaming, which in many ways was sort of a trial run for the podcast, and which like the podcast told its story by looking at individual tracks. I think it can be a problem, but probably not in the way it first appears.\n\nFirst, the period where the album was dominant was a fairly short one -- it's only roughly from 1967 through about 1974 that the bands who were getting the most critical respect were primarily thinking in terms of albums rather than singles. After that, once punk starts, the pendulum swings back again, so it's not a long period of time that I have to think of in those terms. But it is something that has to be considered during that period.\nOn the other hand, even during that period, there were many acts who were still primarily singles acts -- the Monkees, Slade, the Move, T-Rex... many of whom, arguably, had more long-term influence than many of the album acts of the time.\n\nI think for the most part, though, even the big album acts were still working mostly in ways that allow themselves to be looked at through the lens of single tracks. Like even on something like Dark Side of the Moon, which is about as concept-albumy as it gets, there's still \"Money\" and \"Great Gig in the Sky\" which are individual tracks people know even if they don't necessarily know the album, and which could be used as the focus of an episode on the album. Even with Led Zeppelin, who never released singles at all, there are tracks that might as well have been singles, like \"Whole Lotta Love\" or \"Stairway to Heaven\". So for the most part it's fairly easy to find a single track I can focus on.\n\nThe real problem only comes in for a handful of albums -- records, mostly from that period in the late sixties and early seventies, which absolutely deserve to be considered as part of the podcast, but which don't have standout tracks. It's hard to pick one track from, say, Trout Mask Replica by Captain Beefheart or Astral Weeks by Van Morrison -- those two albums really do need considering as albums rather than as individual tracks -- there's no reason to choose, say, \"Frownland\" over \"The Dust Blows Forward 'n' the Dust Blows Back\" or vice versa, or \"Madame George\" ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "This week's episode of A History of Rock Music in Five Hundred Songs is the second of two bonus episodes answering listener questions at the end of the first year of the podcast. Click the full post to read liner notes, links to more information, and a transcript of the episode. Patreon backers also have a bonus podcast, answering even more questions.\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode. This one also includes the songs from the Patreon bonus episode, as that's even more questions and answers.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nWelcome to the second and final part of this year's question and answer bonus podcasts. This week I'm actually going to do two of these. The one that's going on the main podcast is going to consist of those questions that my backers asked that have to do primarily with the podcast and the music, whil",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}