{
  "title": "Macroeconomic outlook: are we back on track?",
  "link": "https://audioboom.com/posts/7815984",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2780,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>This podcast episode is part of Bruegel’s macroeconomic outlook series of The Sound of Economics, in which we bring you regular analysis of all things macro and fiscal policy.<br>\n<br>\n\n</div>\n<div>This February, the European Commission published the Winter 2021 Economic Forecast with the estimation of a 3.7% increase in GDP in the EU in 2021. While this means a recovery from the pandemic, economic uncertainty still remains significant.<br>\n<br>\n\n</div>\n<div>On the other side of the globe, the Biden administration has announced a $1.9 trillion fiscal package. Would this result in inflation risks? How will this affect European economies? And, what fiscal intervention is needed in the euro area?<br>\n<br>\n\n</div>\n<div>\n<a href=\"https://www.bruegel.org/author/maria-demertzis/\">Maria Demertzis</a>, Deputy director of Bruegel, is joined by <a href=\"https://www.bruegel.org/author/elina-ribakova/\">Elina Ribakova</a>, Deputy Chief Economist at the Institute of International Finance, <a href=\"https://www.bruegel.org/author/christian-odendahl/\">Christian Odendahl</a>, Chief economist at the Centre for European Reform and <a href=\"https://www.bruegel.org/author/gregory-claeys\">Grégory Claeys</a>, senior fellow at Bruegel to discuss the Commission forecast, recent US fiscal package and their insights of the macroeconomics outlook in the EU and globally.<br>\n<br>\n\n</div>\n<div>Relevant publications:<br>\n<br>\n\n</div>\n<div>Demertzis, M. (2021) ‘<a href=\"https://www.bruegel.org/2021/03/a-k-shaped-recovery-and-the-role-of-fiscal-policy/\">A K-shaped recovery and the role of fiscal policy</a>’<br>\n<br>\n\n</div>\n<div>Claeys, G. and M. Demertzis (2021) ‘<a href=\"https://www.bruegel.org/2021/01/the-productivity-paradox-policy-lessons-from-microprod/\">The productivity paradox: policy lessons from MICROPROD</a>’, Policy Contribution 01/2021, Bruegel<br>\n<br>\n\n</div>\n<div>Demertzis, M., M. Domínguez-Jiménez and A. Lusardi (2020) ‘<a href=\"https://www.bruegel.org/2020/07/the-financial-fragility-of-european-households-in-the-time-of-covid-19/\">The financial fragility of European households in the time of COVID-19</a>’, Policy Contribution 2020/15, Bruegel<br>\n<br>\n\n</div>\n",
  "itunes:summary": "Summary of the macro outlook based on Commission forecasts and analysis of the global picture.",
  "pubDate": "Fri, 05 Mar 2021 09:05:49 +0000",
  "guid": "tag:audioboom.com,2021-03-05:/posts/7815984",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}