{
  "title": "Reboot",
  "link": "",
  "published": "2020-01-23T00:00:00-05:00",
  "updated": "2020-01-23T00:00:00-05:00",
  "author": {
    "name": "Tommy Blanchard"
  },
  "id": "tag:tommyblanchard.com,2020-01-23:/reboot",
  "summary": "<p>A lot has changed since I started this website and blog.</p>\n<p>When I started, I was just starting my career as a data scientist. I was looking for an outlet for posting projects so I could build up a bit of a portfolio and online presence. This was a career-building …</p>",
  "content": "<p>A lot has changed since I started this website and blog.</p>\n<p>When I started, I was just starting my career as a data scientist. I was looking for an outlet for posting projects so I could build up a bit of a portfolio and online presence. This was a career-building move. (I also had a bunch of pent-up thoughts about leaving academia that I felt I needed a venue for).</p>\n<p>It wasn't long before I got tired of doing data science during the day at my job, and in the evening for this site, even if the projects I was doing for this site were pretty fun, light projects. Instead, I transitioned to making this site mostly a place for me to post thoughts about data science and connect with the data science community. This was easier on me, allowed me to have my online presence, and it was rewarding to have my stuff discussed on Reddit, have people comment here, or have people reach out to me directly.</p>\n<p>My main source of readership was https://www.reddit.com/r/datascience/. The subreddit was at the time plagued with posts about people asking how to get a data science job, which seemed like 95% of the content on the subreddit. But one of the moderators seems to have decided that percentage was too low and started to clamp down on people posting their blogs, and removed one of my posts (which had already generated a bunch of discussion) and told me not to post another. So down my post went, and with it my primary audience.</p>\n<p>It was hard to motivate continuing to write posts after that. Why write posts to enter a discussion with the data science community when there was no venue for connecting the community to what I was writing? So this site went dormant.</p>\n<p>Nowadays, I'm far enough along in my career that I don't think my web presence is going to matter too much one way or another. So I'm doing a bit of a reboot, and making this less of a (poor attempt at) a professional blog and more of whatever I feel like writing about. I'll probably still write about data science stuff, but I'm not limiting myself to that. We'll see what happens!</p>",
  "category": [
    "",
    ""
  ]
}