{
  "id": "tag:theatlantic.com,2021:50-619264",
  "content": "<p><i>Every week, our lead climate reporter brings you the big ideas, expert analysis, and vital guidance that will help you flourish on a changing planet. </i><a href=\"https://www.theatlantic.com/newsletters/sign-up/weekly-planet/?utm_source=feed\"><i>Sign up to get </i><em>T</em></a><em><a href=\"https://ers/sign-up/weekly-planet/\">he Weekly Planet</a></em><i><a href=\"https://www.theatlantic.com/newsletters/sign-up/weekly-planet/?utm_source=feed\"><em>,</em> our guide to living through climate change, in your inbox</a>.</i></p><hr><p>Last month, a tiny hedge fund called Engine No. 1 <a href=\"https://www.theatlantic.com/science/archive/2021/06/wall-streets-skirmish-with-big-oil-exxons-climate-fight/619070/?utm_source=feed\">staged a coup of sorts at ExxonMobil</a>—a shareholders’ revolt that unseated three members of the oil company’s board of directors and replaced them with more climate-concerned candidates. The putsch was the first centered on climate change at an American oil company.</p><p>Now the financial group is ready to recruit ordinary investors—people with 401(k)s, <a href=\"https://www.axios.com/robinhooders-arent-who-you-think-they-are-1844deab-5d23-4f36-a389-231c2e8ffb49.html\">Robinhooders</a>, the macroprudentially curious—into its army. Tomorrow it is launching an exchange-traded fund, or ETF, that will track the performance of the 500 largest public companies in America, the firm told <i>The Atlantic.</i></p><p>The new Engine No. 1 Transition 500 Fund is, in other words, a low-fee, diversified index fund of the type that now dominates the American stock market. Yet unlike other index-fund providers, which sit out some fights with management, Engine No. 1 has pledged to crusade. When Engine No. 1 campaigns against a company’s leadership, shares held by the Transition 500 ETF will vote for its slate. The ETF will trade on the stock market, appropriately, under the ticker symbol VOTE.</p><p>“For many investors, it feels like there’s still a trade-off between financial performance and investing with values,” Yasmin Dahya Bilger, who directs ETFs at Engine No. 1, told me, implying that, well, there shouldn’t be. “This fund will keep the investment side similar to what many already have in their portfolios.”<br>\n<br>\nIt uses a little-understood mechanism to change the economy. American public companies technically are small republics in their own right, subject to some quasi-democratic controls that, in most cases, exhibit all the sleepiness of North Korean plebiscites. A company publishes a slate of approved picks for its board of directors; investors rubber-stamp them; everyone goes home. Engine No. 1 is not the first fund to break that pattern—proxy fights have been a significant feature of Wall Street since the 1970s—but it did so, notably, by holding only 0.02 percent of Exxon’s stock. It found success because it convinced investors holding another 49.99 percent of Exxon’s outstanding stock to join its campaign.</p><p>One of the benefits of VOTE is that, if it’s successful, it will give Engine No. 1 more arrows in its quiver for future battles. The firm says that at least $100 million is already committed to investing in its ETF. The robo-adviser Betterment, <a href=\"https://www.theatlantic.com/science/archive/2021/02/new-idea-fighting-climate-change-retirement-plans-betterment/617909/?utm_source=feed\">which is working to assemble a climate-friendly investment portfolio</a>, has said it will add VOTE to its large-cap portfolio.</p><p>Of course, every fund promising to take on climate change can rope a laudatory article these days. But here’s why I think VOTE is truly notable:</p><p><b>1. It is inexpensive. </b></p><p>Mutual-fund and ETF managers make money by skimming a few cents off of every dollar invested in their products. Socially responsible funds haven't always been cheap: In 2017, when Betterment offered its first socially responsible portfolio, the one large-cap U.S.-stock ETF that it recommended charged fees of 0.5 percent, a fortune in investment terms, Boris Khentov, Betterment’s senior vice president, told me. Today, a popular ETF called <a href=\"https://www.ssga.com/library-content/products/factsheets/etfs/us/factsheet-us-en-spyx.pdf\">SPYX</a>, which mirrors the S&amp;P 500 but omits fossil-fuel companies, charges 0.2 percent. VOTE, by comparison, charges 0.05 percent.</p><p>“It’s a different scale,” Khentov said. That puts VOTE on par with some of <a href=\"https://www.investopedia.com/articles/investing/122215/spy-spdr-sp-500-trust-etf.asp\">the cheapest index funds on the market</a>.</p><p><b>2. It has a clear theory of change. </b></p><p>The economist Albert O. Hirschman once wrote that members of a firm in distress had a few options: They could <i>exit, </i>leaving the organization to collapse; use <i>voice, </i>expressing dissatisfaction with the hope of fixing the firm; or show <i>loyalty, </i>sticking in their role and hoping for improvement.</p><p>For the past decade, the dominant approach among climate-concerned investors has been to exit: If you’re worried about climate change, activists have exhorted, you should divest from fossil-fuel stocks. But last month, Engine No. 1 voiced<i> </i>its problems with Exxon—and found rapid success. VOTE now lets average investors try voice<i> </i>too.</p><p>Really, the two strategies should work in tandem. Divestment should, over time, make raising money more expensive for carbon-intensive oil companies—as it indeed <a href=\"https://www.bloomberg.com/news/articles/2021-06-18/esg-concerns-are-finally-showing-up-in-the-bond-market?sref=BGQFqz7X\">seems to be doing</a>. Engagement should push companies to act in a way that makes divestment less necessary.</p><p><b>3. It puts pressure on other index-fund providers.</b></p><p>The so-called Big Three index investors—Vanguard, BlackRock, and State Street—are <a href=\"https://www.theatlantic.com/ideas/archive/2021/04/the-autopilot-economy/618497/?utm_source=feed\">the largest shareholders in most major U.S. companies</a>. They have not been known as drivers of innovation in the boardroom. “Out of 4,000 shareholder proposals over the last decade or so, not a single one was put forward by any of the largest asset managers out there,” Michael O’Leary, a managing director at Engine No. 1 and a co-author of the book <i>Accountable: The Rise of Citizen Capitalism, </i>told me.</p><p>BlackRock, the largest of the three, has <a href=\"https://www.wsj.com/articles/blackrock-takes-aggressive-posture-on-esg-proxy-votes-11619775002\">lately come to champion</a> ESG—environmental, social, and governance—goals in its voting. (Brian Deese, its former head of ESG, now directs President Joe Biden’s National Economic Council.) BlackRock has voted against Exxon’s board for the past several years, Madison Condon, a law professor at Boston University who studies index providers, told me. But BlackRock’s revolt alone wasn’t enough. Engine No. 1 triumphed only because Vanguard, the most reticent of the three, broke with Exxon and joined its campaign.</p><p>In that light, VOTE seems designed to prod the Big Three as much as America’s corporate leadership. During the Exxon campaign, Engine No. 1 approached institutional investors hat in hand, eager for their support. Now Engine No. 1 is competing with the other indexers—and if investors don’t like their asset manager’s voting record, they can reallocate their portfolio.</p><p>Or maybe not. When I offered this theory to O’Leary, he passed on it. “We owned two basis points of ExxonMobil. Even if we had owned 5 percent, or 6 percent, the way some activist hedge funds do, our success still relies on the support of other investors,” he said. “Our power will always be contingent on our ability to bring other investors along with us.”</p><p>Last year, when I covered Betterment’s <a href=\"https://www.theatlantic.com/science/archive/2021/02/new-idea-fighting-climate-change-retirement-plans-betterment/617909/?utm_source=feed\">attempt to put a climate-friendly portfolio together</a>, I wished for an ETF just like VOTE—a fund that tried to reshape the market not by withdrawing money from some places and investing it in others but by engaging directly with corporate leadership and using the power of shareholder voting to push boards forward. “But right now, no such fund exists,” I concluded.</p><p>Now such a fund does. I think VOTE is a natural complement to a divestment strategy, especially as <a href=\"https://www.theatlantic.com/science/archive/2021/06/climate-change-green-vortex-america/619228/?utm_source=feed\">clean energy gets cheaper</a> and the financial costs of fighting climate change for any one firm decline. Engine No. 1 contends that such a strategy will bring in higher returns too. “We believe that for companies to create shareholder value, they need to focus on investments they make in communities, employees, customers, and the environment,” O’Leary said. “If, over time, companies are focused on those externalities, they are best positioned to succeed. Engine No. 1 will focus on those issues and find the opportunities where our votes will be the most effective.” We’ll find out if that investing hypothesis holds.</p><hr><p>Thanks for reading. <a href=\"https://www.theatlantic.com/newsletters/sign-up/weekly-planet/?utm_source=feed\">Subscribe to get The Weekly Planet in your inbox.</a></p>",
  "author": {
    "name": "Robinson Meyer",
    "uri": "http://www.theatlantic.com/author/robinson-meyer/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Anton Petrus / Getty"
  },
  "title": "A Major New Index Fund Should Unnerve Climate-Skeptical CEOs",
  "published": "2021-06-22T12:31:46-04:00",
  "updated": "2021-06-22T19:22:00-04:00",
  "summary": "The hedge fund that staged a revolt at Exxon last month is now recruiting an army of mom-and-pop investors for future battles.",
  "link": ""
}