{
  "id": "https://bibleinoneyear.org/en/youth/27",
  "title": "Day 27: How to Stay on Track",
  "description": "Psalm 17:3–5, Job 4:1-8, 6:21-25, Matthew 19:1–6, 13-15.  For future walks we decided we would definitely take a map and stick to the route  Staying on the track proves much better for being able to relax, talk together and for our relationship generally!In the Bible, the image of God’s tracks is frequently used: tracks that lead to life",
  "pubDate": "Thu, 27 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/27/",
  "itunes:duration": "13:03",
  "guid": "enyouth27012022-27",
  "length": 783.62,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 27: How to Stay on Track",
  "itunes:subtitle": "Psalm 17:3–5, Job 4:1-8, 6:21-25, Matthew 19:1–6, 13-15.  For future walks we decided we would definitely take a map and stick to the route  Staying on the track proves much better for being able to relax, talk together and for our relationship generally!In the Bible, the image of God’s tracks is frequently used: tracks that lead to life",
  "itunes:summary": "Pippa and I love to go for walks. Not so long ago, we went for quite a long walk on the South Downs. Neither of us has a very good sense of direction and we had forgotten to take the map. Somehow, we managed to wander off the track and we ended up on someone’s farm.\nIt was one of the shortest days of the year and soon the light started to fade. It seemed that the only way to get back to where we had parked the car was to cross a field occupied by a large herd of cows. As we approached them, some surrounded us in an overly friendly fashion, blocking our way, while others took off in fright and started charging around the field.\nFearing that we were going to be mown down into the mud by terrified cows charging at us, we decided to make a rather speedy exit up a very steep and slippery bank. Pippa had exceeded her desired length of walk, darkness was falling and we seemed to be nowhere near a track. Things were not looking good.\nThankfully, we managed to find a path leading us back. It was such a relief. For future walks we decided we would definitely take a map and stick to the route. Staying on the track proves much better for being able to relax, talk together and for our relationship generally!\nIn the Bible, the image of God’s tracks is frequently used: tracks that lead to life.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 392
}