{
  "title": "Getting feet wet with AWS",
  "link": "",
  "id": "http://brooksandrew.github.io/simpleblog/articles/getting-feet-wet-with-aws",
  "published": "2014-11-10T00:00:00+00:00",
  "updated": "2014-11-10T00:00:00+00:00",
  "author": {
    "name": "andrew brooks",
    "uri": "http://brooksandrew.github.io/simpleblog",
    "email": "andrewbrooksct@gmail.com"
  },
  "content": "<p>I’ve been intrigued by <strong>Amazon Web Services (AWS)</strong> for a while now.  I spent some time this week exploring\nthe workhorse (<a href=\"http://aws.amazon.com/ec2/\">EC2</a>) and the warehouse (<a href=\"http://aws.amazon.com/s3/\">S3</a>) among a couple other more lightly used AWS offerings (<a href=\"http://aws.amazon.com/simledb/\">SimpleDB</a> and <a href=\"http://aws.amazon.com/rds/\">RDS</a>).</p>\n\n<p>Here’s <a href=\"http://slides.com/ajb073/web-scraping-and-persisting-data-in-the-cloud\">the presentation</a> I shared with my company during an internal tech-time with my fellow data geeks:</p>\n\n<iframe src=\"//slides.com/ajb073/web-scraping-and-persisting-data-in-the-cloud/embed\" width=\"576\" height=\"420\" scrolling=\"no\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"></iframe>\n\n<h3 id=\"first-impression\">First impression</h3>\n\n<p>Admittedly, I don’t have a slew of cloud computing experience for comparison, but I was thoroughly impressed with the capabilities and usability of AWS, especially EC2.  A data scientist with intermediate-ish command line skills, basic knowledge of technology, and a little bit of patience can be their own <a href=\"http://en.wikipedia.org/wiki/System_administrator\">Sysadmin</a> and <a href=\"http://en.wikipedia.org/wiki/Database_administrator\">DBA</a> pretty quickly.</p>\n\n<p>In the past, I always felt like I was walking on eggshells working on servers, usually just a partition of some bigger machine doing at least something important.  Usually some system or network admin would handle things my user role didn’t have permissions to do in the background, which could be nice, or slow, or a total road block.  Not so with EC2.  They take care of all the hardware and give you the reins for everything else – the fun stuff.  I found I learned a lot more with the license to be dangerous.  Worst case, terminate your instance and built it again.  Just don’t do it on the beefy (and pricy) 8Xlarge 32 core instance…</p>\n\n<h3 id=\"getting-started\">Getting started</h3>\n\n<p>I have to say I was thoroughly impressed with how easy it was to get started.  The great thing about getting started with AWS is that there are minimal environment-specific issues to bog you down, since you’re really not working with your environment or your computer.  The chunk of polycarbonate in front of you is just the vessel.  And if you’re like me, those simple 2 line installation READMEs that go something like</p>\n\n<figure class=\"highlight\"><pre><code class=\"language-bash\" data-lang=\"bash\">get someNew.thing\ninstall someNew.thing</code></pre></figure>\n\n<p>work maybe 1 in 5 times without having to install some hidden environment-specific dependency, manage multiple versions of the same thing, modify your PATH, or scour StackOverflow hoping someone had the same issue requiring you to modify your specific environment somehow to accommodate the new thing.</p>\n\n<h3 id=\"aws-is-everywhere\">AWS is everywhere</h3>\n\n<p>I was doing some research on S3 vs. Dropbox… and then I discovered that <a href=\"http://www.datacenterknowledge.com/archives/2013/10/23/how-dropbox-stores-stuff-for-200-million-users/\"><strong>Dropbox</strong> actually uses (or at least used to use) S3 to host</a> all your favorite kitten photos and documents you save to Dropbox.</p>\n\n<p>Curious to see how <strong>slides.com</strong>, which I used to generate my slides would handle images when I exported the presentation to HTML, I inspected the exported HTML code to find that the platform automatically saves and hosts your content to S3.  Each image (and other rich content, I expect) is available from a unique URL to an S3 bucket.</p>\n\n<h3 id=\"making-of-the-slides\">Making of the slides</h3>\n\n<p>I also took this opportunity to experiment with some new slide/presentation technologies.  Having used Powerpoint and LibreOffice Impress for most of my presentations in the past, I wanted to mess around with some of the web technologies/platforms.  <a href=\"http://bartaz.github.io/impress.js/#/bored\">impress.js</a> and <a href=\"http://prezi.com/your/\">prezi</a> seemed a little dramatic and flashy for my purpose.  I liked the simple style of <a href=\"http://lab.hakim.se/reveal-js/#/\">reveal.js</a>, so I started there.  The framework seemed relative straightforward and even supports markdown which I use to write this here blog, so that was cool.</p>\n\n<p>However, not writing HTML and JavaScript everyday, I was spending more time tweaking code than working on content.  For a more serious presentation, I definitely could have committed more time to this, but I was looking to throw together some casual slides together pretty quickly.  I ended up using <a href=\"http://slides.com\">slides</a> (the online graphical editor for reveal.js) which I found to be a simple yet useful and impressive solution.</p>\n\n<h5 id=\"cool-things-about-slides\">Cool things about <a href=\"http://slides.com\">slides</a>:</h5>\n\n<ul>\n  <li><strong>name.</strong> Seriously, no one thought of <a href=\"http://slides.com\">slides.com</a> before now?</li>\n  <li><strong>free version</strong> for public presentations.</li>\n  <li><strong>export presentation to HTML</strong>, albeit  messy HTML.</li>\n  <li><strong>images and content hosted on S3</strong>, so HTML presentation can stand-alone (no zipping and emailing dozens of files around) if you want to share presentation via email.</li>\n  <li><strong>simple features</strong> I used almost all the features available, but didn’t find myself desiring much more.  Good balance that kept me focused on content.</li>\n  <li><strong>intuitive UI:</strong> I enjoyed not having to navigate worlds of dropdowns, ahem Powerpoint.</li>\n  <li><strong>code blocks:</strong> scrollable code blocks embedded directly in the presentation.</li>\n  <li>you get the code, so you can <strong>customize with reveal.js</strong> as much as you want after getting started with slides.  <em>Note: untested…this may or may not be a good idea.</em></li>\n</ul>\n\n\n  <p><a href=\"http://brooksandrew.github.io/simpleblog/articles/getting-feet-wet-with-aws/\">Getting feet wet with AWS</a> was originally published by andrew brooks at <a href=\"http://brooksandrew.github.io/simpleblog\">andrew brooks</a> on November 10, 2014.</p>"
}