{
  "title": "AI for Wireless",
  "link": "https://spectrum.ieee.org/ai-for-wireless",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/graph-showing-three-communications-signal-levels-in-decibels.jpg?id=31893330&width=980\"/><br/><br/><p>\n<em>This is a sponsored article brought to you by <a href=\"https://www.mathworks.com/\" rel=\"noopener noreferrer\" target=\"_blank\">MathWorks</a>.</em>\n</p><p>\n\tThe evolution of mobile wireless technology, from 3G/4G to 5G, and introduction of Industry 4.0, have resulted in the ever-increasing complexity of wireless systems design. Wireless networks have also become more difficult to manage due to requirements necessitating optimal sharing of valuable resources to expanding sets of users. These challenges force engineers to think beyond traditional rules-based approaches with many are turning to artificial intelligence (AI) as the go-to solution to face the challenges introduced by modern systems.\n</p><p>\n\tFrom managing communications between autonomous vehicles, to optimization of resource allocations in mobile calls, AI has brought the sophistication necessary for modern wireless applications. As the number and scope of devices connected to networks expands, so too will the role of AI in wireless. Engineers must be prepared to introduce it into increasingly complex systems. Knowing the benefits and current applications of AI in wireless systems, as well as the best practices necessary for optimal implementation, will be key for the future success of the technology.\n</p><hr/><h2>The Primary Benefits of AI for Wireless </h2><p>\n\tThe transition to 5G has brought about the optimization of speed and quality of mobile broadband networks, as well as the need for ultra-reliable low rates and massive machine-type communication for time-sensitive connections between Industry 4.0 devices – three distinct use-cases in a modern network and the contending forces driving engineers to the adoption of AI.\n</p><p>\n\tAs devices compete for the resources of the network, with the number of users and applications of a wireless system increasing all the time, formerly linear patterns of designs once understood by human-based rules, cease to be sufficient. AI techniques, however, can better solve non-linear problems by extracting any pattern automatically and efficiently, beyond the ability of human-based approaches.\n</p><p>\n\tBy AI in this context, we mean those machine learning and deep learning systems used to recognize patterns within communications channels that link devices and people. These systems then optimize the resources given to that link to improve performance. Simply put, running a network for those disparate use cases without exploiting AI methodologies becomes a near impossible task.\n</p><p>\n\tBeyond bringing sophistication and optimization, AI also brings project management benefits. Incorporating simulated environments into an algorithmic model through estimating the behaviour of source environments can enable engineers to quickly study a system’s dominant effect using minimal computational resources. This leaves more time to explore design and carry out more iterations faster, reducing cost and development time.\n</p><p>\n<a href=\"https://engineeringresources.spectrum.ieee.org/free/w_math06/prgm.cgi?a=1\" target=\"_blank\"><img alt=\"Click to watch on-demand webinar: Apply AI Techniques to Solve Wireless Communications System Design Challenges\" src=\"https://spectrum.ieee.org/media-library/ai-for-wireless-workflow-data-generation-ai-training-validation-and-testing-and-deployment-on-hardware-click-to-watch-on-demand-webinar-apply-ai-techniques-to-solve-wireless-communications-system-design-challenges.jpg?id=31897034&width=1694&quality=80\"/></a>\n<small alt=\"Click Watch on-demand webinar: Apply AI Techniques to Solve Wireless Communications System Design Challenges\" class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">AI for Wireless workflow: Data generation, AI training, validation and testing and deployment on hardware. Click on the image to watch on-demand webinar: Apply AI Techniques to Solve Wireless Communications System Design Challenges.</small>\n<small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">\n\tMathWorks\n\t</small>\n</p><h2>Best Practices for the Application of AI in Wireless Systems<br/>\n</h2><p>\n\tData size and quality are vital for effective deployment of AI models, because they are only as effective as the data they are trained with. To deal with a range of real-world scenarios, these models need to be trained with a broad range of data. By synthesizing new data based on primitives or by extracting them from over-the-air signals, applications like MathWorks’ \n\t<a href=\"https://www.mathworks.com/products/5g.html\" target=\"_blank\">5G Toolbox</a> provide the data variability necessary for 5G network designers to train AI robustly. Failure to explore a large training data set and iterate on different algorithms based on that data could result in a narrow local optimization instead of an overall global one.\n</p><p>\n\tA robust approach to testing AI models in the field is similarly critical to success. Variability in signal needed for testing AI techniques is a problem, where signals captured in a narrow, localized geography may adversely impact how an engineer might optimize quality of their design. Without field iterations, the parameters of individual cases cannot be used to optimize AI for specific locations, negatively impacting call performance.\n</p><h2>AI for a Wireless World – Primary Application Areas</h2><p>\n\tDigital transformation in areas like telecommunications and automotive necessitate the use of AI and is the primary driver for its application. Placing electronic communications in areas once mechanical orientated generates large amounts of data as applications like smart cities, telecommunication networks and autonomous vehicles (AV) connect. As they do so, the resources of the network joining them becomes stretched.\n</p><p>\n\tIn telecommunications, AI is deployed at two levels – at the physical layer (PHY) and above PHY. The application of AI for improving performance in a line connecting two users is referred to as operating at PHY. Applications of AI techniques to physical layers includes digital pre-distortion, channel estimation and channel resource optimization, as well as automatic adjustments to transceiver parameters during a call otherwise known as autoencoder design.\n</p><p>\n\tChannel optimization is the enhancement of the connection between two devices, notably network infrastructure and user equipment. Often, this means using AI to overcome signal variability in localized environments through techniques such as fingerprinting and channel state information compression.\n</p><p>\n\tWith fingerprinting, AI is used to optimize positioning and localization for wireless networks by mapping disruptions to propagation patterns in indoor environments, caused by individuals entering them. AI then estimates based on these individualized 5G signal variations the position of the user. Meanwhile, channel state information compression is the use of AI to compress feedback data from user equipment to a base station, ensuring that the feedback loop informing the station’s attempt to improve call performance does not exceed the available bandwidth thus consequently causing a dropped call.\n</p><p>\n\tAbove-PHY uses are mainly in network management and resource allocation. Applications, such as scheduling, beam management and spectrum allocation, are functions that manage and optimize the resources of core systems for the competing users and use-cases of the network. As the number of users and use-cases on the network increase, network designers have turned to AI techniques in order to respond to allocation demands in real time.\n</p><p>\n\tIn the automotive industry, using AI for wireless connectivity is making safe autonomous driving possible. Autonomous vehicles (AV) rely on data from multiple sources, including LiDAR, radar, and wireless sensors, to interpret the environment in which they are situated. The hardware present in AVs must handle data from these many competing sources. AI enables sensor fusion, fusing competing signals to allow the vehicle’s software to make sense of its location and establish how it will interact with its environment.\n</p><h2>The Future of AI for Wireless</h2><p>\n\tAs the use cases for wireless technology expand, so too does the need to implement AI within those systems. Without it, systems such as 5G, autonomous vehicles and IoT applications would not have the sophistication necessary to function effectively. While AI’s place in engineering, particularly wireless system design, has been increasing in recent years, it can be expected for this to keep rising – and faster – as the use cases and the number of network users grow.\n</p><p>\n\tTo learn more about this topic, see the additional resource below or email at \n\t<a href=\"mailto:hzarrink@mathworks.com\" target=\"_blank\">hzarrink@mathworks.com</a>:\n</p><p>\n\t• \n\t<a href=\"https://www.mathworks.com/campaigns/products/trials.html\" rel=\"noopener noreferrer\" target=\"_blank\">Free MATLAB Trial</a> (30-day free trial): Start your free 30-day trial to help evaluate MATLAB and Simulink as well as the other products while also getting unlimited online access.\n</p>",
  "pubDate": "Thu, 13 Oct 2022 16:09:45 +0000",
  "guid": "https://spectrum.ieee.org/ai-for-wireless",
  "category": [
    "5g",
    "Machine learning",
    "Deep learning",
    "Mathworks",
    "Wireless"
  ],
  "dc:creator": "Houman Zarrinkoub",
  "media:content": ""
}