{
  "id": "yt:video:STGRes_gXXs",
  "yt:videoId": "STGRes_gXXs",
  "yt:channelId": "UCL-g3eGJi1omSDSz48AML-g",
  "title": "Sackboy: A Big Adventure - PC Features Trailer",
  "link": "",
  "author": {
    "name": "NVIDIA GeForce",
    "uri": "https://www.youtube.com/channel/UCL-g3eGJi1omSDSz48AML-g"
  },
  "published": "2022-09-29T15:00:19+00:00",
  "updated": "2022-10-31T04:29:20+00:00",
  "media:group": {
    "media:title": "Sackboy: A Big Adventure - PC Features Trailer",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Sackboy: A Big Adventure is coming to PC on October 27 with ray tracing and NVIDIA DLSS 2. \n\nIconic PlayStation® hero Sackboy bursts into breathtaking action on PC with a huge, fun and frantic 3D multiplayer platforming adventure.\nThe dastardly Vex (a near-mythical being born of chaos and fear, no less) kidnaps Sackboy’s friends and forces them to build his Topsy Turver. This most terrifyingly twisted device will transform Craftworld from a fantastical land of pure imagination and innocent dreams… into a torrid, barren eyesore of nightmares. Ooh the fiend!\nBut legend tells of a prophecy from deep within the ancient order of the Knitted Knights, Craftworld’s legendary protectors. For only the brave, fearless, chivalrous and, yes, gallant can save the day in an almost too dramatic for words race against time stuffed with danger and peril. So much peril.\nSet off alone or with your bravest friends on a whirlwind of capers across the snowiest mountains, the leafiest jungles, the wettest underwater realms and the, uh, spaciest of space colonies.\nTake down Vex. Save the sack-folk. Save the day.\nIt’s time to fulfil your destiny, Sackboy.\nFrom woolly wonderkid and hessian hero… rise our Knitted Knight.\n\nSubscribe to GeForce! https://www.youtube.com/channel/UCL-g3eGJi1omSDSz48AML-g \n\nGeForce Twitter: https://twitter.com/NVIDIAGeForce \nGeForce Facebook: https://www.facebook.com/NVIDIAGeForce/ \nGeForce Instagram: https://www.instagram.com/nvidiageforce/ \nGeForce Community Portal: https://www.nvidia.com/en-us/geforce/community-portal/\n\n#Sackboy \n#DLSS2\n#RTXOn",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}