{
  "title": "Countries which Primarily use Antimalarial Drugs as COVID-19 Treatment See the Same Dynamic of…",
  "link": "https://medium.com/@chris_bour/countries-which-primarily-use-antimalarial-drugs-as-covid-19-treatment-see-the-same-dynamic-of-98c5fe9d4290?source=rss-90ca8bc640f4------2",
  "guid": "https://medium.com/p/98c5fe9d4290",
  "category": [
    "covid19",
    "data-science"
  ],
  "dc:creator": "Christophe Bourguignat",
  "pubDate": "Wed, 29 Apr 2020 17:22:20 GMT",
  "atom:updated": "2020-04-29T17:22:20.107Z",
  "content:encoded": "<h3>Countries which Primarily use Antimalarial Drugs as COVID-19 Treatment See the Same Dynamic of daily Deaths as Others</h3><p><strong>Disclaimer</strong> — this article is an attempt to show that with the same data, and different analysis methods, a scientific paper can be summarized with different titles, revealing different angles of the results, and leading to different conclusions. It is based on a recent paper published under two different titles:</p><blockquote><a href=\"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3575899\">Countries which Primarily Use Antimalarial Drugs As COVID-19 Treatment See Slower Dynamic of Daily Deaths</a></blockquote><p>and</p><blockquote><a href=\"https://www.medrxiv.org/content/10.1101/2020.04.18.20063875v1\">National Consumption of Antimalarial Drugs and COVID-19 Deaths Dynamics : an Ecological Study</a></blockquote><p>I here propose a third title, with its demonstration:</p><blockquote>Countries which Primarily use Antimalarial Drugs as COVID-19 Treatment See <strong>the Same</strong> Dynamic of daily Deaths as Others</blockquote><p>I don’t try to conclude anything here. I do that to raise citizens awareness on how the same data can be used to demonstrate different things.</p><p>COVID-19 (Coronavirus Disease-2019) is an international public health problem with a high rate of severe clinical cases. Several treatments are currently being tested worldwide. This paper focuses on anti-malarial drugs such as chloroquine or hydroxychloroquine, which have been currently reviewed by a systematic study as a good potential candidate and that has been reported as the most used treatment by a recent survey of physicians. We compare the dynamics of COVID-19 daily deaths in countries using anti-malaria drugs as a treatment from the start of the epidemic versus countries that do not, the day of the 3rd death and the following 10 days. <strong>We show that the first group have the same dynamic in daily deaths that the second group</strong>. This univariate analysis is of course only one additional piece of evidence in the debate regarding the efficiency of anti-malaria drugs, and it is also limited as the two groups certainly have other systemic differences in the way they responded to the pandemic, in the way they report death or in their population that better explain differences in dynamics (systematic differences that may also explain their choice to rely on anti- malaria drugs in the first place). Nevertheless, <strong>the similarity in dynamics of daily deaths is so striking that we believe that the urgency context commands presenting the univariate analysis before delving into further analysis</strong>.</p><h3>Method</h3><p>In this study, we set up two groups of countries and study the dynamics of the number of deaths between the day of the 3rd death and the following 10 days. The first group is made up of countries that we know use or produce chloroquine or hydroxychloroquine on a massive scale during this period. The second group consists of countries that did not use or produce chloroquine or hydroxychloroquine in large quantities during the period under consideration. When we calculate the averages of each of the two groups,<strong> we find very marked similarities in their temporal dynamics</strong> (see results).</p><p>The 60 countries most affected by the epidemic (in terms of number of cases) were studied one by one in descending order to determine whether or not they were conducting a national strategy for the large-scale use or production of chloroquine at the beginning of the epidemic in the country (around the 3rd death). If there was no evidence of such a strategy, or even if sources indicated a strategy to the contrary, the country was classified in the “control group” group, until a panel of countries was obtained in order to have a large sample, provided that daily death data were available for the 10 days following the third death. The second group was constituted with the countries among the 60 most affected in terms of number of cases for which sources indicate the massive use or production of chloroquine at the beginning of the epidemic in the country (around the 3rd death), provided that they have daily death data for the 10 days following the 3rd death. The different groups of countries were constituted according to the information available in the international press on their use or mass production of such drugs over the period under consideration. Respectively 15 and 17 countries thus constitute each of the two groups</p><p>For each of the two groups, the number of daily deaths is noted each day from the 3rd death in the country and the following 10 days. Then, <strong>we normalize by the size of the population older than 65 in each country (the population that is the most vulnerable to COVID-19), to allow fair comparisons</strong>. Then the average of the normalized daily deaths is established for each day for each group of countries.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*UqKGxeHbDXAgZKGIgbAxpg.png\" /><figcaption>Number of normalized daily deaths after day with 3 deaths, “antimalarial drugs group”.</figcaption></figure><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*aQwpnsGyas7VnTQnM1YVsA.png\" /><figcaption>Number of normalized daily deaths after day with 3 deaths, “control group”.</figcaption></figure><h3>Results</h3><p>The graphical projection of the mean curves indicates <strong>a similarity</strong> in the dynamics of the daily death curves of the two groups of countries, which is very clear for the period studied (i.e. from the beginning of the epidemic).</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*67K0yVgOSNpWkpu7XvjhLw.png\" /><figcaption>Means of the number of normalized daily deaths for each group</figcaption></figure><h3>Limitations</h3><p>It should also be noted that while many sources exist to determine the health action of governments, including their use or mass production of chloroquine from the onset of the crisis, quantitative data are lacking and do not allow for more in-depth temporal analyses and causality tests. There also might be systematic differences between the two groups — in particular political differences, urban differences or differences in other strategy aspects such as testing. There is strong evidence for places like South Korea and Japan that mass testing is an effective strategy to control the epidemic, and our study might be a proxy for testing strategies. All these aspects should be examined in a late study.</p><h3>Conclusion</h3><p><strong>We find no difference in death rates, with countries using antimalarial drugs compared to those which do not</strong>. This univariate analysis is of course only one additional piece of evidence in the debate regarding the efficiency of anti-malaria drugs, and it is also limited as the two groups certainly have other systemic differences in the way they responded to the pandemic. Nevertheless, <strong>the similarity in dynamics is so striking that we believe that the urgency context commands presenting this analysis before delving into further analysis</strong>.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=98c5fe9d4290\" width=\"1\" height=\"1\" alt=\"\">"
}