{
  "title": "About That Nobel: Deconstructing Banking Theories of Diamond and Dybvig ",
  "link": "https://mises.org/node/60799",
  "description": "<p>Since the awarding of the Nobel Prize in economics to Ben S. Bernanke, Douglas W. Diamond, and Philip H. Dybvig, most of the media interest has, understandably, concentrated on Bernanke. <a href=\"https://mises.org/wire/ben-bernankes-nobel-prize-committee-rewards-arsonist-claiming-fight-fire-he-started\">Mark Thornton wrote a scathing takedown of bailout Ben</a>, while <a href=\"https://marginalrevolution.com/marginalrevolution/2022/10/the-economic-contributions-of-ben-bernanke.html\">Tyler Cowen inexplicably praised him to the skies</a> (Cowen at least provides a good overview of some of Bernanke’s contributions, such as they are).</p>\n<p>This has allowed Diamond and Dybvig (DD) to escape much scrutiny, which is a shame, since their work is even more symptomatic of the state of modern economics and mainstream analyses of money and banking than that of <a href=\"https://www.theguardian.com/business/2015/apr/29/pimco-recruits-ex-federal-reserve-chairman-ben-bernanke\">bankster darling Bernanke</a>. DD have arguably also had much more influence on how economists analyze banking. Their seminal <a href=\"https://www.bu.edu/econ/files/2012/01/DD83jpe.pdf\">1983 paper in the <em>Journal of Political Economy</em>, “Bank Runs, Deposit Insurance, and Liquidity,”</a> has over thirteen thousand citations on Google Scholar, a number that’s now bound to grow even higher. It has also been described as “<a href=\"https://www.richmondfed.org/publications/research/economic_quarterly/2010/q1/cavalcanti\">a significant conceptual and methodological advance in studying banking arrangements.</a>” So let’s take a critical look at the paper that has been so influential and which is now crowned with Nobel laurels.</p>\n<h4>The DD “Bank</h4>\n<p>DD wanted to study banking and, in particular, to see what kinds of stable equilibria a banking system would produce and which government interventions could possibly improve the market outcome. In order to do this, they constructed a model—and a rather peculiar one at that.</p>\n<p>In the DD model, there is only one economic good and the economy runs for three periods, T = 0, 1, 2. In period 0, each person receives a unit of the good. The good can only be consumed in periods 1 or 2: if it’s invested in production until period 2, it will yield double the good and the person can consume two units.</p>\n<p>In period 0, everyone will invest, since the good can be withdrawn from production and consumed in period 1. In the next period, something magical happens: everyone wakes up and realizes his personality type. Type 1 persons have very high time preference and want to consume immediately, despite the high returns from investment; type 2 persons have low time preference and are willing to wait until period 2 before they consume. As a result, type 1 persons now consume their goods, while type 2 persons wait.</p>\n<p>Before going on to discuss the DD bank, a peculiarity of the model is worth noting: there is no money here—indeed, DD explicitly state that there is no exchange at all. The problems of banking are, as Ludwig von Mises taught, a subset of monetary theory—a point that mainstream economists also accept, since they agree that banks provide liquidity. Yet the model that forms the basis for a major part of modern banking theory explicitly excludes money from consideration—most peculiar, one would think.</p>\n<p>DD now introduces a “bank”: instead of investing, persons turn over their assets to the bank in return for a liquid claim, i.e., they can cash in at any time (meaning in period 1 or 2). Thus, the bank provides liquidity—although again, it is hard to see the point in an economy where exchange, and therefore the need for money and liquidity, has been explicitly excluded.</p>\n<p>Having set up a bank, DD then proceed to show how multiple equilibria are possible—an equilibrium in which all claims are satisfied and a “bank run” equilibrium, where everyone withdraws his asset in period 1, leading to zero production in period 2. While banking thus provides a useful service of liquidity transformation, DD conclude that it is also inherently unstable and that outside help—government-sponsored deposit insurance or a central bank—is required to avoid bank runs.</p>\n<h4>The Key Problems of DD Banking Theory</h4>\n<p>Since there is no money in the DD model, it follows that there also cannot be any banking in a conventional sense. In the classic English definition, a banker is a man who lends other people’s money: he intermediates between different people, savers and borrowers. The DD “bank” does no such thing. It is simply a production manager—it is not a financial intermediary. It takes in assets, manages the production process, and returns assets to the depositors on demand. It can only get into trouble insofar as it pays out assets before the end of production—and then only if it pays out more than the depositors could naturally claim in period 1. In short, to make any sense of the model, we have to conceive of it as a pyramid scheme of sorts.</p>\n<p>That being said, DD are believed to model how banks engage in maturity transformation—indeed, the Nobel Committee focused on this aspect in <a href=\"https://www.nobelprize.org/prizes/economic-sciences/2022/popular-information/\">their depiction of the DD model</a>. Maturity transformation means that savers prefer to lend short term to reduce their risks, and borrowers prefer to borrow long term to be able to invest long term without having to pay back loans before the production processes are complete. Banks then step in as intermediaries: they borrow short term from savers and lend long term to businessmen. The short-term loans are then continuously rolled over: some savers quit and others take their place, but in aggregate the sum of savings available for investment is not volatile. DD see maturity transformation as the cause of unstable banking: to avoid or mitigate bank runs, which here means depositors withdrawing their funds at a greater rate than foreseen, government intervention is necessary.</p>\n<p>The problem for DD and modern banking theorists is that there is nothing new in all this. The problem of maturity transformation was well known centuries ago and led to the formulation of the “golden rule of banking”: as Ludwig von Mises, quoting Karl Knies, <a href=\"https://d.docs.live.net/2106a0a91e11ef4f/AppData/Local/Temp/pid-11664/%20HYPERLINK%20/%22https:/mises.org/library/theory-money-and-credit/html/pp/1273/\">explained</a>: “the date on which the bank’s obligations fall due must not precede the date on which its corresponding claims can be realized.” In other words, far from what the Nobel-winning DD would lead us to believe, banking theorists considered maturity transformation long ago, and they had a clear answer to how bankers should handle it: don’t do it.</p>\n<p>Modern economists have also engaged the question of maturity transformation in a more thoughtful way: Austrian economists <a href=\"http://link.springer.com/10.1007/s10551-009-0050-z\">Philipp Bagus and David Howden</a> have analyzed the practice of maturity mismatching—i.e., of not obeying the golden rule of banking—and debated its legitimacy and economic consequences with <a href=\"http://link.springer.com/10.1007/s10551-010-0677-9\">Randy Barnett and Walter Block</a>. Most importantly, these economists, unlike Diamond and Dybvig, have not confused the question of maturity transformation with the basic questions of banking theory.</p>\n<p>The most fundamental problem with banking theory à la DD is that it ignores the basic problem of banking and the reason for its crucial importance in economic theory. This has nothing to do with maturity transformation, which is simply a question of sound banking management. Banks are important economically because they can increase the money supply by issuing unbacked money substitutes—i.e., fiduciary media. A theory of banking, if it is to address economic reality, must investigate the causes and consequences of this phenomenon. Needless to say, DD don’t do this, and theorists following their lead only do so tangentially. Whatever value DD’s models have, it is close to nil for economic theory.</p>\n<h4>Conclusion</h4>\n<p>The Swedish central bank is thus celebrating not only modern central banking with the 2022 Nobel, but also essentially mistaken theories of banking. Mainstream monetary theory has become increasingly detached from reality over the years, and Diamond and Dybvig’s work is a key example of this: in the pursuit of elegant models, they close their eyes to the real problems of banking—credit expansion and money creation—and at best focus on tangential issues of banking technique.</p>\n<p>This is symptomatic of the general trend of economics, and nowhere is the distinction and superiority of the Austrian school more evident than in the case of monetary theory. From <a href=\"https://mises.org/library/theory-money-and-credit\">Mises’s 1912 <em>Theory of Money and Credit</em></a> on, Austrians have emphasized that the key question of banking theory is the creation of money <em>ex nihilo</em> in the process of credit expansion. <a href=\"https://www.mises.at/static/literatur/Buch/hayek-the-counter-revolution-of-science.pdf\">To paraphrase F.A. Hayek</a>, every important advance in monetary theory during the last hundred years was a further step in the consistent application of Misesian—i.e., marginal and praxeological—principles. Unfortunately, neither the Swedes, nor Diamond and Dybvig, nor Bernanke realize this.</p>\n\n",
  "author": "Kristoffer Mousten Hansen",
  "enclosure": "",
  "guid": 60799,
  "pubDate": "Sat, 29 Oct 2022 06:00:00 -0500",
  "source": "Mises Wire"
}