{
  "title": "Elizabeth Holmes Is Pregnant … Again | True Crime Sunday",
  "link": "https://audioboom.com/posts/8178542",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2194,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<h1><strong>Elizabeth Holmes Is Pregnant … Again</strong></h1>\n<div>\n<br>\nDuring an unusual court appearance on Monday, a key witness in the trial that resulted in the conviction of disgraced Theranos CEO Elizabeth Holmes staunchly defended his testimony. Former Theranos lab director Adam Rosendorff testified for the prosecution and made an apology visit to Holmes' Silicon Valley home after the trial ended, sparking speculation of misconduct on Holmes' part.<br>\n<br>\nHolmes, 38, was convicted of four felonies related to investor fraud earlier this year, and her sentencing was set to begin the same day as the 75-minute hearing. She could spend the next two decades behind bars for promising Thrernos investors that a blood-testing technology would transform medical practice but failing to deliver on that promise.<br>\n<br>\nOn Monday, Holmes had what could be her last chance to avoid jail time by convincing U.S. District Judge Edward Davila that Rosendorff's actions merit a new trial. Rosendorff testified for the prosecution for a total of six days last year during Holmes' trial.<br>\n<br>\nAfter Holmes' attorneys asked for a new trial last month, Davila decided Rosendorff's testimony should be re-examined because he paid an unannounced visit to Holmes' and William \"Billy\" Bundy's mansion on August 8 \"Evans, the man she's currently dating and the father of her son, who is a year old.<br>\n<br>\nWhile Rosendorff did not speak with Holmes directly, Evans recalled that he told the court that Holmes \"tried to answer the questions honestly but that the prosecutors tried to make everyone look bad\" and that Holmes felt \"he had done something wrong.\"<br>\n<br>\nU.S. District Judge Edward Davila questioned Rosendorff, and the witness repeatedly affirmed that he had testified truthfully during the trial and that he believed Holmes deserved to be convicted. But he also expressed regret to Davila about the prospect that Holmes' son \"would spend the formative years of his life without his mother.\" \"Holmes receives a prison term, If.<br>\n<br>\nThe judge finished his question, and Rosendorff spent the next half an hour in a heated exchange with Lance Wade, one of Holmes' lawyers. Wade had already had several heated exchanges with Rosendorff during his cross-examination.<br>\n<br>\nDuring his August visit, Wade hoped to pry some information out of Rosendorff about the mental anguish he'd been experiencing since the trial, as well as whether or not he was taking any medication to cope. After Rosendorff's refusal to respond, the judge did not push the matter further.<br>\n<br>\nMost of Rosendorff's replies to Wade emphasized his testimony's veracity and dispelled the idea that he viewed Holmes as a friend for whom he felt sorry.<br>\n<br>\nAt one point, Rosendorff stated, “I don't want to help Ms. Holmes.” It's up to her to help herself; no one else can. Eventually, she will have to make amends to the public.<br>\n<br>\nAt the same time, Rosendorff made an effort to convey his approval of her conviction. The government wanted to know the facts about what Elizabeth Holmes had done, and they were trying to \"In his words.<br>\n<br>\nGovernment attorneys also spent some time emphasizing Rosendorff's belief that no trial misconduct occurred. During the next week, Davila will consider additional written arguments from both Holmes' attorneys and government prosecutors before making a decision on whether or not to grant a new trial, which is widely considered to be highly unlikely.<br>\n<br>\nA new sentencing date for Holmes has been set for November 18 by Judge Davila. Three days later, her ex-boyfriend and business partner Ramesh \"Sunny\" \"Balwani's sentencing is up next. In a different trial that ended in July, Balwani, 57, was found guilty on 12 counts of investor and patient fraud.<br>\n<br>\nRosendorff then said, \"it is my understanding that she is pregnant again,\" without providing any context. Neither Holmes nor Evans gave an answer to that question when The Associated Press asked them after the hearing. Even as they entered the elevator together, Holmes spontaneously smiled and Evans complemented an Associated Press journalist on his shoes.<br>\n<br>\n<br>\n<strong>Mom allegedly sliced daughter's neck, suffocated her, and drove to ER.</strong><br>\n<br>\n<br>\nMelissa Towne allegedly begged hospital staff for a wheelchair on Oct. 16 because her daughter's body hurt. A nurse reportedly found Towne's daughter in a mesh bag with a neck laceration.<br>\n<br>\nA doctor pronounced the infant dead at 12:10 p.m., Harris County Sgt. Ben Beall said.<br>\n<br>\nTowne allegedly told Tomball police she killed her kid in Spring Creek Park. Detectives questioned Towne while deputies searched the park for a homicide scene.<br>\n<br>\nThe blanket-covered body was reportedly on the car's floor.<br>\n<br>\nBeall stated the child's neck wound \"matched what the mother said.\"<br>\n<br>\nTowne told detectives at her bond hearing that she \"needed to end the child's life\"<br>\n<br>\nTowne allegedly parked at Spring Creek Park and took her daughter to an isolated place. She reportedly forced the girl kneel, then slashed her throat. The girl \"screamed and fought.\"<br>\n<br>\nTowne allegedly strangled the girl for 30 to 45 minutes, sat on her body, and used her hand to cover her mouth.<br>\n<br>\nThe prosecutor's office said Towne told officers she wanted to kill the child because she was evil and she couldn't handle her.<br>\n<br>\nTowne's bond is $15 million at Harris County Jail.<br>\n<br>\n<br>\n<strong>Louisiana deputy allegedly duped an elderly woman into handing him $15,000</strong><br>\n<br>\nAfter allegedly victimizing an elderly woman, a 33-year-old Caddo Parish deputy was fired and charged.<br>\n<br>\nJoey Lee went to the victim's home in the 1800 block of E. Kings Highway while in uniform and \"manipulated her into providing him $15,000 in cash over three months,\" the sheriff's office said.<br>\n<br>\nLee allegedly cashed forgeries while in uniform.<br>\n<br>\nDetectives learned about the incident on Wednesday, Oct. 12, and placed Lee on administrative leave without pay before terminating him. He was a deputy for 10 years.<br>\n<br>\nLee was arrested for forgery, exploitation of infirm persons, extortion, conspiracy to conduct extortion, and malfeasance in office.<br>\n<br>\nThere's one victim.<br>\n<br>\nSteve Prator, sheriff, said, \"This person's unlawful behavior disappoints me. He's an embarrassment to the brave men and women who earn the public's trust.\"<br>\n<br>\n<br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 23 Oct 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-10-21:/posts/8178542",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}