{
  "title": "Challenging the \"Intellectual Dark Web,\" with Michael Brooks (PODCAST 4-20-2020)",
  "description": "<p>I'm joined by Michael Brooks, returning champion and host of <em>The Michael Brooks Show</em> as well as co-host of <em>The Majority Report with Sam Seder</em> and <a target=\"_blank\" href=\"https://www.youtube.com/c/jacobinmagazineyt\">Jacobin's</a> <em>Weekends with Ana Kasparian and Michael Brooks</em>. We're discussing his new book, <em>Against the Web: A Cosmopolitan Answer to the New Right</em>. We're talking the \"Intellectual Dark Web,\" Sam Harris, Jordan Peterson, and how the left can counter their message. Michael’s book is out April 24 and is already available for pre-order from your favorite booksellers, for example <a target=\"_blank\" href=\"https://redemmas.org/titles/34612-against-the-web---a-cosmopolitan-answer-to-the-new-right#\">here</a>.</p><p>There’s a catch to this interview, unfortunately: because of some huge and as yet bafflingly unexplained (though I’m certain human error was involved) technical issues on my end I had to re-record my portion of the audio and trim a few sections where Michael and I are talking in quick succession. Fortunately his audio was fine, it’s just me who sounded like I was talking through a tin can. The result is a coherent interview that is a little choppier than I would like in parts, so please be advised of that. You may still hear a very low-quality version of me in the background a couple of times but thankfully I think I’ve eliminated most of it. My apologies.</p> <br/><br/>This is a public episode. If you’d like to discuss this with other subscribers or get access to bonus episodes, visit <a href=\"https://fx.substack.com/subscribe?utm_medium=podcast&utm_campaign=CTA_2\">fx.substack.com/subscribe</a>",
  "link": "https://fx.substack.com/p/challenging-the-intellectual-dark",
  "guid": "substack:post:391192",
  "dc:creator": "Derek Davison",
  "pubDate": "Mon, 20 Apr 2020 19:30:43 GMT",
  "enclosure": "",
  "itunes:author": "Derek Davison",
  "itunes:explicit": "No",
  "itunes:duration": 4506,
  "itunes:image": ""
}