{
  "title": "Leading the Way for More LGBTQ Inclusivity in STEM",
  "link": "https://spectrum.ieee.org/arti-agrawal-profile",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/photo-of-a-woman-in-front-of-a-bookshelf.jpg?id=30071633&width=1200&height=800&coordinates=0%2C0%2C2%2C0\"/><br/><br/><p>\n<a href=\"https://www.linkedin.com/in/artiagrawal/\" rel=\"noopener noreferrer\" target=\"_blank\">Arti Agrawal</a>, who is gay, didn’t have access to LGBTQ+ support groups when growing up in India, where homosexuality was a crime until 2018.\n</p><p>\n\t“The society itself was very homophobic,” she says. “I had to live under the radar, and it was very difficult and quite traumatizing to live that way.”\n</p><hr/><p>\n\tAgrawal found solace in advocacy and support organizations in London after moving there in 2005. She went on to form her own groups and lead diversity, equity, and inclusion efforts at the universities she worked for in London and Sydney.\n</p><p>\n\t This year she started a consulting firm, where she helps businesses around the world improve their DEI programs. She also has spearheaded DEI campaigns for the<a href=\"https://www.photonicssociety.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Photonics Society</a>.\n</p><p>\n\tFor her efforts, the senior member received the society’s 2020<a href=\"https://www.photonicssociety.org/awards/distinguished-service-award#:~:text=The%20IEEE%20Photonics%20Society%20Distinguished,Photonics%20Society%20as%20a%20whole.\" rel=\"noopener noreferrer\" target=\"_blank\"> Distinguished Service Award</a>.\n</p><p><strong>Fighting for Diversity and Inclusivity in STEM</strong></p><p>\n\tAfter graduating in 2005 from the<a href=\"https://home.iitd.ac.in/\" rel=\"noopener noreferrer\" target=\"_blank\"> Indian Institute of Technology Delhi</a>, with a doctorate in physics, Agrawal decided to move to the United Kingdom. “I didn’t think I could be my true self at home,” she says, “and I thought I could live more openly.” She joined<a href=\"https://www.city.ac.uk/\" rel=\"noopener noreferrer\" target=\"_blank\"> City, University of London</a>, as a research fellow working on computational photonics.</p><p>\n\t But she discovered there were fewer women in science, technology, engineering, and math at the university than at her alma mater. And, she says, the workplace atmosphere wasn’t welcoming.</p><h3></h3><br/><p><strong>About Arti Agrawal</strong></p><p><strong></strong><strong>Employer: </strong>Vividhataa in Sydney</p><p><strong>Title: </strong>Founder and CEO</p><p><strong>Member grade: </strong>Senior member</p><p><strong>Alma mater: </strong>City, University of London</p><p>\n\t “I never felt like I was treated the same as my male peers or was given the same opportunities,” she says.</p><p>\n\t She also faced homophobia, Agrawal says.</p><p>\n\t “Even though the public opinion on gay rights in the U.K. was shifting, it wasn’t like that within STEM,” she says. “It was quite a closed space. You didn’t talk about sexual orientation. And it was okay for people to make homophobic jokes.”</p><p>\n\t Because of such attitudes, Agrawal got more involved in support groups for members of the LGBTQ+ community as well as women in STEM. She joined <a href=\"https://www.gwn.org.uk/\" rel=\"noopener noreferrer\" target=\"_blank\">The London Gay Women’s Network</a>, which offers professional development and networking opportunities to community members who are pursuing a college degree.</p><p>\n\t But, Agrawal says, she still felt isolated because the groups had few members from underrepresented ethnicities and cultures. So she created her own subgroup in 2009: the<a href=\"https://www.gwn.org.uk/gwnm/\" rel=\"noopener noreferrer\" target=\"_blank\"> Gay Women’s Network Multicultural</a>. It provides women of color a safe space to connect with each other. </p><p>\n\t In 2011 she took a position at the university as a lecturer and started her own LGBTQ+ network there so she could help create a better environment. The group got school officials to install gender-neutral bathrooms, and it won the right for students and faculty members to use their preferred pronouns on human resource forms and in email.</p><p>\n\t In 2018 she left to join the<a href=\"https://www.uts.edu.au/\" rel=\"noopener noreferrer\" target=\"_blank\"> University of Technology</a> in Sydney as director of<a href=\"https://www.uts.edu.au/about/faculty-engineering-and-information-technology/women-engineering-and-it\" rel=\"noopener noreferrer\" target=\"_blank\"> its Women in Engineering and IT</a> program. It works to increase the enrollment of women in the school’s engineering program and to support them throughout their academic career by offering mentoring, scholarships, and professional development workshops.</p><p>\n\t While there, she shook up the engineering school’s admissions process and helped increase cultural awareness. The percentage of women in the undergraduate program at the university “had been stuck at around 16 percent for more than 40 years,” she says. “No number of mentoring programs, scholarships, or industry outreach had changed this statistic.”</p><p>\n\t To help more female candidates qualify for the engineering school, Agrawal pushed to change the admissions policy. Prospective students are ranked based on their Higher Secondary Certificate scores. HSC is a subject-based qualification whereby students take three or four courses of their choice in their last year of secondary school. The top-ranking 100 students, no matter their gender, were admitted to the engineering program. Agrawal recommended adding 10 points to every female applicant’s rank.</p><p>\n\t “It doesn’t change their actual marks,” she says. “It just changes their rank.”</p><p class=\"pull-quote\">\n\t “If you want to make a change in a very difficult and unchanging environment, you must be disruptive. You have to do something bold and brave and have the courage to stand up to the backlash that will come eventually.”</p><p>The policy change was reviewed and approved by several university committees as well as by the<a href=\"https://antidiscrimination.nsw.gov.au/\" rel=\"noopener noreferrer\" target=\"_blank\"> New South Wales Anti-Discrimination</a> board, which handles citizen complaints. The board approved the change for 10 years.</p><p>\n\t Since the policy change, implemented in 2019, the number of women in the program has increased by 10 percent, Agrawal says.</p><p>\n\t The change created a huge backlash, though, Agrawal says, as people said “unqualified women would receive degrees.” Many women were against the change, saying it was doing them a disservice.</p><p>\n\t “But there were people who understood that the administration wasn’t changing anyone’s scores,” Agrawal says. Every student who was admitted met the minimum criteria, she says; the change just bumped up the ranking of some qualified women.</p><p>\n\t “If you want to make a change in a very difficult and unchanging environment, you must be disruptive,” she says. “You have to do something bold and brave and have the courage to stand up to the backlash that will come eventually.”</p><p>\n\t Agrawal also worked to create stronger interpersonal relationships among the faculty and staff at the engineering school. She created social events, held every two weeks, at which faculty and staff meet over coffee and learn about cultural customs—such as Diwali, Eid al-Fitr, and Chinese New Year—from one another.</p><p>\n\t “In a very informal sort of way, faculty and staff members raised their cultural awareness,” she says. “The overall environment also became more positive and welcoming.”\n</p><p><strong>Launching a DEI Startup</strong></p><p>\n\tAgrawal left the university last year, and this year she started her own diversity, equity, and inclusion consulting business, Vividhataa, in Sydney.</p><p>\n\t Vividhataa aims to help companies set goals and create strategies to achieve them. It also is educating managers and employees on gender identity, cultural sensitivity, disability inclusion, and related topics, Agrawal says.\n</p><p><strong>Creating a Safe Space at IEEE</strong></p><p>\n\tAgrawal has been involved in similar efforts at IEEE. She joined the organization as a doctoral student at the Indian Institute of Technology so she could become a member of the<a href=\"https://www.photonicssociety.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Photonics Society</a> chapter there.</p><p>\n\t She first became involved in the<a href=\"https://www.photonicssociety.org/chapters-communities/women-in-photonics\" rel=\"noopener noreferrer\" target=\"_blank\"> IEEE Women in Photonics</a> group as its associate vice president. She spearheaded a campaign to increase the number of local chapters. The society also held events worldwide that addressed the needs of established chapters. The campaign grew to include hosting panels on DEI policies at conferences and holding leadership training.</p><p>\n\t Agrawal founded the society’s diversity oversight committee in 2017 and became associate vice president. She explored how to attract more members from underrepresented groups. She says she also wanted to create a more welcoming environment for members regardless of their age, sexual orientation, or disability. She focused on increasing cultural, racial, and religious diversity.</p><p>\n\t In 2018 she helped organize the society’s first<a href=\"https://www.photonicssociety.org/who-we-are/commitment-to-diversity/pride-in-photonics\" rel=\"noopener noreferrer\" target=\"_blank\"> Pride in Photonics</a> symposium. During the event, LGBTQ+ engineers trained attendees on how to be a good ally to members of the community. Speakers also presented on their optics research and shared their personal journeys.</p><p>\n\t “It brought the community together and helped reduce the sense of isolation that people can feel,” she says.</p><p>\n\t The committee collaborated with the<a href=\"https://nsbp.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> U.S. National Society of Black Physicists</a>, the<a href=\"https://hispanicphysicists.org/\" rel=\"noopener noreferrer\" target=\"_blank\"> National Society of Hispanic Physicists</a>, and other groups on joint conferences at Historically Black Colleges and Universities. The groups are also working to increase representation on IEEE’s committees and councils.</p><p>\n\t The Photonics Society’s diversity oversight committee helped run a marketing campaign in 2020 to increase the number of nominations of qualified women and those from IEEE’s underrepresented regions for the organization’s 2021 medals, recognitions, and technical field awards. It also made a pledge to diversify its panels, meetings, conferences, and events, Agrawal says.</p><p>\n\t “I thought the Photonics Society was, and still is, a marvelous society,” she says. “It has embraced diversity and inclusion and made a lot of headway in that area.”\n</p>",
  "pubDate": "Thu, 07 Jul 2022 18:00:00 +0000",
  "guid": "https://spectrum.ieee.org/arti-agrawal-profile",
  "category": [
    "Ieee member news",
    "Lgbt",
    "Diversity and inclusion",
    "Type:ti"
  ],
  "dc:creator": "Joanna Goodrich",
  "media:content": ""
}