{
  "id": "yt:video:5qJlsEz07eQ",
  "yt:videoId": "5qJlsEz07eQ",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "What If? 2: Additional Serious Scientific Answers to Absurd Hypothetical Questions | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-05T16:00:03+00:00",
  "updated": "2022-10-08T21:21:31+00:00",
  "media:group": {
    "media:title": "What If? 2: Additional Serious Scientific Answers to Absurd Hypothetical Questions | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Randall Munroe discusses his book \"What If? 2: Additional Serious Scientific Answers to Absurd Hypothetical Questions.\" The millions of people around the world who read and loved What If? still have questions, and those questions are getting stranger. Thank goodness xkcd creator Randall Munroe is here to help. Planning to ride a fire pole from the moon back to Earth? The hardest part is sticking the landing. Hoping to cool the atmosphere by opening everyone’s freezer door at the same time? Maybe it’s time for a brief introduction to thermodynamics. Want to know what would happen if you rode a helicopter blade, built a billion-story building, made a lava lamp out of lava, or jumped on a geyser as it erupted? Okay, if you insist.\n\nGet the book here: https://goo.gle/3DN4lkT.\n\nBefore you go on a cosmic road trip, feed the residents of New York City to a T. rex, or fill every church with bananas, be sure to consult this practical guide for impractical ideas. Unfazed by absurdity, Randall consults the latest research on everything from swing-set physics to airplane-catapult design to clearly and concisely answer his readers’ questions. As he consistently demonstrates, you can learn a lot from examining how the world might work in very specific extreme circumstances. This book is filled with bonkers science, boundless curiosity, and Randall’s signature stick-figure comics.\n\nRandall Munroe is the author of the number one New York Times bestsellers How To, What If?, and Thing Explainer; the science question-and-answer blog “What If?”; and the popular web comic xkcd. A former NASA roboticist, he left the agency in 2006 to draw comics on the internet full time. \n\nModerated by Lee Yanco.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}