{
  "title": "Engineering Lunar Network 2.0",
  "link": "https://spectrum.ieee.org/apollo-communications",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/photo-of-astronaut-on-the-moon-with-an-antenna-in-the-foreground.png?id=29583209&width=1200&height=800&coordinates=0%2C42%2C0%2C42\"/><br/><br/><p><strong>When Neil Armstrong</strong> uttered one of the most famous sentences in human history, he did so via a microphone in his helmet and a 3-kilogram VHF-band radio in his backpack. The radio linked to a rig in the lunar lander, which launched microwave signals on a 325,000-kilometer journey to Earth.</p><p>That radio was a tech marvel. In a package just 35 by 15 by 3.2 centimeters, its designers fit two AM receivers, two AM transmitters, either an FM receiver or an FM transmitter, and also a telemetry system that transmitted spacesuit status and physiological data about the astronaut. While those specs might not seem so dazzling today, kindly remember that this radio was designed (by RCA) in the mid-1960s. The whole thing was done without integrated circuits, which were available in the mid-1960s and used extensively elsewhere in the Apollo program but were still relatively uncommon and expensive.</p><hr/><p>The astronauts’ backpack radios were just a small piece of a sprawling communications infrastructure assembled by NASA in the 1960s. For the Apollo missions, during the moon walks, the heart of the communications system was the rig in the lunar lander, known as the <a href=\"https://ntrs.nasa.gov/citations/19720023255\" target=\"_blank\">Lunar Module Communications System</a>. It communicated not only with the astronauts’ radios but also had microwave links to the orbiting command module and to Earth, through a globe-spanning network of more than 30 dish antennas called the Manned Space Flight Network.</p><p>A memorable feature of the Apollo communication system was the <a href=\"http://workingonthemoon.com/WOTM-Erectable-S-Band.html\" target=\"_blank\">S-band erectable antenna</a>, which was connected to the lunar module’s radio system. Stowed as a cylinder 25 by 100 cm, it was unfurled on the moon into a 3-meter-diameter parabolic dish covered with a very fine, flexible, gold-plated mesh. The erectable antenna had a transmit gain of 34 decibels, about 12 dB better than the “steerable” antenna mounted on the lander. The higher gain was needed to accommodate color-TV signals, along with the voice and data channels. Unfortunately, the first time the antenna was used, there wasn’t much video to broadcast. As he was setting up the camera, astronaut Alan Bean accidentally aimed it at the sun and burned out its image tube.</p><p>“Here is the TV,” <a href=\"https://www.hq.nasa.gov/alsj/a12/a12.tvtrbls.html\" rel=\"noopener noreferrer\" target=\"_blank\">he said</a>. “And it’s pointing toward the sun. That’s bad.” After the mishap, NASA equipped future Apollo TV cameras with a lens cap.</p><p>One of the <a href=\"http://www.arrl.org/eavesdropping-on-apollo-11\" rel=\"noopener noreferrer\" target=\"_blank\">more poignant stories</a> of Apollo’s communications involved a radio amateur in Kentucky: Larry Baysinger, W4EJA. By day, Baysinger, who had an interest in radio astronomy, was the station engineer at WHAS AM in Louisville. On the evening of 20 July 1969, <a href=\"https://space.stackexchange.com/questions/33359/hijacked-space-data-notable-instances-of-recovering-images-or-other-goodies-fro/33361#33361\" rel=\"noopener noreferrer\" target=\"_blank\">Basinger managed to pick up</a> not the powerful S-band signal from the lunar lander but rather the weak VHF signals from Neil Armstrong’s backpack radio on the moon. For 35 minutes he listened to the astronauts’ conversation, and even heard them being congratulated by President Richard Nixon. The feat is <a rel=\"noopener noreferrer\" target=\"_blank\">all the more</a> remarkable considering Baysinger’s rig—a rebuilt 20-year-old Army surplus tank radio and a steerable antenna he built out of aluminum tubing and chicken wire.</p><p class=\"pull-quote\">With dozens of missions planned for the next decade, Jet Propulsion Laboratory has partnered with the Italian aerospace company Argotec to design a satellite-based lunar network</p><p>Now Earth-to-moon communications are poised for a new era. With dozens of missions planned for the next decade, the <a href=\"https://www.jpl.nasa.gov/\" rel=\"noopener noreferrer\" target=\"_blank\">Jet Propulsion Laboratory</a> has partnered with the Italian aerospace company <a href=\"https://www.argotec.it/online/\" rel=\"noopener noreferrer\" target=\"_blank\">Argotec</a> to design a satellite-based lunar network that would provide coverage to most of the moon at any given time. <a href=\"https://spectrum.ieee.org/lunar-communications\" target=\"_blank\">The plan</a> calls for 24 satellites to move in four highly elliptical orbits, relaying signals between the lunar surface and Earth. The network wouldn’t be very fast—it would deliver tens of megabits per second, which is less than a decent fiber-to-the-home hookup.</p><p>But the Argotec-JPL concept is just one of several budding initiatives to design future lunar communications infrastructure, including proposals to serve future lunar residents. These explorers would need enormously powerful data links to conduct experiments, control remote equipment, receive and issue warnings about dangerous space weather, rescue stranded surface travelers, and even combat homesickness. The largest project to return humans to the moon, <a href=\"https://www.nasa.gov/specials/artemis/\" rel=\"noopener noreferrer\" target=\"_blank\">NASA’s Artemis</a>, has already spawned several proposals for such lunar networks. NASA itself has developed an architecture it calls <a href=\"https://www.nasa.gov/feature/goddard/2021/lunanet-empowering-artemis-with-communications-and-navigation-interoperability\" rel=\"noopener noreferrer\" target=\"_blank\">LunaNet</a>, which it recently shared with industrial and government partners. And the Japan Aerospace Exploration Agency recently awarded separate contracts to <a href=\"https://aithority.com/internet-of-things/space-technology/jaxa-selects-a-consortium-to-study-navigation-and-communication-technology-development-for-lunar-surface-activities/\" rel=\"noopener noreferrer\" target=\"_blank\">ArkEdge Space</a> and <a href=\"https://www.businesswire.com/news/home/20220125005509/en/WARPSPACE-Selected-for-JAXA-RD-Project-to-Consider-the-Design-of-Optical-Cislunar-Communication-Architecture-for-the-Lunar-Exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Warpspace Co.</a> to perform studies for robust and technologically advanced lunar networks.</p><p>It’s not too much of a stretch to envision these future moon dwellers <a href=\"https://www.cbc.ca/radio/quirks/apollo-landing-sites-now-protected-by-u-s-law-but-what-about-the-flags-1.5866031\" rel=\"noopener noreferrer\" target=\"_blank\">gaping at the landing sites</a> of the Apollo missions. There, amid the lander descent stages, <a href=\"https://www.popsci.com/trash-items-left-on-moon-apollo-maps/\" rel=\"noopener noreferrer\" target=\"_blank\">nail clippers, US $2 bills, and vomit bags</a>, they’ll see the S-band erectable antennas, television cameras, and lunar rovers. With their 21st-century smartphones, they might even take selfies alongside some of the most remarkable communications gear of the 20th.</p><p><em>This article appears in the April 2022 print issue as “One Small Step for Radio.”</em></p>",
  "pubDate": "Fri, 25 Mar 2022 16:52:02 +0000",
  "guid": "https://spectrum.ieee.org/apollo-communications",
  "category": [
    "Moon",
    "Apollo",
    "Artemis",
    "Communications",
    "Radio",
    "Lunar communications"
  ],
  "dc:creator": "Glenn Zorpette",
  "media:content": ""
}