{
  "title": "The Sound of Gita Gopinath",
  "link": "https://audioboom.com/posts/7859879",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2158,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>IMF Chief Economist <a href=\"https://www.bruegel.org/author/gita-gopinath/\">Gita Gopinath</a> joins Bruegel Director <a href=\"https://www.bruegel.org/author/guntram-b-wolff/\">Guntram Wolff</a> for this Live recorded session. They were able to discuss the uneven recovery from the pandemic. In the latest World Economic Outlook, the IMF warns that even though the global economy is on firmer ground, recoveries are diverging dangerously across and within countries, as economies with slower vaccine rollout, more limited policy support, and more reliance on tourism do less well.<br>\n<br>\n\n</div>\n<div>Global prospects remain highly uncertain one year into the pandemic. The outlook depends not just on the outcome of the battle between the virus and vaccines—it also hinges on how effectively economic policies deployed under high uncertainty can limit lasting damage from this unprecedented crisis.<br>\n<br>\n\n</div>\n<div>\n<em>Bruegel would like to thank the International Monetary Fund for co-hosting this recording.<br>\n</em><br>\n\n</div>\n<div>\n<em>This podcast was recorded with a live audience on clubhouse. Follow </em><a href=\"https://www.joinclubhouse.com/club/the-sound-of-economics\"><em>The Sound of Economics club on Clubhouse</em></a><em> for the latest and regular rooms and high level policy conversations on everything from geoeconomics to energy and climate change.<br>\n</em><br>\n\n</div>\n",
  "itunes:summary": "IMF Chief Economist Gita Gopinath joins Bruegel Director Guntram Wolff to discuss the uneven recovery from the pandemic with a live clubhouse audience.",
  "pubDate": "Thu, 06 May 2021 11:34:56 +0000",
  "guid": "tag:audioboom.com,2021-05-06:/posts/7859879",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}