{
  "title": "Unsolved Mysteries Ep 9: Death Row Fugitive",
  "link": "https://audioboom.com/posts/7742912",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3480,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>In November, 1965, Lester Eubanks brutally murdered 14 year old Mary-Ellen Deener. He was swiftly convicted of the crime and sentenced to death. However in 1973, he was able to just walk away from his sentence while out of the prison on a shopping trip that had been arranged for inmates on an honor program. He hasn't been seen since. Lester Eubanks has been on the run for more than 40 years, and ever time the police close in, he remains a step ahead. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 140 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of \"<strong>The Vow</strong>\" \"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a>\n</div>\n<div><a href=\"https://audioboom.com/posts/7703675-death-at-the-mansion-rebecca-zahau-part-1/edit\">Update Description</a></div>\n<div>\n<br>\n<strong>YOU GUYS WE LAUNCHED A NEW PODCAST!!</strong> Each week on <a href=\"https://www.centuriespod.com/\">\"Crimes of the Centuries\"</a> host Amber Hunt (of the Accused podcast) takes us on a deep investigative dive into a crime that was huge when it happened, but has been lost to time--and one you've likely never heard of. From the 220 year old murder that brought Alexander Hamilton and Aaron Burr together to fight for the defense, to Jazz Age thrill killers, Lady mob bosses, murdering grandmothers, and serial killers you've never heard of. <strong>Check out \"Crimes of the Centuries wherever you get your podcasts. </strong>\n</div>\n",
  "pubDate": "Thu, 03 Dec 2020 11:42:07 +0000",
  "guid": "tag:audioboom.com,2020-12-03:/posts/7742912",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}