{
  "title": "Episode 94: &#8220;Stand By Me&#8221;, by Ben E. King",
  "link": "https://500songs.com/podcast/episode-94-stand-by-me-by-ben-e-king/",
  "pubDate": "Tue, 18 Aug 2020 16:35:13 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-94-stand-by-me-by-ben-e-king/",
  "description": "Episode ninety-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Stand By Me\" by Ben E. King, and at the later career of the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/40596289\">on \"If I Had a Hammer\" by Trini López</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-94-stand-by-me/\">&nbsp;Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/317rHxB\">This 3-CD set</a> has all Ben E. King's recordings, both solo and with the Drifters, the Crowns, and LaVern Baker, up to 1962.\n\nThis episode follows on from episode <a href=\"https://www.500songs.com/e/episode-75-there-goes-my-baby-by-the-drifters/\">seventy-five, on \"There Goes My Baby\".</a>\n\nI'm not going to recommend a Drifters compilation, because I know of none that actually have only the original hit recordings without any remakes or remixes. The disclaimer in episode seventy-five also applies here -- I may have used an incorrect version of a song here, because of the sloppy way the Drifters' music is packaged.\n\nMy main resource in putting this episode together was&nbsp;<a href=\"http://uncamarvy.com/\">Marv Goldberg's website</a>, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a>&nbsp;by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd&nbsp;<a href=\"https://amzn.to/2vHRyiL\">Bill Millar's book on the Drifters</a>, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a song that ties together several of the threads we've looked at in previous episodes. We're going to look at a song that had its roots in a gospel song that had been performed by Sister Rosetta Tharpe, that involves the Drifters, Leiber and Stoller, and Phil Spector, and which marks the highpoint of the crossover from gospel to pop audiences that had been started by Ray Charles. We're going to look at \"Stand By Me\", by Ben E King.\n\n[Excerpt: Ben E King, \"Stand By Me\"]\n\nWhen we left the Drifters, they'd hit a legal problem. When the contracts for the individual members had been sold to George Treadwell, the owner of the Drifters' name, Ben E King's contract had not been sold with the rest. This had meant that while King continued to sing lead on the records, including the first few big hits of this new lineup of Drifters, he wasn't allowed to tour with them, and so they'd had to bring in a soundalike singer, Johnnie Lee Williams, to sing his parts on stage. So there were now five Drifters in the studio, but only four of them in the touring group.\n\nThat might seem like an unworkable arrangement for any length of time, and so it turned out, but at first this was very successful. Leiber and Stoller continued producing records for this new Drifters lineup, but didn't tend to write for them. They were increasingly tiring of writing to a teenage audience that didn't really share their tastes, and were starting to move into writing for adult stars like Peggy Lee.\n\nAnd so Leiber and Stoller increasingly relied on songs by other writers, and one team they particularly relied on was Pomus and Shuman. You'll remember we've talked about them in association with both the Drifters and Leiber and Stoller previously, and that they'd been the ones who'd discovered the Ben E. King lineup of the Drifters. Doc Pomus was one of the great R&B songwriters of the fifties, but by 1960 he and Mort Shuman, who was thirteen years younger than him, had written a whole string of hits for white performers like Fabian, Bobby Rydell, Frankie Avalon, and Bobby Darin. A typical example of the stuff they were writing was \"Two Fools\" for Frankie Avalon:\n\n[Excerpt: Frankie Avalon, \"Two Fools\"]\n\nThey were one of the hottest teams in the Brill Building, but they still had a sensibility for the R&B music that the Drifters had their roots in, and so they were the perfect writers to provide crossover hits for the group, and that's what they did. They'd already written \"If You Cry True Love, True Love\" for the group, which had gone to number thirty-three and which had been the only Drifters single on which Williams had taken a lead vocal, and now they wrote a song for King to sing, \"This Magic Moment\":\n\n[Excerpt: Ben E. King and the Drifters, \"This Magic Moment\"]\n\nThat made number sixteen on the pop charts. But the next song they wrote for the group was a much bigger success, and a far more personal song. Pomus was paraplegic after having had polio as a child, and either used crutches or a wheelchair to get around. His wife, though, was younger, and was an actor and dancer. On their wedding day, Pomus was unable to dance with her himself, and watched as she danced with a succession of other people. The feeling stayed with him, and a few years later, he turned those thoughts into a set of lyrics, which Shuman then put to music with a vaguely Latin feel, like many of the Drifters' recent hits.\n\nThe result was a number one record, and one of the all-time classic songs of the rock and roll era:\n\n[Excerpt: Ben E. King and the Drifters, \"Save the Last Dance For Me\"]\n\nThat song has gone on to be one of the most covered songs of all time, with recordings by Tina Turner, Leonard Cohen, Buck Owens, Jerry Lee Lewis, The Swinging Blue Jeans, Harry Nilsson, and Bruce Willis, among many others. It would be the Drifters' only number one on the pop charts, and it was also Ben E King's last single with the Drifters, after King's manager Lover Patterson came to an agreement with the Drifters' manager George Treadwell that would let King move smoothly into a solo career.\n\nThere might have been more to it than that, as there seems to have been a lot of negotiation going on around the group's future at this time. There were reports, for example, that King Records were negotiating to buy the Drifters' contract from Atlantic, which would have been interesting -- it's hard to see the group continuing to have success at King, which didn't have Leiber and Stoller, and which put out very different records from Atlantic.\n\nBut either way, the result was that Ben E. King started performing solo, and indeed by the time \"Save the Last Dance\" came out, he had already released a couple of solo records. The first of these was not a success, and nor was the second, a duet with LaVern Baker:\n\n[Excerpt: Ben E. King and LaVern Baker, \"How Often\"]\n\nBut the third was something else.\n\nAt this point, as a favour to their old friend Lester Sill, Leiber and Stoller were mentoring a kid that Sill thought had promise, named Phil Spector, who we've talked about before in the episode on The Gamblers, but who had now moved over to New York for a time. Spector was staying with Leiber, and would follow him around literally everywhere, claiming that he was so traumatised by his father's death that he couldn't be left alone at any time. Leiber found Spector annoying, but owed Sill a favour, and so kept working with him.\n\nAnd Spector kept pestering Leiber to collaborate with him on some songs. Leiber told Spector, \"No, I write with Mike Stoller\", to which Spector would reply, \"Well, he can write with us too.\"\n\nLeiber explained to him that that wasn't how things worked, and that if there was any collaboration, it would be Leiber and Stoller letting Spector write with them, not Spector graciously allowing Stoller to write with him and Leiber. Spector said that that was what he had meant, of course.\n\nLeiber and Stoller reluctantly agreed that Spector could write with them, but then Stoller was unable to turn up to the writing session. Spector persuaded Leiber to go ahead and just write a song with him since Stoller wasn't around.\n\nHe agreed, and they came up with a song called \"Spanish Harlem\", to which Stoller later added a prominent instrumental line, for which he didn't claim credit, because he thought that Spector would only whine, and he didn't need the hassle.\n\nOr at least, that's the story that normally gets told -- there are people who knew Ritchie Valens who say that the marimba riff on the record, which became the most defining feature of the song, was actually something that Valens had been regularly playing in the months before he died. According to them, Spector, who moved in the same circles as Valens, must have stolen the riff from him.\n\nI tend to believe Stoller's version of the story myself, but either way, Leiber, Stoller, and Spector played the song to Jerry Wexler and Ahmet Ertegun as a trio, with Stoller on piano, Spector on guitar, and Leiber singing. They agreed it should be on the B-side of the next single by King, though the song was popular enough that the record was soon flipped, and \"Spanish Harlem\" made the top ten:\n\n[Excerpt: Ben E. King, \"Spanish Harlem\"]\n\nBut that wasn't even the most important record they made at that session, because after recording it, they decided to record a song that King had written for the Drifters, but which they had turned down. King had brought in the basic idea for the song, and Leiber had helped him finish off the lyric, while Stoller had helped with the music -- the resulting songwriting credit gave fifty percent of the royalties to King, and twenty-five percent each to Leiber and Stoller, as a result. King's song had a long prehistory before he wrote it, and like many early soul songs it had its basis in gospel music. The original source for the song is a spiritual from 1905 by Rev. Charles Albert Tindley, which had been recorded by various people, including Sister Rosetta Tharpe:\n\n[Excerpt: Sister Rosetta Tharpe, \"Stand By Me\"]\n\nBut the proximate influence for the song was a song that Sam Cooke had written for his old group, the Soul Stirrers, the year before, which had in turn been inspired by Tindley's song. The lead vocal on the Soul Stirrers' record was by Johnnie Taylor, a friend of Cooke's who had replaced Cooke in his first group, the Highway QCs, and then replaced him in his second one, because he sounded exactly like Cooke:\n\n[Excerpt: The Soul Stirrers, \"Stand By Me, Father\"]\n\nKing idolised Cooke, and was inspired by that record to come up with his own variant on the song. Working with Leiber and Stoller, he carefully crafted his secular adaptation of it, writing a lyric that worked equally well as a gospel song or as a song to a lover, other than the words \"darling, darling\" in the chorus. The chord sequence they used was a simple adaptation of the standard doo-wop chord changes. On a normal doo-wop song, the chords would go I, minor vi, IV, V, with each chord taking up the same amount of time, like this:\n\n[demonstrates on guitar]\n\nStoller took those changes, and made the I and minor vi last two bars each,\n\n[demonstrates]\n\nthen had the IV and V chords both last a bar, then go to two more bars of the I chord.\n\n[demonstrates]\n\nThat bar of IV, bar of V, two bars of I thing is almost what you get at the end of a twelve-bar blues, except there you go V, IV, I, I, rather than IV, V, I, I. So to compare, here's the end of a twelve-bar blues:\n\n[demonstrates]\n\nAnd here's what Stoller did again:\n\n[demonstrates]\n\nSo effectively Stoller has taken the two most hackneyed chord sequences in rock and roll music, and hybridised them to turn them into a single new sequence that's instantly recognisable:\n\n[demonstrates on guitar]\n\nIn later years, Leiber always gave Stoller the credit for the song's success, saying that while the lyrics and melody were good, and King's performance exceptional, it was the bass line that Stoller came up with which made the song the success it was. I agree, to a large extent -- but that bassline is largely just following the root notes of the chord sequence that Stoller had written. But it's one of the most immediately recognisable pieces of music of the early sixties:\n\n[Excerpt: Ben E. King, \"Stand By Me\"]\n\nThe record sounded remarkably original, for something that was made up almost entirely out of repurposed elements from other songs, and it shows more clearly than perhaps any other song that originality doesn't mean creating something entirely ab initio, but can mean taking a fresh look at things that are familiar, and putting just a slight twist on them.\n\nIn particular, one thing that doesn't get noted enough is just how much of a departure the song was lyrically. People had been reworking gospel ideas into secular ones for years -- we've already looked at Ray Charles doing this, and at Sam Cooke, and there were many other examples, like Little Walter turning \"This Train\" into \"My Babe\". But in most cases those songs required wholesale lyrical reworking.\n\n\"Stand By Me\" is different, it brings the lyrical concerns and style of gospel firmly into the secular realm. \"If the sky that we look upon should tumble and fall, and the mountains should crumble to the sea\" is an apocalyptic vision, not \"Candy's sweet/And honey too/There's not another quite, quite as sweet as you\", which were the lyrics Sam Cooke wrote when he turned a song about how God is wonderful into one about how his girl is loveable.\n\nThis new type of more gospel-inflected lyric would become very common in the next few years, especially among Black performers. Another building block in the music that would become known as soul had been put in place.\n\nThe record went to number four on the charts, and it looked like he was headed for a huge career. But the next few singles he released didn't do so well -- he recorded a version of the old standard \"Amor\" which made number nineteen, and then his next two records topped out at sixty-six and fifty-six. He did get back in the pop top twenty with a song co-written by his wife and Ahmet Ertegun, \"Don't Play That Song (You Lied)\", which reached number eleven and became an R&B standard:\n\n[Excerpt: Ben E. King, \"Don't Play That Song (You Lied)\"]\n\nBut as many people did at the time, he tried to move into the more lucrative world of adult supper-club singers, rather than singing R&B. While his version of \"I Who Have Nothing\" -- a French song that has since become a standard, and whose English lyrics were written for King by Leiber and Stoller -- managed to reach number twenty-nine, everything else did terribly. He sang \"I Could Have Danced All Night\" and \"What Now My Love?\" perfectly well, but that wasn't what the audience wanted from him.\n\nHe made some great records in the later 60s, like \"What Is Soul\":\n\n[Excerpt: Ben E. King \"What Is Soul?\"]\n\nBut even teaming up with Solomon Burke, Don Covay, Joe Tex, and Arthur Conley as The Soul Clan didn't help him kickstart his recording career:\n\n[Excerpt: The Soul Clan, \"Soul Meeting\"]\n\nHe asked to be let go from his contract with Atlantic in 1969, and spent a few years in the early seventies recording for small labels.\n\nMeanwhile, the Drifters were continuing without King. After King left, Atlantic started releasing whatever material they had in their vaults, both songs with King's leads and older records from the earlier line-up of Drifters. But they were about to have even more personnel shifts. When they were on tour and got to Mobile, Alabama, Johnny Lee Williams said that he was just going to stay there and not continue on the tour -- he was sick of not getting to sing lead vocals, and he came from Mobile anyway. Williams went on to join a group called the Embraceables, who released this with him singing lead:\n\n[Excerpt: The Embraceables, \"My Foolish Pride\"]\n\nThat was later rereleased as by The Implaceables, for reasons I've not been able to discover.\n\nThe Drifters got in a replacement for Williams, James Poindexter, but he turned out to have stage fright, and the group spent several months as a trio, before being joined by new lead singer Rudy Lewis. And then Elsbeary Hobbs, the group's bass singer, was drafted, and the group got in a couple of different singers before settling on Tommy Evans, who had sung with the old versions of the Drifters in the fifties. The new lineup, Rudy Lewis, Charlie Thomas, Dock Green, and Tommy Evans, would be one of the group's longest-lasting lineups, lasting more than a year, and would record hits like \"Up On the Roof\", by Goffin and King:\n\n[Excerpt: The Drifters, \"Up On the Roof\"]\n\nBut then Dock Green left the group. He and Tommy Evans joined another group -- even though Evans was also still in the Drifters. The Drapers, the group they joined, was managed by Lover Patterson, Ben E. King's manager, and had been given a name that sounded as much like \"The Drifters\" as possible. As well as Green and Evans, it also had Johnny Moore and Carnation Charlie Hughes, who had been in the same 1956 lineup of the Drifters that Tommy Evans had been in.\n\nThat lineup of the Drapers released one single that didn't do particularly well:\n\n[Excerpt: The Drapers, \"(I Know) Your Love Has Gone Away\"]\n\nThe new Drifters lineup, without Dock Green, recorded \"On Broadway\", a song that Leiber and Stoller had co-written with the Brill Building team of Mann and Weill. The guitar on the record was by Phil Spector -- he was by that point a successful producer, but Leiber and Stoller had bumped into him on the way to the session and invited him to sit in:\n\n[Excerpt: The Drifters, \"On Broadway\"]\n\nTommy Evans then also left the Drifters, and was replaced by Johnny Terry, leaving a lineup of Rudy Lewis, Charlie Thomas, Gene Pearson, and Johnny Terry. But Rudy Lewis, the lead singer of the group since just after King had left, was thinking of going solo, and even released one solo single:\n\n[Excerpt: Rudy Lewis, \"I've Loved You So Long\"]\n\nThat wasn't a success, but George Treadwell wanted some insurance in case Lewis left, so he got Johnny Moore -- who had been in the group in the fifties and had just left the Drapers -- to join, and for a few months Lewis and Moore traded off leads in the studio.\n\nOne song that they recorded during 1963, but didn't release, was \"Only in America\", written for them by Leiber and Stoller. Leiber and Stoller had intended the song to be a sly satire, with Black people singing about the American dream, but Atlantic worried that in the racial climate of 1963, the satire would seem tasteless, so they took the Drifters' backing track and got Jay and the Americans, a white group, to record new vocals, turning it into a straightforward bit of boosterism:\n\n[Excerpt: Jay and the Americans, \"Only in America\"]\n\nTragedy struck on the day the Drifters recorded what would be their last US top ten hit, the twenty-first of May 1964. Johnny Moore bumped into Sylvia Vanterpool, of Mickey and Sylvia, and she said \"thank God it wasn't you\". He didn't know what she was talking about, and she told him that Rudy Lewis had died suddenly earlier that day. The group went into the studio anyway, and recorded the songs that had been scheduled, including one called \"I Don't Want To Go On Without You\" which took on a new meaning in the circumstances. But the hit from the session was \"Under the Boardwalk\", with lead vocals from Moore:\n\n[Excerpt: The Drifters, \"Under the Boardwalk\"]\n\nThis version of the group -- Johnny Moore, Charlie Thomas, Gene Pearson, and Johnny Terry, would be the longest-lasting of all the versions of the group managed by George Treadwell, staying together a full two years. But after \"Under the Boardwalk\", which went to number four, they had no more top ten hits in the US. The best they could do was scrape the top twenty with \"Saturday Night at the Movies\":\n\n[Excerpt: The Drifters, \"Saturday Night at the Movies\"]\n\nThere were several more lineup changes, but the big change came in 1967 when George Treadwell died. His wife, Faye, took over the management of the group, and shortly after that, Charlie Thomas -- the person who had been in the group for the longest continuous time, nine years at that point, decided to leave. There were a lot more squabbles and splinter groups, and by 1970 the Drifters' career on Atlantic was over.\n\nBy this point, there were three different versions of The Drifters. There was a group called The Original Drifters, which had formed in 1958 after the first set of Drifters had been fired, and was originally made up entirely of members of the early-fifties lineups, but which was now a revolving-door group based around Bill Pinkney, the bass singer of the Clyde McPhatter lineup, and stayed that way until Pinkney's death in 2007.\n\nThen there was a version of the Drifters that consisted of Dock Green, Charlie Thomas, and Elsbeary Hobbs, the people who had been in Ben E. King's version of the group. Charlie Thomas won the right to use the name in the USA in 1972, and continues touring with his own group there to this day, though no more of that lineup of the Drifters are with him.\n\nAnd then there was a UK-based group, managed by Faye Treadwell, with Johnny Moore as lead singer. That group scored big UK hits when the group moved to the UK in 72, with re-releases of mid-sixties records that had been comparative flops at the time -- \"Saturday Night at the Movies\", \"At the Club\", and \"Come On Over to My Place\" all made the UK top ten in 1972, and Moore's Drifters would have nine more top ten hits with new material in the UK between 1973 and 76.\n\nAnd Ben E. King, meanwhile, had signed again to Atlantic, and had a one-off top ten hit with \"Supernatural Thing\" in 1975:\n\n[Excerpt: Ben E. King, \"Supernatural Thing\"]\n\nBut other than that he'd continued to have far less chart success than his vocal talents deserved, and in the eighties he moved to the UK and joined the UK version of the Drifters, singing his old hits on the nostalgia circuit with them, and adding more authenticity to the Johnny Moore lineup of the group.\n\nHe spent several years like that, until in 1986 his career had a sudden resurgence, when the film Stand By Me came out and his single was used as the theme. On the back of the film's success, the song reentered the top ten, twenty-five years after its initial success, and made number one in the UK. As a result, King became the first person to have hit the top ten in the US in the fifties, sixties, seventies, and eighties -- a remarkable record for someone who had had relatively few hits. A greatest hits collection of King's records made the top twenty in the UK, as well, and King left the Drifters to once again become a solo artist.\n\nBut this is where we say goodbye to King, and to the Drifters, and to Leiber and Stoller as songwriters. The UK version of the Drifters carried on with Johnny Moore as lead singer until he died in 1998, and up to that point it was reasonable to think of that group as a real version of the Drifters, because Moore had sung with the group on hits in the fifties and sixties, and in the UK in the seventies – roughly eighty percent of records released as by The Drifters had had Moore singing on them. But after Moore's death, it gets very confusing, with the Treadwell family apparently abandoning the trademark and moving back to the US, and then changing their mind, resulting in a series of lawsuits. The current UK version of the Drifters has nobody who was in the group before 2010, and is managed by George and Faye Treadwell's daughter. They still fill medium-sized theatres on large national tours, because their audiences don't seem to care, so long as they can hear people singing \"Up On the Roof\" and \"On Broadway\", \"There Goes My Baby\" and \"Save the Last Dance For Me\". In total thirty-four different people were members of the Drifters during their time with Atlantic Records. It's the only case I know where a group identity was genuinely bigger than the members, where whoever was involved, somehow they carried on making exceptional records.\n\nLeiber and Stoller, meanwhile, will turn up again, once more, next year, as record executives, collaborating with another figure we've seen several times before to run a record label. But this is the last record we'll look at with them as a songwriting team. We've been following their remarkable career since episode fifteen, and they would continue writing great songs for a huge variety of artists, but \"Stand By Me\" would be the last time they would come up with something that would change the music industry. It was the end of a truly remarkable run, and one which stands as one of the great achievements in twentieth century popular music.\n\nAnd Ben E. King, who was, other than Clyde McPhatter, the only member of the Drifters to ever break away and become a solo success, spent the last twenty-nine years of his life touring as a solo artist off the renewed success of his greatest contribution to music. He died in 2015, but as long as people listen to rock, pop, soul, or R&B, there'll be people listening to \"Stand By Me\".",
  "itunes:subtitle": "Episode ninety-four of A History of Rock Music in Five Hundred Songs looks at Stand By Me by Ben E. King, and at the later career of the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatre",
  "itunes:keywords": "Ahmet Ertegun,Atlantic Records,Ben E. King,Brill Building,Doc Pomus,gospel,Jerry Wexler,LaVern Baker,lawsuits,Leiber and Stoller,Lester Sill,Mickey and Sylvia,Mort Shuman,Phil Spector,Sam Cooke,soul,Sylvia Vanterpool,The Drifters",
  "itunes:episodeType": "full",
  "itunes:episode": 94,
  "content:encoded": "Episode ninety-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Stand By Me\" by Ben E. King, and at the later career of the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/40596289\">on \"If I Had a Hammer\" by Trini López</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust%20\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-94-stand-by-me/\">&nbsp;Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/317rHxB\">This 3-CD set</a> has all Ben E. King's recordings, both solo and with the Drifters, the Crowns, and LaVern Baker, up to 1962.\n\nThis episode follows on from episode <a href=\"https://www.500songs.com/e/episode-75-there-goes-my-baby-by-the-drifters/\">seventy-five, on \"There Goes My Baby\".</a>\n\nI'm not going to recommend a Drifters compilation, because I know of none that actually have only the original hit recordings without any remakes or remixes. The disclaimer in episode seventy-five also applies here -- I may have used an incorrect version of a song here, because of the sloppy way the Drifters' music is packaged.\n\nMy main resource in putting this episode together was&nbsp;<a href=\"http://uncamarvy.com/\">Marv Goldberg's website</a>, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\n<a href=\"https://amzn.to/2JO5R9p\">Lonely Avenue</a>, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\n<a href=\"https://amzn.to/2SY9jkw\">Hound Dog: The Leiber and Stoller Autobiography</a>&nbsp;by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd&nbsp;<a href=\"https://amzn.to/2vHRyiL\">Bill Millar's book on the Drifters</a>, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">Why not join them</a>?\n\n<strong>Transcript</strong>\n\nToday, we're going to look at a song that ties together several of the threads we've looked at in previous episodes. We're going to look at a song that had its roots in a gospel song that had been performed by Sister Rosetta Tharpe, that involves the Drifters, Leiber and Stoller, and Phil Spector, and which marks the highpoint of the crossover from gospel to pop audiences that had been started by Ray Charles. We're going to look at \"Stand By Me\", by Ben E King.\n\n[Excerpt: Ben E King, \"Stand By Me\"]\n\nWhen we left the Drifters, they'd hit a legal problem. When the contracts for the individual members had been sold to George Treadwell, the owner of the Drifters' name, Ben E King's contract had not been sold with the rest. This had meant that while King continued to sing lead on the records, including the first few big hits of this new lineup of Drifters, he wasn't allowed to tour with them, and so they'd had to bring in a soundalike singer, Johnnie Lee Williams, to sing his parts on stage. So there were now five Drifters in the studio, but only four of them in the touring group.\n\nThat might seem like an unworkable arrangement for any length of time, and so it turned out, but at first this was very successful. Leiber and Stoller continued producing records for this new Drifters lineup, but didn't tend to write for them. They were increasingly tiring of writing to a teenage audience that didn't really share their tastes, and were starting to move into writing for adult stars like Peggy Lee.\n\nAnd so Leiber and Stoller increasingly relied on songs by other writers, and one team they particularly relied on was Pomus and Shuman. You'll remember we've talked about them in association with both the Drifters and Leiber and Stoller previously, and that they'd been the ones who'd discovered the Ben E. King lineup of the Drifters. Doc Pomus was one of the great R&B songwriters of the fifties, but by 1960 he and Mort Shuman, who was thirteen years younger than him, had written a whole string of hits for white performers like Fabian, Bobby Rydell, Frankie Avalon, and Bobby Darin. A typical example of the stuff they were writing was \"Two Fools\" for Frankie Avalon:\n\n[Excerpt: Frankie Avalon, \"Two Fools\"]\n\nThey were one of the hottest teams in the Brill Building, but they still had a sensibility for the R&B music that the Drifters had their roots in, and so they were the perfect writers to provide crossover hits for the group, and that's what they did. They'd already written \"If You Cry True Love, True Love\" for the group, which had gone to number thirty-three and which had been the only Drifters single on which Williams had taken a lead vocal, and now they wrote a song for King to sing, \"This Magic Moment\":\n\n[Excerpt: Ben E. King and the Drifters, \"This Magic Moment\"]\n\nThat made number sixteen on the pop charts. But the next song they wrote for the group was a much bigger success, and a far more personal song. Pomus was paraplegic after having had polio as a child, and either used crutches or a wheelchair to get around. His wife, though, was younger, and was an actor and dancer. On their wedding day, Pomus was unable to dance with her himself, and watched as she danced with a succession of other people. The feeling stayed with him, and a few years later, he turned those thoughts into a set of lyrics, which Shuman then put to music with a vaguely Latin feel, like many of the Drifters' recent hits.\n\nThe result was a number one record, and one of the all-time classic songs of the rock and roll era:\n\n[Excerpt: Ben E. King and the Drifters, \"Save the Last Dance For Me\"]\n\nThat song has gone on to be one of the most covered songs of all time, with recordings by Tina Turner, Leonard Cohen, Buck Owens, Jerry Lee Lewis, The Swinging Blue Jeans, Harry Nilsson, and Bruce Willis, among many others. It would be the Drifters' only number one on the pop charts, and it was also Ben E King's last single with the Drifters, after King's manager Lover Patterson came to an agreement with the Drifters' manager George Treadwell that would let King move smoothly into a solo career.\n\nThere might have been more to it than that, as there seems to have been a lot of negotiation going on around the group's future at this time. There were reports, for example, that King Records were negotiating to buy the Drifters' contract from Atlantic, which would have been interesting -- it's hard to see the group continuing to have success at King, which didn't have Leiber and Stoller, and which put out very different records from Atlantic.\n\nBut either way, the result was that Ben E. King started performing solo, and indeed by the time \"Save the Last Dance\" came out, he had already released a couple of solo records. The first of these was not a success, and nor was the second, a duet with LaVern Baker:\n\n[Excerpt: Ben E. King and LaVern Baker, \"How Often\"]\n\nBut the third was something else.\n\nAt this point, as a favour to their old friend Lester Sill, Leiber and Stoller were mentoring a kid that Sill thought had promise, named Phil Spector, who we've talked about before in the episode on The Gamblers, but who had now moved over to New York for a time. Spector was staying with Leiber, and would follow him around literally everywhere, claiming that he was so traumatised by his father's death that he couldn't be left alone at any time. Leiber found Spector annoying, but owed Sill a favour, and so kept working with him.\n\nAnd Spector kept pestering Leiber to collaborate with him on some songs. Leiber told Spector, \"No, I write with Mike Stoller\", to which Spector would reply, \"Well, he can write with us too.\"\n\nLeiber explained to him that that wasn't how things worked, and that if there was any collaboration, it would be Leiber and Stoller letting Spector write with them, not Spector graciously allowing Stoller to write with him and Leiber. Spector said that that was what he had meant, of course.\n\nLeiber and Stoller reluctantly agreed that Spector could write with them, but then Stoller was unable to turn up to the writing session. Spector persuaded Leiber to go ahead and just write a song with him since Stoller wasn't around.\n\nHe agreed, and they came up with a song called \"Spanish Harlem\", to which Stoller later added a prominent instrumental line, for which he didn't claim credit, because he thought that Spector would only whine, and he didn't need the hassle.\n\nOr at least, that's the story that normally gets told -- there are people who knew Ritchie Valens who say that the marimba riff on the record, which became the most defining feature of the song, was actually something that Valens had been regularly playing in the months before he died. According to them, Spector, who moved in the same circles as Valens, must have stolen the riff from him.\n\nI tend to believe Stoller's version of the story myself, but either way, Leiber, Stoller, and Spector played the song to Jerry Wexler and Ahmet Ertegun as a trio, with Stoller on piano, Spector on guitar, and Leiber singing. They agreed it should be on the B-side of the next single by King, though the song was popular enough that the record was soon flipped, and \"Spanish Harlem\" made the top ten:\n\n[Excerpt: Ben E. King, \"Spanish Harlem\"]\n\nBut that wasn't even the most important record they made at that session, because after recording it, they decided to record a song that King had written for the Drifters, but which they had turned down. King had brought in the basic idea for the song, and Leiber had helped him finish off the lyric, while Stoller had helped with the music -- the resulting songwriting credit gave fifty percent of the royalties to King, and twenty-five percent each to Leiber and Stoller, as a result. King's song had a long prehistory before he wrote it, and like many early soul songs it had its basis in gospel music. The original source for the song is a spiritual from 1905 by Rev. Charles Albert Tindley, which had been recorded by various people, including Sister Rosetta Tharpe:\n\n[Excerpt: Sister Rosetta Tharpe, \"Stand By Me\"]\n\nBut the proximate influence for the song was a song that Sam Cooke had written for his old group, the Soul Stirrers, the year before, which had in turn been inspired by Tindley's song. The lead vocal on the Soul Stirrers' record was by Johnnie Taylor, a friend of Cooke's who had replaced Cooke in his first group, the Highway QCs, and then replaced him in his second one, because he sounded exactly like Cooke:\n\n[Excerpt: The Soul Stirrers, \"Stand By Me, Father\"]\n\nKing idolised Cooke, and was inspired by that record to come up with his own variant on the song. Working with Leiber and Stoller, he carefully crafted his secular adaptation of it, writing a lyric that worked equally well as a gospel song or as a song to a lover, other than the words \"darling, darling\" in the chorus. The chord sequence they used was a simple adaptation of the standard doo-wop chord changes. On a normal doo-wop song, the chords would go I, minor vi, IV, V, with each chord taking up the same amount of time, like this:\n\n[demonstrates on guitar]\n\nStoller took those changes, and made the I and minor vi last two bars each,\n\n[demonstrates]\n\nthen had the IV and V chords both last a bar, then go to two more bars of the I chord.\n\n[demonstrates]\n\nThat bar of IV, bar of V, two bars of I thing is almost what you get at the end of a twelve-bar blues, except there you go V, IV, I, I, rather than IV, V, I, I. So to compare, here's the end of a twelve-bar blues:\n\n[demonstrates]\n\nAnd here's what Stoller did again:\n\n[demonstrates]\n\nSo effectively Stoller has taken the two most hackneyed chord sequences in rock and roll music, and hybridised them to turn them into a single new sequence that's instantly recognisable:\n\n[demonstrates on guitar]\n\nIn later years, Leiber always gave Stoller the credit for the song's success, saying that while the lyrics and melody were good, and King's performance exceptional, it was the bass line that Stoller came up with which made the song the success it was. I agree, to a large extent -- but that bassline is largely just following the root notes of the chord sequence that Stoller had written. But it's one of the most immediately recognisable pieces of music of the early sixties:\n\n[Excerpt: Ben E. King, \"Stand By Me\"]\n\nThe record sounded remarkably original, for something that was made up almost entirely out of repurposed elements from other songs, and it shows more clearly than perhaps any other song that originality doesn't mean creating something entirely ab initio, but can mean taking a fresh look at things that are familiar, and putting just a slight twist on them.\n\nIn particular, one thing that doesn't get noted enough is just how much of a departure the song was lyrically. People had been reworking gospel ideas into secular ones for years -- we've already looked at Ray Charles doing this, and at Sam Cooke, and there were many other examples, like Little Walter turning \"This Train\" into \"My Babe\". But in most cases those songs required wholesale lyrical reworking.\n\n\"Stand By Me\" is different, it brings the lyrical concerns and style of gospel firmly into the secular realm. \"If the sky that we look upon should tumble and fall, and the mountains should crumble to the sea\" is an apocalyptic vision, not \"Candy's sweet/And honey too/There's not another quite, quite as sweet as you\", which were the lyrics Sam Cooke wrote when he turned a song about how God is wonderful into one about how his girl is loveable.\n\nThis new type of more gospel-inflected lyric would become very common in the next few years, especially among Black performers. Another building block in the music that would become known as soul had been put in place.\n\nThe record went to number four on the charts, and it looked like he was headed for a huge career. But the next few singles he released didn't do so well -- he recorded a version of the old standard \"Amor\" which made number nineteen, and then his next two records topped out at sixty-six and fifty-six. He did get back in the pop top twenty with a song co-written by his wife and Ahmet Ertegun, \"Don't Play That Song (You Lied)\", which reached number eleven and became an R&B standard:\n\n[Excerpt: Ben E. King, \"Don't Play That Song (You Lied)\"]\n\nBut as many people did at the time, he tried to move into the more lucrative world of adult supper-club singers, rather than singing R&B. While his version of \"I Who Have Nothing\" -- a French song that has since become a standard, and whose English lyrics were written for King by Leiber and Stoller -- managed to reach number twenty-nine, everything else did terribly. He sang \"I Could Have Danced All Night\" and \"What Now My Love?\" perfectly well, but that wasn't what the audience wanted from him.\n\nHe made some great records in the later 60s, like \"What Is Soul\":\n\n[Excerpt: Ben E. King \"What Is Soul?\"]\n\nBut even teaming up with Solomon Burke, Don Covay, Joe Tex, and Arthur Conley as The Soul Clan didn't help him kickstart his recording career:\n\n[Excerpt: The Soul Clan, \"Soul Meeting\"]\n\nHe asked to be let go from his contract with Atlantic in 1969, and spent a few years in the early seventies recording for small labels.\n\nMeanwhile, the Drifters were continuing without King. After King left, Atlantic started releasing whatever material they had in their vaults, both songs with King's leads and older records from the earlier line-up of Drifters. But they were about to have even more personnel shifts. When they were on tour and got to Mobile, Alabama, Johnny Lee Williams said that he was just going to stay there and not continue on the tour -- he was sick of not getting to sing lead vocals, and he came from Mobile anyway. Williams went on to join a group called the Embraceables, who released this with him singing lead:\n\n[Excerpt: The Embraceables, \"My Foolish Pride\"]\n\nThat was later rereleased as by The Implaceables, for reasons I've not been able to discover.\n\nThe Drifters got in a replacement for Williams, James Poindexter, but he turned out to have stage fright, and the group spent several months as a trio, before being joined by new lead singer Rudy Lewis. And then Elsbeary Hobbs, the group's bass singer, was drafted, and the group got in a couple of different singers before settling on Tommy Evans, who had sung with the old versions of the Drifters in the fifties. The new lineup, Rudy Lewis, Charlie Thomas, Dock Green, and Tommy Evans, would be one of the group's longest-lasting lineups, lasting more than a year, and would record hits like \"Up On the Roof\", by Goffin and King:\n\n[Excerpt: The Drifters, \"Up On the Roof\"]\n\nBut then Dock Green left the group. He and Tommy Evans joined another group -- even though Evans was also still in the Drifters. The Drapers, the group they joined, was managed by Lover Patterson, Ben E. King's manager, and had been given a name that sounded as much like \"The Drifters\" as possible. As well as Green and Evans, it also had Johnny Moore and Carnation Charlie Hughes, who had been in the same 1956 lineup of the Drifters that Tommy Evans had been in.\n\nThat lineup of the Drapers released one single that didn't do particularly well:\n\n[Excerpt: The Drapers, \"(I Know) Your Love Has Gone Away\"]\n\nThe new Drifters lineup, without Dock Green, recorded \"On Broadway\", a song that Leiber and Stoller had co-written with the Brill Building team of Mann and Weill. The guitar on the record was by Phil Spector -- he was by that point a successful producer, but Leiber and Stoller had bumped into him on the way to the session and invited him to sit in:\n\n[Excerpt: The Drifters, \"On Broadway\"]\n\nTommy Evans then also left the Drifters, and was replaced by Johnny Terry, leaving a lineup of Rudy Lewis, Charlie Thomas, Gene Pearson, and Johnny Terry. But Rudy Lewis, the lead singer of the group since just after King had left, was thinking of going solo, and even released one solo single:\n\n[Excerpt: Rudy Lewis, \"I've Loved You So Long\"]\n\nThat wasn't a success, but George Treadwell wanted some insurance in case Lewis left, so he got Johnny Moore -- who had been in the group in the fifties and had just left the Drapers -- to join, and for a few months Lewis and Moore traded off leads in the studio.\n\nOne song that they recorded during 1963, but didn't release, was \"Only in America\", written for them by Leiber and Stoller. Leiber and Stoller had intended the song to be a sly satire, with Black people singing about the American dream, but Atlantic worried that in the racial climate of 1963, the satire would seem tasteless, so they took the Drifters' backing track and got Jay and the Americans, a white group, to record new vocals, turning it into a straightforward bit of boosterism:\n\n[Excerpt: Jay and the Americans, \"Only in America\"]\n\nTragedy struck on the day the Drifters recorded what would be their last US top ten hit, the twenty-first of May 1964. Johnny Moore bumped into Sylvia Vanterpool, of Mickey and Sylvia, and she said \"thank God it wasn't you\". He didn't know what she was talking about, and she told him that Rudy Lewis had died suddenly earlier that day. The group went into the studio anyway, and recorded the songs that had been scheduled, including one called \"I Don't Want To Go On Without You\" which took on a new meaning in the circumstances. But the hit from the session was \"Under the Boardwalk\", with lead vocals from Moore:\n\n[Excerpt: The Drifters, \"Under the Boardwalk\"]\n\nThis version of the group -- Johnny Moore, Charlie Thomas, Gene Pearson, and Johnny Terry, would be the longest-lasting of all the versions of the group managed by George Treadwell, staying together a full two years. But after \"Under the Boardwalk\", which went to number four, they had no more top ten hits in the US. The best they could do was scrape the top twenty with \"Saturday Night at the Movies\":\n\n[Excerpt: The Drifters, \"Saturday Night at the Movies\"]\n\nThere were several more lineup changes, but the big change came in 1967 when George Treadwell died. His wife, Faye, took over the management of the group, and shortly after that, Charlie Thomas -- the person who had been in the group for the longest continuous time, nine years at that point, decided to leave. There were a lot more squabbles and splinter groups, and by 1970 the Drifters' career on Atlantic was over.\n\nBy this point, there were three different versions of The Drifters. There was a group called The Original Drifters, which had formed in 1958 after the first set of Drifters had been fired, and was originally made up entirely of members of the early-fifties lineups, but which was now a revolving-door group based around Bill Pinkney, the bass singer of the Clyde McPhatter lineup, and stayed that way until Pinkney's death in 2007.\n\nThen there was a version of the Drifters that consisted of Dock Green, Charlie Thomas, and Elsbeary Hobbs, the people who had been in Ben E. King's version of the group. Charlie Thomas won the right to use the name in the USA in 1972, and continues touring with his own group there to this day, though no more of that lineup of the Drifters are with him.\n\nAnd then there was a UK-based group, managed by Faye Treadwell, with Johnny Moore as lead singer. That group scored big UK hits when the group moved to the UK in 72, with re-releases of mid-sixties records that had been comparative flops at the time -- \"Saturday Night at the Movies\", \"At the Club\", and \"Come On Over to My Place\" all made the UK top ten in 1972, and Moore's Drifters would have nine more top ten hits with new material in the UK between 1973 and 76.\n\nAnd Ben E. King, meanwhile, had signed again to Atlantic, and had a one-off top ten hit with \"Supernatural Thing\" in 1975:\n\n[Excerpt: Ben E. King, \"Supernatural Thing\"]\n\nBut other than that he'd continued to have far less chart success than his vocal talents deserved, and in the eighties he moved to the UK and joined the UK version of the Drifters, singing his old hits on the nostalgia circuit with them, and adding more authenticity to the Johnny Moore lineup of the group.\n\nHe spent several years like that, until in 1986 his career had a sudden resurgence, when the film Stand By Me came out and his single was used as the theme. On the back of the film's success, the song reentered the top ten, twenty-five years after its initial success, and made number one in the UK. As a result, King became the first person to have hit the top ten in the US in the fifties, sixties, seventies, and eighties -- a remarkable record for someone who had had relatively few hits. A greatest hits collection of King's records made the top twenty in the UK, as well, and King left the Drifters to once again become a solo artist.\n\nBut this is where we say goodbye to King, and to the Drifters, and to Leiber and Stoller as songwriters. The UK version of the Drifters carried on with Johnny Moore as lead singer until he died in 1998, and up to that point it was reasonable to think of that group as a real version of the Drifters, because Moore had sung with the group on hits in the fifties and sixties, and in the UK in the seventies – roughly eighty percent of records released as by The Drifters had had Moore singing on them. But after Moore's death, it gets very confusing, with the Treadwell family apparently abandoning the trademark and moving back to the US, and then changing their mind, resulting in a series of lawsuits. The current UK version of the Drifters has nobody who was in the group before 2010, and is managed by George and Faye Treadwell's daughter. They still fill medium-sized theatres on large national tours, because their audiences don't seem to care, so long as they can hear people singing \"Up On the Roof\" and \"On Broadway\", \"There Goes My Baby\" and \"Save the Last Dance For Me\". In total thirty-four different people were members of the Drifters during their time with Atlantic Records. It's the only case I know where a group identity was genuinely bigger than the members, where whoever was involved, somehow they carried on making exceptional records.\n\nLeiber and Stoller, meanwhile, will turn up again, once more, next year, as record executives, collaborating with another figure we've seen several times before to run a record label. But this is the last record we'll look at with them as a songwriting team. We've been following their remarkable career since episode fifteen, and they would continue writing great songs for a huge variety of artists, but \"Stand By Me\" would be the last time they would come up with something that would change the music industry. It was the end of a truly remarkable run, and one which stands as one of the great achievements in twentieth century popular music.\n\nAnd Ben E. King, who was, other than Clyde McPhatter, the only member of the Drifters to ever break away and become a solo success, spent the last twenty-nine years of his life touring as a solo artist off the renewed success of his greatest contribution to music. He died in 2015, but as long as people listen to rock, pop, soul, or R&B, there'll be people listening to \"Stand By Me\".",
  "enclosure": "",
  "itunes:summary": "Episode ninety-four of A History of Rock Music in Five Hundred Songs looks at \"Stand By Me\" by Ben E. King, and at the later career of the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"If I Had a Hammer\" by Trini López.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThis 3-CD set has all Ben E. King's recordings, both solo and with the Drifters, the Crowns, and LaVern Baker, up to 1962.\n\nThis episode follows on from episode seventy-five, on \"There Goes My Baby\".\n\nI'm not going to recommend a Drifters compilation, because I know of none that actually have only the original hit recordings without any remakes or remixes. The disclaimer in episode seventy-five also applies here -- I may have used an incorrect version of a song here, because of the sloppy way the Drifters' music is packaged.\n\nMy main resource in putting this episode together was&nbsp;Marv Goldberg's website, and his excellent articles on both the early- and late-period Drifters, Bill Pinkney's later Original Drifters, the Five Crowns, and Ben E. King.\n\nLonely Avenue, a biography of Doc Pomus by Alex Halberstadt, helped me with the information on Pomus.\n\nHound Dog: The Leiber and Stoller Autobiography&nbsp;by Jerry Leiber, Mike Stoller, and David Ritz tells Leiber and Stoller's side of the story well.\n\nAnd&nbsp;Bill Millar's book on the Drifters, while it is more a history of 50s vocal group music generally using them as a focus than a biography of the group, contains some interesting material.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon.&nbsp;Why not join them?\n\nTranscript\n\nToday, we're going to look at a song that ties together several of the threads we've looked at in previous episodes. We're going to look at a song that had its roots in a gospel song that had been performed by Sister Rosetta Tharpe, that involves the Drifters, Leiber and Stoller, and Phil Spector, and which marks the highpoint of the crossover from gospel to pop audiences that had been started by Ray Charles. We're going to look at \"Stand By Me\", by Ben E King.\n\n[Excerpt: Ben E King, \"Stand By Me\"]\n\nWhen we left the Drifters, they'd hit a legal problem. When the contracts for the individual members had been sold to George Treadwell, the owner of the Drifters' name, Ben E King's contract had not been sold with the rest. This had meant that while King continued to sing lead on the records, including the first few big hits of this new lineup of Drifters, he wasn't allowed to tour with them, and so they'd had to bring in a soundalike singer, Johnnie Lee Williams, to sing his parts on stage. So there were now five Drifters in the studio, but only four of them in the touring group.\n\nThat might seem like an unworkable arrangement for any length of time, and so it turned out, but at first this was very successful. Leiber and Stoller continued producing records for this new Drifters lineup, but didn't tend to write for them. They were increasingly tiring of writing to a teenage audience that didn't really share their tastes, and were starting to move into writing for adult stars like Peggy Lee.\n\nAnd so Leiber and Stoller increasingly relied on songs by other writers, and one team they particularly relied on was Pomus and Shuman. You'll remember we've talked about them in association with both the Drifters and Leiber and Stoller previously, and that they'd been the ones who'd discovered the Ben E. King lineup of the Drifters. Doc Pomus was one of the great R&B songwriters of the fifties, but by 1960 he and Mort Shum",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode ninety-four of A History of Rock Music in Five Hundred Songs looks at \"Stand By Me\" by Ben E. King, and at the later career of the Drifters. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"If I Had a Hammer\" by Trini López.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nThis 3-CD set has all Ben E. King's recordings, both solo and with the Drifters, the Crowns, and LaVern Baker, up to 1962.\n\nThis episode follows on from episode seventy-five, on \"There Goes My Baby\".\n\nI'm not going to recommend a Drifters compilation, because I know of none tha",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}