{
  "guid": "http://themoth.prx.org/?p=3206",
  "title": "The Moth Radio Hour: Live From Boston",
  "pubDate": "Tue, 08 Dec 2020 21:23:33 -0000",
  "link": "https://beta.prx.org/stories/231304",
  "description": "<p>A special live edition of The Moth recorded at the Shubert Theatre in Boston. A New York City cop looks into the death of a kid he grew up with, a jazz musician dreams of playing with James Brown, and a woman falls in love over the protestations of her family. Hosted by The Moth Radio Hour Producer, Jay Allison. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: Steve Osborne, Christian McBride, and Mary Lou Pieland.</p>",
  "enclosure": "",
  "itunes:subtitle": "A special live edition of The Moth recorded at the Shubert Theatre in Boston. A New York City cop looks into the death of a kid he grew up with, a jazz musician dreams of playing with James Brown, and a woman falls in love over the protestations of her...",
  "itunes:explicit": true,
  "itunes:episodeType": "full",
  "itunes:duration": "52:41",
  "category": [
    "family",
    "live",
    "love",
    "mothradiohour",
    "music",
    "performance",
    "stories",
    "storytelling"
  ],
  "itunes:author": "The Moth",
  "itunes:summary": "A special live edition of The Moth recorded at the Shubert Theatre in Boston. A New York City cop looks into the death of a kid he grew up with, a jazz musician dreams of playing with James Brown, and a woman falls in love over the protestations of her family. Hosted by The Moth […]",
  "itunes:image": "",
  "media:content": "",
  "content:encoded": "<p>A special live edition of The Moth recorded at the Shubert Theatre in Boston. A New York City cop looks into the death of a kid he grew up with, a jazz musician dreams of playing with James Brown, and a woman falls in love over the protestations of her family. Hosted by The Moth Radio Hour Producer, Jay Allison. The Moth Radio Hour is produced by The Moth and Jay Allison of Atlantic Public Media.</p>\n\n<p>Storytellers: Steve Osborne, Christian McBride, and Mary Lou Pieland.</p>"
}