{
  "id": "yt:video:LWCT8wOs1yc",
  "yt:videoId": "LWCT8wOs1yc",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "Don't Quit Your Day Job - Jason Park",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-25T00:00:11+00:00",
  "updated": "2022-10-25T00:00:13+00:00",
  "media:group": {
    "media:title": "Don't Quit Your Day Job - Jason Park",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Jason Park is an accomplished Director, Producer, Writer, Actor, and Cinematographer. Living in Atlanta, GA with a background in both acting and narrative filmmaking.\n\nJason was raised on the Big Island of Hawai'i. After finishing high school, he moved to Los Angeles California, where he found his passion for videography, acting, and filmmaking.\n\nHe began booking commercials and print work for companies like Apple, Samsung, McDonald's, Subway, and the list goes on. He's been in films with actors such as Brittany Snow (Pitch Perfect), Ross Butler (Shazam) Christian Serratos (Selena), David Oyelowo (Gringo), and Evan Ross (The Hunger Games). After appearing in films, commercials, and print campaigns.\n\nThe actor decided to passionately work on  breaking barriers for Asian-American actors, directors, writers, and creators in American Cinema. Leading him to create films with Asian leads in non Asian stereotypical roles.\n\nWATCH 'FOUR AMIGOS'\nhttps://amzn.to/3Uhww13\n\nWATCH 'REX PARK: Curse Of The Golden Buddha'\nhttps://tubitv.com/movies/614223/rex-park-curse-of-the-golden-buddha\n\nSUBSCRIBE TO JASON PARK'S YOUTUBE CHANNEL\nhttps://www.youtube.com/Hypatude\n\nMORE VIDEOS WITH JASON PARK\nhttps://bit.ly/3ylIAF8\n\nCONNECT WITH JASON PARK\nhttps://hypatude.com\nhttps://www.imdb.com/name/nm2949515\nhttps://www.instagram.com/hypatude\nhttps://www.youtube.com/Hypatude\n\nRELATED VIDEOS\nWhy 99% Of People Fail In Hollywood - https://youtu.be/O84rcmg5Ru8\nQuit Your Day Job and Live Out Your Dreams - https://youtu.be/y7yr-za_Meo\nWhy I'll Never Work A Day Job - https://youtu.be/JPTWi2vj5xo\nNot Good Enough To Make It As An Artist - https://youtu.be/vLfnrwk-V0Y\nEvery Artist Must Learn How To Quit - https://youtu.be/tV2gD2FRzI4\nEvery Artist Has A Calling - https://youtu.be/jzg7EfKXWh0\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n\n#life #work #artist",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}