{
  "title": "Women in Data Science: Meet UW Data Science’s Program Manager: Jennifer Cox",
  "link": "https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/",
  "comments": "https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/#respond",
  "dc:creator": "Kaitlynn Martin",
  "pubDate": "Mon, 12 Apr 2021 21:57:03 +0000",
  "category": [
    "Degree Program",
    "data science degree",
    "UW Data Science",
    "Master's Degree",
    "Online Learning",
    "women in data science",
    "UW Extended Campus"
  ],
  "guid": "https://wwwtest.datasciencedegree.wisconsin.edu/?p=7192",
  "description": "<p>As part of our Women in Data Science series highlighting the importance of women in the data science industry, we’re shining the spotlight on Jennifer Cox, a M.S. graduate in data science and the program manager for the 100% online UW Master of Science in Data Science program. After graduating from UW-Platteville in 2005 with [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/\">Women in Data Science: Meet UW Data Science’s Program Manager: Jennifer Cox</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu\">University of Wisconsin Data Science Degree</a>.</p>\n",
  "content:encoded": "<p><span style=\"font-weight: 400;\">As part of our Women in Data Science series highlighting the importance of women in the data science industry, we’re shining the spotlight on Jennifer Cox, a M.S. graduate in data science and the program manager for the </span><a href=\"https://datasciencedegree.wisconsin.edu/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">100% online UW Master of Science in Data Science</span></a><span style=\"font-weight: 400;\"> program.</span></p>\n<p><span style=\"font-weight: 400;\">After graduating from UW-Platteville in 2005 with a bachelor’s degree in psychology and a minor in business, Jennifer worked as a program manager at a group home for adjudicated youth. However, she missed using the technical skills she gained in her psychology degree, specifically the statistical components. </span></p>\n<figure id=\"attachment_7200\" aria-describedby=\"caption-attachment-7200\" style=\"width: 350px\" class=\"wp-caption alignleft\"><a href=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-scaled.jpg\"><img loading=\"lazy\" class=\"wp-image-7200\" src=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-225x300.jpg\" alt=\"program manager Jen Cox with her three daughters\" width=\"350\" height=\"467\" srcset=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-225x300.jpg 225w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-768x1024.jpg 768w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-1152x1536.jpg 1152w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-1536x2048.jpg 1536w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-scaled.jpg 1920w\" sizes=\"(max-width: 350px) 100vw, 350px\" /></a><figcaption id=\"caption-attachment-7200\" class=\"wp-caption-text\"><em>Jen and her three daughters</em></figcaption></figure>\n<p><span style=\"font-weight: 400;\">Jennifer then transitioned to working in a research project management role within the School of Medicine and Public Health at UW-Madison, which is where she discovered the data science field. She was exposed to how databases, programming, and statistics merge together to investigate issues in healthcare. Jennifer also learned how big data, artificial intelligence, and machine learning are used to advance knowledge of disease, and offer opportunities for better prevention and treatment.</span></p>\n<p><span style=\"font-weight: 400;\">While in her role at the UW School of Medicine and Public Health, Jennifer decided to pursue a master’s degree in data science. She had been researching programs since graduating with her bachelor’s degree, but nothing seemed like the right fit. Then, she found the online UW Master of Science in Data Science program. She began her degree in 2016 while working full-time and raising her young children.</span></p>\n<p><span style=\"font-weight: 400;\">“It was not easy, but with support and encouragement from my family and the Data Science program staff, I was able to graduate in 2018,” Jennifer said. “I was thrilled to have completed another major goal in my life and in something I felt so passionate about.” </span></p>\n<p><span style=\"font-weight: 400;\">The UW Data Science program helped Jennifer gain confidence in her ability to do her work and her employer noticed this. After she earned her degree, Jennifer joined a team of clinical informatics professionals to create a master’s degree program. </span></p>\n<p><span style=\"font-weight: 400;\">“I learned a lot about academic program development and found I enjoyed putting together the many different components required to effectively run a program,” Jennifer said.</span></p>\n<p><span style=\"font-weight: 400;\">Jennifer began her role as program manager for UW Master of Science in Data Science and </span><a href=\"https://appliedcomputing.wisconsin.edu/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">UW Bachelor of Science in Applied Computing </span></a><span style=\"font-weight: 400;\">in August of 2020.</span><b> </b></p>\n<p><span style=\"font-weight: 400;\">The following Q&A with Jennifer Cox spotlights her role as program manager and as a woman in the data scie</span><span style=\"font-weight: 400;\">nce field.</span></p>\n<figure id=\"attachment_7201\" aria-describedby=\"caption-attachment-7201\" style=\"width: 350px\" class=\"wp-caption alignright\"><img loading=\"lazy\" class=\"wp-image-7201\" src=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-225x300.jpg\" alt=\"\" width=\"350\" height=\"467\" srcset=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-225x300.jpg 225w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-768x1024.jpg 768w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-1152x1536.jpg 1152w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-1536x2048.jpg 1536w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-graduation-scaled.jpg 1920w\" sizes=\"(max-width: 350px) 100vw, 350px\" /><figcaption id=\"caption-attachment-7201\" class=\"wp-caption-text\"><em>Jen and her family upon graduation with her master&#8217;s degree in data science in 2018</em></figcaption></figure>\n<h4><b>Q: WHAT IS YOUR ROLE AS A UW EXTENDED CAMPUS PROGRAM MANAGER?</b></h4>\n<p><span style=\"font-weight: 400;\">As a program manager of the MS in Data Science and BS in Applied Computing, I serve as a liaison to the programs’ partner campuses to establish systems, policies, procedures and business practices that support effective operations. I see myself as a cheerleader for the programs, encouraging and supporting our partners to communicate and make decisions together as a team to best support our students.</span> <span style=\"font-weight: 400;\">If we have shared goals, and an understanding of one another, we can best serve our students.</span> <span style=\"font-weight: 400;\">I also collaborate with and provide support to internal UW Extended Campus team members to satisfy goals of these programs.</span></p>\n<p><span style=\"font-weight: 400;\">It is important to me that the programs are successful because I’m very passionate about both of these fields. I believe these programs are very strong and UW Extended Campus does a great job of setting students up for success. Graduates of these programs are the future of these fields, so I want to set them up to be the best they can be.</span></p>\n<h4><b>Q: WHY DID YOU CHOOSE THE UW DATA SCIENCE PROGRAM AS A STUDENT? WHAT UNIQUE PERSPECTIVES DO YOU BRING TO YOUR ROLE AS PROGRAM MANAGER?</b></h4>\n<p><span style=\"font-weight: 400;\">As a Wisconsin native, I knew I could trust the quality of UW programs. I chose the UW Data Science program because I liked that it was 100% online and that I could alter my school schedule based on my personal needs. I also felt the curriculum fully covered the skills needed to be successful in the field, with a good mix of technical and nontechnical coursework. The program also leverages instructors from several UW campuses. These instructors are experts in their domains and they work hard to ensure course content is continuously updated to keep us relevant in the field.</span></p>\n<div class=\"perfect-pullquote vcard pullquote-align-full pullquote-border-placement-left\"><blockquote><p>&#8220;<em><strong>Graduates of these programs are the future of these fields, so I want to set them up to be the best they can be.&#8221; &#8211; Jennifer Cox, UW Data Science Program Manager</strong></em></p></blockquote></div>\n<p><span style=\"font-weight: 400;\">I am utilizing the skills I obtained as a UW Data Science student in my program manager role by using data to understand organizational needs and to guide program decisions. I’m also able to effectively communicate data-related information to all audiences so both technical and nontechnical team members can understand. I also have the advantage of experiencing the program firsthand as a student, so I am able to share a student perspective with our campus partners.</span></p>\n<p><b>Q: WHY ARE WOM</b><b>EN CRUCIAL TO THE DATA SCIENCE FIELD?</b></p>\n<p><span style=\"font-weight: 400;\">Women bring unique perspectives and experiences to all areas of work. Leveraging women’s views allows a more complete understanding of an issue and how resolution might be reached. Gathering diverse perspectives, in general, will likely lead to an outcome that is more a</span><span style=\"font-weight: 400;\">pplicable to the masses. </span></p>\n<p><span style=\"font-weight: 400;\">Women should pursue a data science career if they have an interest, and they shouldn’t feel discouraged by the predominantly male field. There is an increasing amount of women working in technical fields and rightfully so. We need highly skilled women to use their experiences and perspectives to bring understanding to all areas of data science.</span></p>\n<p><span style=\"font-weight: 400;\">Women and men currently in the field can support women entering the data science field by encouraging involvement and providing mentorship. Women should believe in themselves and have confidence that they are a valued contributor to the field.</span></p>\n<figure id=\"attachment_7202\" aria-describedby=\"caption-attachment-7202\" style=\"width: 350px\" class=\"wp-caption alignleft\"><img loading=\"lazy\" class=\"wp-image-7202\" src=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-225x300.jpg\" alt=\"\" width=\"350\" height=\"467\" srcset=\"https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-225x300.jpg 225w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-768x1024.jpg 768w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-1152x1536.jpg 1152w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-1536x2048.jpg 1536w, https://datasciencedegree.wisconsin.edu/wp-content/uploads/2021/04/jen-family-2-scaled.jpg 1920w\" sizes=\"(max-width: 350px) 100vw, 350px\" /><figcaption id=\"caption-attachment-7202\" class=\"wp-caption-text\"><em>Jen and her family before her youngest was born</em></figcaption></figure>\n<p><b>Q: WHAT ADVICE DO YOU HAVE FOR PROSPECTIVE DATA SCIENCE STUDENTS?</b></p>\n<p><span style=\"font-weight: 400;\">Getting a master’s degree is both a financial and time commitment. You should be honest with yourself about what your interests are and what you want to get out of completing the degree. It’s also important to make sure the outcomes of the program align with your goals and that the degree makes financial sense.</span></p>\n<p><span style=\"font-weight: 400;\">Having a support system is also really important. You should discuss your coursework schedule and how long it might take you to earn the degree with your support system. It’s likely you will have to give up some time with your family and friends to be successful, but understand it’s only temporary and it will payoff in the end.</span></p>\n<p><b>Q: HOW WILL DATA SCIENCE IMPACT THE FUTURE?</b></p>\n<p><span style=\"font-weight: 400;\">In this digital age, data surrounds us and, when used and interpreted appropriately, we can improve the world around us. Organizations can use data science to improve business practices, such as making operations more efficient or improving products and services. For example, healthcare organizations can use data to improve knowledge of diseases and how to best prevent and treat them. Information gained from harnessing data can allow us to learn things that might not have been possible before.</span></p>\n<h2><b>UW Data Science strives to be inclusive</b></h2>\n<p><span style=\"font-weight: 400;\">In an effort to highlight the importance of women in the data science industry, this is the second post of a blog post series from UW Data Science. </span><span style=\"font-weight: 400;\">The Women in Data Science series features the crucial roles women take on within the computing field. Additionally, the series highlights students, faculty, and program leaders of the UW Master of Science in Data Science program who share their experiences as women in the data science industry, and offer advice for breaking into the male-dominated profession. </span></p>\n<p><span style=\"font-weight: 400;\">The UW Master of Science in Data Science program aims to create an inclusive environment for all. If you’d like to learn about graduates of the program, read about </span><a href=\"https://datasciencedegree.wisconsin.edu/blog/from-dentistry-to-data-science-a-uw-grads-career-journey/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Venmathi Shanmugam</span></a><span style=\"font-weight: 400;\">, a modeling and simulations engineer working at the Veterans Affairs office, and </span><a href=\"https://datasciencedegree.wisconsin.edu/blog/uw-data-science-student-this-masters-degree-propelled-me-forward-in-the-data-science-field/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">Halee Mason</span></a><span style=\"font-weight: 400;\">, a lead data scientist at Cloud9 Esports, Inc. You can also learn about our </span><a href=\"https://datasciencedegree.wisconsin.edu/data-science-faculty/\" target=\"_blank\" rel=\"noopener\"><span style=\"font-weight: 400;\">diverse faculty members</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><i><span style=\"font-weight: 400;\">Have questions about the courses, tuition, or how to apply? Talk with an enrollment adviser by emailing</span></i> <a href=\"mailto:learn@uwex.wisconsin.edu\"><i><span style=\"font-weight: 400;\">learn@uwex.wisconsin.edu</span></i></a> <i><span style=\"font-weight: 400;\">or calling 608-262-2011.</span></i></p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/\">Women in Data Science: Meet UW Data Science’s Program Manager: Jennifer Cox</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencedegree.wisconsin.edu\">University of Wisconsin Data Science Degree</a>.</p>\n",
  "wfw:commentRss": "https://datasciencedegree.wisconsin.edu/blog/women-in-data-science-meet-program-manager-jennifer-cox/feed/",
  "slash:comments": 0
}