{
  "title": "Selected results from IceCube. (arXiv:2211.01737v1 [astro-ph.HE])",
  "link": "http://arxiv.org/abs/2211.01737",
  "description": "<p>Neutrino astronomy saw its birth with the discovery by IceCube of a diffuse\nflux at energies above 60 TeV with intensity comparable to a predicted upper\nlimit to the flux from extra-galactic sources of ultra-high energy cosmic rays\n(UHECRs). While such an upper limit corresponds to the case of calorimetric\nsources, in which cosmic rays lose all their energy into photo-pion production,\nthe first statistically significant coincident observation between neutrinos\nand gamma rays was observed from a blazar of intriguing nature. A\nvery-high-energy muon event, of most probable neutrino energy of 290 TeV for an\n$E^{-2.13}$ spectrum, alerted other observatories triggering a large number of\ninvestigations in many bands of the electromagnetic (EM) spectrum. A high\ngamma-ray state from the blazar was revealed soon after the event and in a\nfollow-up to about 40 days. A posteriori observations also in the optical and\nradio bands indicated a rise of the flux from the TXS 0506+056 blazar. A\nprevious excess of events of the duration of more than 100~d was observed by\nIceCube with higher significance than the alert itself. These observations\ntriggered more complex modeling than simple one-zone proton synchrotron models\nfor proton acceleration in jets of active galactic nuclei (AGNs) and more\nobservations across the EM spectrum. A second piece of evidence was a steady\nexcess of about 50 neutrino events with reconstructed soft spectrum in a sample\nof lower energy well-reconstructed muon events than the alert event. A hot spot\nwas identified in a catalog of 110 gamma-ray intense emitters and starburst\ngalaxies in a direction compatible with NGC 1068 with a significance of\n$2.9\\sigma$. NGC 1068 hosts a mildly relativistic jet in a starburst galaxy,\nseen not from the jet direction but rather through the torus. This Seyfert II\ngalaxy is at only 14.4~Mpc from the Earth. We discuss these observations.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Montaruli_T/0/1/0/all/0/1\">Teresa Montaruli</a> (for the IceCube Collaboration)"
}