{
  "title": "Episode 82: &#8220;Are You Lonesome Tonight?&#8221; by Elvis Presley",
  "link": "https://500songs.com/podcast/episode-82-are-you-lonesome-tonight-by-elvis-presley/",
  "pubDate": "Thu, 14 May 2020 14:27:35 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-82-are-you-lonesome-tonight-by-elvis-presley/",
  "description": "<p>Episode eighty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Are You Lonesome Tonight?\" by Elvis Presley, and the way his promising comeback after leaving the Army quickly got derailed. This episode also contains a brief acknowledgment of the death of the great Little Richard, who died just as I was recording this episode. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/37103790\">\"Muleskinner Blues\" by the Fendermen.</a></p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>Apologies for the delay this week -- I've been unwell, as you might be able to tell from the croaky voice in places. Don't worry, it's not anything serious... </p>\n<p>No Mixcloud this week, as almost every song excerpted is by Elvis, and it would be impossible to do it without breaking Mixcloud's rules about the number of songs by the same artist.</p>\n<p>My main source for this episode is <a href=\"https://amzn.to/2zFQ7Dm\"><em>Careless Love: The Unmaking of Elvis Presley</em>,</a> the second part of Peter Guralnick's two-volume biography of Elvis. It's not *quite* as strong as the first volume, but it's still by far the best book covering his later years. I also used <em><a href=\"https://amzn.to/35WmtFV\">Reconsider Baby: The Definitive Elvis Sessionography 1954-1977</a> </em>by Ernst Jorgensen.</p>\n<p>The box set <a href=\"https://amzn.to/2LyqdDT\"><em>From Nashville to Memphis</em> </a>contains all Elvis' sixties studio recordings other than his gospel and soundtrack albums, and thus manages to make a solid case for Elvis' continued artistic relevance in the sixties, by only including records he chose to make. It's well worth the very cheap price.</p>\n<p>And <a href=\"https://amzn.to/2WVjXvp\"><em>Back in Living Stereo</em></a>, which rounds up the 1960s public domain Elvis recordings, contains the gospel recordings, outtakes, and home recordings from 1960 through 1962.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n<p><strong>Errata</strong></p>\n<p>I say that by the time “Stuck on You” had come out, Elvis had already made his TV appearance with Sinatra. In actual fact, he was still rehearsing for it, and wouldn't record it for a few more days.</p>\n<p>I also say that the Colonel had managed Gene Austin. In fact the Colonel had only promoted shows for Austin, not been his manager.</p>\n<p><strong>Transcript</strong></p>\n<p>Before I start this week's episode, I had to mark the death of Little Richard. We've already covered his work of course, in episodes on \"Tutti Frutti\" and \"Keep A Knockin'\", and I don't really have a lot to add to those episodes in terms of his importance to twentieth-century music. We can argue about which of Elvis, Chuck Berry, or Little Richard was the most important artist of the fifties, but I don't think you can make a good argument that anyone other than one of those three was, and I don't think you can argue that those three weren't the three most important in whatever order.</p>\n<p>Without Little Richard, none of the music we're covering in this podcast after 1955 would be the same, and this podcast would not exist. There are still a handful of people alive who made records we've looked at in the podcast, but without intending the slightest offence to any of them, none are as important a link in the historical chain as Richard Penniman was.</p>\n<p>So, before the episode proper, let's have a few moments' noise in memory of the force of nature who described himself as the King and Queen of Rock and Roll:</p>\n<p>[Excerpt: Little Richard, \"Ooh! My Soul!\"]</p>\n<p>Now on to the main podcast itself.</p>\n<p>Today we're going to take what will be, for a while, our last look at Elvis Presley. He will show up in the background of some other episodes as we go through the sixties, and I plan to take a final look at him in a hundred or so episodes, but for now, as we're entering the sixties, we're leaving behind those fifties rockers, and Elvis is one of those we're definitely leaving for now.</p>\n<p>Elvis' two years spent in the Army had changed him profoundly. His mother had died, he'd been separated from everyone he knew, and he'd met a young woman named Priscilla, who was several years younger than him but who would many years later end up becoming his wife. And the music world had changed while he was gone. Rockabilly had totally disappeared from the charts, and all the musicians who had come up with Elvis had moved into orchestrated pop like Roy Orbison or into pure country like Johnny Cash, with the exception of a handful like Gene Vincent who were no longer having hits, at least in the US.</p>\n<p>Elvis had, though, continued to have hits. He'd recorded enough in 1958 for RCA to have a tiny stockpile of recordings they could issue as singles over the intervening two years -- \"Wear My Ring Around Your Neck\", \"Hard-Headed Woman\", \"One Night\", \"I Need Your Love Tonight\", and \"A Big Hunk O' Love\". Along with those hits, they repackaged several single-only recordings into new albums, and managed to keep Elvis in the spotlight despite him not recording any new material.</p>\n<p>This had been a plan of the Colonel's from the moment it became clear that Elvis was going to be drafted -- his strategy then, and from then on, was to record precisely as much material for RCA as the contracts stipulated they were entitled to, and not one song more. His thinking was that if Elvis recorded more songs than they needed to release at any given time, then there would be nothing for him to use as leverage in contract negotiations. The contract wasn't due for renegotiation any time soon, of course, but you don't want to take that chance.</p>\n<p>This meant that Elvis didn't have long to relax at home before he had to go back into the studio. He had a couple of weeks to settle in at Graceland -- the home he had bought for his mother, but had barely spent any time in before being drafted, and which was now going to be inhabited by Elvis, his father, and his father's new, much younger, girlfriend, of whom Elvis definitely did not approve. In that time he made visits to the cinema, and to an ice-dancing show -- he went to the performance for black people, rather than the one for whites, as Memphis was still segregated, and he made a brief impromptu appearance at that show himself, conducting the orchestra. And most importantly to him, he visited the grave of his mother for the first time.</p>\n<p>But two weeks and one day after his discharge from the Army, he was back in the studio, recording tracks for what would be his first album of new material since his Christmas album two and a half years earlier.</p>\n<p>We talked a little bit, a few weeks back, about the Nashville Sound, the new sound that had become popular in country music, and how Chet Atkins, who had produced several of Elvis' early recordings, had been vitally responsible for the development of that sound. Many of the Nashville A-team, the musicians who were responsible for making those records with Atkins or the other main producer of the sound, Owen Bradley, had played on Elvis' last session before he went into the Army, and they were at this session, though to keep fans from congregating outside, they were told they were going to be playing on a Jim Reeves session -- Reeves was one of the country singers who were having hits with that sound, with records like “He'll Have to Go”:</p>\n<p>[Excerpt: Jim Reeves, “He'll Have to Go”]</p>\n<p>So with Chet Atkins in the control booth, the musicians were Hank \"Sugarfoot\" Garland -- the great guitarist who had briefly replaced Scotty Moore on stage when Elvis and his band had split; Floyd Cramer, who had been playing piano with Elvis on record since his first RCA session, Buddy Harman, who had doubled DJ Fontana on percussion on Elvis' last session from 58, on drums, and Bob Moore, who had played bass on those sessions, back on bass. And of course the Jordanaires were at the session as well -- as well as having sung on Elvis' pre-Army records, they were also part of the Nashville A-Team, and were the go-to male backing vocalists for anyone in Nashville making a country or pop record.</p>\n<p>Scotty and DJ were there, too, but they were in much reduced roles -- Scotty was playing rhythm guitar, rather than lead, and DJ was only one of two drummers on the session. Bill Black was not included at all -- Black had always been the one who would try to push for more recognition, and he was now a star in his own right, with his Bill Black Combo. He would never record with Elvis again.</p>\n<p>The session took a while to get going -- the first hour or so was spent ordering in hamburgers, listening to demos, and Elvis and Bobby Moore showing each other karate moves -- and then the first song they recorded, an Otis Blackwell number titled \"Make Me Know It\" took a further nineteen takes before they had a satisfactory one:</p>\n<p>[Excerpt: Elvis Presley, \"Make Me Know It\"]</p>\n<p>Elvis' voice had improved dramatically during his time in the Army -- he had been practising a lot, with his new friend Charlie Hodge, and had added a full octave to his vocal range, and he was eager to display his newfound ability to tackle other kinds of material. But at the same time, all the reports from everyone in the studio suggest that these early sessions were somewhat hesitant. The best song from this initial session was Pomus and Shuman's \"A Mess of Blues\":</p>\n<p>[Excerpt: Elvis Presley, \"A Mess of Blues\"]</p>\n<p>But it was a song by Aaron Schroeder and Leslie McFarland that was chosen for the first single -- a mediocre track called \"Stuck on You\":</p>\n<p>[Excerpt: Elvis Presley, \"Stuck on You\"]</p>\n<p>Such was the demand for new Elvis material that the single of \"Stuck on You\" backed with \"Fame and Fortune\" was released within seventy-two hours. By that time, RCA had printed up 1.4 million copies of the single, just to fulfil the advance orders -- they came out in sleeves that just read \"Elvis' 1st New Recording For His 50,000,000 Fans All Over The World\", because when they were printing the sleeves the record company had no idea what songs Elvis was going to record.</p>\n<p>By that time, Elvis had already made what would turn out to be his only TV appearance for eight years. The Colonel had arranged for a TV special, to be hosted by Frank Sinatra -- <em>The Frank Sinatra Timex Show: Welcome Home Elvis</em>.</p>\n<p>Most of that special was the standard Rat Packisms, with Sinatra joined by Joey Bishop and Sammy Davis Jr. Sinatra had not been at all complimentary about Elvis before he'd gone into the Army, and in later years would continue to be insulting about him, but money was money, and so Sinatra put on a grin and pretended to be happy to be working with him.</p>\n<p>The train trip to Florida to record the TV show was something Scotty Moore would always remember, saying that at every single crossroads the train tracks went past, there were people lined up to cheer on the train, and that the only comparisons he could make to that trip were the funeral journeys of Lincoln and Roosevelt's bodies.</p>\n<p>Scotty also remembered one other thing about the trip -- that Elvis had offered him some of the little pills he'd been taking in the Army, to keep him awake and alert.</p>\n<p>Elvis, Scotty, and DJ were friendly enough on the train journey, but when they got to Miami they found that during the week they were in rehearsals, Scotty, DJ, and the Jordanaires were forbidden from socialising with Elvis, by order of the Colonel.</p>\n<p>The TV show was one of a very small number of times in the sixties that Elvis would perform for an audience, and here, dressed in a dinner jacket and clearly attempting to prove he was now a family-friendly entertainer, he looks deeply uncomfortable at first, as he croons his way through \"Fame and Fortune\". He gets into his stride with the other side of his single, \"Stuck on You\", and then Sinatra joins him for a duet, where Sinatra sings \"Love Me Tender\" while Elvis sings Sinatra's \"Witchcraft\". Watching the footage, you can see that by this point Elvis is completely comfortable in front of the audience again, and frankly he wipes the floor with Sinatra. Sinatra is trying to mock \"Love Me Tender\", but Elvis takes Sinatra's song completely straight, but at the same time knows exactly how ridiculous he is being:</p>\n<p>[Excerpt: Elvis Presley and Frank Sinatra, “Love Me Tender/Witchcraft”]</p>\n<p>There's a passage in Umberto Eco's book about writing <em>The Name of the Rose</em>, where he talks about the meaning of postmodernism. He explains that an unsophisticated writer like Barbara Cartland might write \"I love you madly\". A sophisticated modernist writer would recognise that as a cliche, and so choose not to write about love at all, having no language to do it in, and mock those who did. And a postmodernist would embrace and acknowledge the cliche, writing \"As Barbara Cartland might say, 'I love you madly'\". This, crucially, means that the postmodernist is, once again, able to talk about real emotions, which the modernist (in Eco's view) can't.</p>\n<p>By this definition, Sinatra's performance is modernist -- he's just showing contempt for the material -- while Elvis is postmodernist, sincere even as he's also knowingly mocking himself. It comes across far more in the video footage, which is easily findable online, but you can hear some of it just in the audio recording:</p>\n<p>[Excerpt: Frank Sinatra and Elvis Presley, \"Love Me Tender/Witchcraft\"]</p>\n<p>A week later, Elvis was back in the studio, with the same musicians as before, along with Boots Randolph on saxophone, to record the rest of the tracks for his new album, to be titled <em>Elvis is Back!</em></p>\n<p><em>Elvis is Back!</em> is quite possibly the most consistent studio album Elvis ever made, and that second 1960 session is where the most impressive material on the album was recorded. They started out with a version of \"Fever\" that easily measured up to the original by Little Willie John and the most famous version by Peggy Lee, with Elvis backed just by Bobby Moore on bass and the two drummers:</p>\n<p>[Excerpt: Elvis Presley, \"Fever\"]</p>\n<p>Then there was \"Like a Baby\", a song originally recorded by Vikki Nelson, and written by Jesse Stone, who had written so many R&B classics before. This saw some of Elvis' best blues vocals:</p>\n<p>[Excerpt: Elvis Presley, \"Like a Baby\"]</p>\n<p>The next song was a huge departure from anything he'd done previously. Elvis had always loved Tony Martin's 1950 hit \"There's No Tomorrow\":</p>\n<p>[Excerpt: Tony Martin, \"There's No Tomorrow\"]</p>\n<p>That had become one of the songs he rehearsed with Charlie Hodge in Germany, and he'd mentioned the idea of recording it. But, of course, \"There's No Tomorrow\" was based on the old song \"O Sole Mio\", which at the time was considered to be in the public domain (though in fact a later Italian court ruling means that even though it was composed in 1897, it will remain in copyright until 2042), so Freddy Bienstock at Hill and Range, the publishing company that supplied Elvis with material, commissioned a new set of lyrics for it, and it became \"It's Now or Never\".</p>\n<p>Elvis did several near-perfect takes of the song, but then kept flubbing the ending, which required a particularly powerful, sustained, note. Bill Porter, who was engineering, suggested that they could do a take of just that bit and then splice it on to the rest, but Elvis was determined. He was going to do the song all the way through, or he was not going to do it. Eventually he got it, and the result was extraordinary, nothing like any performance he'd given previously:</p>\n<p>[Excerpt: Elvis Presley, \"It's Now Or Never\"]</p>\n<p>That would go to number one, as would another non-album single from this session. This one was the only song the Colonel had ever asked Elvis to record, \"Are You Lonesome Tonight?\"</p>\n<p>That song had been written in 1926, and had been a hit in several versions, most notably the version by Al Jolson:</p>\n<p>[Excerpt: Al Jolson, \"Are You Lonesome Tonight?\"]</p>\n<p>But the Colonel had two reasons for wanting Elvis to record the song. The first was that, while the Colonel didn't have much interest in music, he associated the song with Gene Austin, the country singer who had been the first act the Colonel had managed, and so he had a sentimental fondness for it. And the second was that it was the Colonel's wife Marie's favourite song.</p>\n<p>While the studio was normally brightly lit, for this song Elvis made sure that no-one other than the few musicians on the track, which only featured acoustic guitar, bass, drums, and vocals, were in the studio, and that all the lights were off.</p>\n<p>He did one take of the song, on which the Jordanaires apparently made a mistake. He then did a false start, and decided to give up on the song, but Steve Sholes, RCA's A&R man, insisted that the song could be a hit. They eventually got through it, although even the finished take of the song contains one mistake -- because the song was recorded in the dark, the musicians couldn't see the microphones, and you can hear someone bumping into a mic during the spoken bridge:</p>\n<p>[Excerpt: Elvis Presley, \"Are You Lonesome Tonight?\"]</p>\n<p>Despite that flaw, the track was released as a single, and became a massive success, and a song that would stay in Elvis' repertoire until his very last shows.</p>\n<p>During that one overnight session, Elvis and the band recorded twelve songs, covering a stylistic range that's almost inconceivable. There was a Leiber and Stoller rocker left over from \"King Creole\", a cover version of \"Such a Night\", the hit for Clyde McPhatter and the Drifters, the old Lowell Fulson blues song \"Reconsider Baby\", the light Latin pop song \"The Girl of My Best Friend\", a Louvin Brothers style duet with Charlie Hodge -- in one session Elvis managed to cover every style of American popular song as of 1960, and do it all well.</p>\n<p>In total, between this session and the previous one, Elvis recorded eighteen tracks -- three singles and a twelve-track album -- and while they were slicker and more polished than the Sun recordings, it's very easy to make the case that they were every bit as artistically successful, and this was certainly the best creative work he had done since signing to RCA. All three singles went to number one, and the Elvis Is Back! album went to number two, and sold half a million copies.</p>\n<p>But then, only three weeks after that session, he was in a different studio, cutting very different material.</p>\n<p>His first post-Army film was going to be a quick, light, comedy, called \"GI Blues\", intended to present a new, wholesome, image for Elvis. Elvis disliked the script, and he was also annoyed when he got into the recording studio in Hollywood, which was used for his film songs, to discover that he wasn't going to be recording any Leiber and Stoller songs for this film, for what the Colonel told him were \"business reasons\" -- Elvis seems not to have been aware that the Colonel had made them persona non grata.</p>\n<p>Instead, he was to record a set of songs mostly written by people like Sid Wayne, Abner Silver, Sid Tepper, and Fred Wise, journeymen songwriters with little taste for rock and roll. Typical of the songs was one called \"Wooden Heart\", based on an old German folk song, and with a co-writing credit to the German bandleader Bert Kaempfert (of whom we'll hear a little more in a future episode):</p>\n<p>[Excerpt: Elvis Presley, \"Wooden Heart\"]</p>\n<p>Now, one should be careful when criticising Elvis' film songs, because they were written for a specific context. These aren't songs that were intended to be listened to as singles or albums, but they were intended to drive a plot forward, and to exist in the context of a film. Taking them out of that context is a bit like just writing down all the lines spoken by one character in a film and complaining that they don't work as a poem. There's a habit even among Elvis' fans, let alone his detractors, of dunking on some of the songs he recorded for film soundtracks without taking that into account, and it does rather miss the point.</p>\n<p>But at the same time, they still had to be *performed* as songs, not as parts of films, and it was apparent that Elvis wasn't happy with them. Bones Howe, who was working on the sessions, said that Elvis had lost something when compared to his pre-Army work -- he was now trying, and often failing, to find his way into a performance which, pre-Army, he would have been able to do naturally. But when you compare his performances from the Elvis is Back! sessions, it's clear that the time in the Army wasn't the problem -- it's just that Elvis had no desire to be singing those songs or appearing in this film.</p>\n<p>[Excerpt: Elvis Presley, “GI Blues”]</p>\n<p>Elvis told the Colonel that at least half the songs for the film soundtrack had to be scrapped, but the Colonel told him he was locked into them by contract, and he just had to do the best he could with them. And he did -- he gave as good a performance as possible, both in the film and on the songs. But his heart wasn't in it.</p>\n<p>He was placated, though, by being told that his next couple of films would be *proper films*, like the ones he'd been making before going into the Army. These next two films were made back-to-back. Flaming Star was a Western with a rather heavy-handed message about racism, starring Elvis as a mixed-race man who felt at home neither with white people nor Native Americans, and directed by Don Siegel, who would go on to direct Dirty Harry. Elvis' role was originally intended for Marlon Brando, his acting idol, and he only sang one song in the film, other than the title song which played over the credits.</p>\n<p>[Excerpt: Elvis Presley, “Flaming Star”]</p>\n<p>And then he made Wild in the Country, which featured only a very small number of songs, and had Elvis playing a troubled young man who has to get court-ordered psychological counselling, but eventually goes off to college to become a writer.</p>\n<p>There's quite a bit of debate about the merits of both these films, and of Elvis' acting in them, but there's no doubt at all that they were intended to be serious films, even more so than Jailhouse Rock and King Creole had been.</p>\n<p>After filming these three films, Elvis went back into the studio for another overnight session, to record another album. This time, it was a gospel album, his first full-length gospel record. His Hand in Mine was possibly the purest expression of Elvis' own musical instincts yet -- he had always wanted to be a singer in a gospel quartet, and now he was singing gospel songs with the Jordanaires, exactly as he'd wanted to:</p>\n<p>[Excerpt: Elvis Presley, \"His Hand in Mine\"]</p>\n<p>So in 1960, Elvis had recorded two very different, but hugely artistically satisfying, albums, and had made three films, of which he could reasonably be proud of two.</p>\n<p>Unfortunately for him, it was the film he didn't like, GI Blues, that was the big success -- and while Elvis Is Back had gone to number two and sold half a million copies, the soundtrack to GI Blues went to number one and stayed there for eleven weeks, and sold a million copies -- an absurd number at a time when albums generally sold very little. His Hand in Mine only made number thirteen.</p>\n<p>The same pattern happened the next year -- a studio album was massively outsold by the soundtrack album for Blue Hawaii, a mindless film that was full of sea, sand, and bikinis, and which featured dreadful songs like \"Ito Eats\":</p>\n<p>[Excerpt: Elvis Presley, \"Ito Eats\"]</p>\n<p>There would be a couple more films in 1961 and 62, Kid Galahad and Follow That Dream, which tried to do a little more, and which weren't as successful as Blue Hawaii.</p>\n<p>From that point on, the die was cast for Elvis. The Colonel wasn't going to let him appear in any more dramatic roles. The films were all going to be light comedies, set somewhere exotic like Hawaii or Acapulco, and featuring Elvis as a surfer or a race-car driver or a surfing race-car driver, lots of girls in bikinis, and lots of songs called things like \"There's No Room To Rhumba in a Sports Car\". When Elvis got a chance to go into the studio and just make records, as he occasionally did over the next few years, he would make music that was as good as anything he ever did, but starting in 1962 there was a routine of three films a year, almost all interchangeable, and until 1968 Elvis wouldn't be able to step off that treadmill. After 68, he did make a handful of films in which, again, he tried to be an actor, but after twenty or so lightweight films about beaches and bikinis, no-one noticed.</p>\n<p>As a result, Elvis mostly sat out the sixties. While the music world was changing all around him, he was an irrelevance to the new generation of musicians, who mostly agreed with John Lennon that \"Elvis died when he went into the Army\". We'll pick up his story in 1968, when he finally got off the treadmill.</p>\n<p> </p>",
  "itunes:subtitle": "Episode eighty-two of A History of Rock Music in Five Hundred Songs looks at Are You Lonesome Tonight? by Elvis Presley, and the way his promising comeback after leaving the Army quickly got derailed. This episode also contains a brief acknowledgment of ",
  "itunes:keywords": "Bert Kaempfert,Bob Moore,Bones Howe,Chet A,Colonel Tom Parker,D.J. Fontana,Elvis Presley,Floyd Cramer,Frank Sinatra,Freddy Bienstock,Gene Austin,gospel,Hank Garland,Hill and Range publishing,Little Richard,Nashville,Nashville A Team,Otis Blackwell,RCA Records,Scotty Moore,Steve Sholes,The Jordanaires",
  "itunes:episodeType": "full",
  "itunes:episode": 82,
  "content:encoded": "<p>Episode eighty-two of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Are You Lonesome Tonight?\" by Elvis Presley, and the way his promising comeback after leaving the Army quickly got derailed. This episode also contains a brief acknowledgment of the death of the great Little Richard, who died just as I was recording this episode. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n<p>Patreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/37103790\">\"Muleskinner Blues\" by the Fendermen.</a></p>\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n<p><strong>Resources</strong></p>\n<p>Apologies for the delay this week -- I've been unwell, as you might be able to tell from the croaky voice in places. Don't worry, it's not anything serious... </p>\n<p>No Mixcloud this week, as almost every song excerpted is by Elvis, and it would be impossible to do it without breaking Mixcloud's rules about the number of songs by the same artist.</p>\n<p>My main source for this episode is <a href=\"https://amzn.to/2zFQ7Dm\"><em>Careless Love: The Unmaking of Elvis Presley</em>,</a> the second part of Peter Guralnick's two-volume biography of Elvis. It's not *quite* as strong as the first volume, but it's still by far the best book covering his later years. I also used <em><a href=\"https://amzn.to/35WmtFV\">Reconsider Baby: The Definitive Elvis Sessionography 1954-1977</a> </em>by Ernst Jorgensen.</p>\n<p>The box set <a href=\"https://amzn.to/2LyqdDT\"><em>From Nashville to Memphis</em> </a>contains all Elvis' sixties studio recordings other than his gospel and soundtrack albums, and thus manages to make a solid case for Elvis' continued artistic relevance in the sixties, by only including records he chose to make. It's well worth the very cheap price.</p>\n<p>And <a href=\"https://amzn.to/2WVjXvp\"><em>Back in Living Stereo</em></a>, which rounds up the 1960s public domain Elvis recordings, contains the gospel recordings, outtakes, and home recordings from 1960 through 1962.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a></p>\n<p><strong>Errata</strong></p>\n<p>I say that by the time “Stuck on You” had come out, Elvis had already made his TV appearance with Sinatra. In actual fact, he was still rehearsing for it, and wouldn't record it for a few more days.</p>\n<p>I also say that the Colonel had managed Gene Austin. In fact the Colonel had only promoted shows for Austin, not been his manager.</p>\n<p><strong>Transcript</strong></p>\n<p>Before I start this week's episode, I had to mark the death of Little Richard. We've already covered his work of course, in episodes on \"Tutti Frutti\" and \"Keep A Knockin'\", and I don't really have a lot to add to those episodes in terms of his importance to twentieth-century music. We can argue about which of Elvis, Chuck Berry, or Little Richard was the most important artist of the fifties, but I don't think you can make a good argument that anyone other than one of those three was, and I don't think you can argue that those three weren't the three most important in whatever order.</p>\n<p>Without Little Richard, none of the music we're covering in this podcast after 1955 would be the same, and this podcast would not exist. There are still a handful of people alive who made records we've looked at in the podcast, but without intending the slightest offence to any of them, none are as important a link in the historical chain as Richard Penniman was.</p>\n<p>So, before the episode proper, let's have a few moments' noise in memory of the force of nature who described himself as the King and Queen of Rock and Roll:</p>\n<p>[Excerpt: Little Richard, \"Ooh! My Soul!\"]</p>\n<p>Now on to the main podcast itself.</p>\n<p>Today we're going to take what will be, for a while, our last look at Elvis Presley. He will show up in the background of some other episodes as we go through the sixties, and I plan to take a final look at him in a hundred or so episodes, but for now, as we're entering the sixties, we're leaving behind those fifties rockers, and Elvis is one of those we're definitely leaving for now.</p>\n<p>Elvis' two years spent in the Army had changed him profoundly. His mother had died, he'd been separated from everyone he knew, and he'd met a young woman named Priscilla, who was several years younger than him but who would many years later end up becoming his wife. And the music world had changed while he was gone. Rockabilly had totally disappeared from the charts, and all the musicians who had come up with Elvis had moved into orchestrated pop like Roy Orbison or into pure country like Johnny Cash, with the exception of a handful like Gene Vincent who were no longer having hits, at least in the US.</p>\n<p>Elvis had, though, continued to have hits. He'd recorded enough in 1958 for RCA to have a tiny stockpile of recordings they could issue as singles over the intervening two years -- \"Wear My Ring Around Your Neck\", \"Hard-Headed Woman\", \"One Night\", \"I Need Your Love Tonight\", and \"A Big Hunk O' Love\". Along with those hits, they repackaged several single-only recordings into new albums, and managed to keep Elvis in the spotlight despite him not recording any new material.</p>\n<p>This had been a plan of the Colonel's from the moment it became clear that Elvis was going to be drafted -- his strategy then, and from then on, was to record precisely as much material for RCA as the contracts stipulated they were entitled to, and not one song more. His thinking was that if Elvis recorded more songs than they needed to release at any given time, then there would be nothing for him to use as leverage in contract negotiations. The contract wasn't due for renegotiation any time soon, of course, but you don't want to take that chance.</p>\n<p>This meant that Elvis didn't have long to relax at home before he had to go back into the studio. He had a couple of weeks to settle in at Graceland -- the home he had bought for his mother, but had barely spent any time in before being drafted, and which was now going to be inhabited by Elvis, his father, and his father's new, much younger, girlfriend, of whom Elvis definitely did not approve. In that time he made visits to the cinema, and to an ice-dancing show -- he went to the performance for black people, rather than the one for whites, as Memphis was still segregated, and he made a brief impromptu appearance at that show himself, conducting the orchestra. And most importantly to him, he visited the grave of his mother for the first time.</p>\n<p>But two weeks and one day after his discharge from the Army, he was back in the studio, recording tracks for what would be his first album of new material since his Christmas album two and a half years earlier.</p>\n<p>We talked a little bit, a few weeks back, about the Nashville Sound, the new sound that had become popular in country music, and how Chet Atkins, who had produced several of Elvis' early recordings, had been vitally responsible for the development of that sound. Many of the Nashville A-team, the musicians who were responsible for making those records with Atkins or the other main producer of the sound, Owen Bradley, had played on Elvis' last session before he went into the Army, and they were at this session, though to keep fans from congregating outside, they were told they were going to be playing on a Jim Reeves session -- Reeves was one of the country singers who were having hits with that sound, with records like “He'll Have to Go”:</p>\n<p>[Excerpt: Jim Reeves, “He'll Have to Go”]</p>\n<p>So with Chet Atkins in the control booth, the musicians were Hank \"Sugarfoot\" Garland -- the great guitarist who had briefly replaced Scotty Moore on stage when Elvis and his band had split; Floyd Cramer, who had been playing piano with Elvis on record since his first RCA session, Buddy Harman, who had doubled DJ Fontana on percussion on Elvis' last session from 58, on drums, and Bob Moore, who had played bass on those sessions, back on bass. And of course the Jordanaires were at the session as well -- as well as having sung on Elvis' pre-Army records, they were also part of the Nashville A-Team, and were the go-to male backing vocalists for anyone in Nashville making a country or pop record.</p>\n<p>Scotty and DJ were there, too, but they were in much reduced roles -- Scotty was playing rhythm guitar, rather than lead, and DJ was only one of two drummers on the session. Bill Black was not included at all -- Black had always been the one who would try to push for more recognition, and he was now a star in his own right, with his Bill Black Combo. He would never record with Elvis again.</p>\n<p>The session took a while to get going -- the first hour or so was spent ordering in hamburgers, listening to demos, and Elvis and Bobby Moore showing each other karate moves -- and then the first song they recorded, an Otis Blackwell number titled \"Make Me Know It\" took a further nineteen takes before they had a satisfactory one:</p>\n<p>[Excerpt: Elvis Presley, \"Make Me Know It\"]</p>\n<p>Elvis' voice had improved dramatically during his time in the Army -- he had been practising a lot, with his new friend Charlie Hodge, and had added a full octave to his vocal range, and he was eager to display his newfound ability to tackle other kinds of material. But at the same time, all the reports from everyone in the studio suggest that these early sessions were somewhat hesitant. The best song from this initial session was Pomus and Shuman's \"A Mess of Blues\":</p>\n<p>[Excerpt: Elvis Presley, \"A Mess of Blues\"]</p>\n<p>But it was a song by Aaron Schroeder and Leslie McFarland that was chosen for the first single -- a mediocre track called \"Stuck on You\":</p>\n<p>[Excerpt: Elvis Presley, \"Stuck on You\"]</p>\n<p>Such was the demand for new Elvis material that the single of \"Stuck on You\" backed with \"Fame and Fortune\" was released within seventy-two hours. By that time, RCA had printed up 1.4 million copies of the single, just to fulfil the advance orders -- they came out in sleeves that just read \"Elvis' 1st New Recording For His 50,000,000 Fans All Over The World\", because when they were printing the sleeves the record company had no idea what songs Elvis was going to record.</p>\n<p>By that time, Elvis had already made what would turn out to be his only TV appearance for eight years. The Colonel had arranged for a TV special, to be hosted by Frank Sinatra -- <em>The Frank Sinatra Timex Show: Welcome Home Elvis</em>.</p>\n<p>Most of that special was the standard Rat Packisms, with Sinatra joined by Joey Bishop and Sammy Davis Jr. Sinatra had not been at all complimentary about Elvis before he'd gone into the Army, and in later years would continue to be insulting about him, but money was money, and so Sinatra put on a grin and pretended to be happy to be working with him.</p>\n<p>The train trip to Florida to record the TV show was something Scotty Moore would always remember, saying that at every single crossroads the train tracks went past, there were people lined up to cheer on the train, and that the only comparisons he could make to that trip were the funeral journeys of Lincoln and Roosevelt's bodies.</p>\n<p>Scotty also remembered one other thing about the trip -- that Elvis had offered him some of the little pills he'd been taking in the Army, to keep him awake and alert.</p>\n<p>Elvis, Scotty, and DJ were friendly enough on the train journey, but when they got to Miami they found that during the week they were in rehearsals, Scotty, DJ, and the Jordanaires were forbidden from socialising with Elvis, by order of the Colonel.</p>\n<p>The TV show was one of a very small number of times in the sixties that Elvis would perform for an audience, and here, dressed in a dinner jacket and clearly attempting to prove he was now a family-friendly entertainer, he looks deeply uncomfortable at first, as he croons his way through \"Fame and Fortune\". He gets into his stride with the other side of his single, \"Stuck on You\", and then Sinatra joins him for a duet, where Sinatra sings \"Love Me Tender\" while Elvis sings Sinatra's \"Witchcraft\". Watching the footage, you can see that by this point Elvis is completely comfortable in front of the audience again, and frankly he wipes the floor with Sinatra. Sinatra is trying to mock \"Love Me Tender\", but Elvis takes Sinatra's song completely straight, but at the same time knows exactly how ridiculous he is being:</p>\n<p>[Excerpt: Elvis Presley and Frank Sinatra, “Love Me Tender/Witchcraft”]</p>\n<p>There's a passage in Umberto Eco's book about writing <em>The Name of the Rose</em>, where he talks about the meaning of postmodernism. He explains that an unsophisticated writer like Barbara Cartland might write \"I love you madly\". A sophisticated modernist writer would recognise that as a cliche, and so choose not to write about love at all, having no language to do it in, and mock those who did. And a postmodernist would embrace and acknowledge the cliche, writing \"As Barbara Cartland might say, 'I love you madly'\". This, crucially, means that the postmodernist is, once again, able to talk about real emotions, which the modernist (in Eco's view) can't.</p>\n<p>By this definition, Sinatra's performance is modernist -- he's just showing contempt for the material -- while Elvis is postmodernist, sincere even as he's also knowingly mocking himself. It comes across far more in the video footage, which is easily findable online, but you can hear some of it just in the audio recording:</p>\n<p>[Excerpt: Frank Sinatra and Elvis Presley, \"Love Me Tender/Witchcraft\"]</p>\n<p>A week later, Elvis was back in the studio, with the same musicians as before, along with Boots Randolph on saxophone, to record the rest of the tracks for his new album, to be titled <em>Elvis is Back!</em></p>\n<p><em>Elvis is Back!</em> is quite possibly the most consistent studio album Elvis ever made, and that second 1960 session is where the most impressive material on the album was recorded. They started out with a version of \"Fever\" that easily measured up to the original by Little Willie John and the most famous version by Peggy Lee, with Elvis backed just by Bobby Moore on bass and the two drummers:</p>\n<p>[Excerpt: Elvis Presley, \"Fever\"]</p>\n<p>Then there was \"Like a Baby\", a song originally recorded by Vikki Nelson, and written by Jesse Stone, who had written so many R&B classics before. This saw some of Elvis' best blues vocals:</p>\n<p>[Excerpt: Elvis Presley, \"Like a Baby\"]</p>\n<p>The next song was a huge departure from anything he'd done previously. Elvis had always loved Tony Martin's 1950 hit \"There's No Tomorrow\":</p>\n<p>[Excerpt: Tony Martin, \"There's No Tomorrow\"]</p>\n<p>That had become one of the songs he rehearsed with Charlie Hodge in Germany, and he'd mentioned the idea of recording it. But, of course, \"There's No Tomorrow\" was based on the old song \"O Sole Mio\", which at the time was considered to be in the public domain (though in fact a later Italian court ruling means that even though it was composed in 1897, it will remain in copyright until 2042), so Freddy Bienstock at Hill and Range, the publishing company that supplied Elvis with material, commissioned a new set of lyrics for it, and it became \"It's Now or Never\".</p>\n<p>Elvis did several near-perfect takes of the song, but then kept flubbing the ending, which required a particularly powerful, sustained, note. Bill Porter, who was engineering, suggested that they could do a take of just that bit and then splice it on to the rest, but Elvis was determined. He was going to do the song all the way through, or he was not going to do it. Eventually he got it, and the result was extraordinary, nothing like any performance he'd given previously:</p>\n<p>[Excerpt: Elvis Presley, \"It's Now Or Never\"]</p>\n<p>That would go to number one, as would another non-album single from this session. This one was the only song the Colonel had ever asked Elvis to record, \"Are You Lonesome Tonight?\"</p>\n<p>That song had been written in 1926, and had been a hit in several versions, most notably the version by Al Jolson:</p>\n<p>[Excerpt: Al Jolson, \"Are You Lonesome Tonight?\"]</p>\n<p>But the Colonel had two reasons for wanting Elvis to record the song. The first was that, while the Colonel didn't have much interest in music, he associated the song with Gene Austin, the country singer who had been the first act the Colonel had managed, and so he had a sentimental fondness for it. And the second was that it was the Colonel's wife Marie's favourite song.</p>\n<p>While the studio was normally brightly lit, for this song Elvis made sure that no-one other than the few musicians on the track, which only featured acoustic guitar, bass, drums, and vocals, were in the studio, and that all the lights were off.</p>\n<p>He did one take of the song, on which the Jordanaires apparently made a mistake. He then did a false start, and decided to give up on the song, but Steve Sholes, RCA's A&R man, insisted that the song could be a hit. They eventually got through it, although even the finished take of the song contains one mistake -- because the song was recorded in the dark, the musicians couldn't see the microphones, and you can hear someone bumping into a mic during the spoken bridge:</p>\n<p>[Excerpt: Elvis Presley, \"Are You Lonesome Tonight?\"]</p>\n<p>Despite that flaw, the track was released as a single, and became a massive success, and a song that would stay in Elvis' repertoire until his very last shows.</p>\n<p>During that one overnight session, Elvis and the band recorded twelve songs, covering a stylistic range that's almost inconceivable. There was a Leiber and Stoller rocker left over from \"King Creole\", a cover version of \"Such a Night\", the hit for Clyde McPhatter and the Drifters, the old Lowell Fulson blues song \"Reconsider Baby\", the light Latin pop song \"The Girl of My Best Friend\", a Louvin Brothers style duet with Charlie Hodge -- in one session Elvis managed to cover every style of American popular song as of 1960, and do it all well.</p>\n<p>In total, between this session and the previous one, Elvis recorded eighteen tracks -- three singles and a twelve-track album -- and while they were slicker and more polished than the Sun recordings, it's very easy to make the case that they were every bit as artistically successful, and this was certainly the best creative work he had done since signing to RCA. All three singles went to number one, and the Elvis Is Back! album went to number two, and sold half a million copies.</p>\n<p>But then, only three weeks after that session, he was in a different studio, cutting very different material.</p>\n<p>His first post-Army film was going to be a quick, light, comedy, called \"GI Blues\", intended to present a new, wholesome, image for Elvis. Elvis disliked the script, and he was also annoyed when he got into the recording studio in Hollywood, which was used for his film songs, to discover that he wasn't going to be recording any Leiber and Stoller songs for this film, for what the Colonel told him were \"business reasons\" -- Elvis seems not to have been aware that the Colonel had made them persona non grata.</p>\n<p>Instead, he was to record a set of songs mostly written by people like Sid Wayne, Abner Silver, Sid Tepper, and Fred Wise, journeymen songwriters with little taste for rock and roll. Typical of the songs was one called \"Wooden Heart\", based on an old German folk song, and with a co-writing credit to the German bandleader Bert Kaempfert (of whom we'll hear a little more in a future episode):</p>\n<p>[Excerpt: Elvis Presley, \"Wooden Heart\"]</p>\n<p>Now, one should be careful when criticising Elvis' film songs, because they were written for a specific context. These aren't songs that were intended to be listened to as singles or albums, but they were intended to drive a plot forward, and to exist in the context of a film. Taking them out of that context is a bit like just writing down all the lines spoken by one character in a film and complaining that they don't work as a poem. There's a habit even among Elvis' fans, let alone his detractors, of dunking on some of the songs he recorded for film soundtracks without taking that into account, and it does rather miss the point.</p>\n<p>But at the same time, they still had to be *performed* as songs, not as parts of films, and it was apparent that Elvis wasn't happy with them. Bones Howe, who was working on the sessions, said that Elvis had lost something when compared to his pre-Army work -- he was now trying, and often failing, to find his way into a performance which, pre-Army, he would have been able to do naturally. But when you compare his performances from the Elvis is Back! sessions, it's clear that the time in the Army wasn't the problem -- it's just that Elvis had no desire to be singing those songs or appearing in this film.</p>\n<p>[Excerpt: Elvis Presley, “GI Blues”]</p>\n<p>Elvis told the Colonel that at least half the songs for the film soundtrack had to be scrapped, but the Colonel told him he was locked into them by contract, and he just had to do the best he could with them. And he did -- he gave as good a performance as possible, both in the film and on the songs. But his heart wasn't in it.</p>\n<p>He was placated, though, by being told that his next couple of films would be *proper films*, like the ones he'd been making before going into the Army. These next two films were made back-to-back. Flaming Star was a Western with a rather heavy-handed message about racism, starring Elvis as a mixed-race man who felt at home neither with white people nor Native Americans, and directed by Don Siegel, who would go on to direct Dirty Harry. Elvis' role was originally intended for Marlon Brando, his acting idol, and he only sang one song in the film, other than the title song which played over the credits.</p>\n<p>[Excerpt: Elvis Presley, “Flaming Star”]</p>\n<p>And then he made Wild in the Country, which featured only a very small number of songs, and had Elvis playing a troubled young man who has to get court-ordered psychological counselling, but eventually goes off to college to become a writer.</p>\n<p>There's quite a bit of debate about the merits of both these films, and of Elvis' acting in them, but there's no doubt at all that they were intended to be serious films, even more so than Jailhouse Rock and King Creole had been.</p>\n<p>After filming these three films, Elvis went back into the studio for another overnight session, to record another album. This time, it was a gospel album, his first full-length gospel record. His Hand in Mine was possibly the purest expression of Elvis' own musical instincts yet -- he had always wanted to be a singer in a gospel quartet, and now he was singing gospel songs with the Jordanaires, exactly as he'd wanted to:</p>\n<p>[Excerpt: Elvis Presley, \"His Hand in Mine\"]</p>\n<p>So in 1960, Elvis had recorded two very different, but hugely artistically satisfying, albums, and had made three films, of which he could reasonably be proud of two.</p>\n<p>Unfortunately for him, it was the film he didn't like, GI Blues, that was the big success -- and while Elvis Is Back had gone to number two and sold half a million copies, the soundtrack to GI Blues went to number one and stayed there for eleven weeks, and sold a million copies -- an absurd number at a time when albums generally sold very little. His Hand in Mine only made number thirteen.</p>\n<p>The same pattern happened the next year -- a studio album was massively outsold by the soundtrack album for Blue Hawaii, a mindless film that was full of sea, sand, and bikinis, and which featured dreadful songs like \"Ito Eats\":</p>\n<p>[Excerpt: Elvis Presley, \"Ito Eats\"]</p>\n<p>There would be a couple more films in 1961 and 62, Kid Galahad and Follow That Dream, which tried to do a little more, and which weren't as successful as Blue Hawaii.</p>\n<p>From that point on, the die was cast for Elvis. The Colonel wasn't going to let him appear in any more dramatic roles. The films were all going to be light comedies, set somewhere exotic like Hawaii or Acapulco, and featuring Elvis as a surfer or a race-car driver or a surfing race-car driver, lots of girls in bikinis, and lots of songs called things like \"There's No Room To Rhumba in a Sports Car\". When Elvis got a chance to go into the studio and just make records, as he occasionally did over the next few years, he would make music that was as good as anything he ever did, but starting in 1962 there was a routine of three films a year, almost all interchangeable, and until 1968 Elvis wouldn't be able to step off that treadmill. After 68, he did make a handful of films in which, again, he tried to be an actor, but after twenty or so lightweight films about beaches and bikinis, no-one noticed.</p>\n<p>As a result, Elvis mostly sat out the sixties. While the music world was changing all around him, he was an irrelevance to the new generation of musicians, who mostly agreed with John Lennon that \"Elvis died when he went into the Army\". We'll pick up his story in 1968, when he finally got off the treadmill.</p>\n<p> </p>",
  "enclosure": "",
  "itunes:summary": "Episode eighty-two of A History of Rock Music in Five Hundred Songs looks at \"Are You Lonesome Tonight?\" by Elvis Presley, and the way his promising comeback after leaving the Army quickly got derailed. This episode also contains a brief acknowledgment of the death of the great Little Richard, who died just as I was recording this episode. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Muleskinner Blues\" by the Fendermen.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nApologies for the delay this week -- I've been unwell, as you might be able to tell from the croaky voice in places. Don't worry, it's not anything serious... \nNo Mixcloud this week, as almost every song excerpted is by Elvis, and it would be impossible to do it without breaking Mixcloud's rules about the number of songs by the same artist.\nMy main source for this episode is Careless Love: The Unmaking of Elvis Presley, the second part of Peter Guralnick's two-volume biography of Elvis. It's not *quite* as strong as the first volume, but it's still by far the best book covering his later years. I also used Reconsider Baby: The Definitive Elvis Sessionography 1954-1977 by Ernst Jorgensen.\nThe box set From Nashville to Memphis contains all Elvis' sixties studio recordings other than his gospel and soundtrack albums, and thus manages to make a solid case for Elvis' continued artistic relevance in the sixties, by only including records he chose to make. It's well worth the very cheap price.\nAnd Back in Living Stereo, which rounds up the 1960s public domain Elvis recordings, contains the gospel recordings, outtakes, and home recordings from 1960 through 1962.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nErrata\nI say that by the time “Stuck on You” had come out, Elvis had already made his TV appearance with Sinatra. In actual fact, he was still rehearsing for it, and wouldn't record it for a few more days.\nI also say that the Colonel had managed Gene Austin. In fact the Colonel had only promoted shows for Austin, not been his manager.\nTranscript\nBefore I start this week's episode, I had to mark the death of Little Richard. We've already covered his work of course, in episodes on \"Tutti Frutti\" and \"Keep A Knockin'\", and I don't really have a lot to add to those episodes in terms of his importance to twentieth-century music. We can argue about which of Elvis, Chuck Berry, or Little Richard was the most important artist of the fifties, but I don't think you can make a good argument that anyone other than one of those three was, and I don't think you can argue that those three weren't the three most important in whatever order.\nWithout Little Richard, none of the music we're covering in this podcast after 1955 would be the same, and this podcast would not exist. There are still a handful of people alive who made records we've looked at in the podcast, but without intending the slightest offence to any of them, none are as important a link in the historical chain as Richard Penniman was.\nSo, before the episode proper, let's have a few moments' noise in memory of the force of nature who described himself as the King and Queen of Rock and Roll:\n[Excerpt: Little Richard, \"Ooh! My Soul!\"]\nNow on to the main podcast itself.\nToday we're going to take what will be, for a while, our last look at Elvis Presley. He will show up in the background of some other episodes as we go through the sixties, and I plan to take a final look at him in a hundred or so episodes, but for now, as we're entering the sixties, we're leaving behind those fifties rockers, and Elvis is one of those we're definitely leaving for now.\nElvis' two years",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode eighty-two of A History of Rock Music in Five Hundred Songs looks at \"Are You Lonesome Tonight?\" by Elvis Presley, and the way his promising comeback after leaving the Army quickly got derailed. This episode also contains a brief acknowledgment of the death of the great Little Richard, who died just as I was recording this episode. Click the full post to read liner notes, links to more information, and a transcript of the episode.\nPatreon backers also have a ten-minute bonus episode available, on \"Muleskinner Blues\" by the Fendermen.\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\nResources\nApologies for the delay this week -- I've been unwell, as you might be able to tell from the croaky voice in places. Don't worry, it's not anything serious... \nNo Mixcloud this week, as almost every song excerpted is by ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}