{
  "title": "Heating of the intracluster medium by buoyant bubbles and sound waves. (arXiv:2203.13340v2 [astro-ph.CO] UPDATED)",
  "link": "http://arxiv.org/abs/2203.13340",
  "description": "<p>Active galactic nuclei (AGN) powered by the central Super-Massive Black Holes\n(SMBHs) play a major role in modifying the thermal properties of the\nintracluster medium (ICM). In this work, we implement two AGN heating models:\n(i) by buoyant cavities rising through stratified ICM (effervescent model) and,\n(ii) by viscous and conductive dissipation of sound waves (acoustic model). Our\naim is to determine whether these heating models are consistent with ICM\nobservables and if one is preferred over the other. We assume an initial\nentropy profile of ICM that is expected from the purely gravitational infall of\nthe gas in the potential of the dark matter halo. We then incorporate heating,\nradiative cooling, and thermal conduction to study the evolution of ICM over\nthe age of the clusters. Our results are: (i) Both the heating processes can\nproduce comparable thermal profiles of the ICM with some tuning of relevant\nparameters. (ii) Thermal conduction is crucially important, even at the level\nof 10\\% of the Spitzer values, in transferring the injected energy beyond the\ncentral regions, and without which the temperature/entropy profiles are\nunrealistically high. (iii) The required injected AGN power scales with cluster\nmass as $M_{\\rm vir}^{1.5}$ for both models. (iv) The required AGN luminosity\nis comparable with the observed radio jet power, reinforcing the idea that AGNs\nare the dominant heating source in clusters. (v) Finally, we estimate that the\nfraction of the total AGN luminosity available as the AGN mechanical luminosity\nat $0.02r_{500}$ is less than 0.05\\%.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Iqbal_A/0/1/0/all/0/1\">Asif Iqbal</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Majumdar_S/0/1/0/all/0/1\">Subhabrata Majumdar</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Nath_B/0/1/0/all/0/1\">Biman B. Nath</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Roychowdhury_S/0/1/0/all/0/1\">Suparna Roychowdhury</a>"
}