{
  "title": "Episode Sixty-Four: &#8220;Reet Petite&#8221; by Jackie Wilson",
  "link": "https://500songs.com/podcast/episode-sixty-four-reet-petite-by-jackie-wilson/",
  "pubDate": "Mon, 06 Jan 2020 18:38:01 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-sixty-four-reet-petite-by-jackie-wilson/",
  "description": "Episode sixty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Reet Petite\" by Jackie Wilson, and features talent contests with too much talent, the prehistory of Motown, a song banned by the BBC, and a possible Mafia hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/32922513\"> on \"Get a Job\" by the Silhouettes</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-64-reet-petite/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used three main books to put together the narrative for this one. <a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent history of the various companies that became Motown. <a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy's own, understandably one-sided, but relatively well-written, autobiography. And <a href=\"https://amzn.to/2STWhY1\"><em>Jackie Wilson: Lonely Teardrops</em> by Tony Douglas</a> is the closest thing out there to a definitive biography.\n\nThere are dozens of compilations of Wilson's fifties material, as it's in the public domain, but for around the same price as those you can get <a href=\"https://amzn.to/36tEsmB\">this three-CD set</a> which also has his later hits on, so that's probably the place to start when investigating Wilson's music.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday, we're going to have a look at one of the most important people in the history of popular music, and someone we'll be seeing a lot more of as the series goes on. There are very few people in the world who can be said to have created an entire genre of music, and even fewer who were primarily record company owners rather than musicians, but Berry Gordy Jr was one of them.\n\nGordy didn't start out, though, as a record executive. When he first got into the music industry, it was as a songwriter, and today we're going to look at his early songwriting career.\n\nBut we're also going to look at a performer who was massively important in his own right, and who was one of the most exciting performers ever to take to the stage -- someone who inspired Elvis, Michael Jackson, and James Brown, and who provides one of the key links between fifties R&B and sixties soul:\n\n[Excerpt: Jackie Wilson, \"Reet Petite\"]\n\nI'm afraid that this episode is another case where I have to point you to the disclaimer I did in the early weeks of the show. Jackie Wilson was an admirable musician, but he was in no way an admirable human being, particularly in his treatment of women – he's been credibly accused of at least one sexual assault, and he fathered many children by many different women, who he abandoned, and was known for having a violent temper. As always, this podcast is not about his reprehensible acts, but about the music, but again, it should not be taken as an endorsement of him as a person when I talk about his artistic talent.\n\nWilson started out as a boxer in his teens, but he quickly decided to move into singing instead. He would regularly perform at talent contests around Detroit, and he was part of a loose association of musicians and singers including Wilson's cousin Levi Stubbs, the Royals, who would later become Hank Ballard and the Midnighters, and the blues singer Little Willie John. They would all perform on the same talent shows and would agree among themselves who was going to win beforehand – Wilson would tell Stubbs \"you win this week, I'll win next week\".\n\nOn one occasion, Johnny Otis happened to be in the audience, when the Royals, Little Willie John, and Wilson were all on the same bill, and on that particular show Wilson came third. Otis was working as a talent scout for King Records at the time, and tried to get all three acts signed to the label, but for reasons that remain unclear, King decided they only wanted to sign the Royals (though they would sign Little Willie John a couple of years later). As a result, a song that Otis had written for Wilson was recorded instead by the Royals:\n\n[The Royals, \"Every Beat of My Heart\"]\n\nWilson kept performing at the amateur nights for a couple of years, until at the age of seventeen he was signed to Dee Gee Records, a small label co-owned by the jazz trumpet player Dizzy Gillespie. There he cut two singles, under the name Sonny Wilson.\n\nWilson's favourite song to sing in talent contests was \"Danny Boy\", which would remain in his setlists until late in his life, and he would use that song as a way to show off his vocal virtuosity, ornamenting it to the point that the melody would become almost unrecognisable, and so that was, of course, one of the two singles:\n\n[Excerpt: Sonny Wilson, \"Danny Boy\"]\n\nNeither single was particularly successful, but Wilson continued performing in nightclubs around Detroit and built up something of a local following. But in 1953 he got a big break, when he auditioned for Billy Ward and his Dominoes.\n\nWe've talked about the Dominoes before, back in the episode on \"Money Honey\", but as a bit of a recap, they were the biggest black vocal group of the early fifties, and they were led by Billy Ward, a vocal coach who was not their lead singer. The lead singer in the early fifties was Clyde McPhatter, but McPhatter was getting restless.\n\nThere are several different stories about how Wilson came to be picked for Ward's group, but one that sticks out in my mind is one that Ward used to tell, which is that one reason Wilson was picked for the group is that his mother begged Ward, saying that she was scared for the life of her son, as he was getting into trouble on the streets.\n\nCertainly, she had every reason to be worried for him – Wilson had recently been stabbed in the chest by a sex worker. But Ward noted that Wilson was a diamond in the rough, and could have a great deal of success with the right amount of polishing. He decided to get Wilson into the group as a replacement for McPhatter, though McPhatter and Wilson were in the group together for a while, as McPhatter served out his notice with the group.\n\nOver the next few weeks, Wilson studied what McPhatter was doing, until he was able to take McPhatter's place. Ward taught him breath control, and became something of a father figure, giving him some discipline for the first time in his life. McPhatter's were very big shoes to fill, but Wilson soon won the audiences over, both with his vocals and his dancing.\n\nWhile Wilson was not regarded as a good dancer by most of the people who knew him – he couldn't dance with a partner at all – he had a unique way of moving all his own, which he had learned in the boxing ring, where he'd learned to slide, sidestep, and duck away from other fighters, and to come at them from unexpected angles. He soon became one of the most riveting performers on stage, jumping up, throwing his mic in the air, doing mid-air splits, and completely dominating the stage.\n\nAs well as teaching him to perform, Ward made one other major change. Up to this point, Wilson had always been known either as Jack or as Sonny. Ward thought that being called Sonny smacked of Uncle Tommery, and decided that from this point on, Wilson's stage name was going to be Jackie. Wilson was not happy with this at first, but later decided that Ward had been right – though he was still always \"Jack\" or \"Sonny\" to those who knew him.\n\nWilson's first recording with the group as lead singer came just after he turned nineteen, when he went into the studio with them to cut \"You Can't Keep a Good Man Down\" for King Records -- the same label that had turned him down when Johnny Otis had put him forward:\n\n[Excerpt: Billy Ward and the Dominoes, \"You Can't Keep a Good Man Down\"]\n\nFour months later, they went back into the studio to cut eleven songs in a single day -- a mammoth session which really allowed Wilson to show off his vocal versatility. From that session, their version of \"Rags to Riches\", which had been a massive hit for Tony Bennett earlier in the year, went to number two on the R&B chart, though it didn't dent the pop chart:\n\n[Excerpt: Billy Ward and the Dominoes, \"Rags to Riches\"]\n\nBut after this, the Dominoes started to have less success in the charts -- their records weren't selling as well as they had been when Clyde McPhatter was the group's lead singer, and in 1954 they had no hits at all.\n\nBut in some ways that didn't really matter -- the group weren't just looking to have success as recording artists, but as live performers, and they got a two-year residency in Las Vegas, supporting Louis Prima and Keely Smith. The group were getting five thousand dollars a week -- a massive amount of money in those days -- though most of that went to Ward, and Wilson was on a salary of only ninety dollars a week.\n\nIt was while he was performing in Las Vegas that Wilson first came to the notice of someone who would later become a good friend -- Elvis Presley. In 1956 Elvis made his own first trip to perform in Vegas, although he was far, far less successful there than he would be thirteen years later. While he was there, he watched with amazement as Jackie Wilson performed Elvis' own hit \"Don't Be Cruel\" much better than Elvis did himself -- and in the famous Million Dollar Quartet tapes, you can hear Elvis raving about Wilson to Johnny Cash, Carl Perkins, and Jerry Lee Lewis:\n\n[Excerpt: Elvis talking about Jackie Wilson]\n\nIt's quite funny listening to those recordings, as the others keep trying to drag Elvis on to other topics of conversation, and Elvis keeps insisting on telling them just how good this singer with Billy Ward and the Dominoes, whose name he hadn't caught, was.\n\nBut Vegas wasn't a good fit for Wilson. He chafed at the discipline of the Dominoes, and at staying in one place all the time.\n\nAfter a couple of years of disappointing record sales, the Dominoes switched labels to Decca, and for the first time Jackie Wilson hit the pop charts as a lead singer, when \"St. Therese of the Roses\" made number thirteen on the pop charts and number twenty-seven on the hot one hundred:\n\n[Excerpt: Billy Ward and the Dominoes, \"St. Therese of the Roses\"]\n\nIncidentally, over in the UK, where American chart records were often covered for the domestic market by British acts, that was recorded by Malcolm Vaughan, a pop tenor who wanted to be England's answer to Dean Martin:\n\n[Excerpt: Malcolm Vaughan, \"St. Therese of the Roses\"]\n\nThat version actually became a massive hit over here, reaching number three, after being banned by the BBC.\n\nYes, you heard that right. That song was banned, because it was \"contrary both to Roman Catholic doctrine and to Protestant sentiment\". The ban caused enough controversy that the record sold half a million copies. Vaughan would later go on to have a minor hit with a cover version of another Jackie Wilson record, \"To Be Loved\".\n\nIn 1957, Jackie decided to leave Billy Ward and the Dominoes. It had become apparent that Ward had no bigger ambitions than to keep playing Las Vegas forever, and keep making vast amounts of money without having to travel or work especially hard. Jackie Wilson wanted something more, and he went back to Detroit.\n\nAt first he was going to join a vocal group that had been performing for a few years, the Four Aims, which featured his cousin Levi Stubbs and another distant relative, Lawrence Payton. Unfortunately, they found that Jackie's voice didn't blend well with the group -- he sounded, according to Wilson's first wife Freda, too similar to Stubbs, though I don't hear that much of a vocal resemblance myself. Either way, the attempt to work together quickly fizzled out, and the Four Tops, as they became, had to find their own success without Jackie Wilson in the group.\n\nAround this time, Wilson also became obsessed with the singer Mario Lanza. Lanza was an Italian-American pop singer who sang in a pseudo-operatic style, rather than in the more casual crooning style of contemporaries like Frank Sinatra and Tony Bennett, and Wilson was a huge fan of Lanza's 1951 film The Great Caruso, in which he played the opera singer Enrico Caruso:\n\n[Excerpt: Mario Lanza, \"The Loveliest Night of the Year\"]\n\nWilson studied Lanza's performances, and he tried to emulate Lanza's diction and projection. But at the same time, he was, at heart, an R&B performer, and he also knew that as a black singer in Detroit in the early fifties, R&B was what he needed to do to make money.\n\nAnd making money was what Wilson needed to do more than anything else, and so he got an audition at the Flame Bar, which was owned and run by a local mobster, Al Green. Green was a big name in the local music business -- he managed Johnnie Ray, one of the biggest names in white pop music at the time, and also LaVern Baker, who had had a string of R&B hits.\n\nWilson got the audition through his friend Roquel Davis, who went by the name Billy Davis, who was Lawrence Payton's cousin and had performed with him in an early lineup of the Four Aims. Davis had also written songs for the Four Aims, but more importantly for this purpose, his girlfriend, Gwen Gordy, worked with her sister Anna at the Flame Bar. Through these connections, Wilson got himself a regular spot at the Flame -- and he also got to meet Gwen and Anna's little brother Berry.\n\nBerry Gordy Jr was someone who would go on to be one of the most important people in the history of twentieth century music -- someone without whom none of the rest of this story would happen. He was as important to the music of the sixties as Sam Phillips was to the fifties, if not more important.\n\nGordy was born, the seventh of eight children, to a poor family in Detroit. As a child, he was taught some of the rudiments of the piano by an uncle, who tried to get him to learn to play in the proper manner -- learning scales and arpeggios, and how to read music. But young Berry was easily bored, and soon figured out that if you play the first three notes of an arpeggio together, you can get a simple triad chord.\n\nA diversion here, just for those of you who don't know what I'm talking about -- an arpeggio is a musical term that literally means \"like a harp\", and it's used for a type of scale where you pick out the individual notes of a chord. You know the sound, even if you don't know the term. So when you arpeggiate a C major chord, you play the notes C, E, and G, sometimes in multiple octaves:\n\n[Demonstrates on guitar]\n\nWhen you play those notes together, that's a C major chord:\n\n[Demonstrates on guitar]\n\nOnce young Berry Gordy Jr figured out how to play the chords C, F, and G, he was able to start playing boogie-woogie piano by ear. His favourite boogie record was \"Hazel Scott's Boogie Woogie\":\n\n[Excerpt: Hazel Scott, \"Hazel Scott's Boogie Woogie\"]\n\nFrom an early age, he also became a fan of a particular type of vocal group performance, especially when the singers were singing touching songs about loneliness. He loved \"Paper Doll\" by the Mills Brothers:\n\n[Excerpt: The Mills Brothers, \"Paper Doll\"]\n\nand \"We Three\" by the Ink Spots:\n\n[Excerpt: The Ink Spots, \"We Three\"]\n\nBut in his early years, Gordy was unsure whether he wanted to become a musician, or if instead he wanted to become a boxer like his hero Joe Louis -- and in this way his career was paralleling that of Jackie Wilson, though he didn't know Wilson at the time.\n\nHe actually had a reasonable amount of success as a boxer, up until a point in 1950 where he saw two posters next to each other. One of them, on top, was advertising a battle of the bands between Stan Kenton and Duke Ellington, while the other was advertising a fight. He noticed two things about the posters. The first was that the bandleaders could work every night and make money, while he knew that boxers would go weeks or months between fights. And the second was that the bandleaders \"were about fifty and looked twenty-three\", while the boxers \"were about twenty-three and looked fifty\".\n\nHe knew what he was going to do, and it wasn't boxing.\n\nHis attempts at a music career were soon put on the back-burner when he was drafted to fight in the Korean War. After he got out of the military, he had a variety of short-term jobs, but he was regarded by his family more or less as a bum -- he never held down a steady job and he was a dreamer who saw himself as becoming a successful songwriter and a millionaire, but had never quite managed to make anything of his dreams.\n\nThat was, at least, until he met Billy Davis, who at the time was a struggling songwriter like him, but one who had had slightly more success. Davis had managed to persuade Chess Records to sign up the Four Tops, as they were now called, and release a single with Davis credited as the songwriter:\n\n[Excerpt: The Four Tops, \"Kiss Me Baby\"]\n\nI say Davis was credited as the songwriter, because that song bears more than a little resemblance to the Ray Charles song from a few years earlier, \"Kissa Me Baby\":\n\n[Excerpt: Ray Charles, \"Kissa Me Baby\"]\n\nBut Chess hadn't really been interested in the Four Tops themselves -- they'd instead been interested in Billy Davis as a songwriter, and they quickly used songs he'd written for the Four Tops, and cut them instead with the Moonglows:\n\n[Excerpt: The Moonglows, \"See Saw\"]\n\nand the Flamingos:\n\n[Excerpt: The Flamingos, \"A Kiss From Your Lips\"]\n\nNeither of those had been a big hit, but the result was that Billy Davis was, in Gordy's eyes at least, someone with a track record and connections. The two men hit it off musically as well as personally, and they decided that they'd start to collaborate on songs, along with Gordy's sister Gwen, who was dating Davis. Anything any of them wrote on their own would also get credited to them as a group, and they'd pool whatever they got. And they were going to write songs for Jackie Wilson.\n\nDavis tried to get Wilson signed to Chess Records, but they weren't interested in Wilson's sound -- they wanted a harder blues sound, rather than Wilson's more soulful sound. But then Al Green took on Wilson's management, and managed to persuade Bob Thiele at Decca Records, who had just signed Buddy Holly and the Crickets, to sign Wilson -- not so much for Wilson's own talent, though Thiele was impressed by him, but because Green promised that he could also sign LaVern Baker when her contract with Atlantic expired.\n\nAs it turned out, though, Thiele would never get to sign Baker, as the day before Wilson's contract was meant to be signed, Al Green died suddenly. More by chutzpah than anything else, Nat Tarnopol, an office boy who had been employed by Green, managed to take over Wilson's management, just by saying that he was in charge now. He got the contracts signed, and got Wilson signed to Brunswick, the Decca subsidiary that put out rock and roll records. Over the next few years Tarnopol would manage to get himself made a co-owner of Brunswick, by using the leverage he got as Wilson's manager.\n\nThe first record Wilson put out as a solo artist was a song that Billy Davis had originally come up with when he was sixteen, inspired by a Louis Jordan song titled \"Reet, Petite, and Gone\":\n\n[Excerpt: Louis Jordan, \"Reet, Petite, and Gone\"]\n\nDavis and the Gordys reworked his original idea into a new song called \"Reet Petite\", which became Wilson's first solo single since leaving the Dominoes. When Wilson took the song to Dick Jacobs, the arranger assigned to the session, Jacobs was impressed with the song, but became worried -- he sat down with Wilson to work out what key to record the song in, and Wilson kept telling him to take it higher, and higher, and higher. Wilson couldn't demonstrate what he meant during the preparations for the session, as he had laryngitis, but he kept insisting that he should sing it a full octave higher than Jacobs initially suggested.\n\nJacobs went to Bob Thiele, and Thiele said it didn't really matter, they'd only signed Wilson in order to get LaVern Baker, and just to do what he wanted. Jacobs hired some of the best session players in New York, including Panama Francis on drums and Sam \"the Man\" Taylor on saxophone, reasoning that if he had the best players around then the record wouldn't end up too bad, whatever the singer sounded like.\n\nI'll now quote some of Jacobs' description of the session itself:\n\n\"I got him behind the microphone and said a silent prayer that this aerial key he'd picked to sing in would be okay, and that this guy was a reasonable approximation of a singer.\n\n\"Jackie Wilson opened his mouth and out poured what sounded like honey on moonbeams, and it was like the whole room shifted on some weird axis. The musicians, these meat and potatoes pros, stared at each other slack-jawed and goggle-eyed in disbelief; it was as if the purpose of their musical training and woodshedding and lickspitting had been to guide them into this big studio in the Pythian Temple to experience these pure shivering moments of magic. Bob Thiele and I looked at each other and just started laughing, half out of relief and half out of wonder. I never thought crow could taste so sweet.\"\n\n[Excerpt: Jackie Wilson, \"Reet Petite\"]\n\nThe record wasn't a massive hit in the US -- it only went to number sixty-two on the pop charts -- but it was a much bigger hit in the UK, reaching number six, and over here it became a much-loved classic, so much so that it went to number one for four weeks when it was reissued in 1986.\n\nAt one show, where he was Dinah Washington's support act, he rolled his \"r\" on the title of the song, like he did on the record, and his two front dentures went flying off. He never sang the song live again.\n\n\"Reet Petite\" was the start of a run of songs that Davis and the Gordys wrote for Wilson, most of them big hits and several of them classics. Most notably, there was Wilson's second solo single, \"To Be Loved\".\n\nThat song was written by Berry Gordy and Davis, after Gordy found out his wife was divorcing him. Gordy went round to his sister Gwen's house, where Davis also was, and started playing the piano, after Gwen reassured him that even though his wife had left him, he still had the love of his children and his siblings. The result was a gorgeous ballad that went to number seven on the R&B charts and number twenty-two on the pop charts:\n\n[Excerpt: Jackie Wilson, \"To Be Loved\"]\n\nThey also wrote what became Wilson's biggest early it, \"Lonely Teardrops\", which went to number one on the R&B charts:\n\n[Excerpt: Jackie Wilson, \"Lonely Teardrops\"]\n\nThat had originally been written as a ballad, but was reworked into a more danceable song in the studio. Berry Gordy and Davis hated it when they first heard the finished record, but grew to appreciate it as it became a hit. However, from that point on, they started to take more interest in the production side of Wilson's recordings, and they developed a routine where Davis and Gordy would rehearse Wilson, with Gordy on the piano, and they'd teach him the song and record a demo, which Jacobs would then use to write the arrangements -- Dick Jacobs wasn't the only arranger on Wilson's early records, but they soon learned that he was the one who could best capture the sound they wanted. The three men would then supervise in the studio.\n\n(Gwen Gordy is also credited as a co-writer on several of the records, but her contributions tend to be played down by the others, and she doesn't appear to have been involved in the production side. How much of that is her not contributing as much, and how much is just misogyny in how the story is told, is hard to say.)\n\nBut eventually, they fell out with Nat Tarnopol, after they figured out that Tarnopol was putting songs to which he owned the copyright on the B-sides of all Wilson's records, so he could get royalties from the sales. Gordy and Davis insisted that they should get to write the songs on both sides of the singles, so that they could get a fair share of the money -- especially as they were effectively producing the sessions, without either a credit or royalties. Tarnopol disagreed -- as far as he was concerned, Jackie Wilson could be a star with anyone writing his material, and he didn't need these songwriters. Their days as Jackie Wilson's hit factory were over.\n\nDavis and Gwen Gordy went off to found their own record label, along with Gwen and Berry's sister Anna. Anna Records, as it was called, didn't have the most propitious start, with its first single being a Davis and Gwen Gordy song \"Hope and Pray\", performed by the Voice Masters:\n\n[Excerpt: The Voice Masters, \"Hope and Pray\"]\n\nBut it would later put out some much more influential records.\n\nBerry, meanwhile, decided to groom another young artist for stardom -- he saw a lot of possibilities in a young man called William Robinson, who everyone referred to as Smokey, and his group the Miracles. We'll pick up on the Gordys and their business ventures in a few months' time.\n\nJackie Wilson continued having hits for several years, although his career dipped in the early sixties with the British Invasion. He then had a revival in 1967, when he recorded what would end up being his biggest hit, \"Higher and Higher\":\n\n[Excerpt: Jackie Wilson, \"Higher and Higher\"]\n\nWilson continued having occasional hits through to 1970, and remained a popular live artist for years afterwards, but then in 1975, in the middle of performing \"Lonely Teardrops\", right after singing the line \"my heart is crying\", he clutched his chest and collapsed. At first people thought it was part of the act, but he didn't get back up. Cornell Gunter of the Coasters gave him mouth to mouth, and possibly saved his life, but some would question whether that was, in retrospect, a bad idea -- Wilson was in a coma from which he would never fully recover.\n\nFor the next eight and a half years, Wilson was institutionalised. There are some people who claim that he gained a little bit of awareness during that time, but by most accounts he was in a persistent vegetative state.\n\nAt first, the music business rallied round and helped pay for his treatment -- there are some reports that Jackie's old friend Elvis Presley anonymously donated a lot of the money for his medical bills, though these obviously can't be verified. The Detroit Spinners held a benefit concert for him, and donated $5000 of their own money. Al Green (the singer, not Wilson's ex-manager) performed at the concert and gave ten thousand dollars, Stevie Wonder gave five thousand, Gladys Knight gave two thousand five hundred, Michael Jackson ten thousand, Richard Pryor twelve hundred. James Brown sent a one thousand dollar cheque, which bounced, but he coughed up the actual money when Jackie's common-law wife said she was going to tell Jet magazine about the bouncing cheque.\n\nNat Tarnopol and Brunswick Records, on the other hand, gave nothing. In fact, they did worse than nothing -- they lied to Blue Cross/Blue Shield, claiming that Wilson hadn't had any earnings from them in the year prior to his collapse, when he'd been in the studio and was owed regular union rates for recording sessions. If they'd told the truth, his medical bills would have been covered by the insurance, but they weren't.\n\nThere are many hypotheses as to why Wilson collapsed on stage that day, including that he used to drink salt water before going on stage to make himself sweat, and that this caused him to have a heart attack due to induced hypertension. But several people close to Wilson believed that his collapse was somehow caused by Nat Tarnopol having him poisoned. Wilson had been due to testify against Tarnopol in front of a grand jury ten days after his collapse, and Tarnopol was very involved with the Mafia -- at one point he'd tried to have Carl Davis, who produced \"Higher and Higher\" killed, and it was only Davis' friendship with another mobster with ties to Brunswick, Tommy Vastola, that saved him.\n\nJohnny Roberts, Wilson's manager in the seventies and another mobster, actually faked his own death in the eighties and had a funeral, and then reappeared once Tarnopol himself died in 1987, while some of those close to Wilson think it's no coincidence that Cornell Gunter, who had been there when Wilson collapsed and had always thought there was something strange about it, was murdered himself in 1990, in Las Vegas, by an unknown gunman -- though if that murder did have anything to do with Wilson's collapse, it can't have been Tarnopol himself who ordered that murder, of course.\n\nJackie Wilson finally died of pneumonia on January 21, 1984, after having been hospitalised since September 29, 1975. He was buried in an unmarked grave, but three years later funds were raised for a headstone, which reads \"no more lonely teardrops\".",
  "itunes:subtitle": "Episode sixty-four of A History of Rock Music in Five Hundred Songs looks at Reet Petite by Jackie Wilson, and features talent contests with too much talent, the prehistory of Motown, a song banned by the BBC, and a possible Mafia hit. Click the full pos",
  "itunes:keywords": "Anna Gordy,Anna Records,Berry Gordy,Billy Ward and his Dominoes,Bob Thiele,Brunswick Records,Chess Records,Clyde McPhatter,Cornell Gunter,Decca Records,Dizzy Gillespie,Elvis Presley,Gwen Gordy,Hank Ballard,Jackie Wilson,Johnny Otis,King Records,LaVern Baker,Levi Stubbs,Louis Jordan,Million Dollar Quartet,Nat Tarnopol,Roquel Davis,Smokey Robinson,The Four Tops",
  "itunes:episodeType": "full",
  "itunes:episode": 64,
  "content:encoded": "Episode sixty-four of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Reet Petite\" by Jackie Wilson, and features talent contests with too much talent, the prehistory of Motown, a song banned by the BBC, and a possible Mafia hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/32922513\"> on \"Get a Job\" by the Silhouettes</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-64-reet-petite/\">Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nI used three main books to put together the narrative for this one. <a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em> by Nelson George</a> is an excellent history of the various companies that became Motown. <a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em> by Berry Gordy</a> is Gordy's own, understandably one-sided, but relatively well-written, autobiography. And <a href=\"https://amzn.to/2STWhY1\"><em>Jackie Wilson: Lonely Teardrops</em> by Tony Douglas</a> is the closest thing out there to a definitive biography.\n\nThere are dozens of compilations of Wilson's fifties material, as it's in the public domain, but for around the same price as those you can get <a href=\"https://amzn.to/36tEsmB\">this three-CD set</a> which also has his later hits on, so that's probably the place to start when investigating Wilson's music.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nToday, we're going to have a look at one of the most important people in the history of popular music, and someone we'll be seeing a lot more of as the series goes on. There are very few people in the world who can be said to have created an entire genre of music, and even fewer who were primarily record company owners rather than musicians, but Berry Gordy Jr was one of them.\n\nGordy didn't start out, though, as a record executive. When he first got into the music industry, it was as a songwriter, and today we're going to look at his early songwriting career.\n\nBut we're also going to look at a performer who was massively important in his own right, and who was one of the most exciting performers ever to take to the stage -- someone who inspired Elvis, Michael Jackson, and James Brown, and who provides one of the key links between fifties R&B and sixties soul:\n\n[Excerpt: Jackie Wilson, \"Reet Petite\"]\n\nI'm afraid that this episode is another case where I have to point you to the disclaimer I did in the early weeks of the show. Jackie Wilson was an admirable musician, but he was in no way an admirable human being, particularly in his treatment of women – he's been credibly accused of at least one sexual assault, and he fathered many children by many different women, who he abandoned, and was known for having a violent temper. As always, this podcast is not about his reprehensible acts, but about the music, but again, it should not be taken as an endorsement of him as a person when I talk about his artistic talent.\n\nWilson started out as a boxer in his teens, but he quickly decided to move into singing instead. He would regularly perform at talent contests around Detroit, and he was part of a loose association of musicians and singers including Wilson's cousin Levi Stubbs, the Royals, who would later become Hank Ballard and the Midnighters, and the blues singer Little Willie John. They would all perform on the same talent shows and would agree among themselves who was going to win beforehand – Wilson would tell Stubbs \"you win this week, I'll win next week\".\n\nOn one occasion, Johnny Otis happened to be in the audience, when the Royals, Little Willie John, and Wilson were all on the same bill, and on that particular show Wilson came third. Otis was working as a talent scout for King Records at the time, and tried to get all three acts signed to the label, but for reasons that remain unclear, King decided they only wanted to sign the Royals (though they would sign Little Willie John a couple of years later). As a result, a song that Otis had written for Wilson was recorded instead by the Royals:\n\n[The Royals, \"Every Beat of My Heart\"]\n\nWilson kept performing at the amateur nights for a couple of years, until at the age of seventeen he was signed to Dee Gee Records, a small label co-owned by the jazz trumpet player Dizzy Gillespie. There he cut two singles, under the name Sonny Wilson.\n\nWilson's favourite song to sing in talent contests was \"Danny Boy\", which would remain in his setlists until late in his life, and he would use that song as a way to show off his vocal virtuosity, ornamenting it to the point that the melody would become almost unrecognisable, and so that was, of course, one of the two singles:\n\n[Excerpt: Sonny Wilson, \"Danny Boy\"]\n\nNeither single was particularly successful, but Wilson continued performing in nightclubs around Detroit and built up something of a local following. But in 1953 he got a big break, when he auditioned for Billy Ward and his Dominoes.\n\nWe've talked about the Dominoes before, back in the episode on \"Money Honey\", but as a bit of a recap, they were the biggest black vocal group of the early fifties, and they were led by Billy Ward, a vocal coach who was not their lead singer. The lead singer in the early fifties was Clyde McPhatter, but McPhatter was getting restless.\n\nThere are several different stories about how Wilson came to be picked for Ward's group, but one that sticks out in my mind is one that Ward used to tell, which is that one reason Wilson was picked for the group is that his mother begged Ward, saying that she was scared for the life of her son, as he was getting into trouble on the streets.\n\nCertainly, she had every reason to be worried for him – Wilson had recently been stabbed in the chest by a sex worker. But Ward noted that Wilson was a diamond in the rough, and could have a great deal of success with the right amount of polishing. He decided to get Wilson into the group as a replacement for McPhatter, though McPhatter and Wilson were in the group together for a while, as McPhatter served out his notice with the group.\n\nOver the next few weeks, Wilson studied what McPhatter was doing, until he was able to take McPhatter's place. Ward taught him breath control, and became something of a father figure, giving him some discipline for the first time in his life. McPhatter's were very big shoes to fill, but Wilson soon won the audiences over, both with his vocals and his dancing.\n\nWhile Wilson was not regarded as a good dancer by most of the people who knew him – he couldn't dance with a partner at all – he had a unique way of moving all his own, which he had learned in the boxing ring, where he'd learned to slide, sidestep, and duck away from other fighters, and to come at them from unexpected angles. He soon became one of the most riveting performers on stage, jumping up, throwing his mic in the air, doing mid-air splits, and completely dominating the stage.\n\nAs well as teaching him to perform, Ward made one other major change. Up to this point, Wilson had always been known either as Jack or as Sonny. Ward thought that being called Sonny smacked of Uncle Tommery, and decided that from this point on, Wilson's stage name was going to be Jackie. Wilson was not happy with this at first, but later decided that Ward had been right – though he was still always \"Jack\" or \"Sonny\" to those who knew him.\n\nWilson's first recording with the group as lead singer came just after he turned nineteen, when he went into the studio with them to cut \"You Can't Keep a Good Man Down\" for King Records -- the same label that had turned him down when Johnny Otis had put him forward:\n\n[Excerpt: Billy Ward and the Dominoes, \"You Can't Keep a Good Man Down\"]\n\nFour months later, they went back into the studio to cut eleven songs in a single day -- a mammoth session which really allowed Wilson to show off his vocal versatility. From that session, their version of \"Rags to Riches\", which had been a massive hit for Tony Bennett earlier in the year, went to number two on the R&B chart, though it didn't dent the pop chart:\n\n[Excerpt: Billy Ward and the Dominoes, \"Rags to Riches\"]\n\nBut after this, the Dominoes started to have less success in the charts -- their records weren't selling as well as they had been when Clyde McPhatter was the group's lead singer, and in 1954 they had no hits at all.\n\nBut in some ways that didn't really matter -- the group weren't just looking to have success as recording artists, but as live performers, and they got a two-year residency in Las Vegas, supporting Louis Prima and Keely Smith. The group were getting five thousand dollars a week -- a massive amount of money in those days -- though most of that went to Ward, and Wilson was on a salary of only ninety dollars a week.\n\nIt was while he was performing in Las Vegas that Wilson first came to the notice of someone who would later become a good friend -- Elvis Presley. In 1956 Elvis made his own first trip to perform in Vegas, although he was far, far less successful there than he would be thirteen years later. While he was there, he watched with amazement as Jackie Wilson performed Elvis' own hit \"Don't Be Cruel\" much better than Elvis did himself -- and in the famous Million Dollar Quartet tapes, you can hear Elvis raving about Wilson to Johnny Cash, Carl Perkins, and Jerry Lee Lewis:\n\n[Excerpt: Elvis talking about Jackie Wilson]\n\nIt's quite funny listening to those recordings, as the others keep trying to drag Elvis on to other topics of conversation, and Elvis keeps insisting on telling them just how good this singer with Billy Ward and the Dominoes, whose name he hadn't caught, was.\n\nBut Vegas wasn't a good fit for Wilson. He chafed at the discipline of the Dominoes, and at staying in one place all the time.\n\nAfter a couple of years of disappointing record sales, the Dominoes switched labels to Decca, and for the first time Jackie Wilson hit the pop charts as a lead singer, when \"St. Therese of the Roses\" made number thirteen on the pop charts and number twenty-seven on the hot one hundred:\n\n[Excerpt: Billy Ward and the Dominoes, \"St. Therese of the Roses\"]\n\nIncidentally, over in the UK, where American chart records were often covered for the domestic market by British acts, that was recorded by Malcolm Vaughan, a pop tenor who wanted to be England's answer to Dean Martin:\n\n[Excerpt: Malcolm Vaughan, \"St. Therese of the Roses\"]\n\nThat version actually became a massive hit over here, reaching number three, after being banned by the BBC.\n\nYes, you heard that right. That song was banned, because it was \"contrary both to Roman Catholic doctrine and to Protestant sentiment\". The ban caused enough controversy that the record sold half a million copies. Vaughan would later go on to have a minor hit with a cover version of another Jackie Wilson record, \"To Be Loved\".\n\nIn 1957, Jackie decided to leave Billy Ward and the Dominoes. It had become apparent that Ward had no bigger ambitions than to keep playing Las Vegas forever, and keep making vast amounts of money without having to travel or work especially hard. Jackie Wilson wanted something more, and he went back to Detroit.\n\nAt first he was going to join a vocal group that had been performing for a few years, the Four Aims, which featured his cousin Levi Stubbs and another distant relative, Lawrence Payton. Unfortunately, they found that Jackie's voice didn't blend well with the group -- he sounded, according to Wilson's first wife Freda, too similar to Stubbs, though I don't hear that much of a vocal resemblance myself. Either way, the attempt to work together quickly fizzled out, and the Four Tops, as they became, had to find their own success without Jackie Wilson in the group.\n\nAround this time, Wilson also became obsessed with the singer Mario Lanza. Lanza was an Italian-American pop singer who sang in a pseudo-operatic style, rather than in the more casual crooning style of contemporaries like Frank Sinatra and Tony Bennett, and Wilson was a huge fan of Lanza's 1951 film The Great Caruso, in which he played the opera singer Enrico Caruso:\n\n[Excerpt: Mario Lanza, \"The Loveliest Night of the Year\"]\n\nWilson studied Lanza's performances, and he tried to emulate Lanza's diction and projection. But at the same time, he was, at heart, an R&B performer, and he also knew that as a black singer in Detroit in the early fifties, R&B was what he needed to do to make money.\n\nAnd making money was what Wilson needed to do more than anything else, and so he got an audition at the Flame Bar, which was owned and run by a local mobster, Al Green. Green was a big name in the local music business -- he managed Johnnie Ray, one of the biggest names in white pop music at the time, and also LaVern Baker, who had had a string of R&B hits.\n\nWilson got the audition through his friend Roquel Davis, who went by the name Billy Davis, who was Lawrence Payton's cousin and had performed with him in an early lineup of the Four Aims. Davis had also written songs for the Four Aims, but more importantly for this purpose, his girlfriend, Gwen Gordy, worked with her sister Anna at the Flame Bar. Through these connections, Wilson got himself a regular spot at the Flame -- and he also got to meet Gwen and Anna's little brother Berry.\n\nBerry Gordy Jr was someone who would go on to be one of the most important people in the history of twentieth century music -- someone without whom none of the rest of this story would happen. He was as important to the music of the sixties as Sam Phillips was to the fifties, if not more important.\n\nGordy was born, the seventh of eight children, to a poor family in Detroit. As a child, he was taught some of the rudiments of the piano by an uncle, who tried to get him to learn to play in the proper manner -- learning scales and arpeggios, and how to read music. But young Berry was easily bored, and soon figured out that if you play the first three notes of an arpeggio together, you can get a simple triad chord.\n\nA diversion here, just for those of you who don't know what I'm talking about -- an arpeggio is a musical term that literally means \"like a harp\", and it's used for a type of scale where you pick out the individual notes of a chord. You know the sound, even if you don't know the term. So when you arpeggiate a C major chord, you play the notes C, E, and G, sometimes in multiple octaves:\n\n[Demonstrates on guitar]\n\nWhen you play those notes together, that's a C major chord:\n\n[Demonstrates on guitar]\n\nOnce young Berry Gordy Jr figured out how to play the chords C, F, and G, he was able to start playing boogie-woogie piano by ear. His favourite boogie record was \"Hazel Scott's Boogie Woogie\":\n\n[Excerpt: Hazel Scott, \"Hazel Scott's Boogie Woogie\"]\n\nFrom an early age, he also became a fan of a particular type of vocal group performance, especially when the singers were singing touching songs about loneliness. He loved \"Paper Doll\" by the Mills Brothers:\n\n[Excerpt: The Mills Brothers, \"Paper Doll\"]\n\nand \"We Three\" by the Ink Spots:\n\n[Excerpt: The Ink Spots, \"We Three\"]\n\nBut in his early years, Gordy was unsure whether he wanted to become a musician, or if instead he wanted to become a boxer like his hero Joe Louis -- and in this way his career was paralleling that of Jackie Wilson, though he didn't know Wilson at the time.\n\nHe actually had a reasonable amount of success as a boxer, up until a point in 1950 where he saw two posters next to each other. One of them, on top, was advertising a battle of the bands between Stan Kenton and Duke Ellington, while the other was advertising a fight. He noticed two things about the posters. The first was that the bandleaders could work every night and make money, while he knew that boxers would go weeks or months between fights. And the second was that the bandleaders \"were about fifty and looked twenty-three\", while the boxers \"were about twenty-three and looked fifty\".\n\nHe knew what he was going to do, and it wasn't boxing.\n\nHis attempts at a music career were soon put on the back-burner when he was drafted to fight in the Korean War. After he got out of the military, he had a variety of short-term jobs, but he was regarded by his family more or less as a bum -- he never held down a steady job and he was a dreamer who saw himself as becoming a successful songwriter and a millionaire, but had never quite managed to make anything of his dreams.\n\nThat was, at least, until he met Billy Davis, who at the time was a struggling songwriter like him, but one who had had slightly more success. Davis had managed to persuade Chess Records to sign up the Four Tops, as they were now called, and release a single with Davis credited as the songwriter:\n\n[Excerpt: The Four Tops, \"Kiss Me Baby\"]\n\nI say Davis was credited as the songwriter, because that song bears more than a little resemblance to the Ray Charles song from a few years earlier, \"Kissa Me Baby\":\n\n[Excerpt: Ray Charles, \"Kissa Me Baby\"]\n\nBut Chess hadn't really been interested in the Four Tops themselves -- they'd instead been interested in Billy Davis as a songwriter, and they quickly used songs he'd written for the Four Tops, and cut them instead with the Moonglows:\n\n[Excerpt: The Moonglows, \"See Saw\"]\n\nand the Flamingos:\n\n[Excerpt: The Flamingos, \"A Kiss From Your Lips\"]\n\nNeither of those had been a big hit, but the result was that Billy Davis was, in Gordy's eyes at least, someone with a track record and connections. The two men hit it off musically as well as personally, and they decided that they'd start to collaborate on songs, along with Gordy's sister Gwen, who was dating Davis. Anything any of them wrote on their own would also get credited to them as a group, and they'd pool whatever they got. And they were going to write songs for Jackie Wilson.\n\nDavis tried to get Wilson signed to Chess Records, but they weren't interested in Wilson's sound -- they wanted a harder blues sound, rather than Wilson's more soulful sound. But then Al Green took on Wilson's management, and managed to persuade Bob Thiele at Decca Records, who had just signed Buddy Holly and the Crickets, to sign Wilson -- not so much for Wilson's own talent, though Thiele was impressed by him, but because Green promised that he could also sign LaVern Baker when her contract with Atlantic expired.\n\nAs it turned out, though, Thiele would never get to sign Baker, as the day before Wilson's contract was meant to be signed, Al Green died suddenly. More by chutzpah than anything else, Nat Tarnopol, an office boy who had been employed by Green, managed to take over Wilson's management, just by saying that he was in charge now. He got the contracts signed, and got Wilson signed to Brunswick, the Decca subsidiary that put out rock and roll records. Over the next few years Tarnopol would manage to get himself made a co-owner of Brunswick, by using the leverage he got as Wilson's manager.\n\nThe first record Wilson put out as a solo artist was a song that Billy Davis had originally come up with when he was sixteen, inspired by a Louis Jordan song titled \"Reet, Petite, and Gone\":\n\n[Excerpt: Louis Jordan, \"Reet, Petite, and Gone\"]\n\nDavis and the Gordys reworked his original idea into a new song called \"Reet Petite\", which became Wilson's first solo single since leaving the Dominoes. When Wilson took the song to Dick Jacobs, the arranger assigned to the session, Jacobs was impressed with the song, but became worried -- he sat down with Wilson to work out what key to record the song in, and Wilson kept telling him to take it higher, and higher, and higher. Wilson couldn't demonstrate what he meant during the preparations for the session, as he had laryngitis, but he kept insisting that he should sing it a full octave higher than Jacobs initially suggested.\n\nJacobs went to Bob Thiele, and Thiele said it didn't really matter, they'd only signed Wilson in order to get LaVern Baker, and just to do what he wanted. Jacobs hired some of the best session players in New York, including Panama Francis on drums and Sam \"the Man\" Taylor on saxophone, reasoning that if he had the best players around then the record wouldn't end up too bad, whatever the singer sounded like.\n\nI'll now quote some of Jacobs' description of the session itself:\n\n\"I got him behind the microphone and said a silent prayer that this aerial key he'd picked to sing in would be okay, and that this guy was a reasonable approximation of a singer.\n\n\"Jackie Wilson opened his mouth and out poured what sounded like honey on moonbeams, and it was like the whole room shifted on some weird axis. The musicians, these meat and potatoes pros, stared at each other slack-jawed and goggle-eyed in disbelief; it was as if the purpose of their musical training and woodshedding and lickspitting had been to guide them into this big studio in the Pythian Temple to experience these pure shivering moments of magic. Bob Thiele and I looked at each other and just started laughing, half out of relief and half out of wonder. I never thought crow could taste so sweet.\"\n\n[Excerpt: Jackie Wilson, \"Reet Petite\"]\n\nThe record wasn't a massive hit in the US -- it only went to number sixty-two on the pop charts -- but it was a much bigger hit in the UK, reaching number six, and over here it became a much-loved classic, so much so that it went to number one for four weeks when it was reissued in 1986.\n\nAt one show, where he was Dinah Washington's support act, he rolled his \"r\" on the title of the song, like he did on the record, and his two front dentures went flying off. He never sang the song live again.\n\n\"Reet Petite\" was the start of a run of songs that Davis and the Gordys wrote for Wilson, most of them big hits and several of them classics. Most notably, there was Wilson's second solo single, \"To Be Loved\".\n\nThat song was written by Berry Gordy and Davis, after Gordy found out his wife was divorcing him. Gordy went round to his sister Gwen's house, where Davis also was, and started playing the piano, after Gwen reassured him that even though his wife had left him, he still had the love of his children and his siblings. The result was a gorgeous ballad that went to number seven on the R&B charts and number twenty-two on the pop charts:\n\n[Excerpt: Jackie Wilson, \"To Be Loved\"]\n\nThey also wrote what became Wilson's biggest early it, \"Lonely Teardrops\", which went to number one on the R&B charts:\n\n[Excerpt: Jackie Wilson, \"Lonely Teardrops\"]\n\nThat had originally been written as a ballad, but was reworked into a more danceable song in the studio. Berry Gordy and Davis hated it when they first heard the finished record, but grew to appreciate it as it became a hit. However, from that point on, they started to take more interest in the production side of Wilson's recordings, and they developed a routine where Davis and Gordy would rehearse Wilson, with Gordy on the piano, and they'd teach him the song and record a demo, which Jacobs would then use to write the arrangements -- Dick Jacobs wasn't the only arranger on Wilson's early records, but they soon learned that he was the one who could best capture the sound they wanted. The three men would then supervise in the studio.\n\n(Gwen Gordy is also credited as a co-writer on several of the records, but her contributions tend to be played down by the others, and she doesn't appear to have been involved in the production side. How much of that is her not contributing as much, and how much is just misogyny in how the story is told, is hard to say.)\n\nBut eventually, they fell out with Nat Tarnopol, after they figured out that Tarnopol was putting songs to which he owned the copyright on the B-sides of all Wilson's records, so he could get royalties from the sales. Gordy and Davis insisted that they should get to write the songs on both sides of the singles, so that they could get a fair share of the money -- especially as they were effectively producing the sessions, without either a credit or royalties. Tarnopol disagreed -- as far as he was concerned, Jackie Wilson could be a star with anyone writing his material, and he didn't need these songwriters. Their days as Jackie Wilson's hit factory were over.\n\nDavis and Gwen Gordy went off to found their own record label, along with Gwen and Berry's sister Anna. Anna Records, as it was called, didn't have the most propitious start, with its first single being a Davis and Gwen Gordy song \"Hope and Pray\", performed by the Voice Masters:\n\n[Excerpt: The Voice Masters, \"Hope and Pray\"]\n\nBut it would later put out some much more influential records.\n\nBerry, meanwhile, decided to groom another young artist for stardom -- he saw a lot of possibilities in a young man called William Robinson, who everyone referred to as Smokey, and his group the Miracles. We'll pick up on the Gordys and their business ventures in a few months' time.\n\nJackie Wilson continued having hits for several years, although his career dipped in the early sixties with the British Invasion. He then had a revival in 1967, when he recorded what would end up being his biggest hit, \"Higher and Higher\":\n\n[Excerpt: Jackie Wilson, \"Higher and Higher\"]\n\nWilson continued having occasional hits through to 1970, and remained a popular live artist for years afterwards, but then in 1975, in the middle of performing \"Lonely Teardrops\", right after singing the line \"my heart is crying\", he clutched his chest and collapsed. At first people thought it was part of the act, but he didn't get back up. Cornell Gunter of the Coasters gave him mouth to mouth, and possibly saved his life, but some would question whether that was, in retrospect, a bad idea -- Wilson was in a coma from which he would never fully recover.\n\nFor the next eight and a half years, Wilson was institutionalised. There are some people who claim that he gained a little bit of awareness during that time, but by most accounts he was in a persistent vegetative state.\n\nAt first, the music business rallied round and helped pay for his treatment -- there are some reports that Jackie's old friend Elvis Presley anonymously donated a lot of the money for his medical bills, though these obviously can't be verified. The Detroit Spinners held a benefit concert for him, and donated $5000 of their own money. Al Green (the singer, not Wilson's ex-manager) performed at the concert and gave ten thousand dollars, Stevie Wonder gave five thousand, Gladys Knight gave two thousand five hundred, Michael Jackson ten thousand, Richard Pryor twelve hundred. James Brown sent a one thousand dollar cheque, which bounced, but he coughed up the actual money when Jackie's common-law wife said she was going to tell Jet magazine about the bouncing cheque.\n\nNat Tarnopol and Brunswick Records, on the other hand, gave nothing. In fact, they did worse than nothing -- they lied to Blue Cross/Blue Shield, claiming that Wilson hadn't had any earnings from them in the year prior to his collapse, when he'd been in the studio and was owed regular union rates for recording sessions. If they'd told the truth, his medical bills would have been covered by the insurance, but they weren't.\n\nThere are many hypotheses as to why Wilson collapsed on stage that day, including that he used to drink salt water before going on stage to make himself sweat, and that this caused him to have a heart attack due to induced hypertension. But several people close to Wilson believed that his collapse was somehow caused by Nat Tarnopol having him poisoned. Wilson had been due to testify against Tarnopol in front of a grand jury ten days after his collapse, and Tarnopol was very involved with the Mafia -- at one point he'd tried to have Carl Davis, who produced \"Higher and Higher\" killed, and it was only Davis' friendship with another mobster with ties to Brunswick, Tommy Vastola, that saved him.\n\nJohnny Roberts, Wilson's manager in the seventies and another mobster, actually faked his own death in the eighties and had a funeral, and then reappeared once Tarnopol himself died in 1987, while some of those close to Wilson think it's no coincidence that Cornell Gunter, who had been there when Wilson collapsed and had always thought there was something strange about it, was murdered himself in 1990, in Las Vegas, by an unknown gunman -- though if that murder did have anything to do with Wilson's collapse, it can't have been Tarnopol himself who ordered that murder, of course.\n\nJackie Wilson finally died of pneumonia on January 21, 1984, after having been hospitalised since September 29, 1975. He was buried in an unmarked grave, but three years later funds were raised for a headstone, which reads \"no more lonely teardrops\".",
  "enclosure": "",
  "itunes:summary": "Episode sixty-four of A History of Rock Music in Five Hundred Songs looks at \"Reet Petite\" by Jackie Wilson, and features talent contests with too much talent, the prehistory of Motown, a song banned by the BBC, and a possible Mafia hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Get a Job\" by the Silhouettes.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used three main books to put together the narrative for this one. Where Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent history of the various companies that became Motown. To Be Loved by Berry Gordy is Gordy's own, understandably one-sided, but relatively well-written, autobiography. And Jackie Wilson: Lonely Teardrops by Tony Douglas is the closest thing out there to a definitive biography.\n\nThere are dozens of compilations of Wilson's fifties material, as it's in the public domain, but for around the same price as those you can get this three-CD set which also has his later hits on, so that's probably the place to start when investigating Wilson's music.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nToday, we're going to have a look at one of the most important people in the history of popular music, and someone we'll be seeing a lot more of as the series goes on. There are very few people in the world who can be said to have created an entire genre of music, and even fewer who were primarily record company owners rather than musicians, but Berry Gordy Jr was one of them.\n\nGordy didn't start out, though, as a record executive. When he first got into the music industry, it was as a songwriter, and today we're going to look at his early songwriting career.\n\nBut we're also going to look at a performer who was massively important in his own right, and who was one of the most exciting performers ever to take to the stage -- someone who inspired Elvis, Michael Jackson, and James Brown, and who provides one of the key links between fifties R&B and sixties soul:\n\n[Excerpt: Jackie Wilson, \"Reet Petite\"]\n\nI'm afraid that this episode is another case where I have to point you to the disclaimer I did in the early weeks of the show. Jackie Wilson was an admirable musician, but he was in no way an admirable human being, particularly in his treatment of women – he's been credibly accused of at least one sexual assault, and he fathered many children by many different women, who he abandoned, and was known for having a violent temper. As always, this podcast is not about his reprehensible acts, but about the music, but again, it should not be taken as an endorsement of him as a person when I talk about his artistic talent.\n\nWilson started out as a boxer in his teens, but he quickly decided to move into singing instead. He would regularly perform at talent contests around Detroit, and he was part of a loose association of musicians and singers including Wilson's cousin Levi Stubbs, the Royals, who would later become Hank Ballard and the Midnighters, and the blues singer Little Willie John. They would all perform on the same talent shows and would agree among themselves who was going to win beforehand – Wilson would tell Stubbs \"you win this week, I'll win next week\".\n\nOn one occasion, Johnny Otis happened to be in the audience, when the Royals, Little Willie John, and Wilson were all on the same bill, and on that particular show Wilson came third. Otis was working as a talent scout for King Records at the time, and tried to get all three acts signed to the label, but for reasons that remain unclear, King decided they only wanted to sign the Royals (though they would sign Little Willie John a couple of years later). As a result, a song that Otis had written for Wilson was recor",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode sixty-four of A History of Rock Music in Five Hundred Songs looks at \"Reet Petite\" by Jackie Wilson, and features talent contests with too much talent, the prehistory of Motown, a song banned by the BBC, and a possible Mafia hit. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Get a Job\" by the Silhouettes.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nI used three main books to put together the narrative for this one. Where Did Our Love Go? The Rise and Fall of the Motown Sound by Nelson George is an excellent history of the various companies that became Motown. To Be Loved by Berry Gordy is Gordy's own, understandably one-sided, but relatively well-written, autobiography. And Jackie Wilson: Lonely Teardrops by Tony Douglas is the closest thing out there to a definitive biography.\n\n",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}