{
  "title": "Episode 147: &#8220;Hey Joe&#8221; by The Jimi Hendrix Experience",
  "link": "https://500songs.com/podcast/episode-147-hey-joe-by-the-jimi-hendrix-experience/",
  "pubDate": "Sat, 16 Apr 2022 01:43:03 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1124",
  "description": "Episode one hundred and forty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Hey Joe\" by the Jimi Hendrix Experience, and is the longest episode to date, at over two hours.\n\nPatreon backers also have a twenty-two-minute bonus episode available, <a href=\"https://www.patreon.com/posts/65195363\">on \"Making Time\" by The Creation</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-147-hey-joe/\">a Mixcloud mix</a> containing all the music excerpted in this episode.\n\nFor information on the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman’s autobiography</a>.\n\nInformation on Arthur Lee and Love came from <a href=\"https://amzn.to/3Er1LPK\"><em>Forever Changes: Arthur Lee and the Book of Love</em> by John Einarson</a>, and <a href=\"https://amzn.to/3jKi0O5\"><em>Arthur Lee: Alone Again Or</em> by Barney Hoskyns.</a>\n\nInformation on Gary Usher's work with the Surfaris and the Sons of Adam came from <em>The California Sound</em> by Stephen McParland, which can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nInformation on Jimi Hendrix came from <a href=\"https://amzn.to/3JMP82g\"><em>Room Full of Mirrors </em></a>by Charles R. Cross, <a href=\"https://amzn.to/3OqS1JU\"><em>Crosstown Traffic</em> by Charles Shaar Murray</a>, and <a href=\"https://amzn.to/37l2sOc\"><em>Wild Thing</em> by Philip Norman</a>.\n\nInformation on the history of \"Hey Joe\" itself came from all these sources plus <a href=\"https://amzn.to/3M87499\"><em>Hey Joe: The Unauthorised Biography of a Rock Classic</em> by Marc Shapiro</a>, though note that most of that book is about post-1967 cover versions.\n\nMost of the pre-Experience session work by Jimi Hendrix I excerpt in this episode is on <a href=\"https://amzn.to/3KQ2Y5w\">this box set of alternate takes and live recordings</a>. And \"Hey Joe\" can be found on <em><a href=\"https://amzn.to/3ryfMFV\">Are You Experienced?</a></em>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nJust a quick note before we start – this episode deals with a song whose basic subject is a man murdering a woman, and that song also contains references to guns, and in some versions to cocaine use. Some versions excerpted also contain misogynistic slurs. If those things are likely to upset you, please skip this episode, as the whole episode focusses on that song. I would hope it goes without saying that I don't approve of misogyny, intimate partner violence, or murder, and my discussing a song does not mean I condone acts depicted in its lyrics, and the episode itself deals with the writing and recording of the song rather than its subject matter, but it would be impossible to talk about the record without excerpting the song. The normalisation of violence against women in rock music lyrics is a subject I will come back to, but did not have room for in what is already a very long episode. Anyway, on with the show.\n\nLet's talk about the folk process, shall we? We've talked before, like in the episodes on \"Stagger Lee\" and \"Ida Red\", about how there are some songs that aren't really individual songs in themselves, but are instead collections of related songs that might happen to share a name, or a title, or a story, or a melody, but which might be different in other ways.\n\nThere are probably more songs that are like this than songs that aren't, and it doesn't just apply to folk songs, although that's where we see it most notably. You only have to look at the way a song like \"Hound Dog\" changed from the Willie Mae Thornton version to the version by Elvis, which only shared a handful of words with the original. Songs change, and recombine, and everyone who sings them brings something different to them, until they change in ways that nobody could have predicted, like a game of telephone.\n\nBut there usually remains a core, an archetypal story or idea which remains constant no matter how much the song changes. Like Stagger Lee shooting Billy in a bar over a hat, or Frankie killing her man -- sometimes the man is Al, sometimes he's Johnny, but he always done her wrong.\n\nAnd one of those stories is about a man who shoots his cheating woman with a forty-four, and tries to escape -- sometimes to a town called Jericho, and sometimes to Juarez, Mexico. The first version of this song we have a recording of is by Clarence Ashley, in 1929, a recording of an older folk song that was called, in his version, \"Little Sadie\":\n\n[Excerpt: Clarence Ashley, \"Little Sadie\"]\n\nAt some point, somebody seems to have noticed that that song has a slight melodic similarity to another family of songs, the family known as \"Cocaine Blues\" or \"Take a Whiff on Me\", which was popular around the same time:\n\n[Excerpt: The Memphis Jug Band, \"Cocaine Habit Blues\"]\n\nAnd so the two songs became combined, and the protagonist of \"Little Sadie\" now had a reason to kill his woman -- a reason other than her cheating, that is. He had taken a shot of cocaine before shooting her. The first recording of this version, under the name \"Cocaine Blues\" seems to have been a Western Swing version by W. A. Nichol's Western Aces:\n\n[Excerpt: W.A. Nichol's Western Aces, \"Cocaine Blues\"]\n\nWoody Guthrie recorded a version around the same time -- I've seen different dates and so don't know for sure if it was before or after Nichol's version -- and his version had himself credited as songwriter, and included this last verse which doesn't seem to appear on any earlier recordings of the song:\n\n[Excerpt: Woody Guthrie, \"Cocaine Blues\"]\n\nThat doesn't appear on many later recordings either, but it did clearly influence yet another song -- Mose Allison's classic jazz number \"Parchman Farm\":\n\n[Excerpt: Mose Allison, \"Parchman Farm\"]\n\nThe most famous recordings of the song, though, were by Johnny Cash, who recorded it as both \"Cocaine Blues\" and as \"Transfusion Blues\". In Cash's version of the song, the murderer gets sentenced to \"ninety-nine years in the Folsom pen\", so it made sense that Cash would perform that on his most famous album, the live album of his January 1968 concerts at Folsom Prison, which revitalised his career after several years of limited success:\n\n[Excerpt: Johnny Cash, \"Cocaine Blues (live at Folsom Prison)\"]\n\nWhile that was Cash's first live recording at a prison, though, it wasn't the first show he played at a prison -- ever since the success of his single \"Folsom Prison Blues\" he'd been something of a hero to prisoners, and he had been doing shows in prisons for eleven years by the time of that recording. And on one of those shows he had as his support act a man named Billy Roberts, who performed his own song which followed the same broad outlines as \"Cocaine Blues\" -- a man with a forty-four who goes out to shoot his woman and then escapes to Mexico.\n\nRoberts was an obscure folk singer, who never had much success, but who was good with people. He'd been part of the Greenwich Village folk scene in the 1950s, and at a gig at Gerde's Folk City he'd met a woman named Niela Miller, an aspiring songwriter, and had struck up a relationship with her. Miller only ever wrote one song that got recorded by anyone else, a song called \"Mean World Blues\" that was recorded by Dave Van Ronk:\n\n[Excerpt: Dave Van Ronk, \"Mean World Blues\"]\n\nNow, that's an original song, but it does bear a certain melodic resemblance to another old folk song, one known as \"Where Did You Sleep Last Night?\" or \"In the Pines\", or sometimes \"Black Girl\":\n\n[Excerpt: Lead Belly, \"Where Did You Sleep Last Night?\"]\n\nMiller was clearly familiar with the tradition from which \"Where Did You Sleep Last Night?\" comes -- it's a type of folk song where someone asks a question and then someone else answers it, and this repeats, building up a story. This is a very old folk song format, and you hear it for example in \"Lord Randall\", the song on which Bob Dylan based \"A Hard Rain's A-Gonna Fall\":\n\n[Excerpt: Ewan MacColl, \"Lord Randall\"]\n\nI say she was clearly familiar with it, because the other song she wrote that anyone's heard was based very much around that idea. \"Baby Please Don't Go To Town\" is a question-and-answer song in precisely that form, but with an unusual chord progression for a folk song. You may remember back in the episode on \"Eight Miles High\" I talked about the circle of fifths -- a chord progression which either increases or decreases by a fifth for every chord, so it might go C-G-D-A-E\n\n[demonstrates]\n\nThat's a common progression in pop and jazz, but not really so much in folk, but it's the one that Miller had used for \"Baby, Please Don't Go to Town\", and she'd taught Roberts that song, which she only recorded much later:\n\n[Excerpt: Niela Miller, \"Baby, Please Don't Go To Town\"]\n\nAfter Roberts and Miller broke up, Miller kept playing that melody, but he changed the lyrics. The lyrics he added had several influences. There was that question-and-answer folk-song format, there's the story of \"Cocaine Blues\" with its protagonist getting a forty-four to shoot his woman down before heading to Mexico, and there's also a country hit from 1953. \"Hey, Joe!\" was originally recorded by Carl Smith, one of the most popular country singers of the early fifties:\n\n[Excerpt: Carl Smith, \"Hey Joe!\"]\n\nThat was written by Boudleaux Bryant, a few years before the songs he co-wrote for the Everly Brothers, and became a country number one, staying at the top for eight weeks. It didn't make the pop chart, but a pop cover version of it by Frankie Laine made the top ten in the US:\n\n[Excerpt: Frankie Laine, \"Hey Joe\"]\n\nLaine's record did even better in the UK, where it made number one, at a point where Laine was the biggest star in music in Britain -- at the time the UK charts only had a top twelve, and at one point four of the singles in the top twelve were by Laine, including that one.\n\nThere was also an answer record by Kitty Wells which made the country top ten later that year:\n\n[Excerpt: Kitty Wells, \"Hey Joe\"]\n\nOddly, despite it being a very big hit, that \"Hey Joe\" had almost no further cover versions for twenty years, though it did become part of the Searchers' setlist, and was included on their Live at the Star Club album in 1963, in an arrangement that owed a lot to \"What'd I Say\":\n\n[Excerpt: The Searchers, \"Hey Joe\"]\n\nBut that song was clearly on Roberts' mind when, as so many American folk musicians did, he travelled to the UK in the late fifties and became briefly involved in the burgeoning UK folk movement. In particular, he spent some time with a twelve-string guitar player from Edinburgh called Len Partridge, who was also a mentor to Bert Jansch, and who was apparently an extraordinary musician, though I know of no recordings of his work. Partridge helped Roberts finish up the song, though Partridge is about the only person in this story who *didn't* claim a writing credit for it at one time or another, saying that he just helped Roberts out and that Roberts deserved all the credit.\n\nThe first known recording of the completed song is from 1962, a few years after Roberts had returned to the US, though it didn't surface until decades later:\n\n[Excerpt: Billy Roberts, \"Hey Joe\"]\n\nRoberts was performing this song regularly on the folk circuit, and around the time of that recording he also finally got round to registering the copyright, several years after it was written.\n\nWhen Miller heard the song, she was furious, and she later said \"Imagine my surprise when I heard Hey Joe by Billy Roberts. There was my tune, my chord progression, my question/answer format. He dropped the bridge that was in my song and changed it enough so that the copyright did not protect me from his plagiarism... I decided not to go through with all the complications of dealing with him. He never contacted me about it or gave me any credit. He knows he committed a morally reprehensible act. He never was man enough to make amends and apologize to me, or to give credit for the inspiration. Dealing with all that was also why I made the decision not to become a professional songwriter. It left a bad taste in my mouth.”\n\nPete Seeger, a friend of Miller's, was outraged by the injustice and offered to testify on her behalf should she decide to take Roberts to court, but she never did.\n\nSome time around this point, Roberts also played on that prison bill with Johnny Cash, and what happened next is hard to pin down. I've read several different versions of the story, which change the date and which prison this was in, and none of the details in any story hang together properly -- everything introduces weird inconsistencies and things which just make no sense at all. Something like this basic outline of the story seems to have happened, but the outline itself is weird, and we'll probably never know the truth.\n\nRoberts played his set, and one of the songs he played was \"Hey Joe\", and at some point he got talking to one of the prisoners in the audience, Dino Valenti. We've met Valenti before, in the episode on \"Mr. Tambourine Man\" -- he was a singer/songwriter himself, and would later be the lead singer of Quicksilver Messenger Service, but he's probably best known for having written \"Get Together\":\n\n[Excerpt: Dino Valenti, \"Get Together\"]\n\nAs we heard in the \"Mr. Tambourine Man\" episode, Valenti actually sold off his rights to that song to pay for his bail at one point, but he was in and out of prison several times because of drug busts.\n\nAt this point, or so the story goes, he was eligible for parole, but he needed to prove he had a possible income when he got out, and one way he wanted to do that was to show that he had written a song that could be a hit he could make money off, but he didn't have such a song. He talked about his predicament with Roberts, who agreed to let him claim to have written \"Hey Joe\" so he could get out of prison.\n\nHe did make that claim, and when he got out of prison he continued making the claim, and registered the copyright to \"Hey Joe\" in his own name -- even though Roberts had already registered it -- and signed a publishing deal for it with Third Story Music, a company owned by Herb Cohen, the future manager of the Mothers of Invention, and Cohen's brother Mutt.\n\nValenti was a popular face on the folk scene, and he played \"his\" song to many people, but two in particular would influence the way the song would develop, both of them people we've seen relatively recently in episodes of the podcast. One of them, Vince Martin, we'll come back to later, but the other was David Crosby, and so let's talk about him and the Byrds a bit more.\n\nCrosby and Valenti had been friends long before the Byrds formed, and indeed we heard in the \"Mr. Tambourine Man\" episode how the group had named themselves after Valenti's song \"Birdses\":\n\n[Excerpt: Dino Valenti, \"Birdses\"]\n\nAnd Crosby *loved* \"Hey Joe\", which he believed was another of Valenti's songs. He'd perform it every chance he got, playing it solo on guitar in an arrangement that other people have compared to Mose Allison. He'd tried to get it on the first two Byrds albums, but had been turned down, mostly because of their manager and uncredited co-producer Jim Dickson, who had strong opinions about it, saying later \"Some of the songs that David would bring in from the outside were perfectly valid songs for other people, but did not seem to be compatible with the Byrds' myth. And he may not have liked the Byrds' myth. He fought for 'Hey Joe' and he did it. As long as I could say 'No!' I did, and when I couldn't any more they did it. You had to give him something somewhere. I just wish it was something else... 'Hey Joe' I was bitterly opposed to. A song about a guy who murders his girlfriend in a jealous rage and is on the way to Mexico with a gun in his hand. It was not what I saw as a Byrds song.\"\n\nIndeed, Dickson was so opposed to the song that he would later say “One of the reasons David engineered my getting thrown out was because I would not let Hey Joe be on the Turn! Turn! Turn! album.”\n\nDickson was, though, still working with the band when they got round to recording it. That came during the recording of their Fifth Dimension album, the album which included \"Eight Miles High\". That album was mostly recorded after the departure of Gene Clark, which was where we left the group at the end of the \"Eight Miles High\" episode, and the loss of their main songwriter meant that they were struggling for material -- doubly so since they also decided they were going to move away from Dylan covers. This meant that they had to rely on original material from the group's less commercial songwriters, and on a few folk songs, mostly learned from Pete Seeger\n\nThe album ended up with only eleven songs on it, compared to the twelve that was normal for American albums at that time, and the singles on it after \"Eight Miles High\" weren't particularly promising as to the group's ability to come up with commercial material.\n\nThe next single, \"5D\", a song by Roger McGuinn about the fifth dimension, was a waltz-time song that both Crosby and Chris Hillman were enthused by. It featured organ by Van Dyke Parks, and McGuinn said of the organ part \"When he came into the studio I told him to think Bach. He was already thinking Bach before that anyway.\":\n\n[Excerpt: The Byrds, \"5D\"]\n\nWhile the group liked it, though, that didn't make the top forty. The next single did, just about -- a song that McGuinn had written as an attempt at communicating with alien life. He hoped that it would be played on the radio, and that the radio waves would eventually reach aliens, who would hear it and respond:\n\n[Excerpt: The Byrds, \"Mr. Spaceman\"]\n\nThe \"Fifth Dimension\" album did significantly worse, both critically and commercially, than their previous albums, and the group would soon drop Allen Stanton, the producer, in favour of Gary Usher, Brian Wilson's old songwriting partner. But the desperation for material meant that the group agreed to record the song which they still thought at that time had been written by Crosby's friend, though nobody other than Crosby was happy with it, and even Crosby later said \"It was a mistake. I shouldn't have done it. Everybody makes mistakes.\"\n\nMcGuinn said later \"The reason Crosby did lead on 'Hey Joe' was because it was *his* song. He didn't write it but he was responsible for finding it. He'd wanted to do it for years but we would never let him.\":\n\n[Excerpt: The Byrds, \"Hey Joe\"]\n\nOf course, that arrangement is very far from the Mose Allison style version Crosby had been doing previously. And the reason for that can be found in the full version of that McGuinn quote, because the full version continues \"He'd wanted to do it for years but we would never let him. Then both Love and The Leaves had a minor hit with it and David got so angry that we had to let him do it. His version wasn't that hot because he wasn't a strong lead vocalist.\"\n\nThe arrangement we just heard was the arrangement that by this point almost every group on the Sunset Strip scene was playing. And the reason for that was because of another friend of Crosby's, someone who had been a roadie for the Byrds -- Bryan MacLean.\n\nMacLean and Crosby had been very close because they were both from very similar backgrounds -- they were both Hollywood brats with huge egos. MacLean later said \"Crosby and I got on perfectly. I didn't understand what everybody was complaining about, because he was just like me!\"\n\nMacLean was, if anything, from an even more privileged background than Crosby. His father was an architect who'd designed houses for Elizabeth Taylor and Dean Martin, his neighbour when growing up was Frederick Loewe, the composer of My Fair Lady. He learned to swim in Elizabeth Taylor's private pool, and his first girlfriend was Liza Minelli. Another early girlfriend was Jackie DeShannon, the singer-songwriter who did the original version of \"Needles and Pins\", who he was introduced to by Sharon Sheeley, whose name you will remember from many previous episodes.\n\nMacLean had wanted to be an artist until his late teens, when he walked into a shop in Westwood which sometimes sold his paintings, the Sandal Shop, and heard some people singing folk songs there. He decided he wanted to be a folk singer, and soon started performing at the Balladeer, a club which would later be renamed the Troubadour, playing songs like Robert Johnson's \"Cross Roads Blues\", which had recently become a staple of the folk repertoire after John Hammond put out the King of the Delta Blues Singers album:\n\n[Excerpt: Robert Johnson, \"Cross Roads Blues\"]\n\nReading interviews with people who knew MacLean at the time, the same phrase keeps coming up. John Kay, later the lead singer of Steppenwolf, said \"There was a young kid, Bryan MacLean, kind of cocky but nonetheless a nice kid, who hung around Crosby and McGuinn\" while Chris Hillman said \"He was a pretty good kid but a wee bit cocky.\"\n\nHe was a fan of the various musicians who later formed the Byrds, and was also an admirer of a young guitarist on the scene named Ryland Cooder, and of a blues singer on the scene named Taj Mahal. He apparently was briefly in a band with Taj Mahal, called Summer's Children, who as far as I can tell had no connection to the duo that Curt Boettcher later formed of the same name, before Taj Mahal and Cooder formed The Rising Sons, a multi-racial blues band who were for a while the main rivals to the Byrds on the scene.\n\nMacLean, though, firmly hitched himself to the Byrds, and particularly to Crosby. He became a roadie on their first tour, and Hillman said \"He was a hard-working guy on our behalf. As I recall, he pretty much answered to Crosby and was David’s assistant, to put it diplomatically – more like his gofer, in fact.\"\n\nBut MacLean wasn't cut out for the hard work that being a roadie required, and after being the Byrds' roadie for about thirty shows, he started making mistakes, and when they went off on their UK tour they decided not to keep employing him. He was heartbroken, but got back into trying his own musical career.\n\nHe auditioned for the Monkees, unsuccessfully, but shortly after that -- some sources say even the same day as the audition, though that seems a little too neat -- he went to Ben Frank's -- the LA hangout that had actually been namechecked in the open call for Monkees auditions, which said they wanted \"Ben Franks types\", and there he met Arthur Lee and Johnny Echols. Echols would later remember \"He was this gadfly kind of character who knew everybody and was flitting from table to table. He wore striped pants and a scarf, and he had this long, strawberry hair. All the girls loved him. For whatever reason, he came and sat at our table. Of course, Arthur and I were the only two black people there at the time.\"\n\nLee and Echols were both Black musicians who had been born in Memphis. Lee's birth father, Chester Taylor, had been a cornet player with Jimmie Lunceford, whose Delta Rhythm Boys had had a hit with \"The Honeydripper\", as we heard way back in the episode on \"Rocket '88\":\n\n[Excerpt: Jimmie Lunceford and the Delta Rhythm Boys, \"The Honeydripper\"]\n\nHowever, Taylor soon split from Lee's mother, a schoolteacher, and she married Clinton Lee, a stonemason, who doted on his adopted son, and they moved to California. They lived in a relatively prosperous area of LA, a neighbourhood that was almost all white, with a few Asian families, though the boxer Sugar Ray Robinson lived nearby. A year or so after Arthur and his mother moved to LA, so did the Echols family, who had known them in Memphis, and they happened to move only a couple of streets away. Eight year old Arthur Lee reconnected with seven-year-old Johnny Echols, and the two became close friends from that point on.\n\nArthur Lee first started out playing music when his parents were talked into buying him an accordion by a salesman who would go around with a donkey, give kids free donkey rides, and give the parents a sales pitch while they were riding the donkey, He soon gave up on the accordion and persuaded his parents to buy him an organ instead -- he was a spoiled child, by all accounts, with a TV in his bedroom, which was almost unheard of in the late fifties.\n\nJohnny Echols had a similar experience which led to his parents buying him a guitar, and the two were growing up in a musical environment generally. They attended Dorsey High School at the same time as both Billy Preston and Mike Love of the Beach Boys, and Ella Fitzgerald and her then-husband, the great jazz bass player Ray Brown, lived in the same apartment building as the Echols family for a while. Ornette Coleman, the free-jazz saxophone player, lived next door to Echols, and Adolphus Jacobs, the guitarist with the Coasters, gave him guitar lessons. Arthur Lee also knew Johnny Otis, who ran a pigeon-breeding club for local children which Arthur would attend.\n\nEchols was the one who first suggested that he and Arthur should form a band, and they put together a group to play at a school talent show, performing \"Last Night\", the instrumental that had been a hit for the Mar-Keys on Stax records:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nThey soon became a regular group, naming themselves Arthur Lee and the LAGs -- the LA Group, in imitation of Booker T and the MGs – the Memphis Group. At some point around this time, Lee decided to switch from playing organ to playing guitar. He would say later that this was inspired by seeing Johnny \"Guitar\" Watson get out of a gold Cadillac, wearing a gold suit, and with gold teeth in his mouth.\n\nThe LAGs started playing as support acts and backing bands for any blues and soul acts that came through LA, performing with Big Mama Thornton, Johnny Otis, the O'Jays, and more. Arthur and Johnny were both still under-age, and they would pencil in fake moustaches to play the clubs so they'd appear older.\n\nIn the fifties and early sixties, there were a number of great electric guitar players playing blues on the West Coast -- Johnny \"Guitar\" Watson, T-Bone Walker, Guitar Slim, and others -- and they would compete with each other not only to play well, but to put on a show, and so there was a whole bag of stage tricks that West Coast R&B guitarists picked up, and Echols learned all of them -- playing his guitar behind his back, playing his guitar with his teeth, playing with his guitar between his legs.\n\nAs well as playing their own shows, the LAGs also played gigs under other names -- they had a corrupt agent who would book them under the name of whatever Black group had a hit at the time, in the belief that almost nobody knew what popular groups looked like anyway, so they would go out and perform as the Drifters or the Coasters or half a dozen other bands.\n\nBut Arthur Lee in particular wanted to have success in his own right. He would later say \"When I was a little boy I would listen to Nat 'King' Cole and I would look at that purple Capitol Records logo. I wanted to be on Capitol, that was my goal. Later on I used to walk from Dorsey High School all the way up to the Capitol building in Hollywood -- did that many times. I was determined to get a record deal with Capitol, and I did, without the help of a fancy manager or anyone else. I talked to Adam Ross and Jack Levy at Ardmore-Beechwood. I talked to Kim Fowley, and then I talked to Capitol\".\n\nThe record that the LAGs released, though, was not very good, a track called \"Rumble-Still-Skins\":\n\n[Excerpt: The LAGs, \"Rumble-Still-Skins\"]\n\nLee later said \"I was young and very inexperienced and I was testing the record company. I figured if I gave them my worst stuff and they ripped me off I wouldn't get hurt. But it didn't work, and after that I started giving my best, and I've been doing that ever since.\"\n\nThe LAGs were dropped by Capitol after one single, and for the next little while Arthur and Johnny did work for smaller labels, usually labels owned by Bob Keane, with Arthur writing and producing and Johnny playing guitar -- though Echols has said more recently that a lot of the songs that were credited to Arthur as sole writer were actually joint compositions.\n\nMost of these records were attempts at copying the style of other people. There was \"I Been Trying\", a Phil Spector soundalike released by Little Ray:\n\n[Excerpt: Little Ray, \"I Been Trying\"]\n\nAnd there were a few attempts at sounding like Curtis Mayfield, like \"Slow Jerk\" by Ronnie and the Pomona Casuals:\n\n[Excerpt: Ronnie and the Pomona Casuals, \"Slow Jerk\"]\n\nand \"My Diary\" by Rosa Lee Brooks:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nEchols was also playing with a lot of other people, and one of the musicians he was playing with, his old school friend Billy Preston, told him about a recent European tour he'd been on with Little Richard, and the band from Liverpool he'd befriended while he was there who idolised Richard, so when the Beatles hit America, Arthur and Johnny had some small amount of context for them. They soon broke up the LAGs and formed another group, the American Four, with two white musicians, bass player John Fleckenstein and drummer Don Costa. Lee had them wear wigs so they seemed like they had longer hair, and started dressing more eccentrically -- he would soon become known for wearing glasses with one blue lens and one red one, and, as he put it \"wearing forty pounds of beads, two coats, three shirts, and wearing two pairs of shoes on one foot\".\n\nAs well as the Beatles, the American Four were inspired by the other British Invasion bands -- Arthur was in the audience for the TAMI show, and quite impressed by Mick Jagger -- and also by the Valentinos, Bobby Womack's group. They tried to get signed to SAR Records, the label owned by Sam Cooke for which the Valentinos recorded, but SAR weren't interested, and they ended up recording for Bob Keane's Del-Fi records, where they cut \"Luci Baines\", a \"Twist and Shout\" knock-off with lyrics referencing the daughter of new US President Lyndon Johnson:\n\n[Excerpt: The American Four, \"Luci Baines\"]\n\nBut that didn't take off any more than the earlier records had. Another American Four track, \"Stay Away\", was recorded but went unreleased until 2006:\n\n[Excerpt: Arthur Lee and the American Four, \"Stay Away\"]\n\nSoon the American Four were changing their sound and name again. This time it was because of two bands who were becoming successful on the Sunset Strip. One was the Byrds, who to Lee's mind were making music like the stuff he heard in his head, and the other was their rivals the Rising Sons, the blues band we mentioned earlier with Taj Mahal and Ry Cooder. Lee was very impressed by them as an multiracial band making aggressive, loud, guitar music, though he would always make the point when talking about them that they were a blues band, not a rock band, and *he* had the first multiracial rock band.\n\nWhatever they were like live though, in their recordings, produced by the Byrds' first producer Terry Melcher, the Rising Sons often had the same garage band folk-punk sound that Lee and Echols would soon make their own:\n\n[Excerpt: The Rising Sons, \"Take a Giant Step\"]\n\nBut while the Rising Sons recorded a full album's worth of material, only one single was released before they split up, and so the way was clear for Lee and Echols' band, now renamed once again to The Grass Roots, to become the Byrds' new challengers. Lee later said \"I named the group The Grass Roots behind a trip, or an album I heard that Malcolm X did, where he said 'the grass roots of the people are out in the street doing something about their problems instead of sitting around talking about it'\".\n\nAfter seeing the Rolling Stones and the Byrds live, Lee wanted to get up front and move like Mick Jagger, and not be hindered by playing a guitar he wasn't especially good at -- both the Stones and the Byrds had two guitarists and a frontman who just sang and played hand percussion, and these were the models that Lee was following for the group. He also thought it would be a good idea commercially to get a good-looking white boy up front. So the group got in another guitarist, a white pretty boy who Lee soon fell out with and gave the nickname \"Bummer Bob\" because he was unpleasant to be around. Those of you who know exactly why Bobby Beausoleil later became famous will probably agree that this was a more than reasonable nickname to give him (and those of you who don't, I'll be dealing with him when we get to 1969).\n\nSo when Bryan MacLean introduced himself to Lee and Echols, and they found out that not only was he also a good-looking white guitarist, but he was also friends with the entire circle of hipsters who'd been going to Byrds gigs, people like Vito and Franzoni, and he could get a massive crowd of them to come along to gigs for any band he was in and make them the talk of the Sunset Strip scene, he was soon in the Grass Roots, and Bummer Bob was out.\n\nThe Grass Roots soon had to change their name again, though. In 1965, Jan and Dean recorded their \"Folk and Roll\" album, which featured \"The Universal Coward\"...\n\nWhich I am not going to excerpt again. I only put that pause in to terrify Tilt, who edits these podcasts, and has very strong opinions about that song.\n\nBut P. F. Sloan and Steve Barri, the songwriters who also performed as the Fantastic Baggies, had come up with a song for that album called \"Where Where You When I Needed You?\":\n\n[Excerpt: Jan and Dean, \"Where Were You When I Needed You?\"]\n\nSloan and Barri decided to cut their own version of that song under a fake band name, and then put together a group of other musicians to tour as that band. They just needed a name, and Lou Adler, the head of Dunhill Records, suggested they call themselves The Grass Roots, and so that's what they did:\n\n[Excerpt: The Grass Roots, \"Where Were You When I Needed You?\"]\n\nEchols would later claim that this was deliberate malice on Adler's part -- that Adler had come in to a Grass Roots show drunk, and pretended to be interested in signing them to a contract, mostly to show off to a woman he'd brought with him. Echols and MacLean had spoken to him, not known who he was, and he'd felt disrespected, and Echols claims that he suggested the name to get back at them, and also to capitalise on their local success.\n\nThe new Grass Roots soon started having hits, and so the old band had to find another name, which they got as a joking reference to a day job Lee had had at one point -- he'd apparently worked in a specialist bra shop, Luv Brassieres, which the rest of the band found hilarious. The Grass Roots became Love.\n\nWhile Arthur Lee was the group's lead singer, Bryan MacLean would often sing harmonies, and would get a song or two to sing live himself. And very early in the group's career, when they were playing a club called Bido Lito's, he started making his big lead spot a version of \"Hey Joe\", which he'd learned from his old friend David Crosby, and which soon became the highlight of the group's set. Their version was sped up, and included the riff which the Searchers had popularised in their cover version of  \"Needles and Pins\", the song originally recorded by MacLean's old girlfriend Jackie DeShannon:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThat riff is a very simple one to play, and variants of it became very, very, common among the LA bands, most notably on the Byrds' \"I'll Feel a Whole Lot Better\":\n\n[Excerpt: The Byrds, \"I'll Feel a Whole Lot Better\"]\n\nThe riff was so ubiquitous in the LA scene that in the late eighties Frank Zappa would still cite it as one of his main memories of the scene. I'm going to quote from his autobiography, where he's talking about the differences between the LA scene he was part of and the San Francisco scene he had no time for:\n\n\"The Byrds were the be-all and end-all of Los Angeles rock then. They were 'It' -- and then a group called Love was 'It.' There were a few 'psychedelic' groups that never really got to be 'It,' but they could still find work and get record deals, including the West Coast Pop Art Experimental Band, Sky Saxon and the Seeds, and the Leaves (noted for their cover version of \"Hey, Joe\").\n\nWhen we first went to San Francisco, in the early days of the Family Dog, it seemed that everybody was wearing the same costume, a mixture of Barbary Coast and Old West -- guys with handlebar mustaches, girls in big bustle dresses with feathers in their hair, etc. By contrast, the L.A. costumery was more random and outlandish.\n\nMusically, the northern bands had a little more country style. In L.A., it was folk-rock to death. Everything had that\" [and here Zappa uses the adjectival form of a four-letter word beginning with 'f' that the main podcast providers don't like you saying on non-adult-rated shows] \"D chord down at the bottom of the neck where you wiggle your finger around -- like 'Needles and Pins.'\"\n\nThe reason Zappa describes it that way, and the reason it became so popular, is that if you play that riff in D, the chords are D, Dsus2, and Dsus4 which means you literally only wiggle one finger on your left hand:\n\n[demonstrates]\n\nAnd so you get that on just a ton of records from that period, though Love, the Byrds, and the Searchers all actually play the riff on A rather than D:\n\n[demonstrates]\n\nSo that riff became the Big Thing in LA after the Byrds popularised the Searchers sound there, and Love added it to their arrangement of \"Hey Joe\".\n\nIn January 1966, the group would record their arrangement of it for their first album, which would come out in March:\n\n[Excerpt: Love, \"Hey Joe\"]\n\nBut that wouldn't be the first recording of the song, or of Love's arrangement of it – although other than the Byrds' version, it would be the only one to come out of LA with the original Billy Roberts lyrics. Love's performances of the song at Bido Lito's had become the talk of the Sunset Strip scene, and soon every band worth its salt was copying it, and it became one of those songs like \"Louie Louie\" before it that everyone would play.\n\nThe first record ever made with the \"Hey Joe\" melody actually had totally different lyrics. Kim Fowley had the idea of writing a sequel to \"Hey Joe\", titled \"Wanted Dead or Alive\", about what happened after Joe shot his woman and went off. He produced the track for The Rogues, a group consisting of Michael Lloyd and Shaun Harris, who later went on to form the West Coast Pop Art Experimental Band, and Lloyd and Harris were the credited writers:\n\n[Excerpt: The Rogues, \"Wanted Dead or Alive\"]\n\nThe next version of the song to come out was the first by anyone to be released as \"Hey Joe\", or at least as \"Hey Joe, Where You Gonna Go?\", which was how it was titled on its initial release. This was by a band called The Leaves, who were friends of Love, and had picked up on \"Hey Joe\", and was produced by Nik Venet. It was also the first to have the now-familiar opening line \"Hey Joe, where you going with that gun in your hand?\":\n\n[Excerpt: The Leaves, \"Hey Joe Where You Gonna Go?\"]\n\nRoberts' original lyric, as sung by both Love and the Byrds, had been \"where you going with that money in your hand?\", and had Joe headed off to *buy* the gun. But as Echols later said “What happened was Bob Lee from The Leaves, who were friends of ours, asked me for the words to 'Hey Joe'. I told him I would have the words the next day. I decided to write totally different lyrics. The words you hear on their record are ones I wrote as a joke. The original words to Hey Joe are ‘Hey Joe, where you going with that money in your hand? Well I’m going downtown to buy me a blue steel .44. When I catch up with that woman, she won’t be running round no more.’ It never says ‘Hey Joe where you goin’ with that gun in your hand.’ Those were the words I wrote just because I knew they were going to try and cover the song before we released it. That was kind of a dirty trick that I played on The Leaves, which turned out to be the words that everybody uses.”\n\nThat first release by the Leaves also contained an extra verse -- a nod to Love's previous name:\n\n[Excerpt: The Leaves, \"Hey Joe Where You Gonna Go?\"]\n\nThat original recording credited the song as public domain -- apparently Bryan MacLean had refused to tell the Leaves who had written the song, and so they assumed it was traditional. It came out in November 1965, but only as a promo single.\n\nEven before the Leaves, though, another band had recorded \"Hey Joe\", but it didn't get released. The Sons of Adam had started out as a surf group called the Fender IV, who made records like \"Malibu Run\":\n\n[Excerpt: The Fender IV, \"Malibu Run\"]\n\nKim Fowley had suggested they change their name to the Sons of Adam, and they were another group who were friends with Love -- their drummer, Michael Stuart-Ware, would later go on to join Love, and Arthur Lee wrote the song \"Feathered Fish\" for them:\n\n[Excerpt: Sons of Adam, \"Feathered Fish\"]\n\nBut while they were the first to record \"Hey Joe\", their version has still to this day not been released. Their version was recorded for Decca, with producer Gary Usher, but before it was released, another Decca artist also recorded the song, and the label weren't sure which one to release. And then the label decided to press Usher to record a version with yet another act -- this time with the Surfaris, the surf group who had had a hit with \"Wipe Out\". Coincidentally, the Surfaris had just changed bass players -- their most recent bass player, Ken Forssi, had quit and joined Love, whose own bass player, John Fleckenstein, had gone off to join the Standells, who would also record a version of “Hey Joe” in 1966.\n\nUsher thought that the Sons of Adam were much better musicians than the Surfaris, who he was recording with more or less under protest, but their version, using Love's arrangement and the \"gun in your hand\" lyrics, became the first version to come out on a major label:\n\n[Excerpt: The Surfaris, \"Hey Joe\"]\n\nThey believed the song was in the public domain, and so the songwriting credits on the record are split between Gary Usher, a W. Hale who nobody has been able to identify, and Tony Cost, a pseudonym for Nik Venet.\n\nUsher said later \"I got writer's credit on it because I was told, or I assumed at the time, the song was Public Domain; meaning a non-copyrighted song. It had already been cut two or three times, and on each occasion the writing credit had been different. On a traditional song, whoever arranges it, takes the songwriting credit. I may have changed a few words and arranged and produced it, but I certainly did not co-write it.\"\n\nThe public domain credit also appeared on the Leaves' second attempt to cut the song, which was actually given a general release, but flopped. But when the Leaves cut the song for a *third* time, still for the same tiny label, Mira, the track became a hit in May 1966, reaching number thirty-one:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nAnd *that* version had what they thought was the correct songwriting credit, to Dino Valenti.\n\nWhich came as news to Billy Roberts, who had registered the copyright to the song back in 1962 and had no idea that it had become a staple of LA garage rock until he heard his song in the top forty with someone else's name on the credits. He angrily confronted Third Story Music, who agreed to a compromise -- they would stop giving Valenti songwriting royalties and start giving them to Roberts instead, so long as he didn't sue them and let them keep the publishing rights. Roberts was indignant about this -- he deserved all the money, not just half of it -- but he went along with it to avoid a lawsuit he might not win.\n\nSo Roberts was now the credited songwriter on the versions coming out of the LA scene. But of course, Dino Valenti had been playing \"his\" song to other people, too. One of those other people was Vince Martin. Martin had been a member of a folk-pop group called the Tarriers, whose members also included the future film star Alan Arkin, and who had had a hit in the 1950s with \"Cindy, Oh Cindy\":\n\n[Excerpt: The Tarriers, \"Cindy, Oh Cindy\"]\n\nBut as we heard in the episode on the Lovin' Spoonful, he had become a Greenwich Village folkie, in a duo with Fred Neil, and recorded an album with him, \"Tear Down the Walls\":\n\n[Excerpt: Fred Neil and Vince Martin, \"Morning Dew\"]\n\nThat song we just heard, \"Morning Dew\", was another question-and-answer folk song. It was written by the Canadian folk-singer Bonnie Dobson, but after Martin and Neil recorded it, it was picked up on by Martin's friend Tim Rose who stuck his own name on the credits as well, without Dobson's permission, for a version which made the song into a rock standard for which he continued to collect royalties:\n\n[Excerpt: Tim Rose, \"Morning Dew\"]\n\nThis was something that Rose seems to have made a habit of doing, though to be fair to him it went both ways. We heard about him in the Lovin' Spoonful episode too, when he was in a band named the Big Three with Cass Elliot and her coincidentally-named future husband Jim Hendricks, who recorded this song, with Rose putting new music to the lyrics of the old public domain song \"Oh! Susanna\":\n\n[Excerpt: The Big Three, \"The Banjo Song\"]\n\nThe band Shocking Blue used that melody for their 1969 number-one hit \"Venus\", and didn't give Rose any credit:\n\n[Excerpt: Shocking Blue, \"Venus\"]\n\nBut another song that Rose picked up from Vince Martin was \"Hey Joe\". Martin had picked the song up from Valenti, but didn't know who had written it, or who was claiming to have written it, and told Rose he thought it might be an old Appalchian murder ballad or something. Rose took the song and claimed writing credit in his own name -- he would always, for the rest of his life, claim it was an old folk tune he'd heard in Florida, and that he'd rewritten it substantially himself, but no evidence of the song has ever shown up from prior to Roberts' copyright registration, and Rose's version is basically identical to Roberts' in melody and lyrics. But Rose takes his version at a much slower pace, and his version would be the model for the most successful versions going forward, though those other versions would use the lyrics Johnny Echols had rewritten, rather than the ones Rose used:\n\n[Excerpt: Tim Rose, \"Hey Joe\"]\n\nRose's version got heard across the Atlantic as well. And in particular it was heard by Chas Chandler, the bass player of the Animals. Some sources seem to suggest that Chandler first heard the song performed by a group called the Creation, but in a biography I've read of that group they clearly state that they didn't start playing the song until 1967.\n\nBut however he came across it, when Chandler heard Rose's recording, he knew that the song could be a big hit for someone, but he didn't know who. And then he bumped into Linda Keith, Keith Richards' girlfriend,  who took him to see someone whose guitar we've already heard in this episode:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nThe Curtis Mayfield impression on guitar there was, at least according to many sources the first recording session ever played on by a guitarist then calling himself Maurice (or possibly Mo-rees) James. We'll see later in the story that it possibly wasn't his first -- there are conflicting accounts, as there are about a lot of things, and it was recorded either in very early 1964, in which case it was his first, or (as seems more likely, and as I tell the story later) a year later, in which case he'd played on maybe half a dozen tracks in the studio by that point. But it was still a very early one.\n\nAnd by late 1966 that guitarist had reverted to the name by which he was brought up, and was calling himself Jimi Hendrix. Hendrix and Arthur Lee had become close, and Lee would later claim that Hendrix had copied much of Lee's dress style and attitude -- though many of Hendrix's other colleagues and employers, including Little Richard, would make similar claims -- and most of them had an element of truth, as Lee's did. Hendrix was a sponge. But Lee did influence him. Indeed, one of Hendrix's *last* sessions, in March 1970, was guesting on an album by Love:\n\n[Excerpt: Love with Jimi Hendrix, \"Everlasting First\"]\n\nHendrix's name at birth was Johnny Allen Hendrix, which made his father, James Allen Hendrix, known as Al, who was away at war when his son was born, worry that he'd been named after another man who might possibly be the real father, so the family just referred to the child as \"Buster\" to avoid the issue. When Al Hendrix came back from the war the child was renamed James Marshall Hendrix -- James after Al's first name, Marshall after Al's dead brother -- though the family continued calling him \"Buster\".\n\nLittle James Hendrix Junior didn't have anything like a stable home life. Both his parents were alcoholics, and Al Hendrix was frequently convinced that Jimi's mother Lucille was having affairs and became abusive about it. They had six children, four of whom were born disabled, and Jimi was the only one to remain with his parents -- the rest were either fostered or adopted at birth, fostered later on because the parents weren't providing a decent home life, or in one case made a ward of state because the Hendrixes couldn't afford to pay for a life-saving operation for him. The only one that Jimi had any kind of regular contact with was the second brother, Leon, his parents' favourite, who stayed with them for several years before being fostered by a family only a few blocks away.\n\nAl and Lucille Hendrix frequently split and reconciled, and while they were ostensibly raising Jimi (and for a  few years Leon), he was shuttled between them and various family members and friends, living sometimes in Seattle where his parents lived and sometimes in Vancouver with his paternal grandmother. He was frequently malnourished, and often survived because friends' families fed him. Al Hendrix was also often physically and emotionally abusive of the son he wasn't sure was his.\n\nJimi grew up introverted, and stuttering, and only a couple of things seemed to bring him out of his shell. One was science fiction -- he always thought that his nickname, Buster, came from Buster Crabbe, the star of the Flash Gordon serials he loved to watch, though in fact he got the nickname even before that interest developed, and he was fascinated with ideas about aliens and UFOs -- and the other was music. Growing up in Seattle in the forties and fifties, most of the music he was exposed to as a child and in his early teens was music made by and for white people -- there wasn't a very large Black community in the area at the time compared to most major American cities, and so there were no prominent R&B stations. As a kid he loved the music of Bob Wills and the Texas Playboys, and when he was thirteen Jimi's favourite record was Dean Martin's \"Memories are Made of This\":\n\n[Excerpt: Dean Martin, \"Memories are Made of This\"]\n\nHe also, like every teenager, became a fan of rock and roll music. When Elvis played at a local stadium when Jimi was fifteen, he couldn't afford a ticket, but he went and sat on top of a nearby hill and watched the show from the distance.\n\nJimi's first exposure to the blues also came around this time, when his father briefly took in lodgers, Cornell and Ernestine Benson, and Ernestine had a record collection that included records by Lightnin' Hopkins, Howlin' Wolf, and Muddy Waters, all of whom Jimi became a big fan of, especially Muddy Waters. The Bensons' most vivid memory of Jimi in later years was him picking up a broom and pretending to play guitar along with these records:\n\n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n\nShortly after this, it would be Ernestine Benson who would get Jimi his very first guitar. By this time Jimi and Al had lost their home and moved into a boarding house, and the owner's son had an acoustic guitar with only one string that he was planning to throw out. When Jimi asked if he could have it instead of it being thrown out, the owner told him he could have it for five dollars. Al Hendrix refused to pay that much for it, but Ernestine Benson bought Jimi the guitar. She said later “He only had one string, but he could really make that string talk.”\n\nHe started carrying the guitar on his back everywhere he went, in imitation of Sterling Hayden in the western Johnny Guitar, and eventually got some more strings for it and learned to play. He would play it left-handed -- until his father came in. His father had forced him to write with his right hand, and was convinced that left-handedness was the work of the devil, so Jimi would play left-handed while his father was somewhere else, but as soon as Al came in he would flip the guitar the other way up and continue playing the song he had been playing, now right-handed.\n\nJimi's mother died when he was fifteen, after having been ill for a long time with drink-related problems, and Jimi and his brother didn't get to go to the funeral -- depending on who you believe, either Al gave Jimi the bus fare and told him to go by himself and Jimi was too embarrassed to go to the funeral alone on the bus, or Al actually forbade Jimi and Leon from going.  After this, he became even more introverted than he was before, and he also developed a fascination with the idea of angels, convinced his mother now was one.\n\nJimi started to hang around with a friend called Pernell Alexander, who also had a guitar, and they would play along together with Elmore James records. The two also went to see Little Richard and Bill Doggett perform live, and while Jimi was hugely introverted, he did start to build more friendships in the small Seattle music scene, including with Ron Holden, the man we talked about in the episode on \"Louie Louie\" who introduced that song to Seattle, and who would go on to record with Bruce Johnston for Bob Keane:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nEventually Ernestine Benson persuaded Al Hendrix to buy Jimi a decent electric guitar on credit -- Al also bought himself a saxophone at the same time, thinking he might play music with his son, but sent it back once the next payment became due.\n\nAs well as blues and R&B, Jimi was soaking up the guitar instrumentals and garage rock that would soon turn into surf music. The first song he learned to play was \"Tall Cool One\" by the Fabulous Wailers, the local group who popularised a version of \"Louie Louie\" based on Holden's one:\n\n[Excerpt: The Fabulous Wailers, \"Tall Cool One\"]\n\nAs we talked about in the \"Louie Louie\" episode, the Fabulous Wailers used to play at a venue called the Spanish Castle, and Jimi was a regular in the audience, later writing his song \"Spanish Castle Magic\" about those shows:\n\n[Excerpt: The Jimi Hendrix Experience, \"Spanish Castle Magic\"]\n\nHe was also a big fan of Duane Eddy, and soon learned Eddy's big hits \"Forty Miles of Bad Road\", \"Because They're Young\", and \"Peter Gunn\" -- a song he would return to much later in his life:\n\n[Excerpt: Jimi Hendrix, \"Peter Gunn/Catastrophe\"]\n\nHis career as a guitarist didn't get off to a great start -- the first night he played with his first band, he was meant to play two sets, but he was fired after the first set, because he was playing in too flashy a manner and showing off too much on stage. His girlfriend suggested that he might want to tone it down a little, but he said \"That's not my style\".  This would be a common story for the next several years.\n\nAfter that false start, the first real band he was in was the Velvetones, with his friend Pernell Alexander. There were four guitarists, two piano players, horns and drums, and they dressed up with glitter stuck to their pants. They played Duane Eddy songs, old jazz numbers, and \"Honky Tonk\" by Bill Doggett, which became Hendrix's signature song with the band.\n\n[Excerpt: Bill Doggett, \"Honky Tonk\"]\n\nHis father was unsupportive of his music career, and he left his guitar at Alexander's house because he was scared that his dad would smash it if he took it home. At the same time he was with the Velvetones, he was also playing with another band called the Rocking Kings, who got gigs around the Seattle area, including at the Spanish Castle. But as they left school, most of Hendrix's friends were joining the Army, in order to make a steady living, and so did he -- although not entirely by choice. He was arrested, twice, for riding in stolen cars, and he was given a choice -- either go to prison, or sign up for the Army for three years. He chose the latter.\n\nAt first, the Army seemed to suit him. He was accepted into the 101st Airborne Division, the famous \"Screaming Eagles\", whose actions at D-Day made them legendary in the US, and he was proud to be a member of the Division. They were based out of Fort Campbell, the base near Clarksville we talked about a couple of episodes ago, and while he was there he met a bass player, Billy Cox, who he started playing with.\n\nAs Cox and Hendrix were Black, and as Fort Campbell straddled the border between Kentucky and Tennessee, they had to deal with segregation and play to only Black audiences. And Hendrix quickly discovered that Black audiences in the Southern states weren't interested in \"Louie Louie\", Duane Eddy, and surf music, the stuff he'd been playing in Seattle. He had to instead switch to playing Albert King and Slim Harpo songs, but luckily he loved that music too. He also started singing at this point -- when Hendrix and Cox started playing together, in a trio called the Kasuals, they had no singer, and while Hendrix never liked his own voice, Cox was worse, and so Hendrix was stuck as the singer.\n\nThe Kasuals started gigging around Clarksville, and occasionally further afield, places like Nashville, where Arthur Alexander would occasionally sit in with them. But Cox was about to leave the Army, and Hendrix had another two and a bit years to go, having enlisted for three years. They couldn't play any further away unless Hendrix got out of the Army, which he was increasingly unhappy in anyway, and so he did the only thing he could -- he pretended to be gay, and got discharged on medical grounds for homosexuality. In later years he would always pretend he'd broken his ankle parachuting from a plane.\n\nFor the next few years, he would be a full-time guitarist, and spend the periods when he wasn't earning enough money from that leeching off women he lived with, moving from one to another as they got sick of him or ran out of money.\n\nThe Kasuals expanded their lineup, adding a second guitarist, Alphonso Young, who would show off on stage by playing guitar with his teeth. Hendrix didn't like being upstaged by another guitarist, and quickly learned to do the same.\n\nOne biography I've used as a source for this says that at this point, Billy Cox played on a session for King Records, for Frank Howard and the Commanders, and brought Hendrix along, but the producer thought that Hendrix's guitar was too frantic and turned his mic off.\n\nBut other sources say the session Hendrix and Cox played on for the Commanders wasn't until three years later, and the record *sounds* like a 1965 record, not a 1962 one, and his guitar is very audible – and the record isn't on King. But we've not had any music to break up the narration for a little while, and it's a good track (which later became a Northern Soul favourite) so I'll play a section here, as either way it was certainly an early Hendrix session:\n\n[Excerpt: Frank Howard and the Commanders, \"I'm So Glad\"]\n\nThis illustrates a general problem with Hendrix's life at this point -- he would flit between bands, playing with the same people at multiple points, nobody was taking detailed notes, and later, once he became famous, everyone wanted to exaggerate their own importance in his life, meaning that while the broad outlines of his life are fairly clear, any detail before late 1966 might be hopelessly wrong.\n\nBut all the time, Hendrix was learning his craft. One story from around this time  sums up both Hendrix's attitude to his playing -- he saw himself almost as much as a scientist as a musician -- and his slightly formal manner of speech.  He challenged the best blues guitarist in Nashville to a guitar duel, and the audience actually laughed at Hendrix's playing, as he was totally outclassed. When asked what he was doing, he replied “I was simply trying to get that B.B. King tone down and my experiment failed.”\n\nBookings for the King Kasuals dried up, and he went to Vancouver, where he spent a couple of months playing in a covers band, Bobby Taylor and the Vancouvers, whose lead guitarist was Tommy Chong, later to find fame as one half of Cheech and Chong. But he got depressed at how white Vancouver was, and travelled back down south to join a reconfigured King Kasuals, who now had a horn section.\n\nThe new lineup of King Kasuals were playing the chitlin circuit and had to put on a proper show, and so Hendrix started using all the techniques he'd seen other guitarists on the circuit use -- playing with his teeth like Alphonso Young, the other guitarist in the band, playing with his guitar behind his back like T-Bone Walker, and playing with a fifty-foot cord that allowed him to walk into the crowd and out of the venue, still playing, like Guitar Slim used to.\n\nAs well as playing with the King Kasuals, he started playing the circuit as a sideman. He got short stints with many of the second-tier acts on the circuit -- people who had had one or two hits, or were crowd-pleasers, but weren't massive stars, like Carla Thomas or Jerry Butler or Slim Harpo. The first really big name he played with was Solomon Burke, who when Hendrix joined his band had just released \"Just Out of Reach (Of My Two Empty Arms)\":\n\n[Excerpt: Solomon Burke, \"Just Out of Reach (Of My Two Empty Arms)\"]\n\nBut he lacked discipline. “Five dates would go beautifully,” Burke later said, “and then at the next show, he’d go into this wild stuff that wasn’t part of the song. I just couldn’t handle it anymore.”\n\nBurke traded him to Otis Redding, who was on the same tour, for two horn players, but then Redding fired him a week later and they left him on the side of the road.\n\nHe played in the backing band for the Marvelettes, on a tour with Curtis Mayfield, who would be another of Hendrix's biggest influences, but he accidentally blew up Mayfield's amp and got sacked. On another tour, Cecil Womack threw Hendrix's guitar off the bus while he slept.\n\nIn February 1964 he joined the band of the Isley Brothers, and he would watch the Beatles on Ed Sullivan with them during his first days with the group. Assuming he hadn't already played the Rosa Lee Brooks session (and I think there's good reason to believe he hadn't), then the first record Hendrix played on was their single \"Testify\":\n\n[Excerpt: The Isley Brothers, \"Testify\"]\n\nWhile he was with them, he also moonlighted on Don Covay's big hit \"Mercy, Mercy\":\n\n[Excerpt: Don Covay and the Goodtimers, \"Mercy Mercy\"]\n\nAfter leaving the Isleys, Hendrix joined the minor soul singer Gorgeous George, and on a break from Gorgeous George's tour, in Memphis, he went to Stax studios in the hope of meeting Steve Cropper, one of his idols. When he was told that Cropper was busy in the studio, he waited around all day until Cropper finished, and introduced himself. Hendrix was amazed to discover that Cropper was white -- he'd assumed that he must be Black -- and Cropper was delighted to meet the guitarist who had played on \"Mercy Mercy\", one of his favourite records. The two spent hours showing each other guitar licks -- Hendrix playing Cropper's right-handed guitar, as he hadn't brought along his own.\n\nShortly after this, he joined Little Richard's band, and once again came into conflict with the star of the show by trying to upstage him. For one show he wore a satin shirt, and after the show Richard screamed at him “I am the only Little Richard! I am the King of Rock and Roll, and I am the only one allowed to be pretty. Take that shirt off!”\n\nWhile he was with Richard, Hendrix played on his \"I Don't Know What You've Got, But It's Got Me\", which like \"Mercy Mercy\" was written by Don Covay, who had started out as Richard's chauffeur:\n\n[Excerpt: Little Richard, \"I Don't Know What You've Got, But It's Got Me\"]\n\nAccording to the most likely version of events I've read, it was while he was working for Richard that Hendrix met Rosa Lee Brooks, on New Year's Eve 1964. At this point he was using the name Maurice James, apparently in tribute to the blues guitarist Elmore James, and he used various names, including Jimmy James, for most of his pre-fame performances.\n\nRosa Lee Brooks was an R&B singer who had been mentored by Johnny \"Guitar\" Watson, and when she met Hendrix she was singing in a girl group who were one of the support acts for Ike & Tina Turner, who Hendrix went to see on his night off. Hendrix met Brooks afterwards, and told her she looked like his mother -- a line he used on a lot of women, but which was true in her case if photos are anything to go by. The two got into a relationship, and were soon talking about becoming a duo like Ike and Tina or Mickey and Sylvia -- \"Love is Strange\" was one of Hendrix's favourite records. But the only recording they made together was the \"My Diary\" single. Brooks always claimed that she actually wrote that song, but the label credit is for Arthur Lee, and it sounds like his work to me, albeit him trying hard to write like Curtis Mayfield, just as Hendrix is trying to play like him:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nBrooks and Hendrix had a very intense relationship for a short period. Brooks would later recall Little Richard trying to persuade them to have sex while he watched, which they refused to do, and Hendrix soon quit playing for Little Richard and joined Ike and Tina Turner's band. But then Ike Turner fired him for being too flashy, and he rejoined Little Richard, quitting (or being fired) again when the tour hit New York.\n\nHendrix soon ran out of money and sent Brooks a letter from New York saying he'd had to pawn his guitar -- a line he used on women he was asking for money all the time. She sent him forty dollars and a photo, but never heard from him again.\n\nBrooks would go on to have a minor career as a singer, but would never have any great success. You can get an idea of the kind of thing she did from one of the oddest records she made -- it was still normal at this time for hits to be covered for different markets, though it wasn't anything like as common as it had been even a few years earlier, and so in 1966, a few weeks after the original came out, Brooks recorded what was publicised as \"The R&B version\" of \"They're Coming to Take Me Away, Ha-Ha\", the song that had been a hit for Napoleon XIV:\n\n[Excerpt: Rose Brooks, \"They're Coming to Take Me Away, Ha-Ha\"]\n\nSadly she died in December last year.\n\nIn New York, Hendrix hit the lowest point of his professional career. After having played with some of the best performers on the circuit, he was reduced to playing with a local band, Curtis Knight and the Squires, whose lead singer was actually just a pimp who sang a bit on the side. The one advantage of the Squires was that they allowed Hendrix to show off a bit -- with no real star, and not even really any particularly good musicians in the band other than him, he was given the space to play what he wanted, at least on stage.\n\nKnight had a contract with a record producer, Ed Chalpin, who made knockoff cover versions for overseas markets and other exploitation records, and Chalpin signed Hendrix to a recording contract, mostly to work as a sideman. At this time, he played on such terrible records as Curtis Knight's \"How Do You Feel?\", a rip-off of \"Like a Rolling Stone\":\n\n[Excerpt: Curtis Knight, \"How Would You Feel?\"]\n\nHe also played bass on \"As the Clouds Drift By\", by the fading film star Jayne Mansfield:\n\n[Excerpt; Jayne Mansfield, \"As the Clouds Drift By\"]\n\nIn all, he recorded thirty-three sides with Chalpin, none of them of any worth, and which would be endlessly repackaged under Hendrix's name later.\n\nHis career picked up slightly when he joined Joey Dee and the Starliters, the group who'd had a hit a couple of years earlier with \"Peppermint Twist\" and were still getting reasonably good bookings -- and this was his first experience of playing in a multiracial band since his early days playing around Seattle. He moved on from Joey Dee to King Curtis, the great saxophone player who'd played on so many hits on Atlantic Records, and played with Curtis on \"Instant Groove\":\n\n[Excerpt: King Curtis, \"Instant Groove\"]\n\nBut soon he was back playing with Curtis Knight again. And it was when he was playing with Curtis Knight that he met the person who would change his life.\n\nLinda Keith was, at this time, Keith Richards' girlfriend. She was a model, she was twenty years old, and she shared Richards' massive love of the blues. She'd flown over to New York a month before the Stones were due to tour the US, so she could spend some time exploring the clubs. And when she walked in to the tiny club that Curtis Knight and the Squires were playing, she was astonished to see one of the greatest blues guitarists she'd ever heard, playing with a terrible band.\n\nShe struck up a conversation with the guitarist, who was calling himself Jimmy James. and invited him back to a party with her friends. At the party someone offered him acid, and it says everything about the difference between the white and Black music scenes in New York at this point that his reply was, in all sincerity, \"No, I don’t want any of that, but I’d love to try some of that LSD stuff\". He had no idea that acid and LSD were the same thing, as among the musicians he was playing with, LSD was regarded as a \"white drug\", and some of Hendrix's friends would seriously try to talk him out of taking it in future by saying that it made you \"think like a white man\".\n\nWhile he was on acid, he saw himself in the mirror and was convinced he looked just like Marilyn Monroe. And then Linda Keith put on what he became convinced was the greatest album ever, Bob Dylan's new album Blonde on Blonde:\n\n[Excerpt: Bob Dylan, \"Just Like a Woman\"]\n\nHendrix was already a big fan of Dylan. He'd even taken to styling his hair in imitation of what he called Dylan's \"white Afro\", putting it in curlers to get the same look. But he thought Blonde on Blonde was even better than anything else he'd heard from Dylan, and became obsessed with the record.\n\nHendrix bonded with Linda Keith over their shared love of both Dylan and blues. Their relationship remained platonic -- a rarity among Hendrix's relationships with women -- but Keith became determined she would use her contacts to make this guitarist a star.\n\nShortly after this meeting, after playing a gig with another bad R&B band, Hendrix was approached by a member of the audience -- a Black folk musician named Richie Havens who loved Hendrix's playing. They got talking, and they too bonded over a love for Dylan. Havens mentioned that he would often perform his own version of \"Just Like a Woman\" from Dylan's new album:\n\n[Excerpt: Richie Havens, \"Just Like a Woman\"]\n\nHendrix said he'd like to listen to that, and so Havens told him about the Greenwich Village folk clubs where he played. Hendrix went down to see Havens, and then started hanging around the Village a lot, especially a place called the Cafe Wha?, where Tim Rose used to play, and it was there that he picked up on Rose's slow version of \"Hey Joe\".\n\nHendrix decided that he was going to start playing the Greenwich Village scene, and he put together a band called Jimmy James and the Blue Flames, named after the band that backed Junior Parker, the blues musician who did the original version of \"Mystery Train\". The band had a revolving lineup that at various times included Randy California, later to become famous in the band Spirit, and Jeff \"Skunk\" Baxter, who would go on to play with Steely Dan and the Doobie Brothers.\n\nAnd Hendrix absolutely blew the Greenwich Village crowds away.\n\nYou see, you'll notice that there are roughly three types of story that successful musicians have for the beginning of their career -- three broad shapes they fall into. The first is the one that, say, the Beach Boys or Elvis had -- someone who has literally never played a gig in their lives goes into a small record label and cuts a local hit, then gets picked up by a major label. In the case of the Beach Boys and Elvis, that obviously led to substantial careers with huge artistic and commercial success, but that's also the story behind a hell of a lot of one-hit wonders.\n\nThen there's the one that most of the Greenwich Village folk scene, the British trad and skiffle scenes, and the British blues bands, mostly fall into -- people with some live experience, but not that much, playing odd gigs for six months or a year or so, mostly as a kind of gentleman amateur, playing in front of your friends from art school or the local left-wing activist group, half of whom are also musicians playing those same venues, and who are willing to put up with a bit of sloppiness if you're enthusiastic enough and you know the catalogue number of the original issue of \"Jim Jackson's Kansas City Blues\" on the Vocalion label. Those scenes would often produce great songwriters, but usually rather mediocre musicians, and when they did produce a genuinely good musician, it was usually someone who played in a very scholarly fashion -- expertly reproducing someone else's sound in a rather clinical way, rather than innovating.\n\nBut then there's the people who played the Chitlin Circuit and the equivalent white working class country venues. Places where you were playing multiple shows a day, every day, for audiences of poor people who insist on value for money if they're spending some of what little they have on a night out after a hard week of working, and who will throw fruit at best, and bottles at worst, at you if you weren't putting on a good show. To survive playing those venues, you had to be an exceptional musician, *and* an exceptional entertainer. You had to be able to put on a show while you were playing expertly, and if you couldn't play your guitar behind your head, perfectly in tune, while you were also doing the synchronised dance routine for the lead singer's latest single they only recorded the day before, well there were plenty of other musicians out there who wanted the gig.\n\nAnd the crowds at the Cafe Wha?, where Jimmy James and the Blue Flames were playing, were crowds whose experience of music was almost entirely from type two, and they were now watching a performer of type three. On the Chitlin Circuit, Hendrix had been one of the best players around, but not so far ahead of everyone else that he couldn't be replaced if he started thinking himself more important than the star. On the Greenwich Village folk scene, though, he was unlike anything anyone had seen.\n\nRichie Havens sent Mike Bloomfield, the guitarist with the Paul Butterfield Blues Band who'd played on several Dylan sessions, and was widely regarded as the best rock guitarist in New York, to see the Blue Flames, and he said \"Hendrix knew who I was and that day, in front of my eyes, he burned me to death. H-bombs were going off, guided missiles were flying—I can’t tell you the sounds he was getting out of his instrument. He was getting every sound I was ever to hear him get, right there in that room with a Stratocaster. . . . How he did this, I wish I understood.”\n\nThe Blue Flames' set was mostly covers of contemporary hits, but they also did \"Hey Joe\", at the same speed that Tim Rose played it, but with the lyrics as rewritten by Johnny Echols, though without the grass roots verse:\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe\"]\n\nAs well as playing with the Blue Flames, Hendrix was also playing with other artists on the Greenwich Village scene, like John Hammond junior, who brought his father along to see Hendrix. Hammond senior was unimpressed, but one of the people who worked at the cafe where they played later said \"He just blew everybody away. He played behind his back, all that stuff he had stolen from T-Bone Walker. We thought he invented it. No one there realised there was a Black tradition that went back to the 1920s.”\n\nMeanwhile Linda Keith was trying to get other people interested. She wasn't helped by the fact that when the Rolling Stones came over, Keith Richards became convinced that she was having an affair with Hendrix, and became very jealous of him, which put Andrew Oldham off from signing him to Immediate Records -- though Keith also says that Hendrix's music was fundamentally not to Oldham's taste, as Oldham was far more interested in Phil Spector and the Beach Boys than in blues-based guitar rock.\n\nBut then she bumped into Chas Chandler, the bass player of the Animals. The Animals were going to split up at the end of the tour, and Chandler was planning on going into management and production in partnership with Mike Jeffrey, the Animals' manager, who seemed to have a variety of dodgy underworld connections. Chandler had even decided on what record he was going to produce -- he was convinced that Tim Rose's arrangement of \"Hey Joe\" could be a hit, if he could find someone good to play it.\n\nKeith told him to come and see Jimmy James and the Blue Flames, and when they opened their set with \"Hey Joe\", Chandler got so excited he spilled his milkshake all over himself.\n\nChandler had to finish his tour, and in the meantime Linda Keith split up with Keith Richards, who took revenge on her by telling her father she was dating a \"Black junkie\" -- her father had her made a ward of the court as she was not yet twenty-one, flew over from England and dragged her back with him. But when the Animals tour finished, Chandler returned to New York, tracked Hendrix down, and persuaded him to come over to the UK. When he left New York, Jimi had forty dollars in his pocket, borrowed from John Hammond junior's drummer, and his only other possessions in the world were his guitar, a single change of clothes, his hair curlers, and a jar of cream for his acne.\n\nIn the UK, Hendrix was an immediate sensation. At the time, the biggest guitar hero in the country was Eric Clapton, who had recently formed the group Cream:\n\n[Excerpt: Cream, \"I Feel Free\"]\n\n75) We'll be dealing with Cream in a future episode, so I won't talk too much about them now, but the important thing here is that Clapton was considered so great that \"Clapton is God\" was a popular graffito in London at the time. Chandler prevailed upon his acquaintance with the band to get them to let Hendrix get up on stage with them and jam on Howlin' Wolf's \"Killing Floor\", and Hendrix started doing things on guitar that Clapton found unimaginable, his jaw dropping on stage. Jack Bruce, Cream's bassist, later said \"It must have been difficult for Eric to handle, because he was ‘God,’ and this unknown person comes along, and *burns*.”\n\nAlso in the audience was Jeff Beck, the *other* great guitar hero in Britain, and he was similarly impressed. Everyone knew that there was a new best guitarist in town. Now all he needed was a band and a record.\n\nThe question of a band caused some conflict between Hendrix and Chandler. Hendrix wanted a big band of the kind he was used to playing with, with a horn section, but Chandler was insistent that what he needed was a small rock group without too many other instruments. Chandler at first tried to get Brian Auger and the Trinity to drop their guitarist and install Hendrix as guitarist and frontman, but Auger quite rightly refused to do so, and so Chandler decided to put together a band for Hendrix. Auger did, though, let Hendrix sit in with the group one night, which gave Hendrix his first experience of playing through a Marshall amp, which quickly became his favoured equipment.\n\nThe first person they took on was Noel Redding, who Chandler discovered in the auditions for Eric Burdon's New Animals, which Chandler was attending. Redding was a guitarist, but Chandler persuaded him to change to bass, and Hendrix liked him because he had hair like Bob Dylan's, so he was in the group.\n\nChandler's connections were paying off for Hendrix in ways that he couldn't have imagined even a few months earlier. Hendrix got a girlfriend, Kathy Etchingham, who was part of the London scene, and they happened to bump into Ringo Starr in a club. Etchingham complained that they were living in a rather cramped hotel room, and Starr had a spare two-bedroom flat in one of the most expensive parts of central London he wasn't using, so he let it to them for thirty pounds a month, and Hendrix and Etchingham moved into one bedroom while Chandler and his girlfriend took the other.\n\nHendrix was for the most part just going to clubs, getting on stage with more famous musicians, and playing a couple of songs using all the tricks he learned on the chitlin circuit, blowing the other musicians off stage. At one of these events, Johnny Hallyday was in the audience. Hallyday was known as \"the French Elvis\", but he had recently started trying to update his music, making records with psychedelic and soul elements, with Brian Auger on keyboards and Mick Jones, later of Foreigner, on guitar, and covering recent hits from other countries in French:\n\n[Excerpt: Johnny Hallyday, \"Je veux te graver dans ma vie\"]\n\nHallyday was impressed by Hendrix, and invited him to be his support act on a residency at the Paris Olympia and a couple of warm-up gigs before that, at the bottom of the bill with Brian Auger between Hendrix and the main attraction. The very first gigs for the Jimi Hendrix Experience -- a name chosen by Mike Jeffrey -- would be supporting France's biggest ever rock star.\n\nOf course, that meant that they needed a drummer, and the one they chose was actually the ex drummer of the Blue Flames -- but not Hendrix's old band the Blue Flames, nor Junior Parker's band of that name, but rather the band that backed the British R&B keyboardist and Mose Allison soundalike Georgie Fame:\n\n[Excerpt: Georgie Fame and the Blue Flames, \"See Saw\"]\n\nMitch Mitchell had been given drum lessons by Jim Marshall, and had played briefly with the Who when they were finding a drummer to replace Doug Sandom, and with the Pretty Things, but was best known as a child actor, having appeared in the film Bottoms Up with Jimmy Edwards, Melvyn Hayes, and Richard Briers:\n\n[Excerpt: Bottoms Up]\n\nHe had also starred as the schoolboy Jennings in the TV series based on the series of school novels by Anthony Buckeridge.\n\nMitchell was chosen as the result of a coin-toss, the other option being Aynsley Dunbar, but he turned out to be perfect for the group, and after fairly rough try-out shows, by the time the group hit the Olympia they were receiving an overwhelming reception -- so much so that in early 1967, Johnny Hallyday recorded this:\n\n[Excerpt: Johnny Hallyday, \"Hey Joe\"]\n\nA week after the Olympia show -- a month after Hendrix first arrived in the UK with no money and no possessions -- the group were in the studio to record their first single. For a B-side, Hendrix wanted to rerecord \"Mercy Mercy\", the Don Covay song he'd played on, but Chandler explained to him that the real money was in songwriting, so he should write a song, and Hendrix came up with \"Stone Free\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Stone Free\"]\n\nThe A-side, of course, was going to be \"Hey Joe\", and while they were going to use Hendrix's bluesy guitar part and the Echols version of the lyrics, Chandler also wanted to have the same kind of build that Tim Rose's version had. Rose had had block backing vocals, so Chandler brought in Britain's top session-singing girl group the Breakaways. The Breakaways had started out as part of the Vernons Girls, a sixteen-piece female choir formed from staff at Vernons football pools company in Liverpool, who had come to fame on Oh Boy!\n\nAfter Oh Boy! the Vernons Girls had split into several smaller groups, one keeping the name The Vernons Girls and going on to make some rather fun girl-group records, often written by future Vicar of Dibley star Trevor Peacock:\n\n[Excerpt: The Vernons Girls, \"You Know What I Mean\"]\n\nAnother of the small groups formed from the large one had gone on to become the Fordettes, backing Emile Ford, the singer who was one of Britain's first Black pop stars and had the first UK number one of the sixties with a record produced by Joe Meek. Then one of them had become engaged to Joe Brown, so they'd broken away from Ford and become the Breakaways, backing Brown. They'd made some singles of their own, like \"That's How it Goes\":\n\n[Excerpt: The Breakaways, \"That's How it Goes\"]\n\nBut they'd become best known as session singers, providing backing vocals for Cilla Black, Cliff Richard, Lulu, and Petula Clark -- that's them singing on \"Downtown\":\n\n[Excerpt: Petula Clark, \"Downtown\"]\n\nSo Chandler brought them in to sing the backing vocals, which became a crucial part of the record, providing the block chordal support that might otherwise be provided by a keyboard or rhythm guitar, allowing the members of the Experience to improvise over their solid backing:\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe\"]\n\nBut while they'd recorded their first single, they had no label yet -- Chandler and Jeffreys had sunk their own money into the sessions, just knowing that the single would be a hit. The first few labels they took it to turned them down, but while that was going on the press grew steadily more interested in Hendrix -- though there was a problem for his publicist when writing his first press biography, because Hendrix had played with so many great musicians they were actually worried he would look like he was lying if they named them all.\n\nHendrix was now making some money, but was living off a £15 a week salary he was being paid by Chandler and Jeffreys as an advance against future royalties, and was short enough on cash that when Little Richard appeared in London, Hendrix went backstage to see if he could get fifty dollars that Richard owed him in unpaid salary from his time with the band. Richard countered that Hendrix had missed the band bus and so he'd been fined that fifty dollars, and Hendrix left empty handed\n\nEventually, the Jimi Hendrix Experience was signed to Track Records, the new label being set up by Kit Lambert and Chris Stamp, the Who's managers, partly on the recommendation of Pete Townshend, who after being unimpressed with Hendrix on first meeting him, was wowed by seeing him live and became one of his biggest admirers. The new label got the group an appearance on Ready Steady Go!, the biggest music TV show in Britain, for the same day that the record came out, and it quickly entered the top ten.\n\nJimi Hendrix had started 1966 living penniless in New York, playing for a band that nobody liked, facing eviction, and going hungry. He ended the year a pop star, living in a luxury flat owned by another pop star, with every important guitarist in Britain worshipping him. For Jimi Hendrix, as for the music world generally, 1966 had been a revolutionary year that had changed everything. And as we head into 1967, we're going to see how the ripples from those changes spread out and change the whole of society.",
  "itunes:subtitle": "Episode one hundred and forty-seven of A History of Rock Music in Five Hundred Songs looks at “Hey Joe by the Jimi Hendrix Experience, and is the longest episode to date, at over two hours.\n\nPatreon backers also have a twenty-two-minute bonus episode ava",
  "itunes:keywords": "Andrew Oldham,Arthur Lee,Billy Cox,Billy Preston,Bob Keane,Bobby Beausoleil,Brian Auger,Bryan Maclean,Chas Chandler,Chris Stamp,Cream,Dave van Ronk,David Crosby,Dino Valenti,Don Covay,Eric Clapton,Felice and Boudleaux Bryant,Frank Zappa,Gary Usher,Jackie DeShannon,Jan and Dean,Jim Dickson,Jimi Hendrix,Johnny Cash,Johnny Echols,Johnny Hallyday,Keith Richards,Kim Fowley,King Curtis,Kit Lambert,Linda Keith,Little Richard,Lou Adler,Love,Mike Bloomfield,Mitch Mitchell,Nik Venet,Noel Redding,Otis Redding,P.F. Sloan,Pete Seeger,Richie Havens,Ry Cooder,Sharon Sheeley,Solomon Burke,Steve Barri,Steve Cropper,Taj Mahal,Terry Melcher,The Animals,The Breakaways,The Byrds,The Fabulous Wailers,The Grass Roots,The Isley Brothers,The Leaves,the Monkees,The Rising Sons,The Searchers,Tim Rose,Van Dyke Parks,Vernons Girls,West Coast Pop Art Experimental Band,Woody Guthrie",
  "itunes:episodeType": "full",
  "itunes:episode": 147,
  "content:encoded": "Episode one hundred and forty-seven of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Hey Joe\" by the Jimi Hendrix Experience, and is the longest episode to date, at over two hours.\n\nPatreon backers also have a twenty-two-minute bonus episode available, <a href=\"https://www.patreon.com/posts/65195363\">on \"Making Time\" by The Creation</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've put together <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-147-hey-joe/\">a Mixcloud mix</a> containing all the music excerpted in this episode.\n\nFor information on the Byrds, I relied mostly on <a href=\"https://amzn.to/3rsesTF\">Timeless Flight Revisited by Johnny Rogan,</a> with some information from <a href=\"https://amzn.to/36RTDrp\">Chris Hillman’s autobiography</a>.\n\nInformation on Arthur Lee and Love came from <a href=\"https://amzn.to/3Er1LPK\"><em>Forever Changes: Arthur Lee and the Book of Love</em> by John Einarson</a>, and <a href=\"https://amzn.to/3jKi0O5\"><em>Arthur Lee: Alone Again Or</em> by Barney Hoskyns.</a>\n\nInformation on Gary Usher's work with the Surfaris and the Sons of Adam came from <em>The California Sound</em> by Stephen McParland, which can be found at <a href=\"https://payhip.com/CMusicBooks\">https://payhip.com/CMusicBooks</a>\n\nInformation on Jimi Hendrix came from <a href=\"https://amzn.to/3JMP82g\"><em>Room Full of Mirrors </em></a>by Charles R. Cross, <a href=\"https://amzn.to/3OqS1JU\"><em>Crosstown Traffic</em> by Charles Shaar Murray</a>, and <a href=\"https://amzn.to/37l2sOc\"><em>Wild Thing</em> by Philip Norman</a>.\n\nInformation on the history of \"Hey Joe\" itself came from all these sources plus <a href=\"https://amzn.to/3M87499\"><em>Hey Joe: The Unauthorised Biography of a Rock Classic</em> by Marc Shapiro</a>, though note that most of that book is about post-1967 cover versions.\n\nMost of the pre-Experience session work by Jimi Hendrix I excerpt in this episode is on <a href=\"https://amzn.to/3KQ2Y5w\">this box set of alternate takes and live recordings</a>. And \"Hey Joe\" can be found on <em><a href=\"https://amzn.to/3ryfMFV\">Are You Experienced?</a></em>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nJust a quick note before we start – this episode deals with a song whose basic subject is a man murdering a woman, and that song also contains references to guns, and in some versions to cocaine use. Some versions excerpted also contain misogynistic slurs. If those things are likely to upset you, please skip this episode, as the whole episode focusses on that song. I would hope it goes without saying that I don't approve of misogyny, intimate partner violence, or murder, and my discussing a song does not mean I condone acts depicted in its lyrics, and the episode itself deals with the writing and recording of the song rather than its subject matter, but it would be impossible to talk about the record without excerpting the song. The normalisation of violence against women in rock music lyrics is a subject I will come back to, but did not have room for in what is already a very long episode. Anyway, on with the show.\n\nLet's talk about the folk process, shall we? We've talked before, like in the episodes on \"Stagger Lee\" and \"Ida Red\", about how there are some songs that aren't really individual songs in themselves, but are instead collections of related songs that might happen to share a name, or a title, or a story, or a melody, but which might be different in other ways.\n\nThere are probably more songs that are like this than songs that aren't, and it doesn't just apply to folk songs, although that's where we see it most notably. You only have to look at the way a song like \"Hound Dog\" changed from the Willie Mae Thornton version to the version by Elvis, which only shared a handful of words with the original. Songs change, and recombine, and everyone who sings them brings something different to them, until they change in ways that nobody could have predicted, like a game of telephone.\n\nBut there usually remains a core, an archetypal story or idea which remains constant no matter how much the song changes. Like Stagger Lee shooting Billy in a bar over a hat, or Frankie killing her man -- sometimes the man is Al, sometimes he's Johnny, but he always done her wrong.\n\nAnd one of those stories is about a man who shoots his cheating woman with a forty-four, and tries to escape -- sometimes to a town called Jericho, and sometimes to Juarez, Mexico. The first version of this song we have a recording of is by Clarence Ashley, in 1929, a recording of an older folk song that was called, in his version, \"Little Sadie\":\n\n[Excerpt: Clarence Ashley, \"Little Sadie\"]\n\nAt some point, somebody seems to have noticed that that song has a slight melodic similarity to another family of songs, the family known as \"Cocaine Blues\" or \"Take a Whiff on Me\", which was popular around the same time:\n\n[Excerpt: The Memphis Jug Band, \"Cocaine Habit Blues\"]\n\nAnd so the two songs became combined, and the protagonist of \"Little Sadie\" now had a reason to kill his woman -- a reason other than her cheating, that is. He had taken a shot of cocaine before shooting her. The first recording of this version, under the name \"Cocaine Blues\" seems to have been a Western Swing version by W. A. Nichol's Western Aces:\n\n[Excerpt: W.A. Nichol's Western Aces, \"Cocaine Blues\"]\n\nWoody Guthrie recorded a version around the same time -- I've seen different dates and so don't know for sure if it was before or after Nichol's version -- and his version had himself credited as songwriter, and included this last verse which doesn't seem to appear on any earlier recordings of the song:\n\n[Excerpt: Woody Guthrie, \"Cocaine Blues\"]\n\nThat doesn't appear on many later recordings either, but it did clearly influence yet another song -- Mose Allison's classic jazz number \"Parchman Farm\":\n\n[Excerpt: Mose Allison, \"Parchman Farm\"]\n\nThe most famous recordings of the song, though, were by Johnny Cash, who recorded it as both \"Cocaine Blues\" and as \"Transfusion Blues\". In Cash's version of the song, the murderer gets sentenced to \"ninety-nine years in the Folsom pen\", so it made sense that Cash would perform that on his most famous album, the live album of his January 1968 concerts at Folsom Prison, which revitalised his career after several years of limited success:\n\n[Excerpt: Johnny Cash, \"Cocaine Blues (live at Folsom Prison)\"]\n\nWhile that was Cash's first live recording at a prison, though, it wasn't the first show he played at a prison -- ever since the success of his single \"Folsom Prison Blues\" he'd been something of a hero to prisoners, and he had been doing shows in prisons for eleven years by the time of that recording. And on one of those shows he had as his support act a man named Billy Roberts, who performed his own song which followed the same broad outlines as \"Cocaine Blues\" -- a man with a forty-four who goes out to shoot his woman and then escapes to Mexico.\n\nRoberts was an obscure folk singer, who never had much success, but who was good with people. He'd been part of the Greenwich Village folk scene in the 1950s, and at a gig at Gerde's Folk City he'd met a woman named Niela Miller, an aspiring songwriter, and had struck up a relationship with her. Miller only ever wrote one song that got recorded by anyone else, a song called \"Mean World Blues\" that was recorded by Dave Van Ronk:\n\n[Excerpt: Dave Van Ronk, \"Mean World Blues\"]\n\nNow, that's an original song, but it does bear a certain melodic resemblance to another old folk song, one known as \"Where Did You Sleep Last Night?\" or \"In the Pines\", or sometimes \"Black Girl\":\n\n[Excerpt: Lead Belly, \"Where Did You Sleep Last Night?\"]\n\nMiller was clearly familiar with the tradition from which \"Where Did You Sleep Last Night?\" comes -- it's a type of folk song where someone asks a question and then someone else answers it, and this repeats, building up a story. This is a very old folk song format, and you hear it for example in \"Lord Randall\", the song on which Bob Dylan based \"A Hard Rain's A-Gonna Fall\":\n\n[Excerpt: Ewan MacColl, \"Lord Randall\"]\n\nI say she was clearly familiar with it, because the other song she wrote that anyone's heard was based very much around that idea. \"Baby Please Don't Go To Town\" is a question-and-answer song in precisely that form, but with an unusual chord progression for a folk song. You may remember back in the episode on \"Eight Miles High\" I talked about the circle of fifths -- a chord progression which either increases or decreases by a fifth for every chord, so it might go C-G-D-A-E\n\n[demonstrates]\n\nThat's a common progression in pop and jazz, but not really so much in folk, but it's the one that Miller had used for \"Baby, Please Don't Go to Town\", and she'd taught Roberts that song, which she only recorded much later:\n\n[Excerpt: Niela Miller, \"Baby, Please Don't Go To Town\"]\n\nAfter Roberts and Miller broke up, Miller kept playing that melody, but he changed the lyrics. The lyrics he added had several influences. There was that question-and-answer folk-song format, there's the story of \"Cocaine Blues\" with its protagonist getting a forty-four to shoot his woman down before heading to Mexico, and there's also a country hit from 1953. \"Hey, Joe!\" was originally recorded by Carl Smith, one of the most popular country singers of the early fifties:\n\n[Excerpt: Carl Smith, \"Hey Joe!\"]\n\nThat was written by Boudleaux Bryant, a few years before the songs he co-wrote for the Everly Brothers, and became a country number one, staying at the top for eight weeks. It didn't make the pop chart, but a pop cover version of it by Frankie Laine made the top ten in the US:\n\n[Excerpt: Frankie Laine, \"Hey Joe\"]\n\nLaine's record did even better in the UK, where it made number one, at a point where Laine was the biggest star in music in Britain -- at the time the UK charts only had a top twelve, and at one point four of the singles in the top twelve were by Laine, including that one.\n\nThere was also an answer record by Kitty Wells which made the country top ten later that year:\n\n[Excerpt: Kitty Wells, \"Hey Joe\"]\n\nOddly, despite it being a very big hit, that \"Hey Joe\" had almost no further cover versions for twenty years, though it did become part of the Searchers' setlist, and was included on their Live at the Star Club album in 1963, in an arrangement that owed a lot to \"What'd I Say\":\n\n[Excerpt: The Searchers, \"Hey Joe\"]\n\nBut that song was clearly on Roberts' mind when, as so many American folk musicians did, he travelled to the UK in the late fifties and became briefly involved in the burgeoning UK folk movement. In particular, he spent some time with a twelve-string guitar player from Edinburgh called Len Partridge, who was also a mentor to Bert Jansch, and who was apparently an extraordinary musician, though I know of no recordings of his work. Partridge helped Roberts finish up the song, though Partridge is about the only person in this story who *didn't* claim a writing credit for it at one time or another, saying that he just helped Roberts out and that Roberts deserved all the credit.\n\nThe first known recording of the completed song is from 1962, a few years after Roberts had returned to the US, though it didn't surface until decades later:\n\n[Excerpt: Billy Roberts, \"Hey Joe\"]\n\nRoberts was performing this song regularly on the folk circuit, and around the time of that recording he also finally got round to registering the copyright, several years after it was written.\n\nWhen Miller heard the song, she was furious, and she later said \"Imagine my surprise when I heard Hey Joe by Billy Roberts. There was my tune, my chord progression, my question/answer format. He dropped the bridge that was in my song and changed it enough so that the copyright did not protect me from his plagiarism... I decided not to go through with all the complications of dealing with him. He never contacted me about it or gave me any credit. He knows he committed a morally reprehensible act. He never was man enough to make amends and apologize to me, or to give credit for the inspiration. Dealing with all that was also why I made the decision not to become a professional songwriter. It left a bad taste in my mouth.”\n\nPete Seeger, a friend of Miller's, was outraged by the injustice and offered to testify on her behalf should she decide to take Roberts to court, but she never did.\n\nSome time around this point, Roberts also played on that prison bill with Johnny Cash, and what happened next is hard to pin down. I've read several different versions of the story, which change the date and which prison this was in, and none of the details in any story hang together properly -- everything introduces weird inconsistencies and things which just make no sense at all. Something like this basic outline of the story seems to have happened, but the outline itself is weird, and we'll probably never know the truth.\n\nRoberts played his set, and one of the songs he played was \"Hey Joe\", and at some point he got talking to one of the prisoners in the audience, Dino Valenti. We've met Valenti before, in the episode on \"Mr. Tambourine Man\" -- he was a singer/songwriter himself, and would later be the lead singer of Quicksilver Messenger Service, but he's probably best known for having written \"Get Together\":\n\n[Excerpt: Dino Valenti, \"Get Together\"]\n\nAs we heard in the \"Mr. Tambourine Man\" episode, Valenti actually sold off his rights to that song to pay for his bail at one point, but he was in and out of prison several times because of drug busts.\n\nAt this point, or so the story goes, he was eligible for parole, but he needed to prove he had a possible income when he got out, and one way he wanted to do that was to show that he had written a song that could be a hit he could make money off, but he didn't have such a song. He talked about his predicament with Roberts, who agreed to let him claim to have written \"Hey Joe\" so he could get out of prison.\n\nHe did make that claim, and when he got out of prison he continued making the claim, and registered the copyright to \"Hey Joe\" in his own name -- even though Roberts had already registered it -- and signed a publishing deal for it with Third Story Music, a company owned by Herb Cohen, the future manager of the Mothers of Invention, and Cohen's brother Mutt.\n\nValenti was a popular face on the folk scene, and he played \"his\" song to many people, but two in particular would influence the way the song would develop, both of them people we've seen relatively recently in episodes of the podcast. One of them, Vince Martin, we'll come back to later, but the other was David Crosby, and so let's talk about him and the Byrds a bit more.\n\nCrosby and Valenti had been friends long before the Byrds formed, and indeed we heard in the \"Mr. Tambourine Man\" episode how the group had named themselves after Valenti's song \"Birdses\":\n\n[Excerpt: Dino Valenti, \"Birdses\"]\n\nAnd Crosby *loved* \"Hey Joe\", which he believed was another of Valenti's songs. He'd perform it every chance he got, playing it solo on guitar in an arrangement that other people have compared to Mose Allison. He'd tried to get it on the first two Byrds albums, but had been turned down, mostly because of their manager and uncredited co-producer Jim Dickson, who had strong opinions about it, saying later \"Some of the songs that David would bring in from the outside were perfectly valid songs for other people, but did not seem to be compatible with the Byrds' myth. And he may not have liked the Byrds' myth. He fought for 'Hey Joe' and he did it. As long as I could say 'No!' I did, and when I couldn't any more they did it. You had to give him something somewhere. I just wish it was something else... 'Hey Joe' I was bitterly opposed to. A song about a guy who murders his girlfriend in a jealous rage and is on the way to Mexico with a gun in his hand. It was not what I saw as a Byrds song.\"\n\nIndeed, Dickson was so opposed to the song that he would later say “One of the reasons David engineered my getting thrown out was because I would not let Hey Joe be on the Turn! Turn! Turn! album.”\n\nDickson was, though, still working with the band when they got round to recording it. That came during the recording of their Fifth Dimension album, the album which included \"Eight Miles High\". That album was mostly recorded after the departure of Gene Clark, which was where we left the group at the end of the \"Eight Miles High\" episode, and the loss of their main songwriter meant that they were struggling for material -- doubly so since they also decided they were going to move away from Dylan covers. This meant that they had to rely on original material from the group's less commercial songwriters, and on a few folk songs, mostly learned from Pete Seeger\n\nThe album ended up with only eleven songs on it, compared to the twelve that was normal for American albums at that time, and the singles on it after \"Eight Miles High\" weren't particularly promising as to the group's ability to come up with commercial material.\n\nThe next single, \"5D\", a song by Roger McGuinn about the fifth dimension, was a waltz-time song that both Crosby and Chris Hillman were enthused by. It featured organ by Van Dyke Parks, and McGuinn said of the organ part \"When he came into the studio I told him to think Bach. He was already thinking Bach before that anyway.\":\n\n[Excerpt: The Byrds, \"5D\"]\n\nWhile the group liked it, though, that didn't make the top forty. The next single did, just about -- a song that McGuinn had written as an attempt at communicating with alien life. He hoped that it would be played on the radio, and that the radio waves would eventually reach aliens, who would hear it and respond:\n\n[Excerpt: The Byrds, \"Mr. Spaceman\"]\n\nThe \"Fifth Dimension\" album did significantly worse, both critically and commercially, than their previous albums, and the group would soon drop Allen Stanton, the producer, in favour of Gary Usher, Brian Wilson's old songwriting partner. But the desperation for material meant that the group agreed to record the song which they still thought at that time had been written by Crosby's friend, though nobody other than Crosby was happy with it, and even Crosby later said \"It was a mistake. I shouldn't have done it. Everybody makes mistakes.\"\n\nMcGuinn said later \"The reason Crosby did lead on 'Hey Joe' was because it was *his* song. He didn't write it but he was responsible for finding it. He'd wanted to do it for years but we would never let him.\":\n\n[Excerpt: The Byrds, \"Hey Joe\"]\n\nOf course, that arrangement is very far from the Mose Allison style version Crosby had been doing previously. And the reason for that can be found in the full version of that McGuinn quote, because the full version continues \"He'd wanted to do it for years but we would never let him. Then both Love and The Leaves had a minor hit with it and David got so angry that we had to let him do it. His version wasn't that hot because he wasn't a strong lead vocalist.\"\n\nThe arrangement we just heard was the arrangement that by this point almost every group on the Sunset Strip scene was playing. And the reason for that was because of another friend of Crosby's, someone who had been a roadie for the Byrds -- Bryan MacLean.\n\nMacLean and Crosby had been very close because they were both from very similar backgrounds -- they were both Hollywood brats with huge egos. MacLean later said \"Crosby and I got on perfectly. I didn't understand what everybody was complaining about, because he was just like me!\"\n\nMacLean was, if anything, from an even more privileged background than Crosby. His father was an architect who'd designed houses for Elizabeth Taylor and Dean Martin, his neighbour when growing up was Frederick Loewe, the composer of My Fair Lady. He learned to swim in Elizabeth Taylor's private pool, and his first girlfriend was Liza Minelli. Another early girlfriend was Jackie DeShannon, the singer-songwriter who did the original version of \"Needles and Pins\", who he was introduced to by Sharon Sheeley, whose name you will remember from many previous episodes.\n\nMacLean had wanted to be an artist until his late teens, when he walked into a shop in Westwood which sometimes sold his paintings, the Sandal Shop, and heard some people singing folk songs there. He decided he wanted to be a folk singer, and soon started performing at the Balladeer, a club which would later be renamed the Troubadour, playing songs like Robert Johnson's \"Cross Roads Blues\", which had recently become a staple of the folk repertoire after John Hammond put out the King of the Delta Blues Singers album:\n\n[Excerpt: Robert Johnson, \"Cross Roads Blues\"]\n\nReading interviews with people who knew MacLean at the time, the same phrase keeps coming up. John Kay, later the lead singer of Steppenwolf, said \"There was a young kid, Bryan MacLean, kind of cocky but nonetheless a nice kid, who hung around Crosby and McGuinn\" while Chris Hillman said \"He was a pretty good kid but a wee bit cocky.\"\n\nHe was a fan of the various musicians who later formed the Byrds, and was also an admirer of a young guitarist on the scene named Ryland Cooder, and of a blues singer on the scene named Taj Mahal. He apparently was briefly in a band with Taj Mahal, called Summer's Children, who as far as I can tell had no connection to the duo that Curt Boettcher later formed of the same name, before Taj Mahal and Cooder formed The Rising Sons, a multi-racial blues band who were for a while the main rivals to the Byrds on the scene.\n\nMacLean, though, firmly hitched himself to the Byrds, and particularly to Crosby. He became a roadie on their first tour, and Hillman said \"He was a hard-working guy on our behalf. As I recall, he pretty much answered to Crosby and was David’s assistant, to put it diplomatically – more like his gofer, in fact.\"\n\nBut MacLean wasn't cut out for the hard work that being a roadie required, and after being the Byrds' roadie for about thirty shows, he started making mistakes, and when they went off on their UK tour they decided not to keep employing him. He was heartbroken, but got back into trying his own musical career.\n\nHe auditioned for the Monkees, unsuccessfully, but shortly after that -- some sources say even the same day as the audition, though that seems a little too neat -- he went to Ben Frank's -- the LA hangout that had actually been namechecked in the open call for Monkees auditions, which said they wanted \"Ben Franks types\", and there he met Arthur Lee and Johnny Echols. Echols would later remember \"He was this gadfly kind of character who knew everybody and was flitting from table to table. He wore striped pants and a scarf, and he had this long, strawberry hair. All the girls loved him. For whatever reason, he came and sat at our table. Of course, Arthur and I were the only two black people there at the time.\"\n\nLee and Echols were both Black musicians who had been born in Memphis. Lee's birth father, Chester Taylor, had been a cornet player with Jimmie Lunceford, whose Delta Rhythm Boys had had a hit with \"The Honeydripper\", as we heard way back in the episode on \"Rocket '88\":\n\n[Excerpt: Jimmie Lunceford and the Delta Rhythm Boys, \"The Honeydripper\"]\n\nHowever, Taylor soon split from Lee's mother, a schoolteacher, and she married Clinton Lee, a stonemason, who doted on his adopted son, and they moved to California. They lived in a relatively prosperous area of LA, a neighbourhood that was almost all white, with a few Asian families, though the boxer Sugar Ray Robinson lived nearby. A year or so after Arthur and his mother moved to LA, so did the Echols family, who had known them in Memphis, and they happened to move only a couple of streets away. Eight year old Arthur Lee reconnected with seven-year-old Johnny Echols, and the two became close friends from that point on.\n\nArthur Lee first started out playing music when his parents were talked into buying him an accordion by a salesman who would go around with a donkey, give kids free donkey rides, and give the parents a sales pitch while they were riding the donkey, He soon gave up on the accordion and persuaded his parents to buy him an organ instead -- he was a spoiled child, by all accounts, with a TV in his bedroom, which was almost unheard of in the late fifties.\n\nJohnny Echols had a similar experience which led to his parents buying him a guitar, and the two were growing up in a musical environment generally. They attended Dorsey High School at the same time as both Billy Preston and Mike Love of the Beach Boys, and Ella Fitzgerald and her then-husband, the great jazz bass player Ray Brown, lived in the same apartment building as the Echols family for a while. Ornette Coleman, the free-jazz saxophone player, lived next door to Echols, and Adolphus Jacobs, the guitarist with the Coasters, gave him guitar lessons. Arthur Lee also knew Johnny Otis, who ran a pigeon-breeding club for local children which Arthur would attend.\n\nEchols was the one who first suggested that he and Arthur should form a band, and they put together a group to play at a school talent show, performing \"Last Night\", the instrumental that had been a hit for the Mar-Keys on Stax records:\n\n[Excerpt: The Mar-Keys, \"Last Night\"]\n\nThey soon became a regular group, naming themselves Arthur Lee and the LAGs -- the LA Group, in imitation of Booker T and the MGs – the Memphis Group. At some point around this time, Lee decided to switch from playing organ to playing guitar. He would say later that this was inspired by seeing Johnny \"Guitar\" Watson get out of a gold Cadillac, wearing a gold suit, and with gold teeth in his mouth.\n\nThe LAGs started playing as support acts and backing bands for any blues and soul acts that came through LA, performing with Big Mama Thornton, Johnny Otis, the O'Jays, and more. Arthur and Johnny were both still under-age, and they would pencil in fake moustaches to play the clubs so they'd appear older.\n\nIn the fifties and early sixties, there were a number of great electric guitar players playing blues on the West Coast -- Johnny \"Guitar\" Watson, T-Bone Walker, Guitar Slim, and others -- and they would compete with each other not only to play well, but to put on a show, and so there was a whole bag of stage tricks that West Coast R&B guitarists picked up, and Echols learned all of them -- playing his guitar behind his back, playing his guitar with his teeth, playing with his guitar between his legs.\n\nAs well as playing their own shows, the LAGs also played gigs under other names -- they had a corrupt agent who would book them under the name of whatever Black group had a hit at the time, in the belief that almost nobody knew what popular groups looked like anyway, so they would go out and perform as the Drifters or the Coasters or half a dozen other bands.\n\nBut Arthur Lee in particular wanted to have success in his own right. He would later say \"When I was a little boy I would listen to Nat 'King' Cole and I would look at that purple Capitol Records logo. I wanted to be on Capitol, that was my goal. Later on I used to walk from Dorsey High School all the way up to the Capitol building in Hollywood -- did that many times. I was determined to get a record deal with Capitol, and I did, without the help of a fancy manager or anyone else. I talked to Adam Ross and Jack Levy at Ardmore-Beechwood. I talked to Kim Fowley, and then I talked to Capitol\".\n\nThe record that the LAGs released, though, was not very good, a track called \"Rumble-Still-Skins\":\n\n[Excerpt: The LAGs, \"Rumble-Still-Skins\"]\n\nLee later said \"I was young and very inexperienced and I was testing the record company. I figured if I gave them my worst stuff and they ripped me off I wouldn't get hurt. But it didn't work, and after that I started giving my best, and I've been doing that ever since.\"\n\nThe LAGs were dropped by Capitol after one single, and for the next little while Arthur and Johnny did work for smaller labels, usually labels owned by Bob Keane, with Arthur writing and producing and Johnny playing guitar -- though Echols has said more recently that a lot of the songs that were credited to Arthur as sole writer were actually joint compositions.\n\nMost of these records were attempts at copying the style of other people. There was \"I Been Trying\", a Phil Spector soundalike released by Little Ray:\n\n[Excerpt: Little Ray, \"I Been Trying\"]\n\nAnd there were a few attempts at sounding like Curtis Mayfield, like \"Slow Jerk\" by Ronnie and the Pomona Casuals:\n\n[Excerpt: Ronnie and the Pomona Casuals, \"Slow Jerk\"]\n\nand \"My Diary\" by Rosa Lee Brooks:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nEchols was also playing with a lot of other people, and one of the musicians he was playing with, his old school friend Billy Preston, told him about a recent European tour he'd been on with Little Richard, and the band from Liverpool he'd befriended while he was there who idolised Richard, so when the Beatles hit America, Arthur and Johnny had some small amount of context for them. They soon broke up the LAGs and formed another group, the American Four, with two white musicians, bass player John Fleckenstein and drummer Don Costa. Lee had them wear wigs so they seemed like they had longer hair, and started dressing more eccentrically -- he would soon become known for wearing glasses with one blue lens and one red one, and, as he put it \"wearing forty pounds of beads, two coats, three shirts, and wearing two pairs of shoes on one foot\".\n\nAs well as the Beatles, the American Four were inspired by the other British Invasion bands -- Arthur was in the audience for the TAMI show, and quite impressed by Mick Jagger -- and also by the Valentinos, Bobby Womack's group. They tried to get signed to SAR Records, the label owned by Sam Cooke for which the Valentinos recorded, but SAR weren't interested, and they ended up recording for Bob Keane's Del-Fi records, where they cut \"Luci Baines\", a \"Twist and Shout\" knock-off with lyrics referencing the daughter of new US President Lyndon Johnson:\n\n[Excerpt: The American Four, \"Luci Baines\"]\n\nBut that didn't take off any more than the earlier records had. Another American Four track, \"Stay Away\", was recorded but went unreleased until 2006:\n\n[Excerpt: Arthur Lee and the American Four, \"Stay Away\"]\n\nSoon the American Four were changing their sound and name again. This time it was because of two bands who were becoming successful on the Sunset Strip. One was the Byrds, who to Lee's mind were making music like the stuff he heard in his head, and the other was their rivals the Rising Sons, the blues band we mentioned earlier with Taj Mahal and Ry Cooder. Lee was very impressed by them as an multiracial band making aggressive, loud, guitar music, though he would always make the point when talking about them that they were a blues band, not a rock band, and *he* had the first multiracial rock band.\n\nWhatever they were like live though, in their recordings, produced by the Byrds' first producer Terry Melcher, the Rising Sons often had the same garage band folk-punk sound that Lee and Echols would soon make their own:\n\n[Excerpt: The Rising Sons, \"Take a Giant Step\"]\n\nBut while the Rising Sons recorded a full album's worth of material, only one single was released before they split up, and so the way was clear for Lee and Echols' band, now renamed once again to The Grass Roots, to become the Byrds' new challengers. Lee later said \"I named the group The Grass Roots behind a trip, or an album I heard that Malcolm X did, where he said 'the grass roots of the people are out in the street doing something about their problems instead of sitting around talking about it'\".\n\nAfter seeing the Rolling Stones and the Byrds live, Lee wanted to get up front and move like Mick Jagger, and not be hindered by playing a guitar he wasn't especially good at -- both the Stones and the Byrds had two guitarists and a frontman who just sang and played hand percussion, and these were the models that Lee was following for the group. He also thought it would be a good idea commercially to get a good-looking white boy up front. So the group got in another guitarist, a white pretty boy who Lee soon fell out with and gave the nickname \"Bummer Bob\" because he was unpleasant to be around. Those of you who know exactly why Bobby Beausoleil later became famous will probably agree that this was a more than reasonable nickname to give him (and those of you who don't, I'll be dealing with him when we get to 1969).\n\nSo when Bryan MacLean introduced himself to Lee and Echols, and they found out that not only was he also a good-looking white guitarist, but he was also friends with the entire circle of hipsters who'd been going to Byrds gigs, people like Vito and Franzoni, and he could get a massive crowd of them to come along to gigs for any band he was in and make them the talk of the Sunset Strip scene, he was soon in the Grass Roots, and Bummer Bob was out.\n\nThe Grass Roots soon had to change their name again, though. In 1965, Jan and Dean recorded their \"Folk and Roll\" album, which featured \"The Universal Coward\"...\n\nWhich I am not going to excerpt again. I only put that pause in to terrify Tilt, who edits these podcasts, and has very strong opinions about that song.\n\nBut P. F. Sloan and Steve Barri, the songwriters who also performed as the Fantastic Baggies, had come up with a song for that album called \"Where Where You When I Needed You?\":\n\n[Excerpt: Jan and Dean, \"Where Were You When I Needed You?\"]\n\nSloan and Barri decided to cut their own version of that song under a fake band name, and then put together a group of other musicians to tour as that band. They just needed a name, and Lou Adler, the head of Dunhill Records, suggested they call themselves The Grass Roots, and so that's what they did:\n\n[Excerpt: The Grass Roots, \"Where Were You When I Needed You?\"]\n\nEchols would later claim that this was deliberate malice on Adler's part -- that Adler had come in to a Grass Roots show drunk, and pretended to be interested in signing them to a contract, mostly to show off to a woman he'd brought with him. Echols and MacLean had spoken to him, not known who he was, and he'd felt disrespected, and Echols claims that he suggested the name to get back at them, and also to capitalise on their local success.\n\nThe new Grass Roots soon started having hits, and so the old band had to find another name, which they got as a joking reference to a day job Lee had had at one point -- he'd apparently worked in a specialist bra shop, Luv Brassieres, which the rest of the band found hilarious. The Grass Roots became Love.\n\nWhile Arthur Lee was the group's lead singer, Bryan MacLean would often sing harmonies, and would get a song or two to sing live himself. And very early in the group's career, when they were playing a club called Bido Lito's, he started making his big lead spot a version of \"Hey Joe\", which he'd learned from his old friend David Crosby, and which soon became the highlight of the group's set. Their version was sped up, and included the riff which the Searchers had popularised in their cover version of  \"Needles and Pins\", the song originally recorded by MacLean's old girlfriend Jackie DeShannon:\n\n[Excerpt: The Searchers, \"Needles and Pins\"]\n\nThat riff is a very simple one to play, and variants of it became very, very, common among the LA bands, most notably on the Byrds' \"I'll Feel a Whole Lot Better\":\n\n[Excerpt: The Byrds, \"I'll Feel a Whole Lot Better\"]\n\nThe riff was so ubiquitous in the LA scene that in the late eighties Frank Zappa would still cite it as one of his main memories of the scene. I'm going to quote from his autobiography, where he's talking about the differences between the LA scene he was part of and the San Francisco scene he had no time for:\n\n\"The Byrds were the be-all and end-all of Los Angeles rock then. They were 'It' -- and then a group called Love was 'It.' There were a few 'psychedelic' groups that never really got to be 'It,' but they could still find work and get record deals, including the West Coast Pop Art Experimental Band, Sky Saxon and the Seeds, and the Leaves (noted for their cover version of \"Hey, Joe\").\n\nWhen we first went to San Francisco, in the early days of the Family Dog, it seemed that everybody was wearing the same costume, a mixture of Barbary Coast and Old West -- guys with handlebar mustaches, girls in big bustle dresses with feathers in their hair, etc. By contrast, the L.A. costumery was more random and outlandish.\n\nMusically, the northern bands had a little more country style. In L.A., it was folk-rock to death. Everything had that\" [and here Zappa uses the adjectival form of a four-letter word beginning with 'f' that the main podcast providers don't like you saying on non-adult-rated shows] \"D chord down at the bottom of the neck where you wiggle your finger around -- like 'Needles and Pins.'\"\n\nThe reason Zappa describes it that way, and the reason it became so popular, is that if you play that riff in D, the chords are D, Dsus2, and Dsus4 which means you literally only wiggle one finger on your left hand:\n\n[demonstrates]\n\nAnd so you get that on just a ton of records from that period, though Love, the Byrds, and the Searchers all actually play the riff on A rather than D:\n\n[demonstrates]\n\nSo that riff became the Big Thing in LA after the Byrds popularised the Searchers sound there, and Love added it to their arrangement of \"Hey Joe\".\n\nIn January 1966, the group would record their arrangement of it for their first album, which would come out in March:\n\n[Excerpt: Love, \"Hey Joe\"]\n\nBut that wouldn't be the first recording of the song, or of Love's arrangement of it – although other than the Byrds' version, it would be the only one to come out of LA with the original Billy Roberts lyrics. Love's performances of the song at Bido Lito's had become the talk of the Sunset Strip scene, and soon every band worth its salt was copying it, and it became one of those songs like \"Louie Louie\" before it that everyone would play.\n\nThe first record ever made with the \"Hey Joe\" melody actually had totally different lyrics. Kim Fowley had the idea of writing a sequel to \"Hey Joe\", titled \"Wanted Dead or Alive\", about what happened after Joe shot his woman and went off. He produced the track for The Rogues, a group consisting of Michael Lloyd and Shaun Harris, who later went on to form the West Coast Pop Art Experimental Band, and Lloyd and Harris were the credited writers:\n\n[Excerpt: The Rogues, \"Wanted Dead or Alive\"]\n\nThe next version of the song to come out was the first by anyone to be released as \"Hey Joe\", or at least as \"Hey Joe, Where You Gonna Go?\", which was how it was titled on its initial release. This was by a band called The Leaves, who were friends of Love, and had picked up on \"Hey Joe\", and was produced by Nik Venet. It was also the first to have the now-familiar opening line \"Hey Joe, where you going with that gun in your hand?\":\n\n[Excerpt: The Leaves, \"Hey Joe Where You Gonna Go?\"]\n\nRoberts' original lyric, as sung by both Love and the Byrds, had been \"where you going with that money in your hand?\", and had Joe headed off to *buy* the gun. But as Echols later said “What happened was Bob Lee from The Leaves, who were friends of ours, asked me for the words to 'Hey Joe'. I told him I would have the words the next day. I decided to write totally different lyrics. The words you hear on their record are ones I wrote as a joke. The original words to Hey Joe are ‘Hey Joe, where you going with that money in your hand? Well I’m going downtown to buy me a blue steel .44. When I catch up with that woman, she won’t be running round no more.’ It never says ‘Hey Joe where you goin’ with that gun in your hand.’ Those were the words I wrote just because I knew they were going to try and cover the song before we released it. That was kind of a dirty trick that I played on The Leaves, which turned out to be the words that everybody uses.”\n\nThat first release by the Leaves also contained an extra verse -- a nod to Love's previous name:\n\n[Excerpt: The Leaves, \"Hey Joe Where You Gonna Go?\"]\n\nThat original recording credited the song as public domain -- apparently Bryan MacLean had refused to tell the Leaves who had written the song, and so they assumed it was traditional. It came out in November 1965, but only as a promo single.\n\nEven before the Leaves, though, another band had recorded \"Hey Joe\", but it didn't get released. The Sons of Adam had started out as a surf group called the Fender IV, who made records like \"Malibu Run\":\n\n[Excerpt: The Fender IV, \"Malibu Run\"]\n\nKim Fowley had suggested they change their name to the Sons of Adam, and they were another group who were friends with Love -- their drummer, Michael Stuart-Ware, would later go on to join Love, and Arthur Lee wrote the song \"Feathered Fish\" for them:\n\n[Excerpt: Sons of Adam, \"Feathered Fish\"]\n\nBut while they were the first to record \"Hey Joe\", their version has still to this day not been released. Their version was recorded for Decca, with producer Gary Usher, but before it was released, another Decca artist also recorded the song, and the label weren't sure which one to release. And then the label decided to press Usher to record a version with yet another act -- this time with the Surfaris, the surf group who had had a hit with \"Wipe Out\". Coincidentally, the Surfaris had just changed bass players -- their most recent bass player, Ken Forssi, had quit and joined Love, whose own bass player, John Fleckenstein, had gone off to join the Standells, who would also record a version of “Hey Joe” in 1966.\n\nUsher thought that the Sons of Adam were much better musicians than the Surfaris, who he was recording with more or less under protest, but their version, using Love's arrangement and the \"gun in your hand\" lyrics, became the first version to come out on a major label:\n\n[Excerpt: The Surfaris, \"Hey Joe\"]\n\nThey believed the song was in the public domain, and so the songwriting credits on the record are split between Gary Usher, a W. Hale who nobody has been able to identify, and Tony Cost, a pseudonym for Nik Venet.\n\nUsher said later \"I got writer's credit on it because I was told, or I assumed at the time, the song was Public Domain; meaning a non-copyrighted song. It had already been cut two or three times, and on each occasion the writing credit had been different. On a traditional song, whoever arranges it, takes the songwriting credit. I may have changed a few words and arranged and produced it, but I certainly did not co-write it.\"\n\nThe public domain credit also appeared on the Leaves' second attempt to cut the song, which was actually given a general release, but flopped. But when the Leaves cut the song for a *third* time, still for the same tiny label, Mira, the track became a hit in May 1966, reaching number thirty-one:\n\n[Excerpt: The Leaves, \"Hey Joe\"]\n\nAnd *that* version had what they thought was the correct songwriting credit, to Dino Valenti.\n\nWhich came as news to Billy Roberts, who had registered the copyright to the song back in 1962 and had no idea that it had become a staple of LA garage rock until he heard his song in the top forty with someone else's name on the credits. He angrily confronted Third Story Music, who agreed to a compromise -- they would stop giving Valenti songwriting royalties and start giving them to Roberts instead, so long as he didn't sue them and let them keep the publishing rights. Roberts was indignant about this -- he deserved all the money, not just half of it -- but he went along with it to avoid a lawsuit he might not win.\n\nSo Roberts was now the credited songwriter on the versions coming out of the LA scene. But of course, Dino Valenti had been playing \"his\" song to other people, too. One of those other people was Vince Martin. Martin had been a member of a folk-pop group called the Tarriers, whose members also included the future film star Alan Arkin, and who had had a hit in the 1950s with \"Cindy, Oh Cindy\":\n\n[Excerpt: The Tarriers, \"Cindy, Oh Cindy\"]\n\nBut as we heard in the episode on the Lovin' Spoonful, he had become a Greenwich Village folkie, in a duo with Fred Neil, and recorded an album with him, \"Tear Down the Walls\":\n\n[Excerpt: Fred Neil and Vince Martin, \"Morning Dew\"]\n\nThat song we just heard, \"Morning Dew\", was another question-and-answer folk song. It was written by the Canadian folk-singer Bonnie Dobson, but after Martin and Neil recorded it, it was picked up on by Martin's friend Tim Rose who stuck his own name on the credits as well, without Dobson's permission, for a version which made the song into a rock standard for which he continued to collect royalties:\n\n[Excerpt: Tim Rose, \"Morning Dew\"]\n\nThis was something that Rose seems to have made a habit of doing, though to be fair to him it went both ways. We heard about him in the Lovin' Spoonful episode too, when he was in a band named the Big Three with Cass Elliot and her coincidentally-named future husband Jim Hendricks, who recorded this song, with Rose putting new music to the lyrics of the old public domain song \"Oh! Susanna\":\n\n[Excerpt: The Big Three, \"The Banjo Song\"]\n\nThe band Shocking Blue used that melody for their 1969 number-one hit \"Venus\", and didn't give Rose any credit:\n\n[Excerpt: Shocking Blue, \"Venus\"]\n\nBut another song that Rose picked up from Vince Martin was \"Hey Joe\". Martin had picked the song up from Valenti, but didn't know who had written it, or who was claiming to have written it, and told Rose he thought it might be an old Appalchian murder ballad or something. Rose took the song and claimed writing credit in his own name -- he would always, for the rest of his life, claim it was an old folk tune he'd heard in Florida, and that he'd rewritten it substantially himself, but no evidence of the song has ever shown up from prior to Roberts' copyright registration, and Rose's version is basically identical to Roberts' in melody and lyrics. But Rose takes his version at a much slower pace, and his version would be the model for the most successful versions going forward, though those other versions would use the lyrics Johnny Echols had rewritten, rather than the ones Rose used:\n\n[Excerpt: Tim Rose, \"Hey Joe\"]\n\nRose's version got heard across the Atlantic as well. And in particular it was heard by Chas Chandler, the bass player of the Animals. Some sources seem to suggest that Chandler first heard the song performed by a group called the Creation, but in a biography I've read of that group they clearly state that they didn't start playing the song until 1967.\n\nBut however he came across it, when Chandler heard Rose's recording, he knew that the song could be a big hit for someone, but he didn't know who. And then he bumped into Linda Keith, Keith Richards' girlfriend,  who took him to see someone whose guitar we've already heard in this episode:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nThe Curtis Mayfield impression on guitar there was, at least according to many sources the first recording session ever played on by a guitarist then calling himself Maurice (or possibly Mo-rees) James. We'll see later in the story that it possibly wasn't his first -- there are conflicting accounts, as there are about a lot of things, and it was recorded either in very early 1964, in which case it was his first, or (as seems more likely, and as I tell the story later) a year later, in which case he'd played on maybe half a dozen tracks in the studio by that point. But it was still a very early one.\n\nAnd by late 1966 that guitarist had reverted to the name by which he was brought up, and was calling himself Jimi Hendrix. Hendrix and Arthur Lee had become close, and Lee would later claim that Hendrix had copied much of Lee's dress style and attitude -- though many of Hendrix's other colleagues and employers, including Little Richard, would make similar claims -- and most of them had an element of truth, as Lee's did. Hendrix was a sponge. But Lee did influence him. Indeed, one of Hendrix's *last* sessions, in March 1970, was guesting on an album by Love:\n\n[Excerpt: Love with Jimi Hendrix, \"Everlasting First\"]\n\nHendrix's name at birth was Johnny Allen Hendrix, which made his father, James Allen Hendrix, known as Al, who was away at war when his son was born, worry that he'd been named after another man who might possibly be the real father, so the family just referred to the child as \"Buster\" to avoid the issue. When Al Hendrix came back from the war the child was renamed James Marshall Hendrix -- James after Al's first name, Marshall after Al's dead brother -- though the family continued calling him \"Buster\".\n\nLittle James Hendrix Junior didn't have anything like a stable home life. Both his parents were alcoholics, and Al Hendrix was frequently convinced that Jimi's mother Lucille was having affairs and became abusive about it. They had six children, four of whom were born disabled, and Jimi was the only one to remain with his parents -- the rest were either fostered or adopted at birth, fostered later on because the parents weren't providing a decent home life, or in one case made a ward of state because the Hendrixes couldn't afford to pay for a life-saving operation for him. The only one that Jimi had any kind of regular contact with was the second brother, Leon, his parents' favourite, who stayed with them for several years before being fostered by a family only a few blocks away.\n\nAl and Lucille Hendrix frequently split and reconciled, and while they were ostensibly raising Jimi (and for a  few years Leon), he was shuttled between them and various family members and friends, living sometimes in Seattle where his parents lived and sometimes in Vancouver with his paternal grandmother. He was frequently malnourished, and often survived because friends' families fed him. Al Hendrix was also often physically and emotionally abusive of the son he wasn't sure was his.\n\nJimi grew up introverted, and stuttering, and only a couple of things seemed to bring him out of his shell. One was science fiction -- he always thought that his nickname, Buster, came from Buster Crabbe, the star of the Flash Gordon serials he loved to watch, though in fact he got the nickname even before that interest developed, and he was fascinated with ideas about aliens and UFOs -- and the other was music. Growing up in Seattle in the forties and fifties, most of the music he was exposed to as a child and in his early teens was music made by and for white people -- there wasn't a very large Black community in the area at the time compared to most major American cities, and so there were no prominent R&B stations. As a kid he loved the music of Bob Wills and the Texas Playboys, and when he was thirteen Jimi's favourite record was Dean Martin's \"Memories are Made of This\":\n\n[Excerpt: Dean Martin, \"Memories are Made of This\"]\n\nHe also, like every teenager, became a fan of rock and roll music. When Elvis played at a local stadium when Jimi was fifteen, he couldn't afford a ticket, but he went and sat on top of a nearby hill and watched the show from the distance.\n\nJimi's first exposure to the blues also came around this time, when his father briefly took in lodgers, Cornell and Ernestine Benson, and Ernestine had a record collection that included records by Lightnin' Hopkins, Howlin' Wolf, and Muddy Waters, all of whom Jimi became a big fan of, especially Muddy Waters. The Bensons' most vivid memory of Jimi in later years was him picking up a broom and pretending to play guitar along with these records:\n\n[Excerpt: Muddy Waters, \"Baby Please Don't Go\"]\n\nShortly after this, it would be Ernestine Benson who would get Jimi his very first guitar. By this time Jimi and Al had lost their home and moved into a boarding house, and the owner's son had an acoustic guitar with only one string that he was planning to throw out. When Jimi asked if he could have it instead of it being thrown out, the owner told him he could have it for five dollars. Al Hendrix refused to pay that much for it, but Ernestine Benson bought Jimi the guitar. She said later “He only had one string, but he could really make that string talk.”\n\nHe started carrying the guitar on his back everywhere he went, in imitation of Sterling Hayden in the western Johnny Guitar, and eventually got some more strings for it and learned to play. He would play it left-handed -- until his father came in. His father had forced him to write with his right hand, and was convinced that left-handedness was the work of the devil, so Jimi would play left-handed while his father was somewhere else, but as soon as Al came in he would flip the guitar the other way up and continue playing the song he had been playing, now right-handed.\n\nJimi's mother died when he was fifteen, after having been ill for a long time with drink-related problems, and Jimi and his brother didn't get to go to the funeral -- depending on who you believe, either Al gave Jimi the bus fare and told him to go by himself and Jimi was too embarrassed to go to the funeral alone on the bus, or Al actually forbade Jimi and Leon from going.  After this, he became even more introverted than he was before, and he also developed a fascination with the idea of angels, convinced his mother now was one.\n\nJimi started to hang around with a friend called Pernell Alexander, who also had a guitar, and they would play along together with Elmore James records. The two also went to see Little Richard and Bill Doggett perform live, and while Jimi was hugely introverted, he did start to build more friendships in the small Seattle music scene, including with Ron Holden, the man we talked about in the episode on \"Louie Louie\" who introduced that song to Seattle, and who would go on to record with Bruce Johnston for Bob Keane:\n\n[Excerpt: Ron Holden, \"Gee But I'm Lonesome\"]\n\nEventually Ernestine Benson persuaded Al Hendrix to buy Jimi a decent electric guitar on credit -- Al also bought himself a saxophone at the same time, thinking he might play music with his son, but sent it back once the next payment became due.\n\nAs well as blues and R&B, Jimi was soaking up the guitar instrumentals and garage rock that would soon turn into surf music. The first song he learned to play was \"Tall Cool One\" by the Fabulous Wailers, the local group who popularised a version of \"Louie Louie\" based on Holden's one:\n\n[Excerpt: The Fabulous Wailers, \"Tall Cool One\"]\n\nAs we talked about in the \"Louie Louie\" episode, the Fabulous Wailers used to play at a venue called the Spanish Castle, and Jimi was a regular in the audience, later writing his song \"Spanish Castle Magic\" about those shows:\n\n[Excerpt: The Jimi Hendrix Experience, \"Spanish Castle Magic\"]\n\nHe was also a big fan of Duane Eddy, and soon learned Eddy's big hits \"Forty Miles of Bad Road\", \"Because They're Young\", and \"Peter Gunn\" -- a song he would return to much later in his life:\n\n[Excerpt: Jimi Hendrix, \"Peter Gunn/Catastrophe\"]\n\nHis career as a guitarist didn't get off to a great start -- the first night he played with his first band, he was meant to play two sets, but he was fired after the first set, because he was playing in too flashy a manner and showing off too much on stage. His girlfriend suggested that he might want to tone it down a little, but he said \"That's not my style\".  This would be a common story for the next several years.\n\nAfter that false start, the first real band he was in was the Velvetones, with his friend Pernell Alexander. There were four guitarists, two piano players, horns and drums, and they dressed up with glitter stuck to their pants. They played Duane Eddy songs, old jazz numbers, and \"Honky Tonk\" by Bill Doggett, which became Hendrix's signature song with the band.\n\n[Excerpt: Bill Doggett, \"Honky Tonk\"]\n\nHis father was unsupportive of his music career, and he left his guitar at Alexander's house because he was scared that his dad would smash it if he took it home. At the same time he was with the Velvetones, he was also playing with another band called the Rocking Kings, who got gigs around the Seattle area, including at the Spanish Castle. But as they left school, most of Hendrix's friends were joining the Army, in order to make a steady living, and so did he -- although not entirely by choice. He was arrested, twice, for riding in stolen cars, and he was given a choice -- either go to prison, or sign up for the Army for three years. He chose the latter.\n\nAt first, the Army seemed to suit him. He was accepted into the 101st Airborne Division, the famous \"Screaming Eagles\", whose actions at D-Day made them legendary in the US, and he was proud to be a member of the Division. They were based out of Fort Campbell, the base near Clarksville we talked about a couple of episodes ago, and while he was there he met a bass player, Billy Cox, who he started playing with.\n\nAs Cox and Hendrix were Black, and as Fort Campbell straddled the border between Kentucky and Tennessee, they had to deal with segregation and play to only Black audiences. And Hendrix quickly discovered that Black audiences in the Southern states weren't interested in \"Louie Louie\", Duane Eddy, and surf music, the stuff he'd been playing in Seattle. He had to instead switch to playing Albert King and Slim Harpo songs, but luckily he loved that music too. He also started singing at this point -- when Hendrix and Cox started playing together, in a trio called the Kasuals, they had no singer, and while Hendrix never liked his own voice, Cox was worse, and so Hendrix was stuck as the singer.\n\nThe Kasuals started gigging around Clarksville, and occasionally further afield, places like Nashville, where Arthur Alexander would occasionally sit in with them. But Cox was about to leave the Army, and Hendrix had another two and a bit years to go, having enlisted for three years. They couldn't play any further away unless Hendrix got out of the Army, which he was increasingly unhappy in anyway, and so he did the only thing he could -- he pretended to be gay, and got discharged on medical grounds for homosexuality. In later years he would always pretend he'd broken his ankle parachuting from a plane.\n\nFor the next few years, he would be a full-time guitarist, and spend the periods when he wasn't earning enough money from that leeching off women he lived with, moving from one to another as they got sick of him or ran out of money.\n\nThe Kasuals expanded their lineup, adding a second guitarist, Alphonso Young, who would show off on stage by playing guitar with his teeth. Hendrix didn't like being upstaged by another guitarist, and quickly learned to do the same.\n\nOne biography I've used as a source for this says that at this point, Billy Cox played on a session for King Records, for Frank Howard and the Commanders, and brought Hendrix along, but the producer thought that Hendrix's guitar was too frantic and turned his mic off.\n\nBut other sources say the session Hendrix and Cox played on for the Commanders wasn't until three years later, and the record *sounds* like a 1965 record, not a 1962 one, and his guitar is very audible – and the record isn't on King. But we've not had any music to break up the narration for a little while, and it's a good track (which later became a Northern Soul favourite) so I'll play a section here, as either way it was certainly an early Hendrix session:\n\n[Excerpt: Frank Howard and the Commanders, \"I'm So Glad\"]\n\nThis illustrates a general problem with Hendrix's life at this point -- he would flit between bands, playing with the same people at multiple points, nobody was taking detailed notes, and later, once he became famous, everyone wanted to exaggerate their own importance in his life, meaning that while the broad outlines of his life are fairly clear, any detail before late 1966 might be hopelessly wrong.\n\nBut all the time, Hendrix was learning his craft. One story from around this time  sums up both Hendrix's attitude to his playing -- he saw himself almost as much as a scientist as a musician -- and his slightly formal manner of speech.  He challenged the best blues guitarist in Nashville to a guitar duel, and the audience actually laughed at Hendrix's playing, as he was totally outclassed. When asked what he was doing, he replied “I was simply trying to get that B.B. King tone down and my experiment failed.”\n\nBookings for the King Kasuals dried up, and he went to Vancouver, where he spent a couple of months playing in a covers band, Bobby Taylor and the Vancouvers, whose lead guitarist was Tommy Chong, later to find fame as one half of Cheech and Chong. But he got depressed at how white Vancouver was, and travelled back down south to join a reconfigured King Kasuals, who now had a horn section.\n\nThe new lineup of King Kasuals were playing the chitlin circuit and had to put on a proper show, and so Hendrix started using all the techniques he'd seen other guitarists on the circuit use -- playing with his teeth like Alphonso Young, the other guitarist in the band, playing with his guitar behind his back like T-Bone Walker, and playing with a fifty-foot cord that allowed him to walk into the crowd and out of the venue, still playing, like Guitar Slim used to.\n\nAs well as playing with the King Kasuals, he started playing the circuit as a sideman. He got short stints with many of the second-tier acts on the circuit -- people who had had one or two hits, or were crowd-pleasers, but weren't massive stars, like Carla Thomas or Jerry Butler or Slim Harpo. The first really big name he played with was Solomon Burke, who when Hendrix joined his band had just released \"Just Out of Reach (Of My Two Empty Arms)\":\n\n[Excerpt: Solomon Burke, \"Just Out of Reach (Of My Two Empty Arms)\"]\n\nBut he lacked discipline. “Five dates would go beautifully,” Burke later said, “and then at the next show, he’d go into this wild stuff that wasn’t part of the song. I just couldn’t handle it anymore.”\n\nBurke traded him to Otis Redding, who was on the same tour, for two horn players, but then Redding fired him a week later and they left him on the side of the road.\n\nHe played in the backing band for the Marvelettes, on a tour with Curtis Mayfield, who would be another of Hendrix's biggest influences, but he accidentally blew up Mayfield's amp and got sacked. On another tour, Cecil Womack threw Hendrix's guitar off the bus while he slept.\n\nIn February 1964 he joined the band of the Isley Brothers, and he would watch the Beatles on Ed Sullivan with them during his first days with the group. Assuming he hadn't already played the Rosa Lee Brooks session (and I think there's good reason to believe he hadn't), then the first record Hendrix played on was their single \"Testify\":\n\n[Excerpt: The Isley Brothers, \"Testify\"]\n\nWhile he was with them, he also moonlighted on Don Covay's big hit \"Mercy, Mercy\":\n\n[Excerpt: Don Covay and the Goodtimers, \"Mercy Mercy\"]\n\nAfter leaving the Isleys, Hendrix joined the minor soul singer Gorgeous George, and on a break from Gorgeous George's tour, in Memphis, he went to Stax studios in the hope of meeting Steve Cropper, one of his idols. When he was told that Cropper was busy in the studio, he waited around all day until Cropper finished, and introduced himself. Hendrix was amazed to discover that Cropper was white -- he'd assumed that he must be Black -- and Cropper was delighted to meet the guitarist who had played on \"Mercy Mercy\", one of his favourite records. The two spent hours showing each other guitar licks -- Hendrix playing Cropper's right-handed guitar, as he hadn't brought along his own.\n\nShortly after this, he joined Little Richard's band, and once again came into conflict with the star of the show by trying to upstage him. For one show he wore a satin shirt, and after the show Richard screamed at him “I am the only Little Richard! I am the King of Rock and Roll, and I am the only one allowed to be pretty. Take that shirt off!”\n\nWhile he was with Richard, Hendrix played on his \"I Don't Know What You've Got, But It's Got Me\", which like \"Mercy Mercy\" was written by Don Covay, who had started out as Richard's chauffeur:\n\n[Excerpt: Little Richard, \"I Don't Know What You've Got, But It's Got Me\"]\n\nAccording to the most likely version of events I've read, it was while he was working for Richard that Hendrix met Rosa Lee Brooks, on New Year's Eve 1964. At this point he was using the name Maurice James, apparently in tribute to the blues guitarist Elmore James, and he used various names, including Jimmy James, for most of his pre-fame performances.\n\nRosa Lee Brooks was an R&B singer who had been mentored by Johnny \"Guitar\" Watson, and when she met Hendrix she was singing in a girl group who were one of the support acts for Ike & Tina Turner, who Hendrix went to see on his night off. Hendrix met Brooks afterwards, and told her she looked like his mother -- a line he used on a lot of women, but which was true in her case if photos are anything to go by. The two got into a relationship, and were soon talking about becoming a duo like Ike and Tina or Mickey and Sylvia -- \"Love is Strange\" was one of Hendrix's favourite records. But the only recording they made together was the \"My Diary\" single. Brooks always claimed that she actually wrote that song, but the label credit is for Arthur Lee, and it sounds like his work to me, albeit him trying hard to write like Curtis Mayfield, just as Hendrix is trying to play like him:\n\n[Excerpt: Rosa Lee Brooks, \"My Diary\"]\n\nBrooks and Hendrix had a very intense relationship for a short period. Brooks would later recall Little Richard trying to persuade them to have sex while he watched, which they refused to do, and Hendrix soon quit playing for Little Richard and joined Ike and Tina Turner's band. But then Ike Turner fired him for being too flashy, and he rejoined Little Richard, quitting (or being fired) again when the tour hit New York.\n\nHendrix soon ran out of money and sent Brooks a letter from New York saying he'd had to pawn his guitar -- a line he used on women he was asking for money all the time. She sent him forty dollars and a photo, but never heard from him again.\n\nBrooks would go on to have a minor career as a singer, but would never have any great success. You can get an idea of the kind of thing she did from one of the oddest records she made -- it was still normal at this time for hits to be covered for different markets, though it wasn't anything like as common as it had been even a few years earlier, and so in 1966, a few weeks after the original came out, Brooks recorded what was publicised as \"The R&B version\" of \"They're Coming to Take Me Away, Ha-Ha\", the song that had been a hit for Napoleon XIV:\n\n[Excerpt: Rose Brooks, \"They're Coming to Take Me Away, Ha-Ha\"]\n\nSadly she died in December last year.\n\nIn New York, Hendrix hit the lowest point of his professional career. After having played with some of the best performers on the circuit, he was reduced to playing with a local band, Curtis Knight and the Squires, whose lead singer was actually just a pimp who sang a bit on the side. The one advantage of the Squires was that they allowed Hendrix to show off a bit -- with no real star, and not even really any particularly good musicians in the band other than him, he was given the space to play what he wanted, at least on stage.\n\nKnight had a contract with a record producer, Ed Chalpin, who made knockoff cover versions for overseas markets and other exploitation records, and Chalpin signed Hendrix to a recording contract, mostly to work as a sideman. At this time, he played on such terrible records as Curtis Knight's \"How Do You Feel?\", a rip-off of \"Like a Rolling Stone\":\n\n[Excerpt: Curtis Knight, \"How Would You Feel?\"]\n\nHe also played bass on \"As the Clouds Drift By\", by the fading film star Jayne Mansfield:\n\n[Excerpt; Jayne Mansfield, \"As the Clouds Drift By\"]\n\nIn all, he recorded thirty-three sides with Chalpin, none of them of any worth, and which would be endlessly repackaged under Hendrix's name later.\n\nHis career picked up slightly when he joined Joey Dee and the Starliters, the group who'd had a hit a couple of years earlier with \"Peppermint Twist\" and were still getting reasonably good bookings -- and this was his first experience of playing in a multiracial band since his early days playing around Seattle. He moved on from Joey Dee to King Curtis, the great saxophone player who'd played on so many hits on Atlantic Records, and played with Curtis on \"Instant Groove\":\n\n[Excerpt: King Curtis, \"Instant Groove\"]\n\nBut soon he was back playing with Curtis Knight again. And it was when he was playing with Curtis Knight that he met the person who would change his life.\n\nLinda Keith was, at this time, Keith Richards' girlfriend. She was a model, she was twenty years old, and she shared Richards' massive love of the blues. She'd flown over to New York a month before the Stones were due to tour the US, so she could spend some time exploring the clubs. And when she walked in to the tiny club that Curtis Knight and the Squires were playing, she was astonished to see one of the greatest blues guitarists she'd ever heard, playing with a terrible band.\n\nShe struck up a conversation with the guitarist, who was calling himself Jimmy James. and invited him back to a party with her friends. At the party someone offered him acid, and it says everything about the difference between the white and Black music scenes in New York at this point that his reply was, in all sincerity, \"No, I don’t want any of that, but I’d love to try some of that LSD stuff\". He had no idea that acid and LSD were the same thing, as among the musicians he was playing with, LSD was regarded as a \"white drug\", and some of Hendrix's friends would seriously try to talk him out of taking it in future by saying that it made you \"think like a white man\".\n\nWhile he was on acid, he saw himself in the mirror and was convinced he looked just like Marilyn Monroe. And then Linda Keith put on what he became convinced was the greatest album ever, Bob Dylan's new album Blonde on Blonde:\n\n[Excerpt: Bob Dylan, \"Just Like a Woman\"]\n\nHendrix was already a big fan of Dylan. He'd even taken to styling his hair in imitation of what he called Dylan's \"white Afro\", putting it in curlers to get the same look. But he thought Blonde on Blonde was even better than anything else he'd heard from Dylan, and became obsessed with the record.\n\nHendrix bonded with Linda Keith over their shared love of both Dylan and blues. Their relationship remained platonic -- a rarity among Hendrix's relationships with women -- but Keith became determined she would use her contacts to make this guitarist a star.\n\nShortly after this meeting, after playing a gig with another bad R&B band, Hendrix was approached by a member of the audience -- a Black folk musician named Richie Havens who loved Hendrix's playing. They got talking, and they too bonded over a love for Dylan. Havens mentioned that he would often perform his own version of \"Just Like a Woman\" from Dylan's new album:\n\n[Excerpt: Richie Havens, \"Just Like a Woman\"]\n\nHendrix said he'd like to listen to that, and so Havens told him about the Greenwich Village folk clubs where he played. Hendrix went down to see Havens, and then started hanging around the Village a lot, especially a place called the Cafe Wha?, where Tim Rose used to play, and it was there that he picked up on Rose's slow version of \"Hey Joe\".\n\nHendrix decided that he was going to start playing the Greenwich Village scene, and he put together a band called Jimmy James and the Blue Flames, named after the band that backed Junior Parker, the blues musician who did the original version of \"Mystery Train\". The band had a revolving lineup that at various times included Randy California, later to become famous in the band Spirit, and Jeff \"Skunk\" Baxter, who would go on to play with Steely Dan and the Doobie Brothers.\n\nAnd Hendrix absolutely blew the Greenwich Village crowds away.\n\nYou see, you'll notice that there are roughly three types of story that successful musicians have for the beginning of their career -- three broad shapes they fall into. The first is the one that, say, the Beach Boys or Elvis had -- someone who has literally never played a gig in their lives goes into a small record label and cuts a local hit, then gets picked up by a major label. In the case of the Beach Boys and Elvis, that obviously led to substantial careers with huge artistic and commercial success, but that's also the story behind a hell of a lot of one-hit wonders.\n\nThen there's the one that most of the Greenwich Village folk scene, the British trad and skiffle scenes, and the British blues bands, mostly fall into -- people with some live experience, but not that much, playing odd gigs for six months or a year or so, mostly as a kind of gentleman amateur, playing in front of your friends from art school or the local left-wing activist group, half of whom are also musicians playing those same venues, and who are willing to put up with a bit of sloppiness if you're enthusiastic enough and you know the catalogue number of the original issue of \"Jim Jackson's Kansas City Blues\" on the Vocalion label. Those scenes would often produce great songwriters, but usually rather mediocre musicians, and when they did produce a genuinely good musician, it was usually someone who played in a very scholarly fashion -- expertly reproducing someone else's sound in a rather clinical way, rather than innovating.\n\nBut then there's the people who played the Chitlin Circuit and the equivalent white working class country venues. Places where you were playing multiple shows a day, every day, for audiences of poor people who insist on value for money if they're spending some of what little they have on a night out after a hard week of working, and who will throw fruit at best, and bottles at worst, at you if you weren't putting on a good show. To survive playing those venues, you had to be an exceptional musician, *and* an exceptional entertainer. You had to be able to put on a show while you were playing expertly, and if you couldn't play your guitar behind your head, perfectly in tune, while you were also doing the synchronised dance routine for the lead singer's latest single they only recorded the day before, well there were plenty of other musicians out there who wanted the gig.\n\nAnd the crowds at the Cafe Wha?, where Jimmy James and the Blue Flames were playing, were crowds whose experience of music was almost entirely from type two, and they were now watching a performer of type three. On the Chitlin Circuit, Hendrix had been one of the best players around, but not so far ahead of everyone else that he couldn't be replaced if he started thinking himself more important than the star. On the Greenwich Village folk scene, though, he was unlike anything anyone had seen.\n\nRichie Havens sent Mike Bloomfield, the guitarist with the Paul Butterfield Blues Band who'd played on several Dylan sessions, and was widely regarded as the best rock guitarist in New York, to see the Blue Flames, and he said \"Hendrix knew who I was and that day, in front of my eyes, he burned me to death. H-bombs were going off, guided missiles were flying—I can’t tell you the sounds he was getting out of his instrument. He was getting every sound I was ever to hear him get, right there in that room with a Stratocaster. . . . How he did this, I wish I understood.”\n\nThe Blue Flames' set was mostly covers of contemporary hits, but they also did \"Hey Joe\", at the same speed that Tim Rose played it, but with the lyrics as rewritten by Johnny Echols, though without the grass roots verse:\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe\"]\n\nAs well as playing with the Blue Flames, Hendrix was also playing with other artists on the Greenwich Village scene, like John Hammond junior, who brought his father along to see Hendrix. Hammond senior was unimpressed, but one of the people who worked at the cafe where they played later said \"He just blew everybody away. He played behind his back, all that stuff he had stolen from T-Bone Walker. We thought he invented it. No one there realised there was a Black tradition that went back to the 1920s.”\n\nMeanwhile Linda Keith was trying to get other people interested. She wasn't helped by the fact that when the Rolling Stones came over, Keith Richards became convinced that she was having an affair with Hendrix, and became very jealous of him, which put Andrew Oldham off from signing him to Immediate Records -- though Keith also says that Hendrix's music was fundamentally not to Oldham's taste, as Oldham was far more interested in Phil Spector and the Beach Boys than in blues-based guitar rock.\n\nBut then she bumped into Chas Chandler, the bass player of the Animals. The Animals were going to split up at the end of the tour, and Chandler was planning on going into management and production in partnership with Mike Jeffrey, the Animals' manager, who seemed to have a variety of dodgy underworld connections. Chandler had even decided on what record he was going to produce -- he was convinced that Tim Rose's arrangement of \"Hey Joe\" could be a hit, if he could find someone good to play it.\n\nKeith told him to come and see Jimmy James and the Blue Flames, and when they opened their set with \"Hey Joe\", Chandler got so excited he spilled his milkshake all over himself.\n\nChandler had to finish his tour, and in the meantime Linda Keith split up with Keith Richards, who took revenge on her by telling her father she was dating a \"Black junkie\" -- her father had her made a ward of the court as she was not yet twenty-one, flew over from England and dragged her back with him. But when the Animals tour finished, Chandler returned to New York, tracked Hendrix down, and persuaded him to come over to the UK. When he left New York, Jimi had forty dollars in his pocket, borrowed from John Hammond junior's drummer, and his only other possessions in the world were his guitar, a single change of clothes, his hair curlers, and a jar of cream for his acne.\n\nIn the UK, Hendrix was an immediate sensation. At the time, the biggest guitar hero in the country was Eric Clapton, who had recently formed the group Cream:\n\n[Excerpt: Cream, \"I Feel Free\"]\n\n75) We'll be dealing with Cream in a future episode, so I won't talk too much about them now, but the important thing here is that Clapton was considered so great that \"Clapton is God\" was a popular graffito in London at the time. Chandler prevailed upon his acquaintance with the band to get them to let Hendrix get up on stage with them and jam on Howlin' Wolf's \"Killing Floor\", and Hendrix started doing things on guitar that Clapton found unimaginable, his jaw dropping on stage. Jack Bruce, Cream's bassist, later said \"It must have been difficult for Eric to handle, because he was ‘God,’ and this unknown person comes along, and *burns*.”\n\nAlso in the audience was Jeff Beck, the *other* great guitar hero in Britain, and he was similarly impressed. Everyone knew that there was a new best guitarist in town. Now all he needed was a band and a record.\n\nThe question of a band caused some conflict between Hendrix and Chandler. Hendrix wanted a big band of the kind he was used to playing with, with a horn section, but Chandler was insistent that what he needed was a small rock group without too many other instruments. Chandler at first tried to get Brian Auger and the Trinity to drop their guitarist and install Hendrix as guitarist and frontman, but Auger quite rightly refused to do so, and so Chandler decided to put together a band for Hendrix. Auger did, though, let Hendrix sit in with the group one night, which gave Hendrix his first experience of playing through a Marshall amp, which quickly became his favoured equipment.\n\nThe first person they took on was Noel Redding, who Chandler discovered in the auditions for Eric Burdon's New Animals, which Chandler was attending. Redding was a guitarist, but Chandler persuaded him to change to bass, and Hendrix liked him because he had hair like Bob Dylan's, so he was in the group.\n\nChandler's connections were paying off for Hendrix in ways that he couldn't have imagined even a few months earlier. Hendrix got a girlfriend, Kathy Etchingham, who was part of the London scene, and they happened to bump into Ringo Starr in a club. Etchingham complained that they were living in a rather cramped hotel room, and Starr had a spare two-bedroom flat in one of the most expensive parts of central London he wasn't using, so he let it to them for thirty pounds a month, and Hendrix and Etchingham moved into one bedroom while Chandler and his girlfriend took the other.\n\nHendrix was for the most part just going to clubs, getting on stage with more famous musicians, and playing a couple of songs using all the tricks he learned on the chitlin circuit, blowing the other musicians off stage. At one of these events, Johnny Hallyday was in the audience. Hallyday was known as \"the French Elvis\", but he had recently started trying to update his music, making records with psychedelic and soul elements, with Brian Auger on keyboards and Mick Jones, later of Foreigner, on guitar, and covering recent hits from other countries in French:\n\n[Excerpt: Johnny Hallyday, \"Je veux te graver dans ma vie\"]\n\nHallyday was impressed by Hendrix, and invited him to be his support act on a residency at the Paris Olympia and a couple of warm-up gigs before that, at the bottom of the bill with Brian Auger between Hendrix and the main attraction. The very first gigs for the Jimi Hendrix Experience -- a name chosen by Mike Jeffrey -- would be supporting France's biggest ever rock star.\n\nOf course, that meant that they needed a drummer, and the one they chose was actually the ex drummer of the Blue Flames -- but not Hendrix's old band the Blue Flames, nor Junior Parker's band of that name, but rather the band that backed the British R&B keyboardist and Mose Allison soundalike Georgie Fame:\n\n[Excerpt: Georgie Fame and the Blue Flames, \"See Saw\"]\n\nMitch Mitchell had been given drum lessons by Jim Marshall, and had played briefly with the Who when they were finding a drummer to replace Doug Sandom, and with the Pretty Things, but was best known as a child actor, having appeared in the film Bottoms Up with Jimmy Edwards, Melvyn Hayes, and Richard Briers:\n\n[Excerpt: Bottoms Up]\n\nHe had also starred as the schoolboy Jennings in the TV series based on the series of school novels by Anthony Buckeridge.\n\nMitchell was chosen as the result of a coin-toss, the other option being Aynsley Dunbar, but he turned out to be perfect for the group, and after fairly rough try-out shows, by the time the group hit the Olympia they were receiving an overwhelming reception -- so much so that in early 1967, Johnny Hallyday recorded this:\n\n[Excerpt: Johnny Hallyday, \"Hey Joe\"]\n\nA week after the Olympia show -- a month after Hendrix first arrived in the UK with no money and no possessions -- the group were in the studio to record their first single. For a B-side, Hendrix wanted to rerecord \"Mercy Mercy\", the Don Covay song he'd played on, but Chandler explained to him that the real money was in songwriting, so he should write a song, and Hendrix came up with \"Stone Free\":\n\n[Excerpt: The Jimi Hendrix Experience, \"Stone Free\"]\n\nThe A-side, of course, was going to be \"Hey Joe\", and while they were going to use Hendrix's bluesy guitar part and the Echols version of the lyrics, Chandler also wanted to have the same kind of build that Tim Rose's version had. Rose had had block backing vocals, so Chandler brought in Britain's top session-singing girl group the Breakaways. The Breakaways had started out as part of the Vernons Girls, a sixteen-piece female choir formed from staff at Vernons football pools company in Liverpool, who had come to fame on Oh Boy!\n\nAfter Oh Boy! the Vernons Girls had split into several smaller groups, one keeping the name The Vernons Girls and going on to make some rather fun girl-group records, often written by future Vicar of Dibley star Trevor Peacock:\n\n[Excerpt: The Vernons Girls, \"You Know What I Mean\"]\n\nAnother of the small groups formed from the large one had gone on to become the Fordettes, backing Emile Ford, the singer who was one of Britain's first Black pop stars and had the first UK number one of the sixties with a record produced by Joe Meek. Then one of them had become engaged to Joe Brown, so they'd broken away from Ford and become the Breakaways, backing Brown. They'd made some singles of their own, like \"That's How it Goes\":\n\n[Excerpt: The Breakaways, \"That's How it Goes\"]\n\nBut they'd become best known as session singers, providing backing vocals for Cilla Black, Cliff Richard, Lulu, and Petula Clark -- that's them singing on \"Downtown\":\n\n[Excerpt: Petula Clark, \"Downtown\"]\n\nSo Chandler brought them in to sing the backing vocals, which became a crucial part of the record, providing the block chordal support that might otherwise be provided by a keyboard or rhythm guitar, allowing the members of the Experience to improvise over their solid backing:\n\n[Excerpt: The Jimi Hendrix Experience, \"Hey Joe\"]\n\nBut while they'd recorded their first single, they had no label yet -- Chandler and Jeffreys had sunk their own money into the sessions, just knowing that the single would be a hit. The first few labels they took it to turned them down, but while that was going on the press grew steadily more interested in Hendrix -- though there was a problem for his publicist when writing his first press biography, because Hendrix had played with so many great musicians they were actually worried he would look like he was lying if they named them all.\n\nHendrix was now making some money, but was living off a £15 a week salary he was being paid by Chandler and Jeffreys as an advance against future royalties, and was short enough on cash that when Little Richard appeared in London, Hendrix went backstage to see if he could get fifty dollars that Richard owed him in unpaid salary from his time with the band. Richard countered that Hendrix had missed the band bus and so he'd been fined that fifty dollars, and Hendrix left empty handed\n\nEventually, the Jimi Hendrix Experience was signed to Track Records, the new label being set up by Kit Lambert and Chris Stamp, the Who's managers, partly on the recommendation of Pete Townshend, who after being unimpressed with Hendrix on first meeting him, was wowed by seeing him live and became one of his biggest admirers. The new label got the group an appearance on Ready Steady Go!, the biggest music TV show in Britain, for the same day that the record came out, and it quickly entered the top ten.\n\nJimi Hendrix had started 1966 living penniless in New York, playing for a band that nobody liked, facing eviction, and going hungry. He ended the year a pop star, living in a luxury flat owned by another pop star, with every important guitarist in Britain worshipping him. For Jimi Hendrix, as for the music world generally, 1966 had been a revolutionary year that had changed everything. And as we head into 1967, we're going to see how the ripples from those changes spread out and change the whole of society.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and forty-seven of A History of Rock Music in Five Hundred Songs looks at “Hey Joe\" by the Jimi Hendrix Experience, and is the longest episode to date, at over two hours.\n\nPatreon backers also have a twenty-two-minute bonus episode available, on \"Making Time\" by The Creation.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've put together a Mixcloud mix containing all the music excerpted in this episode.\n\nFor information on the Byrds, I relied mostly on Timeless Flight Revisited by Johnny Rogan, with some information from Chris Hillman’s autobiography.\n\nInformation on Arthur Lee and Love came from Forever Changes: Arthur Lee and the Book of Love by John Einarson, and Arthur Lee: Alone Again Or by Barney Hoskyns.\n\nInformation on Gary Usher's work with the Surfaris and the Sons of Adam came from The California Sound by Stephen McParland, which can be found at https://payhip.com/CMusicBooks\n\nInformation on Jimi Hendrix came from Room Full of Mirrors by Charles R. Cross, Crosstown Traffic by Charles Shaar Murray, and Wild Thing by Philip Norman.\n\nInformation on the history of \"Hey Joe\" itself came from all these sources plus Hey Joe: The Unauthorised Biography of a Rock Classic by Marc Shapiro, though note that most of that book is about post-1967 cover versions.\n\nMost of the pre-Experience session work by Jimi Hendrix I excerpt in this episode is on this box set of alternate takes and live recordings. And \"Hey Joe\" can be found on Are You Experienced?\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nJust a quick note before we start – this episode deals with a song whose basic subject is a man murdering a woman, and that song also contains references to guns, and in some versions to cocaine use. Some versions excerpted also contain misogynistic slurs. If those things are likely to upset you, please skip this episode, as the whole episode focusses on that song. I would hope it goes without saying that I don't approve of misogyny, intimate partner violence, or murder, and my discussing a song does not mean I condone acts depicted in its lyrics, and the episode itself deals with the writing and recording of the song rather than its subject matter, but it would be impossible to talk about the record without excerpting the song. The normalisation of violence against women in rock music lyrics is a subject I will come back to, but did not have room for in what is already a very long episode. Anyway, on with the show.\n\nLet's talk about the folk process, shall we? We've talked before, like in the episodes on \"Stagger Lee\" and \"Ida Red\", about how there are some songs that aren't really individual songs in themselves, but are instead collections of related songs that might happen to share a name, or a title, or a story, or a melody, but which might be different in other ways.\n\nThere are probably more songs that are like this than songs that aren't, and it doesn't just apply to folk songs, although that's where we see it most notably. You only have to look at the way a song like \"Hound Dog\" changed from the Willie Mae Thornton version to the version by Elvis, which only shared a handful of words with the original. Songs change, and recombine, and everyone who sings them brings something different to them, until they change in ways that nobody could have predicted, like a game of telephone.\n\nBut there usually remains a core, an archetypal story or idea which remains constant no matter how much the song changes. Like Stagger Lee shooting Billy in a bar over a hat, or Frankie killing her man -- sometimes the man is Al, sometimes he's Johnny, but he always done her wrong.\n\nAnd one of those stories is about a man who shoots his cheating woman with a forty-four, ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and forty-seven of A History of Rock Music in Five Hundred Songs looks at “Hey Joe\" by the Jimi Hendrix Experience, and is the longest episode to date, at over two hours.\n\nPatreon backers also have a twenty-two-minute bonus episode available, on \"Making Time\" by The Creation.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've put together a Mixcloud mix containing all the music excerpted in this episode.\n\nFor information on the Byrds, I relied mostly on Timeless Flight Revisited by Johnny Rogan, with some information from Chris Hillman’s autobiography.\n\nInformation on Arthur Lee and Love came from Forever Changes: Arthur Lee and the Book of Love by John Einarson, and Arthur Lee: Alone Again Or by Barney Hoskyns.\n\nInformation on Gary Usher's work with the Surfaris and th",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}