{
  "guid": "https://podcasts.nationalreview.com/?p=1854",
  "title": "Episode 17: Stephen Miller / Oasis",
  "description": "<p>Scot and Jeff talk to Fox News’s Stephen Miller about Oasis.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Stephen Miller, co-host of <a href=\"https://ricochet.com/series/the-conservatarians/\">The Conservatarians</a> podcast, opinion contributor to FoxNews.com, formerly of National Review and IJR. Follow Stephen on Twitter at <a href=\"https://twitter.com/redsteeze\">@redsteeze</a> and read his work <a href=\"http://www.foxnews.com/person/m/stephen-l-miller.html\">here</a> and <a href=\"http://thewilderness.me/archive_2/\">here</a>.</p>\n<p><span><b>Stephen’s Musical Pick: Oasis</b></span><b><br />\n</b>It’s time to break out the cigarettes and alcohol as the gang talks about one of the definitive Britpop acts (and arguably one of the biggest bands in the world during the 1990s), Oasis. Stephen cheerfully predicts this will be our “least popular episode ever” as he labels Oasis a band that people love to hate, despite the objective quality of their music. Stephen celebrates them not only as one of rock’s great “troll” bands (anyone familiar with the public interviews and appearances of brothers Liam (lead vocals) and Noel Gallagher (lead guitars, vocals, songwriting) will immediately understand the label), but as a refreshingly straightforward answer to the pretensions of the rest of contemporaneous rock scene: a bunch of guys who unashamedly wanted to be rock stars and had the songs to match. Jeff reminisces about being on the other side of the great Blur vs. Oasis “Britpop Wars” of the mid-’90s (truthfully, he was with the weirdos and theater-kids who loved Radiohead), and how it kept him from giving them a chance for years.</p>\n<p><span><b>“The band you were waiting for your entire life”: <i>Definitely Maybe</i> and the Creation of Britpop<br />\n</b></span><i>Definitely Maybe </i>(1994) <i>— </i>eleven tracks of straight-ahead, tightly-constructed three-chord meat & potatoes RAWK — is considered by many Brits to be one of the greatest debut albums of all time, and none of the gang are going to run counter to the conventional wisdom here. Jeff thinks it might just be a touch overrated (he thinks it’s a tad monochromatic, and oh lord the brickwalled sound can get hard on the ears), but that’s about it for criticism; Scot labels this their finest record. Jeff celebrates the gloriously boneheaded lyrics of songs like “Supersonic” and Stephen agrees, chalking it up to the sound of a band who simply wasn’t even the slightest bit insecure about who they were or what they wanted to be. Stephen also points out how refreshing it was to hear <i>Definitely Maybe</i>coming out of high self-seriousness of the Grunge era (<i>In Utero</i>, <i>Vs.</i>, even the miserabilism of <i>Pablo Honey</i>-era Radiohead). Everyone cites to “Columbia” as the finest song on the album (though Jeff regrets now he didn’t mention “Slide Away,” which is nearly as good), and Scot considers “Live Forever” to be their greatest anthem.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-uHNFL8pmc8\">Rock ‘N Roll Star</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=E7E5aMq7fSc\">Columbia</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=u5mSGTL6EoM\">Live Forever</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=omNRPEWOh6c\">Supersonic</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=M_AK75ifE-w\">Cigarettes & Alcohol</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=1urrn9NGfJY\">Digsy’s Dinner</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=YnYoPKwRX1Q\">Slide Away</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=OCxmwNMBOGo\">Whatever</a>” (A-side of single, 1994)</p>\n<p><span><b>First Britain, then the world: Oasis conquer the globe with </b></span><b><i><span>(What’s The Story) Morning Glory</span><br />\n</i></b><b></b><i>Definitely Maybe</i> may have made Oasis megastars in Great Britain, but it made only minor ripples in the United States (where their tour was aborted when Noel quit the band after several incidents of asinine behavior by his brother Liam). Their big breakthrough would have to wait until next year, when Oasis truly became one of the biggest bands on the planet with <i>(What’s The Story)</i> <i>Morning Glory?</i> (1995). Stephen is a bit tired of this record due to its ubiquity, but since Jeff was a latecomer to Oasis he never had the chance to get tired of it and loves nearly every single song on it, including, yes, “Wonderwall.” But it’s really the Beatley jangle of “She’s Electric” that makes him swoon, while Stephen prefers “Some Might Say” and Scot goes for the epic hook of “Don’t Look Back In Anger.” Stephen points out that bands like Blur and Radiohead may have been the choice of Oxford students and bedsit-room musos, but when the people of Manchester got together to publicly remember the lives lost in the recent Manchester terror bombing, it was “Don’t Look Back In Anger” that the crowd spontaneously broke out singing: this was music that resonated, and still resonates with the masses.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=BLf40tlspPE\">She’s Electric</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=C_QUTK0p8g4\">Roll With It</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=dxOn-aZZ9z0\">Don’t Look Back In Anger</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=aSklJTABqus\">Cast No Shadow</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=zRHAJCqUuDo\">Some Might Say</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=ZrOKjDZOtkA\">Wonderwall</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=NcUhYQQrvyI\">Champagne Supernova</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995)</p>\n<p><span><b><i>The Masterplan</i>: Oasis as one of the great B-side acts of rock history</b></span><b></b></p>\n<p>No understanding of Oasis’ career makes even the slightest bit of sense unless their stunningly impressive passel of otherwise unavailable B-sides are considered, which is what the gang does now. Many (but not all, by any means) were eventually released on the 1999 compilation <i>The Masterplan</i>, and that is probably the best place to collect most of the songs they reference, but Jeff loves the acoustic version of “Up In The Sky” (which he dopily misnames as the similarly titled “Underneath The Sky” during the show) and Stephen picks “D’Yer Wanna Be A Spaceman” as one of his five favorite Oasis songs — and you’ll have to go find the singles or the deluxe reissues if you want to hear those. Please listen to every one of these songs.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-uHNFL8pmc8\">Up In The Sky (acoustic version)</a>” (B-side of “Live Forever,” 1994), “<a href=\"https://www.youtube.com/watch?v=w1Oj0Mmlssg\">D’Yer Wanna Be A Spaceman?</a>” (B-side of “Shakermaker,” 1994); “<a href=\"https://www.youtube.com/watch?v=Uqx4cHNMRjA\">I Am The Walrus (live June 1994)</a>” (B-side of “Cigarettes & Alcohol,” 1994); “<a href=\"https://www.youtube.com/watch?v=-Oeoalds_O8\">Half The World Away</a>” (B-side of “Whatever,” 1994); “<a href=\"https://www.youtube.com/watch?v=d9GtaIN_w2c\">Talk Tonight</a>” (B-side of ‘Some Might Say,” 1995); “<a href=\"https://www.youtube.com/watch?v=Hnu_rGHP4u4\">Acquiesce</a>” (B-side of “Some Might Say,” 1995); “<a href=\"https://www.youtube.com/watch?v=5jlY1s3paVg\">Rockin’ Chair</a>” (B-side of “Roll With It,” 1995); “<a href=\"https://www.youtube.com/watch?v=8QNcluTXcfI\">The Masterplan</a>” (B-side of “Wonderwall,” 1995)</p>\n<p><span><b>Popping the Balloon: the Monumental Self-Indulgence of <i>Be Here Now</i></b></span></p>\n<p>Jeff notes that the only thing missing from the “rock excess” car-in-a-swimming-pool cover of <i>Be Here Now</i>(1998) is the giant bag of cocaine that clearly fueled the poor decisions made during this album’s recording sessions. (Scot: “it’s there, you just can’t see it because it’s already up their noses.”) <i>Be Here Now</i> is usually treated as one of most legendary own-goals in rock history: the universally-anticipated follow-up to one of the most beloved albums of the last 40 years that ended up as a spectacularly self-indulgent, flatulently long (72 minutes!) flop that failed to yield a single song the band considered good enough to put on their later “best-of” compilation <i>Stop The Clocks</i> (2006). And yet! The gang is willing to defend some aspects of <i>Be Here Now</i>. Yes, it’s hideously overlong — five of its eleven songs are over 7 minutes long, and not a single one is <i>under</i> 4m20s — and yes, the mix sounds like it was done amidst a blizzard of cocaine and whiskey. But there’s something interesting going with nearly every one of these songs, Scot, Jeff, and Stephen each come up with their attempt to ‘redo’ <i>Be Here Now</i> to make it palatable, but it’s Stephen’s (cut a bunch of songs and use some of the songs foolishly already given away for non-LP B-sides) that most tracks with Noel Gallagher’s own alt-history take on it. Also, Stephen reads from Noel’s Gallagher’s self-written edits to his own Wikipedia entry.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=xKsT0Z6HW5k\">D’You Know What I Mean?</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=8MDjbuHdI_A\">My Big Mouth</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=9TguPhIbPV8\">Stand By Me</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=dBXvyRqQiWw\">Don’t Go Away</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=qyIi8rEZSQk\">All Around The World</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=r69zpd-6kVI\">Stay Young</a>” (B-side of “D’You Know What I Mean?,” 1998)</p>\n<p><span><b>Digging Out from the Mess: <i>Standing On The Shoulder Of Giants</i> and <i>Heathen Chemistry<br />\n</i></b></span>Neither critics nor bandmembers have much good to say about 2000’s <i>Standing On The Shoulder Of Giants. </i>(Noel Gallagher says nowadays it should never have been released, and that he was in a bout of songwriting lethargy due to recently detoxing from the drug-fueled insanity of the <i>Be Here Now</i> era.) But both Jeff and Scot are actually quite fond of Oasis’ turn towards woozy psychedelia, finding a far more interesting development that the band were given credit for at the time. Neither is nearly as impressed with its “back to basics” follow-up <i>Heathen Chemistry</i> (2002) with the exception of “The Hindu Times” and Liam’s “Songbird,” but Stephen loves “She Is Love” and Scot enjoys “Little By Little.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=d5tv7mtJTB8\">F***in’ In The Bushes</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=esXjDLRW7B0\">Go Let It Out</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=_7mq6G3qK7g\">Put Yer Money Where Your Mouth Is</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=0OxLL5uONJY\">Gas Panic!</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=yjaGwcLBnUE\">Where Did It All Go Wrong?</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=rovJ6m0n9H0\">The Hindu Times</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=SXlKphSkJ7I\">Songbird</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=-Ui91SxGNc4\">She Is Love</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=3HML3Ne9LQ4\">Little By Little</a>” (<i>Heathen Chemistry</i>, 2002)</p>\n<p><span><b>The Best Band You Never Heard in Your Life (If You’re an American): <i>Don’t Believe The Truth</i>, <i>Dig Out Your Soul</i>, and Oasis’ Collapse<br />\n</b></span>Oasis’ last two albums are almost entirely unknown to American audiences, where they did middling business. But they were still huge stars in the United Kingdom and <i>Don’t Believe The Truth </i>(2005) was one of the fastest-selling albums of all-time in that nation, even in an era where CD purchases were quickly being eclipsed by illegal downloads. And the gang wants you to know that it’s a rather underrated record, particularly the delightful Kinks pastiche of “The Importance Of Being Idle.” Jeff is an equally big fan of Andy Bell’s chiming “Turn Up The Sun.” Jeff is also at pains to emphasize that this is the moment when Oasis became far more democratic in terms of songwriting contributions, mostly because Liam was finding his voice as a writer and drummer Andy Bell (formerly of the shoegaze act Ride) was a gifted songwriter in his own right. The gang is even more enthusiastic about Oasis’ swan-song <i>Dig Out Your Soul</i> (2009), a fantastic record that serves as a damn fine epitaph for the band, even if it wasn’t necessarily intended as one.</p>\n<p>This leads up to the collapse of the band (short version: Liam behaving like a prat again, Noel finally saying “that’s it, I’ve had enough”), and therefore to wrap things up, the gang has a discussion about the elephant in the room: the wildly compelling, tabloid-famous sibling rivalry between Noel and Liam Gallagher. Is this the most entertaining sibling rivalry in all of rock history? (Creedence Clearwater Revival, The Black Crowes, and the Beach Boys all have compelling candidacies as well.) That gang thinks so, if only because both Liam and Noel are spectacularly fun (and extremely vulgar) interviews, but also because unlike, say, Tom and John Fogerty (who were truly estranged), you always get the sense that one day Noel and Liam will patch things up…and then promptly fall out with one another again next week.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=S7m0upCiTFQ\">Turn Up The Sun</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=6V-DfpX3jDU\">Guess God Thinks I’m Abel</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=tbpjzvyNKW0\">Lyla</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=Z_JEgPxbvMk\">The Importance Of Being Idle</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=ofduiqyP2Go\">Bag It Up</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=0IgowI6sGu0\">The Turning</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=ay0gSVs7LEI\">The Shock Of The Lightning</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=FgSTaZVeFWQ\">I’m Outta Time</a>” (<i>Dig Out Your Soul</i>, 2008)</p>\n<p><span><b>Finale</b></span><br />\nStephen, Scot and Jeff each name their two key albums and five key songs by Oasis.</p>\n",
  "pubDate": "Mon, 18 Dec 2017 12:59:00 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Fox News’s Stephen Miller about Oasis.</p>\n<p><b><span>Introducing the Band</span><br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Stephen Miller, co-host of <a href=\"https://ricochet.com/series/the-conservatarians/\">The Conservatarians</a> podcast, opinion contributor to FoxNews.com, formerly of National Review and IJR. Follow Stephen on Twitter at <a href=\"https://twitter.com/redsteeze\">@redsteeze</a> and read his work <a href=\"http://www.foxnews.com/person/m/stephen-l-miller.html\">here</a> and <a href=\"http://thewilderness.me/archive_2/\">here</a>.</p>\n<p><span><b>Stephen’s Musical Pick: Oasis</b></span><b><br />\n</b>It’s time to break out the cigarettes and alcohol as the gang talks about one of the definitive Britpop acts (and arguably one of the biggest bands in the world during the 1990s), Oasis. Stephen cheerfully predicts this will be our “least popular episode ever” as he labels Oasis a band that people love to hate, despite the objective quality of their music. Stephen celebrates them not only as one of rock’s great “troll” bands (anyone familiar with the public interviews and appearances of brothers Liam (lead vocals) and Noel Gallagher (lead guitars, vocals, songwriting) will immediately understand the label), but as a refreshingly straightforward answer to the pretensions of the rest of contemporaneous rock scene: a bunch of guys who unashamedly wanted to be rock stars and had the songs to match. Jeff reminisces about being on the other side of the great Blur vs. Oasis “Britpop Wars” of the mid-’90s (truthfully, he was with the weirdos and theater-kids who loved Radiohead), and how it kept him from giving them a chance for years.</p>\n<p><span><b>“The band you were waiting for your entire life”: <i>Definitely Maybe</i> and the Creation of Britpop<br />\n</b></span><i>Definitely Maybe </i>(1994) <i>— </i>eleven tracks of straight-ahead, tightly-constructed three-chord meat & potatoes RAWK — is considered by many Brits to be one of the greatest debut albums of all time, and none of the gang are going to run counter to the conventional wisdom here. Jeff thinks it might just be a touch overrated (he thinks it’s a tad monochromatic, and oh lord the brickwalled sound can get hard on the ears), but that’s about it for criticism; Scot labels this their finest record. Jeff celebrates the gloriously boneheaded lyrics of songs like “Supersonic” and Stephen agrees, chalking it up to the sound of a band who simply wasn’t even the slightest bit insecure about who they were or what they wanted to be. Stephen also points out how refreshing it was to hear <i>Definitely Maybe</i>coming out of high self-seriousness of the Grunge era (<i>In Utero</i>, <i>Vs.</i>, even the miserabilism of <i>Pablo Honey</i>-era Radiohead). Everyone cites to “Columbia” as the finest song on the album (though Jeff regrets now he didn’t mention “Slide Away,” which is nearly as good), and Scot considers “Live Forever” to be their greatest anthem.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-uHNFL8pmc8\">Rock ‘N Roll Star</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=E7E5aMq7fSc\">Columbia</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=u5mSGTL6EoM\">Live Forever</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=omNRPEWOh6c\">Supersonic</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=M_AK75ifE-w\">Cigarettes & Alcohol</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=1urrn9NGfJY\">Digsy’s Dinner</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=YnYoPKwRX1Q\">Slide Away</a>” (<i>Definitely Maybe</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=OCxmwNMBOGo\">Whatever</a>” (A-side of single, 1994)</p>\n<p><span><b>First Britain, then the world: Oasis conquer the globe with </b></span><b><i><span>(What’s The Story) Morning Glory</span><br />\n</i></b><b></b><i>Definitely Maybe</i> may have made Oasis megastars in Great Britain, but it made only minor ripples in the United States (where their tour was aborted when Noel quit the band after several incidents of asinine behavior by his brother Liam). Their big breakthrough would have to wait until next year, when Oasis truly became one of the biggest bands on the planet with <i>(What’s The Story)</i> <i>Morning Glory?</i> (1995). Stephen is a bit tired of this record due to its ubiquity, but since Jeff was a latecomer to Oasis he never had the chance to get tired of it and loves nearly every single song on it, including, yes, “Wonderwall.” But it’s really the Beatley jangle of “She’s Electric” that makes him swoon, while Stephen prefers “Some Might Say” and Scot goes for the epic hook of “Don’t Look Back In Anger.” Stephen points out that bands like Blur and Radiohead may have been the choice of Oxford students and bedsit-room musos, but when the people of Manchester got together to publicly remember the lives lost in the recent Manchester terror bombing, it was “Don’t Look Back In Anger” that the crowd spontaneously broke out singing: this was music that resonated, and still resonates with the masses.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=BLf40tlspPE\">She’s Electric</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=C_QUTK0p8g4\">Roll With It</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=dxOn-aZZ9z0\">Don’t Look Back In Anger</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=aSklJTABqus\">Cast No Shadow</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=zRHAJCqUuDo\">Some Might Say</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=ZrOKjDZOtkA\">Wonderwall</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995); “<a href=\"https://www.youtube.com/watch?v=NcUhYQQrvyI\">Champagne Supernova</a>” (<i>(What’s The Story) Morning Glory?</i>, 1995)</p>\n<p><span><b><i>The Masterplan</i>: Oasis as one of the great B-side acts of rock history</b></span><b></b></p>\n<p>No understanding of Oasis’ career makes even the slightest bit of sense unless their stunningly impressive passel of otherwise unavailable B-sides are considered, which is what the gang does now. Many (but not all, by any means) were eventually released on the 1999 compilation <i>The Masterplan</i>, and that is probably the best place to collect most of the songs they reference, but Jeff loves the acoustic version of “Up In The Sky” (which he dopily misnames as the similarly titled “Underneath The Sky” during the show) and Stephen picks “D’Yer Wanna Be A Spaceman” as one of his five favorite Oasis songs — and you’ll have to go find the singles or the deluxe reissues if you want to hear those. Please listen to every one of these songs.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=-uHNFL8pmc8\">Up In The Sky (acoustic version)</a>” (B-side of “Live Forever,” 1994), “<a href=\"https://www.youtube.com/watch?v=w1Oj0Mmlssg\">D’Yer Wanna Be A Spaceman?</a>” (B-side of “Shakermaker,” 1994); “<a href=\"https://www.youtube.com/watch?v=Uqx4cHNMRjA\">I Am The Walrus (live June 1994)</a>” (B-side of “Cigarettes & Alcohol,” 1994); “<a href=\"https://www.youtube.com/watch?v=-Oeoalds_O8\">Half The World Away</a>” (B-side of “Whatever,” 1994); “<a href=\"https://www.youtube.com/watch?v=d9GtaIN_w2c\">Talk Tonight</a>” (B-side of ‘Some Might Say,” 1995); “<a href=\"https://www.youtube.com/watch?v=Hnu_rGHP4u4\">Acquiesce</a>” (B-side of “Some Might Say,” 1995); “<a href=\"https://www.youtube.com/watch?v=5jlY1s3paVg\">Rockin’ Chair</a>” (B-side of “Roll With It,” 1995); “<a href=\"https://www.youtube.com/watch?v=8QNcluTXcfI\">The Masterplan</a>” (B-side of “Wonderwall,” 1995)</p>\n<p><span><b>Popping the Balloon: the Monumental Self-Indulgence of <i>Be Here Now</i></b></span></p>\n<p>Jeff notes that the only thing missing from the “rock excess” car-in-a-swimming-pool cover of <i>Be Here Now</i>(1998) is the giant bag of cocaine that clearly fueled the poor decisions made during this album’s recording sessions. (Scot: “it’s there, you just can’t see it because it’s already up their noses.”) <i>Be Here Now</i> is usually treated as one of most legendary own-goals in rock history: the universally-anticipated follow-up to one of the most beloved albums of the last 40 years that ended up as a spectacularly self-indulgent, flatulently long (72 minutes!) flop that failed to yield a single song the band considered good enough to put on their later “best-of” compilation <i>Stop The Clocks</i> (2006). And yet! The gang is willing to defend some aspects of <i>Be Here Now</i>. Yes, it’s hideously overlong — five of its eleven songs are over 7 minutes long, and not a single one is <i>under</i> 4m20s — and yes, the mix sounds like it was done amidst a blizzard of cocaine and whiskey. But there’s something interesting going with nearly every one of these songs, Scot, Jeff, and Stephen each come up with their attempt to ‘redo’ <i>Be Here Now</i> to make it palatable, but it’s Stephen’s (cut a bunch of songs and use some of the songs foolishly already given away for non-LP B-sides) that most tracks with Noel Gallagher’s own alt-history take on it. Also, Stephen reads from Noel’s Gallagher’s self-written edits to his own Wikipedia entry.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=xKsT0Z6HW5k\">D’You Know What I Mean?</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=8MDjbuHdI_A\">My Big Mouth</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=9TguPhIbPV8\">Stand By Me</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=dBXvyRqQiWw\">Don’t Go Away</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=qyIi8rEZSQk\">All Around The World</a>” (<i>Be Here Now</i>, 1998); “<a href=\"https://www.youtube.com/watch?v=r69zpd-6kVI\">Stay Young</a>” (B-side of “D’You Know What I Mean?,” 1998)</p>\n<p><span><b>Digging Out from the Mess: <i>Standing On The Shoulder Of Giants</i> and <i>Heathen Chemistry<br />\n</i></b></span>Neither critics nor bandmembers have much good to say about 2000’s <i>Standing On The Shoulder Of Giants. </i>(Noel Gallagher says nowadays it should never have been released, and that he was in a bout of songwriting lethargy due to recently detoxing from the drug-fueled insanity of the <i>Be Here Now</i> era.) But both Jeff and Scot are actually quite fond of Oasis’ turn towards woozy psychedelia, finding a far more interesting development that the band were given credit for at the time. Neither is nearly as impressed with its “back to basics” follow-up <i>Heathen Chemistry</i> (2002) with the exception of “The Hindu Times” and Liam’s “Songbird,” but Stephen loves “She Is Love” and Scot enjoys “Little By Little.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=d5tv7mtJTB8\">F***in’ In The Bushes</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=esXjDLRW7B0\">Go Let It Out</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=_7mq6G3qK7g\">Put Yer Money Where Your Mouth Is</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=0OxLL5uONJY\">Gas Panic!</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=yjaGwcLBnUE\">Where Did It All Go Wrong?</a>” (<i>Standing On The Shoulder Of Giants</i>, 2000); “<a href=\"https://www.youtube.com/watch?v=rovJ6m0n9H0\">The Hindu Times</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=SXlKphSkJ7I\">Songbird</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=-Ui91SxGNc4\">She Is Love</a>” (<i>Heathen Chemistry</i>, 2002); “<a href=\"https://www.youtube.com/watch?v=3HML3Ne9LQ4\">Little By Little</a>” (<i>Heathen Chemistry</i>, 2002)</p>\n<p><span><b>The Best Band You Never Heard in Your Life (If You’re an American): <i>Don’t Believe The Truth</i>, <i>Dig Out Your Soul</i>, and Oasis’ Collapse<br />\n</b></span>Oasis’ last two albums are almost entirely unknown to American audiences, where they did middling business. But they were still huge stars in the United Kingdom and <i>Don’t Believe The Truth </i>(2005) was one of the fastest-selling albums of all-time in that nation, even in an era where CD purchases were quickly being eclipsed by illegal downloads. And the gang wants you to know that it’s a rather underrated record, particularly the delightful Kinks pastiche of “The Importance Of Being Idle.” Jeff is an equally big fan of Andy Bell’s chiming “Turn Up The Sun.” Jeff is also at pains to emphasize that this is the moment when Oasis became far more democratic in terms of songwriting contributions, mostly because Liam was finding his voice as a writer and drummer Andy Bell (formerly of the shoegaze act Ride) was a gifted songwriter in his own right. The gang is even more enthusiastic about Oasis’ swan-song <i>Dig Out Your Soul</i> (2009), a fantastic record that serves as a damn fine epitaph for the band, even if it wasn’t necessarily intended as one.</p>\n<p>This leads up to the collapse of the band (short version: Liam behaving like a prat again, Noel finally saying “that’s it, I’ve had enough”), and therefore to wrap things up, the gang has a discussion about the elephant in the room: the wildly compelling, tabloid-famous sibling rivalry between Noel and Liam Gallagher. Is this the most entertaining sibling rivalry in all of rock history? (Creedence Clearwater Revival, The Black Crowes, and the Beach Boys all have compelling candidacies as well.) That gang thinks so, if only because both Liam and Noel are spectacularly fun (and extremely vulgar) interviews, but also because unlike, say, Tom and John Fogerty (who were truly estranged), you always get the sense that one day Noel and Liam will patch things up…and then promptly fall out with one another again next week.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=S7m0upCiTFQ\">Turn Up The Sun</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=6V-DfpX3jDU\">Guess God Thinks I’m Abel</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=tbpjzvyNKW0\">Lyla</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=Z_JEgPxbvMk\">The Importance Of Being Idle</a>” (<i>Don’t Believe The Truth</i>, 2005); “<a href=\"https://www.youtube.com/watch?v=ofduiqyP2Go\">Bag It Up</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=0IgowI6sGu0\">The Turning</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=ay0gSVs7LEI\">The Shock Of The Lightning</a>” (<i>Dig Out Your Soul</i>, 2008); “<a href=\"https://www.youtube.com/watch?v=FgSTaZVeFWQ\">I’m Outta Time</a>” (<i>Dig Out Your Soul</i>, 2008)</p>\n<p><span><b>Finale</b></span><br />\nStephen, Scot and Jeff each name their two key albums and five key songs by Oasis.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 17: Stephen Miller / Oasis",
  "itunes:author": "National Review",
  "itunes:duration": "02:08:38",
  "itunes:summary": "Scot and Jeff talk to Stephen Miller about Oasis.",
  "itunes:subtitle": "Scot and Jeff talk to Stephen Miller about Oasis.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 17
}