{
  "id": "yt:video:uVetowZOndQ",
  "yt:videoId": "uVetowZOndQ",
  "yt:channelId": "UCsT0YIqwnpJCM-mx7-gSA4Q",
  "title": "Effects of nanomaterials on organisms and ecosystems | Martina Vijver | TEDxBoerhaavedistrictStudio",
  "link": "",
  "author": {
    "name": "TEDx Talks",
    "uri": "https://www.youtube.com/channel/UCsT0YIqwnpJCM-mx7-gSA4Q"
  },
  "published": "2022-11-04T17:48:38+00:00",
  "updated": "2022-11-05T07:23:57+00:00",
  "media:group": {
    "media:title": "Effects of nanomaterials on organisms and ecosystems | Martina Vijver | TEDxBoerhaavedistrictStudio",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What effects can nanomaterials have on the planet? In this talk Martina Vijver explains what her team of ecotoxicologists has discovered.\nCredits and thanks to: Recording studio sponsor @ University of Applied Sciences Leiden. Graphic design by Esmé Postma, Ire Oyekan and Sheila Herron. Intro music Birds by Scandinavianz | https://soundcloud.com/scandinavianz Creative Commons Attribution 3.0 Unported License https://creativecommons.org/licenses/by/3.0/deed.en_US Martina Vijver is Professor of Ecotoxicology and the first female Scientific director of the Institute of Environmental Sciences at Leiden University. Martina has extensive experience in working on the boundary of chemistry, biology and physics needed to unravel the impact of nanomaterials and chemicals to organisms, populations and communities. She is involved in various Horizon 2020 projects and has been awarded multiple prestigious research grants. In 2017 she received the international World Cultural Council prize for outspoken research and outreach activities to young students and the main public. She collaborated on writing 2 textbooks for BSc-students Environmental Toxicology (2019 online learning book), and Food and Sustainability (2019). This talk was given at a TEDx event using the TED conference format but independently organized by a local community. Learn more at https://www.ted.com/tedx",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}