{
  "id": "https://bibleinoneyear.org/en/youth/38",
  "title": "Day 38: Use It or Lose It",
  "description": "Psalm 18:46,50, Job 42:8-10, Matthew 25:20–40.  Use them or lose them  He is faithful to us and he expects us to be faithful to him",
  "pubDate": "Sun, 07 Feb 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/38/?ignore",
  "itunes:duration": "13:35",
  "guid": "enyouth07022021-38",
  "length": 815.31,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 38: Use It or Lose It",
  "itunes:subtitle": "Psalm 18:46,50, Job 42:8-10, Matthew 25:20–40.  Use them or lose them  He is faithful to us and he expects us to be faithful to him",
  "itunes:summary": "Myra Hindley was one of the most notorious murderers of the twentieth century. Her crimes were almost unbelievably horrific. Yet, one person took it upon himself to visit her regularly while she was in prison.\nLord Longford (1905–2001) was a controversial figure who spent much of his life visiting prisoners, including Myra Hindley. Yet, no one can doubt his compassion and his faithfulness, both to God and to those he visited.\nWhen he died, former prisoners joined hundreds of mourners to say farewell to the man who had spent his life faithfully fighting for society’s outcasts.\nHe found inspiration in the words of Jesus from today’s passage. On his deathbed he asked his wife, ‘You know what the most important quotation from the Bible is?’ He spoke his last words by answering his own question, quoting the words of Jesus: ‘I was in prison and you came to visit me’ (Matthew 25:36).\nLife is not a competition that you have to win. It is not supposed to be a rat race. Life is a huge privilege and an opportunity. God has trusted you with gifts and abilities, which he wants you to use. Use them or lose them. He is faithful to us and he expects us to be faithful to him.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 38
}