{
  "title": "Hollywood Whines About Mandatory Release Windows (Which They Used To Support) Fueling Piracy",
  "link": "https://www.techdirt.com/2022/11/04/hollywood-whines-about-mandatory-release-windows-which-they-used-to-support-fueling-piracy/",
  "comments": "https://www.techdirt.com/2022/11/04/hollywood-whines-about-mandatory-release-windows-which-they-used-to-support-fueling-piracy/#comments",
  "dc:creator": "Mike Masnick",
  "pubDate": "Fri, 04 Nov 2022 22:44:46 +0000",
  "category": [
    "mpa",
    "day and date",
    "release windows",
    "streaming",
    "trade barriers",
    "ustr"
  ],
  "guid": "https://www.techdirt.com/?p=381726",
  "description": "This is all kinds of hilarious if you&#8217;re aware of the history of the Motion Picture Association (MPA), formerly the MPAA. Basically, the group&#8217;s entire existence has been built around lobbying government for ever more ridiculous laws that protect the bottom line of the movie studios. In the late aughts, the studios decided they needed [&#8230;]",
  "content:encoded": "<p>This is all kinds of hilarious if you&#8217;re aware of the history of the Motion Picture Association (MPA), formerly the MPAA. Basically, the group&#8217;s entire existence has been built around lobbying government for ever more ridiculous laws that protect the bottom line of the movie studios.  In the late aughts, the studios decided they needed to fight for special &#8220;release windows&#8221; to make it harder for people to rent movies (this was the pre-streaming, DVD era).</p>\n<p>Specifically, Hollywood had a pretty clear release window schedule (we&#8217;ll leave aside how the industry fought the existence of a &#8220;home&#8221; movie market all the way up to the Supreme Court, <a href=\"https://en.wikipedia.org/wiki/Sony_Corp._of_America_v._Universal_City_Studios,_Inc.\">where they lost</a>): movies get released in theaters. Many months later, DVDs (and VHS tapes) would be available to <em>purchase</em> at inflated prices.  Many months after that, you could finally rent them at your local rental store.  The issue in the late aughts was that a new entrant, Redbox, was bucking that last window by buying the DVDs&#8230; and just renting them out, relying on the first sale doctrine.</p>\n<p>And, hoo boy, did the movie studios lose their shit.  20th Century Fox declared Redbox a menace and <a href=\"https://www.techdirt.com/2009/08/07/fox-the-latest-studio-to-declare-war-on-redbox/\">ordered its wholesalers</a> not to sell to the company. Redbox and Universal <a href=\"https://www.techdirt.com/2008/10/28/hollywood-again-tries-to-stop-innovation-threatening-redbox-dvd-rentals/\">went to court</a> after Universal demanded Redbox wait 45 days after DVDs were released for sale to rent them. Warner Bros. <a href=\"https://www.techdirt.com/2009/08/14/hollywoods-war-with-redbox-expanding-to-netflix-as-well/\">then blocked Redbox</a> (and Netflix, long before Netflix became a member of the MPA) as well.  The studios insisted that these windows were <em>vital</em> to their own business interests.</p>\n<p>How things have changed.</p>\n<p>DVDs are now relics. Streaming rules the day. Netflix is a member of the MPA and one of the biggest &#8220;studios&#8221; around. </p>\n<p>And&#8230; now, the MPA is freaked out about release windows. And how they might increase piracy. Gee, that kinda sounds like the thing we talked about a decade ago, when we pointed out that all these release windows <em>that the studios demanded</em>, <a href=\"https://www.techdirt.com/2011/12/01/yet-another-study-shows-that-hollywoods-own-bad-decisions-are-increasing-amount-infringement/\">were contributing to piracy</a>.</p>\n<p>So I find it absolutely hilarious that, as reported by TorrentFreak, the <a href=\"https://torrentfreak.com/mpa-mandatory-release-windows-could-exacerbate-piracy-221103/\">MPA is fuming at laws</a> in France and Italy (almost certainly pushed for by <em>theater</em> owners) that require mandatory release windows. The MPA filed its usual <a href=\"https://s3.documentcloud.org/documents/23267386/ustr-2022-mpa-trade-barriers.pdf\">overwrought list of concerns</a> about &#8220;trade barriers&#8221; (historically, this has always been &#8220;copyright laws that are too weak&#8221;) to the US Trade Rep (USTR).  And these mandatory release windows are part of their concerns.</p>\n<p>In France, where the ridiculous &#8220;media chronology law&#8221; was <a href=\"https://torrentfreak.com/france-is-fighting-piracy-and-keeping-it-alive-at-the-same-time-220525/\">recently updated</a> so that streaming services had to wait 15 to 17 months after a theatrical release to stream a film (before that it had been <em>three years</em>). But <em>now</em> the MPA is suddenly concerned that these laws lead to piracy there: </p>\n<blockquote>\n<p><em>\nRelease Windows – France mandates the chronology\nof how cinematographic content is released. The\nmedia chronology was last updated in January\n2022. However, several international and local\nstakeholders have argued that the chronology lacks\nflexibility, that the mandated release windows are\ntoo long, and that such windows exacerbate piracy.\nThere are ongoing discussions to re-update the\nmedia chronology.</p>\n<p></em></p>\n</blockquote>\n<p>They&#8217;re similarly concerned about a release window law in Italy, which is currently at 90 days and is looking to extend it:</p>\n<blockquote>\n<p><em>\nRelease Windows – In 2022, the Italian government\nconsidered extending a 90-day mandatory release\nwindow to all theatrical films, including foreign\nproductions. The Italian government introduced a\nmandatory window for Italian subsidized motion\npictures in 2018. MPA is concerned about the\nimpact of such an extension on a broad scale,\nas this mandatory window would have serious\nrepercussions on producers’ ability to adequately\nmarket their works. It remains unclear at this stage\nif the new government elected in October 2022 will\nfurther pursue plans to regulate theatrical release\nwindows. </p>\n<p></em></p>\n</blockquote>\n<p>So, everyone agrees with the MPA here that these mandatory release windows are really, really silly, and serve no one&#8217;s interests but theater owners&#8217;.  But I find it <em>pretty rich</em> that the MPA is running around calling these &#8220;trade barriers&#8221; when it was just over a decade ago that they were fighting for the same sort of release windows, when they (falsely) believed they benefited the studios.</p>\n",
  "wfw:commentRss": "https://www.techdirt.com/2022/11/04/hollywood-whines-about-mandatory-release-windows-which-they-used-to-support-fueling-piracy/comments/feed/",
  "slash:comments": 10
}