{
  "id": "https://bibleinoneyear.org/en/youth/118",
  "title": "Day 118: It’s Not Over",
  "description": "Psalm 52:1–9, Joshua 13:1, 14:6–11, Luke 24:36–49.  He entitled his autobiography *Unfinished Agenda*  For him, there was always still so much to hope for and so much more to be done",
  "pubDate": "Thu, 28 Apr 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/118/",
  "itunes:duration": "13:46",
  "guid": "enyouth28042022-118",
  "length": 826.36,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 118: It’s Not Over",
  "itunes:subtitle": "Psalm 52:1–9, Joshua 13:1, 14:6–11, Luke 24:36–49.  He entitled his autobiography *Unfinished Agenda*  For him, there was always still so much to hope for and so much more to be done",
  "itunes:summary": "You could have heard a pin drop. It was mesmerising. We were spellbound. An eighty-five-year-old man, almost totally blind, got up to speak to 1,500 people of all ages on our church holiday. He had no notes, of course, because he could no longer read. He gave two talks, each of them an hour long.\nIn the first talk, he gave a breathtaking summary of the entire Old Testament. In the second, which was equally brilliant, he gave a summary of the whole of the New Testament. There was no hesitation, no stumbling and not a word was out of place. It was the distilled wisdom of a man who had followed the Lord wholeheartedly all his life.\nBishop Lesslie Newbigin had one of the most remarkable ministries of the twentieth century. At the age of thirty-six he was elected as one of the first bishops of the new Church of South India*.* When he returned from India, later on in life, he wrote several books that aimed to help the church in the West fulfil its mission in a world that was rapidly changing and felt no need for God.\nHis writing and speaking influenced thousands of Christian leaders around the world. Yet for this astonishing man, who had achieved so much in his life, it was not over. He entitled his autobiography Unfinished Agenda. For him, there was always still so much to hope for and so much more to be done.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 483
}