{
  "title": "Benjamin Meiches, \"The Politics of Annihilation: A Genealogy of Genocide\" (U Minnesota Press, 2019)",
  "description": "In The Politics of Annihilation: A Genealogy of Genocide (University of Minnesota Press, 2019),Benjamin Meiches takes a novel approach to the study of genocide by analyzing the ways in which ideas, concepts, and understandings about what genocide is and how it is to be prevented have become entrenched politically and intellectually. At the center of this analysis is what Meiches refers to throughout his text as the hegemonic understanding of genocide. Using what Michel Foucault describes as genealogy, Meiches set out to evaluate the process by which the concept of genocide has become intelligible. In doing so, Meiches offers significant evidence in support of many of the emerging critiques of the field of genocide studies. Meiches also inspires reflective and introspective thinking regarding the ways in which genocide scholarship contributes to the maintenance of a hegemonic understanding of genocide.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/law",
  "pubDate": "Wed, 17 Jul 2019 08:00:00 -0000",
  "itunes:episodeType": "full",
  "itunes:episode": 94,
  "itunes:author": "New Books Network",
  "itunes:subtitle": "At the center of this analysis is what Meiches refers to throughout his text as the hegemonic understanding of genocide...",
  "itunes:summary": "In The Politics of Annihilation: A Genealogy of Genocide (University of Minnesota Press, 2019),Benjamin Meiches takes a novel approach to the study of genocide by analyzing the ways in which ideas, concepts, and understandings about what genocide is and how it is to be prevented have become entrenched politically and intellectually. At the center of this analysis is what Meiches refers to throughout his text as the hegemonic understanding of genocide. Using what Michel Foucault describes as genealogy, Meiches set out to evaluate the process by which the concept of genocide has become intelligible. In doing so, Meiches offers significant evidence in support of many of the emerging critiques of the field of genocide studies. Meiches also inspires reflective and introspective thinking regarding the ways in which genocide scholarship contributes to the maintenance of a hegemonic understanding of genocide.\nLearn more about your ad choices. Visit megaphone.fm/adchoices\nSupport our show by becoming a premium member! https://newbooksnetwork.supportingcast.fm/law",
  "content:encoded": "<p>In <a href=\"http://www.amazon.com/dp/1517905826/?tag=newbooinhis-20\"><em>The Politics of Annihilation: A Genealogy of Genocide</em></a> (University of Minnesota Press, 2019),<a href=\"https://directory.tacoma.uw.edu/employee/bmeiches\"><em>Benjamin Meiches</em></a> takes a novel approach to the study of genocide by analyzing the ways in which ideas, concepts, and understandings about what genocide is and how it is to be prevented have become entrenched politically and intellectually. At the center of this analysis is what Meiches refers to throughout his text as the hegemonic understanding of genocide. Using what Michel Foucault describes as <em>genealogy</em>, Meiches set out to evaluate the process by which the concept of genocide has become intelligible. In doing so, Meiches offers significant evidence in support of many of the emerging critiques of the field of genocide studies. Meiches also inspires reflective and introspective thinking regarding the ways in which genocide scholarship contributes to the maintenance of a hegemonic understanding of genocide.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p><p>Support our show by becoming a premium member! <a href=\"https://newbooksnetwork.supportingcast.fm/law\">https://newbooksnetwork.supportingcast.fm/law</a></p>",
  "itunes:duration": 3469,
  "itunes:explicit": "no",
  "guid": "e15088ec-a31f-11e9-8e12-43ea3af0f69f",
  "enclosure": ""
}