{
  "title": "What continues to stun me is how something can be clear and unambiguous, and it still takes years or even decades to resolve",
  "link": "https://statmodeling.stat.columbia.edu/2022/11/05/what-continues-to-stun-me-is-how-a-problem-can-be-clear-and-unambiguous-and-it-still-takes-years-or-even-decades-to-resolve/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/11/05/what-continues-to-stun-me-is-how-a-problem-can-be-clear-and-unambiguous-and-it-still-takes-years-or-even-decades-to-resolve/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Sat, 05 Nov 2022 13:26:40 +0000",
  "category": [
    "Sociology",
    "Zombies"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=47806",
  "description": "OK, remember Wile E. Coyote when he makes the all-too-common mistake of stepping off a cliff, or standing on a cliff edge that breaks? He stands there in the air, unsupported by anything, until he realizes what&#8217;s happening&#8212;and only then &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/11/05/what-continues-to-stun-me-is-how-a-problem-can-be-clear-and-unambiguous-and-it-still-takes-years-or-even-decades-to-resolve/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>OK, remember Wile E. Coyote when he makes the all-too-common mistake of stepping off a cliff, or standing on a cliff edge that breaks?  He stands there in the air, unsupported by anything, until he realizes what&#8217;s happening&#8212;and only then does he fall.</p>\n<p>We see this a lot with science scandals and political scandals:  the problem is there for ever and ever, people point it out, they holler and scream, but that damn coyote just stands there, oblivious.</p>\n<p>One example we talked about a couple years ago was the scam medical-device company <a href=\"https://statmodeling.stat.columbia.edu/2018/08/09/bad-blood-secrets-lies-silicon-valley-startup/\">Theranos</a>, which fell apart around 2015, nearly a decade <em>after</em> they faked a test in 2006, causing one of its chief executives to leave.</p>\n<p>And Cornell&#8217;s Food and Brand Lab (&#8220;Pizzagate&#8221;), which fell apart around 2017, <a href=\"https://statmodeling.stat.columbia.edu/2018/03/03/brian-wansinks-misrepresentation-data-research-methods-known-years/\">years after</a> their work had been publicly criticized several times, with the lab never offering any reasonable rebuttal to these points.</p>\n<p>Let me be clear here.  It&#8217;s not a surprise to me that people whose bad research has been called out will continue to publish bad research:  there are lots of journals out there that are looking for publishable articles, so if you have the knack for writing an article in that publishable style, you can keep getting published.  And then people will read your article and take it seriously, because the default mode of reading a published article is to take it seriously, so you can get citations etc.  Similarly, it&#8217;s no surprise that companies that are in proximity to rich people or some other source of suckers can get funding even if they have a track record of lies.</p>\n<p>So that&#8217;s no surprise.  What surprises me is the high-profile cases.  Theranos didn&#8217;t just pull in some money; it got a lot of publicity.  The Food and Brand Lab people were all over the major media.  In both cases, it took many years for the crash to come.</p>\n<p>OK, here are a couple more examples that came up recently.  I read them in Defector, the sports website that never sticks to sports:</p>\n<p><a href=\"https://defector.com/meet-richard-fritz-americas-most-unelectable-elected-official/\">Meet Richard Fritz, America’s Most Unelectable Elected Official</a></p>\n<p><a href=\"https://defector.com/cops-are-still-fainting-when-they-touch-fentanyl/\">Cops Are Still Fainting When They Touch Fentanyl</a></p>\n<p>Both of these are scandals that have been going on for years&#8212;and people have been screaming about them for years&#8212;but they just keep on going.  The perpetrators have that chutzpah which is one of the strongest forces of nature.</p>\n<p>And then, the most horrible story.  I just read Nickel Boys&#8212;I&#8217;ll read anything by Colson Whitehead, as long as it&#8217;s not about <a href=\"https://statmodeling.stat.columbia.edu/2020/01/21/top-5-literary-descriptions-of-poker/\">poker</a>&#8212;and then I went to wikipedia to read up on the <a href=\"https://en.wikipedia.org/wiki/Florida_School_for_Boys\">true story</a> that it&#8217;s based on.  OK, here&#8217;s the deal.  The Florida School for Boys in Marianna, Florida, had all these scandals, starting shortly after it was founded in 1990 (&#8220;In 1903, an inspection reported that children at the school were commonly kept in leg irons. . . . A fire in a dormitory at the school in 1914 killed six students and two staff members. . . . A 13-year-old boy sent to the school in 1934 for &#8216;trespassing&#8217; died 38 days after arriving there. . . . there were 81 school-related deaths of students from 1911 to 1973 . . . In 1968, Florida Governor Claude Kirk said, after a visit to the school where he found overcrowding and poor conditions, that &#8216;somebody should have blown the whistle a long time ago.&#8217; . . .&#8221;)  OK, horrible things going on for nearly 70 years, all happening in a racist environment (the &#8220;School&#8221; separately housed whites and blacks), then they finally blew the whistle&#8212;1968 was way too late, but that was a time of reform.</p>\n<p>But, no, it didn&#8217;t stop in 1968.  The wikipedia entry continues:  &#8220;In 1982, an inspection revealed that boys at the school were &#8220;hogtied and kept in isolation for weeks at a time&#8221;. The ACLU filed a lawsuit over this and similar mistreatment at a total of three juvenile facilities in Florida. . . . In 1985, the media reported that young ex-students of the school, sentenced to jail terms for crimes committed at Dozier, had subsequently been the victims of torture by guards at the Jackson County jail. The prison guards typically handcuffed the teenagers and hanged them from the bars of their cells, sometimes for over an hour. The guards said their superiors approved the practice and that it was routine. . . . In 1994, the school was placed under the management of the newly created Florida Department of Juvenile Justice . . . On September 16, 1998, a resident of the school lost his right arm in a washing machine. . . . In April 2007, the acting superintendent of the school and one other employee were fired following allegations of abuse of inmates.&#8221;</p>\n<p>That&#8217;s 2007&#8212;over 100 years after the first scandal (the inspection in 1903 with the leg irons), nearly 30 years after the governor talked about blowing the whistle, and over 20 years after the reports of torture.  And then, &#8220;In late 2009, the school failed its annual inspection. . . .&#8221;  The &#8220;School&#8221; was finally closed in 2011.</p>\n<p>Everything took so long.  It &#8220;failed its annual inspection&#8221; in 2009!  What did they think about all the annual inspections that came before?  At some point, this history should case doubts upon the inspection process itself, no?</p>\n<p><strong>How does it happen?</strong></p>\n<p>My point here is not to stir up indignation about a past scandal, which is part of the whole &#8220;New Jim Crow&#8221; thing that&#8217;s been doing its part to destroy our country for a long time.  This is just the most striking example I&#8217;ve come across of a general phenomenon of the truth being out there, available to all, but nothing happens.  This is not a new thing&#8212;consider, for example, the Dreyfus affair, where it was clear that the evidence was fabricated, but this didn&#8217;t stop it from being a live issue for years and years after that.  But, that was the 1800s!  We should realize that this sort of thing continues to happen today, in so many different domains, as discussed above.</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/11/05/what-continues-to-stun-me-is-how-a-problem-can-be-clear-and-unambiguous-and-it-still-takes-years-or-even-decades-to-resolve/feed/",
  "slash:comments": 5
}