{
  "id": "yt:video:hIXaUaZc-Vw",
  "yt:videoId": "hIXaUaZc-Vw",
  "yt:channelId": "UCZRoNJu1OszFqABP8AuJIuw",
  "title": "Dubai's \"Oil Independence\" Is A Fairytale",
  "link": "",
  "author": {
    "name": "Logically Answered",
    "uri": "https://www.youtube.com/channel/UCZRoNJu1OszFqABP8AuJIuw"
  },
  "published": "2022-10-10T19:00:19+00:00",
  "updated": "2022-10-30T08:54:33+00:00",
  "media:group": {
    "media:title": "Dubai's \"Oil Independence\" Is A Fairytale",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Dubai often likes to portray themselves as someone who has escaped their dependency on oil by cleverly investing in hospitality and tourism. They usually back up this claim by stating that less than 1% of their GDP comes from oil. While this sounds great at first glance, when we take a closer look, we’ll see that this is rather misleading. Even though less than 1% of Dubai’s GDP comes from oil doesn’t mean that oil helps the emirate in other ways. Likely the most obvious way in which oil plays a role in Dubai is through Abu Dhabi. The UAE is actually one of the most oil-rich countries in the world and almost all of that oil is located in Abu Dhabi. So, while Dubai isn’t able to produce their own oil and export it, they do often get loans, investments, and bailouts from Abu Dhabi. A perfect example of this was in 2008 when Abu Dhabhi bailed out Dubai with $10 billion. This bailout was crucial in completing the Burj Khalifa and keeping the emirate afloat. But, Dubai has yet to pay back Abu Dhabi for this bailout. This video explains how Dubai is still dependent on oil revenue through Abu Dhabi and why Dubai’s story of oil independence is nothing more than a fairytale. \n\nDiscord Community: \nhttps://discord.gg/SJUNWNt\n\nTimestamps:\n0:00 - Dubai’s Fairytale\n2:10 - Nothing But Poverty\n5:14 - Close By No Cigar\n8:23 - The Godfather\n11:34 - The Ugly Truth\n\nThumbnail Credit:\nJack Morton\nhttps://bit.ly/3CoijY5\n\nResources:\nhttps://pastebin.com/AVjsUxnK",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}