{
  "id": "tag:theatlantic.com,2020:39-616477",
  "content": "<p class=\"dropcap\">HBO’s <i>Silicon Valley </i>aired its final episode last year, the tech world’s realities having gotten too dystopian to be fictionalized, in good conscience, for laughs. When a reporter asked what material the show had left on the table, the showrunners, Mike Judge and Alec Berg, admitted, “We missed the WeWork guy.” That guy—WeWork’s telegenic co-founder and former CEO, Adam Neumann—had once been known for turning an upscale co-working business into America’s most valuable private start-up, peddling vague kumbayas like <i>This decade is the decade of “We.”</i> But then WeWork <a href=\"https://www.sec.gov/Archives/edgar/data/1533523/000119312519220499/d781982ds1.htm\">filed paperwork to go public</a>, revealing that the company had lost billions of dollars while enriching Neumann.</p><p>Among other extraordinary disclosures, it turned out that he had bought <i>we</i>-related trademarks, then charged WeWork $5.9 million to buy them. The press soon uncovered other details to fill out the portrait of a terrible little richling: Neumann’s practice of <a href=\"https://www.wsj.com/articles/this-is-not-the-way-everybody-behaves-how-adam-neumanns-over-the-top-style-built-wework-11568823827\">hotboxing chartered jets</a>, whether his co-passengers liked it or not; his musings about becoming president of the world; his company-wide ban on meat that left executives puzzling over how to implement it.</p><p>When life transcends art, tell it straight. That’s what Reeves Wiedeman, a <i>New York </i>contributing editor since 2016, has done with <i>Billion Dollar Loser</i>, the <a href=\"https://nymag.com/intelligencer/2019/06/wework-adam-neumann.html\">propulsive tale of WeWork’s, and Neumann’s, rise and fall</a>. Neumann is clearly not the first founder to enrich and empower himself while claiming to do the same for the masses. At a congressional hearing this summer about tech companies’ enormous wealth and influence, Facebook’s Mark Zuckerberg explained that his company is “giving every person a voice.” And while Neumann’s eccentricities are undeniable, Elon Musk, of Tesla and SpaceX, has a mind-reading start-up and a son named X Æ A-Xii. What sets Neumann apart is the flagrancy with which he exploited investors, employees, and customers for his own benefit. His innovation was, in the terms of the trade, one of scale.</p><p class=\"dropcap\"><span class=\"smallcaps\">Neumann spun </span>an origin myth about growing up on a kibbutz in Israel, where he appreciated the community but bristled at how everyone was rewarded the same regardless of how much work they put in. He envisioned WeWork, he said, as a “capitalist kibbutz”—a “community,” but the kind where “you eat what you kill.”</p><p>Wiedeman (with whom I overlapped while working at <i>The New Yorker</i>) presents a more nuanced portrait of the founder as a young man. Neumann was born in 1979 in Beersheba, Israel, to physician parents who shuttled Neumann and his sister around desert towns before moving to the suburbs of Tel Aviv. When he was in the second grade, his grandmother realized that he couldn’t read the menu at a restaurant; he was dyslexic. “He had become skilled at fooling his teachers and coaxing others to do what he needed,” Wiedeman writes. After his parents divorced when he was 9, his mother moved, with him and his sister, to Indianapolis, where he struggled emotionally at first. Only later did the family live on a kibbutz, after they’d returned to Israel. Neumann went on to serve in the Israeli navy, and then moved to New York, where he enrolled at Baruch College, before launching a series of businesses—making collapsible high heels, then baby clothes with kneepads—and dropping out. In 2010, he and a friend, Miguel McKelvey, unveiled WeWork.</p><aside class=\"callout-placeholder\" data-source=\"curated\"></aside><p>At the time, co-working spaces were already common. The business model was straightforward: Entrepreneurs “leased space, cut it up, and rented out each slice with an upcharge for hip design, flexibility, and regular happy hours,” Wiedeman writes. But those in charge typically ran no more than a few locations apiece, in part because operating multiple spaces required spending a lot of money, up front, on leases. What distinguished Neumann, along with his ambition, was “his connection to capital,” Wiedeman writes. Neumann had married <a href=\"https://www.bustle.com/p/rebekah-neumanns-search-for-enlightenment-fueled-weworks-collapse-22581874\">Rebekah Paltrow</a>, a wealthy cousin of Gwyneth Paltrow and a kabbalah devotee. She invested part of a $1 million nest egg in WeWork and introduced her husband to Manhattan’s Kabbalah Centre, where he met other well-off backers. By January 2012, he had raised almost $7 million.</p><p>Neumann’s approach to fundraising seems rooted in a simple tenet: Find out what investors want—then say whatever is needed to convince them that their desires are yours. Heavily reliant on support from the kabbalists, Neumann told a real-estate publication that WeWork had in fact been inspired by kabbalah: “I noticed that in the Kabbalah community, people were really helping each other. I wanted to translate that to business.” His chameleonic tendencies as a child and young man, it turned out, had been good training.</p><p>Later, as he began courting Silicon Valley’s venture-capital firms—which tend to invest in fast-growing tech companies—Neumann described WeWork as a “physical social network,” and promptly raised $16.5 million from Benchmark. Investors surely also liked his message about his company’s position in the Silicon Valley ecosystem: Work had come to feel alienating; <a href=\"https://www.theatlantic.com/magazine/archive/2018/03/wework-the-perfect-manifestation-of-the-millennial-id/550922/?utm_source=feed\">WeWork would make it social again</a>, while at the same time empowering independent-minded entrepreneurs to fulfill their individual dreams. As venture-capital funding poured in—seven more rounds followed—Neumann hired engineers to work on techie-sounding projects, such as building an exclusive social-networking platform for WeWork members. More significant, with investors encouraging fast growth, he leased hundreds of new spaces around the world, splurging on perks such as free beer and <a href=\"https://www.vanityfair.com/news/2018/08/wework-summer-camp-party\">a bacchanalian retreat called Summer Camp</a>, so as to fill them. At the same time, in the name of efficiency—which Silicon Valley investors appreciate almost as much as growth—he kept certain costs down. Neumann used nonunion laborers for construction, and many of WeWork’s employees put in long, poorly compensated hours. “I can hire a bunch of young people and pay them nothing,” he once said. Attendance at a “Thank God It’s Monday” pep rally, held after hours, was required.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2019/09/curse-cult-of-the-founder/598753/?utm_source=feed\">Annie Lowrey: The curse of the cult of the founder</a>]</i></p><p>Then, in August 2017, came the apotheosis. Neumann convinced Masayoshi Son, the proudly offbeat CEO of the Japanese technology conglomerate SoftBank, that his company and its Vision Fund should invest $4.4 billion in WeWork—bringing its valuation to $20 billion and making it the fourth-most-valuable start-up in the U.S. Subsequent funding from SoftBank raised the company’s valuation to $47 billion in 2019, moving it into first place. Even some employees questioned the math. Neumann’s bespoke social-networking platform and other tech projects hadn’t panned out; an employee of a data-analytics start-up with a WeWork office discovered, through a security loophole, that only a fifth of WeWork members had posted at all. WeWork remained an upscale office-leasing business. But Son found Neumann charming. He asked him who would win in a fight, “the smart guy or the crazy guy?” The crazy one, Neumann replied—the right answer, according to Son.</p><p>Neumann acquired five companies in quick succession and, inexplicably, bought a significant stake in a company that makes wave pools. He leased enough additional real estate that WeWork became New York’s biggest office tenant, and he launched WeGrow, a private school run by Rebekah, whom WeWork had begun listing as a third co-founder. Dedicated to “unleashing every person’s superpower,” it charged up to $42,000 per student. At Summer Camp, Rebekah shared with attendees her dream of building “communities around the world where children who are not in the right situation could come and live forever, basically.” Neumann chimed in: “There are 150 million orphans in this world today. If we do the work right, we could wake up one day and say, ‘We want to solve the problem of children without parents in this world.’ ” Meanwhile, ahead of that event, the Neumanns had compiled a three-and-a-half-page list of items to be stocked at their campsite, including two bottles of $1,000 Highland Park scotch and a “Signature Range Rover for Rebekah/Adam use.”</p><p>No one could accuse Neumann of pursuing a plan that was too smart, or not crazy enough. As it had done almost every year since its start, WeWork was spending far more than it brought in. In April 2019, four months before everything fell apart, Wiedeman asked Neumann what his superpower was. “Change,” Neumann answered. “It’s the best superpower to have.”</p><p class=\"dropcap\"><span class=\"smallcaps\">After WeWork’s </span>mismanagement became apparent, public investors swiftly lost interest in the IPO. Thinking a little shake-up might help, the board persuaded Neumann to step down as CEO, in return for an exit package worth nearly $1.7 billion, including the option of selling $970 million in shares to SoftBank. (Neumann had leverage because he had negotiated outsize voting power in the company.) But a year later, the recovery plan clearly has not been successful. WeWork, now run by a veteran real-estate executive, has indefinitely postponed its IPO. The beer no longer flows freely. Much of Neumann’s exit package is at risk of evaporating, after SoftBank reneged on the buyout it had promised. (Neumann has sued SoftBank, and the case is in the courts.) Even so, Neumann will have squeezed hundreds of millions of dollars out of the situation. While there are plenty of losers here, he can’t really be said to be one of them.</p><p>Wiedeman writes that it is “hard to figure out what lesson Adam, or the entrepreneurs of the future, should learn from his rise and fall.” Is it, though? In fact, any future entrepreneur who hopes to get rich fast can draw a straightforward directive from Neumann’s experience: Emulate it. More relevant is what the rest of us should learn. We have a habit of demonizing corporate figureheads much more than the investors who technically own the companies. For all of the books devoted to the Zuckerbergs, Musks, and Neumanns of the world, who can name their companies’ biggest shareholders? Yet the most important lesson in the rise and fall of WeWork has less to do with Neumann than with the ecosystem that nurtured him. “They’re trying to make this about Adam being a lunatic,” a real-estate executive told Wiedeman shortly after Neumann’s resignation. “These people invested, they knew the terms, they knew about the governance issues, and they told this guy, ‘Be you, but be ten times you.’ What did they expect?”</p><p>To be fair, the fact that no one saw Neumann coming might have something to do with the relative newness of the landscape in which WeWork’s odyssey took place. For decades, venture capitalists have tossed money at lots of unprofitable, fast-growing tech companies on the assumption that at least one of them would make it big. But in recent years, a staggering amount of funding has become available through the private market. To make a return, early investors don’t need an IPO—they just need some other private fund to come along later and buy their shares for more than they spent, a process through which founders can also cash out. (When SoftBank first invested in WeWork, Benchmark quietly sold more than $129 million in shares; Neumann sold $361 million worth.) Unsurprisingly, that has encouraged start-ups to stay private as long as they can, given that being public comes with more regulation and scrutiny. The number of U.S. “unicorns”—private companies worth at least $1 billion—has risen more than tenfold since WeWork’s founding, to more than 200.</p><p>The result is a perverse set of incentives for founders. There’s the push to keep their companies growing at any cost. But there’s also another quirk, one that Neumann exploited particularly well: Everyday investors in public companies aren’t likely to meet CEOs one-on-one, whereas private deals are still negotiated in person—between CEOs and venture capitalists—leaving the investors vulnerable to individual charisma. “The nature of the private markets is that if nine smart investors pass, it only takes one relatively dumber investor, and suddenly we’re valued at $16 billion,” one member of WeWork’s finance team told Wiedeman.</p><p>And how, exactly, did a college dropout from the Israeli desert charm all those investors in the first place? While Wiedeman emphasizes Neumann’s persuasiveness, he doesn’t spend a lot of time deconstructing what makes him so persuasive. But what if the answer is directly tied to the WeWork message—the one about capitalist community-spiritedness—that, in retrospect, sounds so lame?</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/technology/archive/2019/09/why-wework-was-destined-fail/598891/?utm_source=feed\">Read: The wildly appealing, totally doomed future of work</a>]</i></p><p>“Every human society must justify its inequalities,” Thomas Piketty writes in <i>Capital and Ideology</i>. “Unless reasons for them are found, the whole political and social edifice stands in danger of collapse.” <i>Billion Dollar Loser </i>doesn’t dwell on the experiences of WeWork’s tenants, but many of them belong to an expanding class of workers—those making their own way as freelancers. More and more U.S. taxpayers have been reporting independent-contractor income; an IRS study published last year found evidence suggesting that an increasing share of companies have been hiring new workers under this status—which keeps them from being entitled to a minimum wage or unemployment insurance—instead of as employees. This sort of freelancing grew more slowly during the recovery from the Great Recession, which seems to suggest that, given the option, people would rather be employed.</p><p>But over the past decade, Silicon Valley has been at the center of an energetic campaign to convince people that this insecure status is, in fact, desirable—that an independent contractor is a member of the “sharing economy” or even, like Zuckerberg or Musk, an entrepreneur. The riches of investors, such as the ones who funded WeWork, depend on this myth; another major Benchmark and SoftBank investment is Uber, which classifies its drivers as independent contractors rather than employees.</p><p data-id=\"injected-recirculation-link\"><i>[<a href=\"https://www.theatlantic.com/ideas/archive/2019/10/say-goodbye-millennial-urban-lifestyle/599839/?utm_source=feed\">Derek Thompson: The Millennial urban lifestyle is about to get more expensive</a>]</i></p><p>All that marketing about making people feel happier about working—in the end, maybe it was directed less at the public than at the venture capitalists Neumann was really wooing all along. If workers are insecure, the message suggested, the solution doesn’t have to be fairer wages, better job protections, or a transfer of wealth from the rich to the poor. WeWork could address the problem—and do so for hundreds of thousands of workers—with parties and beer.</p><p>Now Neumann is out. Yet SoftBank is doing just fine. It reported a historic loss of $13 billion in its last fiscal year, partly because of the WeWork debacle, but has since turned around, posting a $12 billion profit in its first quarter alone. One of its prized investments is DoorDash, the food-delivery service, whose website describes ambitions of “connecting people with possibility—easier evenings, happier days, bigger savings accounts, wider nets and stronger communities.” DoorDash is reportedly losing money, regulators have targeted it for its pricing and employment practices, and delivery workers have sued it for skimming their tips. “We created a monster,” Son admits to investors, toward the end of <i>Billion Dollar Loser</i>—evidently not a market niche to abandon.</p><hr><p><small><em>This article appears in the November 2020 print edition with the headline “The WeWork Guy’s Guide to Striking It Rich.” </em></small></p>",
  "author": {
    "name": "Vauhini Vara",
    "uri": "http://www.theatlantic.com/author/vauhini-vara/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Erik Carter"
  },
  "title": "How to Get Rich By Losing Lots of Money",
  "published": "2020-10-14T09:00:00-04:00",
  "updated": "2020-10-14T17:42:38-04:00",
  "summary": "Adam Neumann is out of his WeWork job, but entrepreneurs will surely imitate him.",
  "link": ""
}