{
  "id": "yt:video:O2tXLsEUpaQ",
  "yt:videoId": "O2tXLsEUpaQ",
  "yt:channelId": "UCeTfBygNb1TahcNpZyELO8g",
  "title": "Every Zelda is the Darkest Zelda",
  "link": "",
  "author": {
    "name": "Jacob Geller",
    "uri": "https://www.youtube.com/channel/UCeTfBygNb1TahcNpZyELO8g"
  },
  "published": "2022-07-18T15:19:11+00:00",
  "updated": "2022-07-25T02:42:14+00:00",
  "media:group": {
    "media:title": "Every Zelda is the Darkest Zelda",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Someone I loved once gave me a box full of darkness. It took me years to understand that this, too, was a gift. | Get a Henson razor and a free pack of 100 blades with code JACOB at: https://bit.ly/3G3sa59  \n\nSupport me: https://www.patreon.com/JacobGeller \nFollow me at: https://twitter.com/yacobg42\nMerch: https://store.nebula.app/collections/jacob-geller\n\nWatch this video on Nebula: https://nebula.app/videos/jacob-geller-every-zelda-is-the-darkest-zelda\n\nLetter from K.A. Applegate: http://www.hiracdelest.com/database/articles/kaa_response-full.htm\nMajora’s Mask: Terrible Fate (short film by Ember Lab): https://youtu.be/vbMQfaG6lo8\n\nK.A. Applegate Reading by Jessie Gender: https://www.youtube.com/c/lostrekkie \n\nAdditional Footage from:\nScrustle: https://www.youtube.com/user/scrustle \nZelda Central: https://www.youtube.com/channel/UC1csybsXHrbGs96WgKPU34g \nGamescapes: https://www.youtube.com/c/Gamescapes \n\nVisual Media Used: Willy Wonka and the Chocolate Factory, The Simpsons, Scooby-Doo, Ratatouille, The Lord of the Rings: The Fellowship of the Ring, Finding Nemo, The Legend of Zelda: A Link to the Past, A Link Between Worlds, Link’s Awakening, Wind Waker, Twilight Princess, Skyward Sword, Ocarina of Time, Majora’s Mask, Breath of the Wild\n\nMusic Used, chronologically: Title, Snowpeak, Light and Shadow, Meeting with Princess Zelda (Twilight Princess), Cave, Final Hours, Giant’s Theme, Clock Tower (Majora’s Mask), Fi’s Theme (Skyward Sword), Preload, Link’s Memories- “Despair” (Breath of the Wild), Forest Temple (Ocarina of Time), Farewell King Hyrule (Wind Waker), Chamber of the Sages (Ocarina of Time), Ballad of the Windfish (Link’s Awakening), Confrontation with the Demon King (Skyward Sword), Death Mountain (The Legend of Zelda), Time of the Falling Rain (A Link to the Past), Hilda and Ganon (A Link Between Worlds), Riverside (Tri Force Heroes), Courage (Twilight Princess), Eternal Gratitude- Fi’s Theme (Skyward Sword), Orchestra Piece #1 (Twilight Princess)\n\nThumbnail Credit:https://twitter.com/HotCyder\nDescription Credit: The Uses of Sorrow, Mary Oliver\n\nAdditional music from Epidemic Sound\nAdditional video from Getty Images",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}