{
  "title": "🤖 might just be your next co-worker",
  "description": "<p>1.8 million robots were in operation globally during 2015 according the the International Federation of Robotics, a number that is forecast to balloon to 2.6 million in the year 2019.\n<br/><br/>\nWhile these “automatically controlled, reprogrammable machines” may not make workers in certain industries immediately redundant, the data show that robotic penetration is trending upward. The consequences of this leap in technology loom large for the worker.\n<br/><br/><img src=\"http://i.imgur.com/IR51p5u.jpg\"/><br/><i>Baxter is the flagship product built by Rethink Robotics and is billed as America’s first adaptive manufacturing robot. Source: <a href=\"https://www.washingtonpost.com/business/technology/new-robots-in-the-workplace-job-creators-or-job-terminators/2013/03/06/a80b8f34-746c-11e2-8f84-3e4b513b1a13_story.html?utm_term=.4066b21eb973\" target=\"_blank\">The Washington Post</a>.</i>\n<br/><br/>\nLater in 2017, the Brookings Metro program is expected to release a new state and metro mapping of where the effects of automation may be most disruptive, using some high-quality estimates of the susceptibility of occupations to substitution.\n<br/><br/>\nFor an opinion on the impact of robots, artificial intelligence, and machine learning, give Brookings’ Darrel M West’s <a href=\"https://www.brookings.edu/wp-content/uploads/2016/06/robotwork.pdf\" target=\"_blank\">piece</a> a read.\n<br/><br/>\nIn the meantime, we explore data from the <a href=\"https://ifr.org/\" target=\"_blank\">International Federation of Robots</a> (some made available by <a href=\"https://www.brookings.edu/blog/the-avenue/2017/08/14/where-the-robots-are/\" target=\"_blank\">Brookings</a>) showing where robot have so far made their significant impression.\n<br/><br/>\nAs you’ll learn below, their incidence is well-aligned with the United States’ highly automated advanced manufacturing sector.\n<br/><br/>\n<!-- more -->\n<br/><br/></p><h2>1. <a href=\"https://plot.ly/~Dreamshot/8936/\" target=\"_blank\">Where the robots are</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/o4dwSH2.png\"/><br/><br/>\nMichigan had the most industrial robots in 2015, with over 27,600 in operation. In fact, the high bot concentration across the Upper Midwest and Mid-South aligns well with the automotive industry which employs about half of all industrial robots in use (see Robots by industry below). Hawaii (83) edged out Wyoming (84) for the fewest industrial robots in 2015.\n<br/><br/><h2>2. <a href=\"https://plot.ly/~Dreamshot/8937/\" target=\"_blank\">Robotic trends</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/LBPtqTk.png\"/><br/><br/>\nIndustrial robot use is increasing most quickly where it is already prevalent. Between 2010 and 2015, Michigan amassed over 16,700 new bots. Ohio (11,900) and Indiana (11,400) are a distant 2nd and 3rd, respectively. California is an honorable mention with nearly a 10,200-bot increase. Wyoming added a paltry 30 bots between 2010 and 2015.\n<br/><br/><h2>3. <a href=\"https://plot.ly/~Dreamshot/8946/\" target=\"_blank\">Where a robot is most likely to be your colleague</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/XxdfE2S.png\"/><br/><br/>\nThe Elkhart-Goshen Metropolitan Statistical Area was the epicenter of robotic activity in 2015, where for every 1,000 workers was 35.9 bots. Here’s a little known fact about the area:\n<br/><br/>\n“Elkhart is best known for two industries: recreational vehicles and musical instruments. It has been referenced as the “RV Capital of the World” and the “Band Instrument Capital of the World” for decades.” 🤖\n<br/><br/>\nThus, the clustering across the Upper Midwest makes a lot of sense.\n<br/><br/>\nBut what about the South? Take east Tennessee for instance, Morristown &ndash; here, 3 of the top 4 employers fit the employ-a-robot mold: poultry processing (Koch Foods), aluminum piston manufacturing (MAHLE Engine Components), and power steering systems (JTEKT Automotive).\n<br/><br/><h2>4. <a href=\"https://plot.ly/~Dreamshot/8947/\" target=\"_blank\">“Robot-as-a-colleague” trends</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/OtR5tR7.png\"/><br/><br/>\nThe largest annualized percentage change of total industrial robots between 2010 and 2015 was found in northwest Alabama. In Florence-Muscle Shoals, AL, specifically, where the increase was a dramatic 45% during the 5-year period. A diverse manufacturing center, this NW Alabama region calls manufacturing its <a href=\"http://advantagealabama.com/county/077/lauderdale/edpa-advantage-alabama-county.html\" target=\"_blank\">2nd largest industry</a> by payroll.\n<br/><br/>\nChambersburg in central Pennsylvania is another up and coming bot-center. Here, manufacturing facilities are common and include machinery production, metal fabrication, and food processing.\n<br/><br/><h2>5. <a href=\"https://plot.ly/~Dreamshot/8941/\" target=\"_blank\">Robots by industry</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/D3XfQh9.png\"/><br/><br/>\nApproximately 62% of the globe’s estimated operational stock of robots were found in the automotive industry in 2015. Between 2010 and 2015, the electronics industry experienced the largest percentage gain (135%) in operational robot use.\n<br/><br/><h2>6. <a href=\"https://plot.ly/~Dreamshot/8939/\" target=\"_blank\">Global robot stock increasing</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/JP9Ukte.png\"/><br/><br/>\nBy 2019, the world is estimated to have 2.6 million robots in operation. This would be well over two-fold decade-over-decade increase and over a three-fold increase since the turn of the century.\n<br/><br/><h2>7. <a href=\"https://plot.ly/~Dreamshot/8951/\" target=\"_blank\">Who’s winning the race?</a></h2>\n<br/><br/><img src=\"http://i.imgur.com/7lztEzk.png\"/><br/><br/>\nThe Republic of Korea, as of 2015, lead the world with 531 robots per 10,000 employees in the manufacturing industry.\n<br/><br/>\nHowever, robots in South Korea aren’t just limited to one industry&ndash;recently, they were commissioned to aid tourists and <a href=\"http://www.ctvnews.ca/sci-tech/robots-to-aid-tourists-and-clean-floors-at-south-korean-airport-1.3487697\" target=\"_blank\">clean the floors</a> at Incheon International Airport.\n<br/><br/><img src=\"http://i.imgur.com/QtlM7lb.jpg\"/><br/><i>Troika, a self-driving robot made by LG Electronics, at Incheon International Airport in South Korea.</i>\n<br/><br/>\nSingapore, 2nd in the global robot race, is home to <a href=\"http://www.straitstimes.com/singapore/asias-first-retail-robot-launched-to-help-relieve-manpower-shortages\" target=\"_blank\">Asia’s first retail bot</a> ‘XYZrobot,’ who will greet and help customers at electronics shop Newstead.\n<br/><br/>\nIn conclusion: robots are here to stay. With an open mind, we’ll be able adapt to a world that includes more of them. And perhaps with a touch of ingenuity, we’ll be better off because of it.\n<br/><br/><i>&ldquo;I think while the technology kills the jobs we don’t want, it creates this opening to find new ways to deploy people that we’ve never thought of before. And I think that’s an exciting opportunity. We have so many human issues that we can’t deal with, and those aren’t jobs today. I think there’s all kinds of redeployment that’s good for the human race when we think it through.&rdquo;</i>\n<br/>\n&ndash;Jeff Hoffman, Co-Founder of Priceline.com\n<br/><br/>\nPlotly is built by computational scientists with degrees and research expertise from McGill, Harvard, Stanford, and other world-class institutions. Making no-compromise open-source software for scientific visualization is our full-time job and passion. Want to support our work? Consider purchasing a Pro plan. For less than half the cost of a Tableau license, you’ll get support from our engineering staff and time-saving ways to save and share your work with colleagues, advisors, or managers.\n<br/><br/><a href=\"https://plot.ly/education/\" target=\"_blank\">Pro Plans for University students and instructors ($59/year)</a>\n<br/><br/><a href=\"https://plot.ly/products/cloud/\" target=\"_blank\">Pro Plans for industry users ($396/year)</a>",
  "link": "https://blog.plotly.com/post/165493522252",
  "guid": "https://blog.plotly.com/post/165493522252",
  "pubDate": "Mon, 18 Sep 2017 21:08:47 -0400",
  "category": [
    "robots",
    "technology",
    "manufacturing",
    "robotics",
    "brookings",
    "data",
    "datascience"
  ]
}