{
  "title": "Episode 1: The Customer is Always Taxed",
  "itunes:title": "Episode 1: The Customer is Always Taxed",
  "pubDate": "Wed, 15 Feb 2017 17:00:00 +0000",
  "guid": "a4c9eec76cd45d6e258e0e0f15c7d6b4",
  "link": "https://wordsandnumbers.libsyn.com/the-customer-is-always-taxed",
  "itunes:image": "",
  "description": "<p>We're really excited to present the first episode of what will be an on-going podcast featuring Dr. Antony Davies, Professor of Economics of Duquesne University in Pittsburgh, and Dr. James R. Harrigan, CEO of FreedomTrust<br /> <br /> Each Wednesday we'll be sharing a new podcast featuring Antony and James talking about the economics and political science of current events. We hope you enjoy the show and look forward to your input on what topics Antony and James should cover in the future.<br /> <br /> Today's episode is about everybody's favorite subject: Taxes!</p>",
  "content:encoded": "<p>We're really excited to present the first episode of what will be an on-going podcast featuring Dr. Antony Davies, Professor of Economics of Duquesne University in Pittsburgh, and Dr. James R. Harrigan, CEO of FreedomTrust  Each Wednesday we'll be sharing a new podcast featuring Antony and James talking about the economics and political science of current events. We hope you enjoy the show and look forward to your input on what topics Antony and James should cover in the future.  Today's episode is about everybody's favorite subject: Taxes!</p>",
  "enclosure": "",
  "itunes:duration": "06:29",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,words,economics,Opinion,taxes,numbers",
  "itunes:subtitle": "We're really excited to present the first episode of what will be an on-going podcast featuring Dr. Antony Davies, Professor of Economics of Duquesne University in Pittsburgh, and Dr. James R. Harrigan, CEO of FreedomTrust  Each Wednesday we'll be...",
  "itunes:season": 1,
  "itunes:episode": 1,
  "itunes:episodeType": "full",
  "itunes:author": "Foundation for Economic Education"
}