{
  "title": "Where does your imagination come from?",
  "guid": "01GDBVZ69QCEREFJC31FMJ81D5",
  "itunes:author": "American Public Media",
  "description": "<p>Picture this: a pickle with a cowboy hat. It has cute little arms and legs -- let’s make them orange. And this pickle is riding a horse on the beach as the sun sets. #PickleLife, am I right? Now think about this: you just imagined that whole scene in your head!</p>\n<p> </p>\n<p>Imagination can engage every one of our senses. It sprouts from the things we’ve experienced in life, then collages itself into new thoughts… like a pickle on a horse. This episode goes into the far reaches of the brain and examines how imagination works and what role it plays in our lives. If you want a fun game to play with friends, try an Imagine Off. That’s when you take turns trying to come up with something that nobody else can imagine. We’ll also meet some of our listeners’ imaginary friends and learn why some people have these companions. U.S. Poet Laureate Ada Limón also stops by and tells us how she puts her imagination to use. Plus, there’s a brand new Mystery Sound to guess.</p>\n<p> </p>\n<p>We always love hearing from you. Keep sending in your questions, drawings and Mystery Sounds. We’re currently looking for your best jingle about space. If you have an out-of-this-world tune about space, record it and send it to us at www.brainson.org/contact.</p>\n<p></p>\n<p>This episode is sponsored by:</p>\n<p></p>\n<ul>\n<li><p>Indeed (<a href=\"http://indeed.com/BRAINSON\" class=\"c-link\">Indeed.com/BRAINSON</a> - to start hiring now. <em>Terms and conditions apply. Cost per application pricing not available for everyone.)</em></p></li>\n<li><p>Shopify (<a href=\"http://shopify.com/brainson\" class=\"c-link\">Shopify.com/brainson</a> - for a free 14-day trial and full access to Shopify's entire suite of features)</p></li>\n<li><p>Outschool (<a href=\"http://outschool.com/brains\" class=\"c-link\">Outschool.com/brains</a> - save $15 on your child's first class)</p></li>\n<li><p>Bombas (<a href=\"http://bombas.com/brainson\" class=\"c-link\">Bombas.com/brainson</a> - get 20% off your first purchase)</p></li>\n\n</ul>\n\n",
  "enclosure": "",
  "pubDate": "Tue, 20 Sep 2022 12:00:00 +0000",
  "itunes:duration": "00:36:56",
  "itunes:explicit": "no"
}