{
  "id": "yt:video:99QR3F4giqA",
  "yt:videoId": "99QR3F4giqA",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Venus Williams | Playing it Forward | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-09-28T16:00:05+00:00",
  "updated": "2022-11-04T07:18:03+00:00",
  "media:group": {
    "media:title": "Venus Williams | Playing it Forward | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In partnership with #IamRemarkable Week, tennis superstar Venus Williams discusses what being remarkable means to her, and discuss the importance of recognizing our own achievements. She will also talk about her dedication to “playing it forward” by using her voice to empower others to make a difference.\n\nWith 7 Grand Slam titles, 5 Wimbledon championships and 4 Olympic gold medals, tennis champion Venus Williams is arguably one of the most accomplished and inspiring women in the history of sports. Beginning with her rise to the top at the age of 14, she quickly took the world of tennis by storm, climbing to the top-ranked position, breaking countless records, and winning numerous championships. \n\nEncouraged by her mother at an early age to explore her creative side, Williams enrolled in fashion school where she was instantly drawn to the world of fashion and interior design. Venus parlayed her business acumen with her healthy competitive spirit into two successful design ventures. In 2002, after obtaining an Interior Decorator certification, she founded V Starr, a full-service commercial and residential design firm, which recently announced their partnership with Airbnb partner Niido. And in 2012, Venus obtained an Associate of Science in Fashion Design and launched the fashion-forward activewear brand, EleVen by Venus Williams. Her entrepreneurship has continued in the health, wellness and beauty spaces and includes her role as Chief Brand Officer to Asutra as well as her plant-based protein company, Happy Viking, which she launched in 2020.  \n\nIn 2009, Venus, along with her sister Serena, became the first female African-Americans to have a stake in an NFL franchise after joining the ownership group of the Miami Dolphins. The following year, Venus published her motivational book, Come to Win which reached number five on The New York Times Best Sellers list.\n\nThroughout her career, Venus has been a steadfast advocate for equality. In 2006, UNESCO, the United Nations’ cultural organization, titled her as the first Promoter of Gender Equality. In 2007 she led an unwavering fight, which resulted in Wimbledon awarding female players the same pay as their male counterparts. Most recently, she launched an awareness initiative called the #PrivilegeTax in conjunction with EleVen to bring attention to wage inequality and unveiled a platform of resources for young women to get inspired and address the issue on a grassroots level.\n \nVenus' achievements throughout her legendary career have merited her a plethora of additional accolades, including the Americanism Award, honored by the Anti-Defamation League (ADL), Glamour Magazine’s \"Woman of the Year,\" ESPN’s \"WTA Player of the Year,\" and Forbes’ \"Celebrity 100,\" among others.                                       \n\nModerated by Nelson Boyce.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}