{
  "title": "Grieving and Loss of a Parent | Dr. Justin Puder",
  "pubDate": "Mon, 13 Jun 2022 12:00:00 +0000",
  "guid": "082363ef-6b77-4d2c-81b9-bb4a136a08a8",
  "link": "https://beautyuncovered.libsyn.com/grieving-and-loss-of-a-parent-dr-justin-puder",
  "itunes:image": "",
  "description": "<span style=\"font-weight: 400;\">Father’s Day is coming up. What do you do when you’ve lost your father? Or mother? What do you do on holidays? How do you deal with that loss and grief? It doesn’t matter if you had a good relationship with your parents, either way it can be painful.</span> <p><span style=\"font-weight: 400;\">So we’ve asked Dr. Justin Puder, or Dr. J, to have a conversation with him about handling our loss and figuring out how to get through it. Dr. J is @amoderntherapist and is a mental health influencer. So not only does he have the credentials, he personally lost his own father at 19. Join us as he walks us through coping with our grief and loss even decades after.</span></p>",
  "content:encoded": "Father’s Day is coming up. What do you do when you’ve lost your father? Or mother? What do you do on holidays? How do you deal with that loss and grief? It doesn’t matter if you had a good relationship with your parents, either way it can be painful. <p>So we’ve asked Dr. Justin Puder, or Dr. J, to have a conversation with him about handling our loss and figuring out how to get through it. Dr. J is @amoderntherapist and is a mental health influencer. So not only does he have the credentials, he personally lost his own father at 19. Join us as he walks us through coping with our grief and loss even decades after.</p>",
  "enclosure": "",
  "itunes:duration": "18:47",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Father’s Day is coming up. What do you do when you’ve lost your father? Or mother? What do you do on holidays? How do you deal with that loss and grief? It doesn’t matter if you had a good relationship with your parents, either way it can be...",
  "itunes:episodeType": "full"
}