{
  "title": "Theory of Truncation Resonances in Continuum Rod-based Phononic Crystals with Generally Asymmetric Unit Cells. (arXiv:2211.01423v1 [physics.app-ph])",
  "link": "http://arxiv.org/abs/2211.01423",
  "description": "<p>Phononic crystals exhibit Bragg bandgaps, frequency regions within which wave\npropagation is forbidden. In solid continua, such bandgaps are the outcome of\ndestructive interferences resulting from periodically alternating layers. Under\ncertain conditions, natural frequencies emerge within these bandgaps in the\nform of high-amplitude localized vibrations near one boundary of the structure.\nIn this paper, we investigate the vibrational spectrum of finite phononic\ncrystals which take the form a one-dimensional rod, and explain the fundamental\nfactors that contribute to the origination of truncation resonances. By\nidentifying a unit cell symmetry parameter, we define a family of finite\nphononic rods which share the same unit cell dispersion relation, yet distinct\ntruncated forms. A transfer matrix method is utilized to derive closed-form\nexpressions of the characteristic equations governing the natural frequencies\nof the finite system and decipher the truncation resonances emerging across\ndifferent boundary conditions. The presented analysis establishes concrete\nconnections between the localized vibrations associated with a truncation\nresonance, the corresponding boundary condition, and the overall configuration\nof the truncated chain as dictated by the unit cell choice. The study provides\ntools to predict, tune, and selectively design truncation resonances, to meet\nthe demands of various applications that require such truncation resonances.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Babaa_H/0/1/0/all/0/1\">Hasan B. Al Ba&#x27;ba&#x27;a</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Willey_C/0/1/0/all/0/1\">Carson L. Willey</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Chen_V/0/1/0/all/0/1\">Vincent W. Chen</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Juhl_A/0/1/0/all/0/1\">Abigail T. Juhl</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Nouh_M/0/1/0/all/0/1\">Mostafa Nouh</a>"
}