{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-5716472105738269942",
  "published": "2019-06-21T13:59:00.000-07:00",
  "updated": "2019-06-21T13:59:07.245-07:00",
  "title": "Libra: Financial Inclusion for the World's Poor, or Scam?",
  "content": "In case you haven't heard, Facebook has recently set up a financial subsidiary, Calibra, and has issued a so-called <a href=\"https://libra.org/en-US/white-paper/\">\"white paper\"</a> which is a proposal to issue a cryptocurrency, Libra. As stated in the white paper, \"Libra's mission is to enable a simple global currency and financial infrastructure that empowers billions of people.\" Sounds rather lofty, don't you think? Financial innovation that's going to make a significant fraction of human beings, particularly the world's poor, significantly better off. Makes me want to give Mark Zuckerberg a big hug.<br /><br />But hold on. What is Facebook actually proposing? The \"white paper,\" which is obviously, in part, a public relations document, is long on vague descriptions of inclusion, working together, integrity, blah, blah, blah - and short on some critical details. So what is Libra exactly? It's a bank. Let's just call it the Facebook Bank. This bank will have assets, liabilities, capital, and shareholders. And, what makes it a bank is that its liabilities - Libra - are intended to function as means of payment. So what's the problem the Facebook Bank is trying to solve? Given the available technology, our payments systems are remarkably slow and costly to use, particularly the ones that involve international transactions. God knows that domestic payments in the United States are particularly slow and costly, but try to move money between countries and you'll have spend some time and energy in figuring out how to do it at the lowest cost. And you probably won't be happy with the best thing you can find.<br /><br />Some of the people who want to move money between countries are poor people, for example immigrants come to Canada from poor countries and want to send transfers to their relatives. But most of the money moving around the world is moved by rich people, so they would certainly benefit in principle from what the Facebook Bank claims to offer. And of course, plenty of shady people move money between countries. For example, people in the US who import street drugs from wherever need to get money to the suppliers of those drugs, and it would be a lot cheaper to send it electronically than running currency across the border. Or Don Jr. needs a vehicle for getting his money from the Russian oligarch, the Saudi Prince, or whoever. If regulation of the Facebook Bank is lax, plenty of shady people will be using it for sure.<br /><br />So, just in case this isn't totally obvious, Mark Zuckerberg cares about making a profit. If this enterprise flies, it's not because it's just helping poor people, though some of them might benefit. Mark Zuckerberg makes big money by serving rich people and, maybe, crooks.<br /><br />Next, to the details of what's in the \"white paper.\" First, note that \"white paper\" is a term first used by the British government for proposals it was floating prior to writing legislation. Callting the Facebook Bank proposal a \"white paper\" of course lends an air of authority to this marketing effort, which has also included consultation by Facebook with some financial regulators - the Fed included (Powell mentioned this in his last press conference). Zuckerberg understands that regulation is a potential obstacle to big profits, so he wants to stay on the good side of people like Jay Powell.<br /><br />We need to look at the proposed financial structure of the Facebook Bank. In contrast to typical cryptocurrencies, the Facebook Bank will have assets backing Libra. Bitcoin for example is more like a commodity money. It's fundamentally costless to create Bitcoin, but the Bitcoin mechanism is set up to make Bitcoin scarce - there's an upper bound on supply, and creating more Bitcoin currently requires competing as a miner to update the blockchain, and this competition burns phenomenal quantities of electricity. New Libra will be created by someone exchanging balances denominated in some standard currency, Canadian dollars for example, for Libra. Then, those balances would be used to buy assets. No mystery there, as that's what banks do. But what are the assets? The section in the \"white paper\" on the <a href=\"https://libra.org/en-US/about-currency-reserve/#the_reserve\">\"The Reserve\"</a> tells us that these assets will be \"stable and liquid,\" more particularly the short term debt of countries not deemed to be likely to default or inflate, and \"bank deposits.\"<br /><br />So this is starting to sound a bit like a narrow bank. An example of a narrow bank would be a bank that issues demand deposits, subject to withdrawal, one-for-one, in U.S. currency, backed by a portfolio of 3-month US Treasury bills. But the Facebook Bank is not a standard narrow bank. First, its assets will have payoffs denominated in different currencies. In principle, the asset portfolio could be diversified, but the riskiness of the whole enterprise will depend on the nature of the liabilities.<br /><br />Facebook Bank liabilities - Libra - is where the action is in this proposed operation. Ultimate users of the means of payment will not actually interact directly with the Facebook Bank. There will be \"authorized resellers\" who transact with the Facebook Bank. If you and I want to acquire Libra, or sell Libra in exchange for Pound Sterling or Mexican Pesos, we have to interact with an authorized reseller. Though this is vague in the \"white paper,\" it appears that resellers can exchange Libra for various currencies, and vice versa, with the Facebook Bank. So, as the \"white paper\" says, the Facebook Bank \"mints and burns coins.\" The key question is, at what prices can a reseller \"mint and burn?\" It seems that Libra is a demand liability. This is what makes every successful banking system work. Bank liabilities are convertible into something at a fixed rate. In the very old days, there was convertibility into precious metals, and in modern times banks convert deposits one-for-one into domestic currency. If the convenience of the Facebook Bank comes from having demand liabilities that are convertible at fixed rates into a set of currencies, then the Facebook Bank is potentially unstable, in the same sense any bank is. We know how we overcome that. We have regulation, deposit insurance, central bank lender-of-last-resort facilities, capital requirements. If there aren't fixed rates of conversion of the liabilities, then the Facebook Bank is more like a mutual fund, which makes the liabilities less convenient as a means of payment. An interesting feature of the Facebook Bank is that the liabilities won't pay interest. How come? There's inflation in the world, so one might think it would be in the interest of an profit-seeking financial institution to offer liabilities that are going to compensate for inflation - by paying interest.<br /><br />Don't be fooled by the use of the word \"cryptocurrency\" in the \"white paper\" to describe the Facebook Bank's liabilities. This is similar to how some security issuers use the word \"coin\" to mask what they're doing. For example, an \"initial coin offering\" or ICO is just the issue of a security that typically has features that look like simple debt or equity. What makes these securities different is that they're traded using a decentralized ledger. A complete record of ownership and trades is in the blockchain. Similarly, the Facebook Bank's liabilities - Libra - are just bank deposits traded on a distributed ledger instead of through the conventional system of bank recordkeeping, supported by interbank transfers on the central bank's books. What we should be wary of is the possibility that, by issuing a cryptocurrency, Facebook is just evading regulation, in the same way that \"coin offerings\" evade securities regulation. It's well-known that ICOs are a <a href=\"https://cointelegraph.com/news/new-study-says-80-percent-of-icos-conducted-in-2017-were-scams\">cesspool of fraud.</a><br /><br />And why trade the Facebook Bank's deposit liabilities using blockchain? From what I can tell, all the experiments with blockchain have been a bust. It's very exciting to sort out how blockchains work, and to talk about it at dinner parties, but decentralized ledgers have thus far been a failure. Basically, providing the incentives that prevent manipulation of the blockchain for individual gain is too costly. Unless Facebook has some technological breakthrough they're hiding from us, what we know about blockchain makes the \"white paper's\" claims of low-cost financial services seem like wishful thinking.<br /><br />Is there anything regulators should be doing about the Facebook Bank, or should we just let Facebook take its chances and let them worry about the consequences? Well, in banking we have a long history of regulation. Sometimes regulators, and the people setting up the regulatory structure, make mistakes. But there's never been a successful banking system that didn't have a strong regulatory hand behind it. Laissez faire banking is only an idea, not demonstrated best practice. So, regulators should be paying attention to this, asking questions, and figuring out what to do about it.<br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 6
}