{
  "id": "tag:blogger.com,1999:blog-6959495683334200101.post-8161751282393975313",
  "published": "2019-08-27T10:30:00.000-07:00",
  "updated": "2019-09-03T08:53:14.272-07:00",
  "title": "Susan Wojcicki: Preserving openness through responsibility",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Dear creators and artists,<br /><br /><br /><br />As I do every <a href=\"https://youtube-creators.googleblog.com/2019/04/addressing-creator-feedback-and-update.html\" target=\"_blank\">quarter</a>, I’d like to pause and reflect on my priorities and how I can help you be successful on YouTube. But rather than our usual update on this quarter’s highlights and lowlights, I want to take a minute to talk about something that is incredibly important to me personally, and the future of this platform: openness and how we balance that with our responsibility to protect the community. <br /><br /><br /><br />YouTube is built on the premise of openness. Based on this open platform, millions of creators around the world have connected with global audiences and many of them have built thriving businesses in the process. But openness comes with its challenges, which is why we also have <a href=\"https://www.youtube.com/yt/about/policies/#community-guidelines\" target=\"_blank\">Community Guidelines</a> that we update on an ongoing basis. Most recently, this includes our<a href=\"https://youtube.googleblog.com/2019/06/our-ongoing-work-to-tackle-hate.html\" target=\"_blank\"> hate speech policy</a> and our <a href=\"https://youtube.googleblog.com/2019/06/taking-harder-look-at-harassment.html\" target=\"_blank\">upcoming harassment policy</a>. When you create a place designed to welcome many different voices, some will cross the line. Bad actors will try to exploit platforms for their own gain, even as we invest in the systems to stop them. As more issues come into view, a rising chorus of policymakers, press and pundits are questioning whether an open platform is valuable... or even viable. <br /><br /><br /><br />Despite these concerns, I believe preserving an open platform is more important than ever. <br /><br /><br /><br />First, openness leads to opportunity. Today’s creators have built an entire creative economy and are redefining the face of media. They are truly next-generation media businesses, with millions of views and global brands, who are contributing to local and global economies, and creating jobs. These are creators that would not have had a chance to break through in a more closed media landscape. Creators like Swedish robotics enthusiast <a href=\"https://www.youtube.com/channel/UC3KEoMzNz8eYnwBC34RaKCQ\" target=\"_blank\">Simone Giertz</a> and blind lifestyle vlogger <a href=\"https://www.youtube.com/channel/UCwf9TcLyS5KDoLRLjke41Hg\" target=\"_blank\">Molly Burke</a>, both unconventional in their appeal and passed over by traditional media, are finding huge success on YouTube managing businesses, selling merchandise, creating jobs for other people and creating real economic value in their communities. Or creators like <a href=\"https://www.youtube.com/user/LauraVitalesKitchen\" target=\"_blank\">Laura Vitale</a>, <a href=\"https://www.youtube.com/watch?v=V2ffyfoXJOY\" target=\"_blank\">Sallys Welt</a> and <a href=\"https://www.youtube.com/channel/UCMmZEL8jV1B61NKAXcyW87A\" target=\"_blank\">Helen's Recipes</a> have turned their passion for food into full-time professions, complete with successful channels, cookbooks and more. And they are not alone. A <a href=\"https://drive.google.com/file/d/1frDtTaR-y7qHQuECH-4M83zOhfBk-t2Z/view\" target=\"_blank\">report</a> from Ryerson University found that YouTube creators have created 28,000 full time jobs just in Canada. And 20% of eligible Canadian creators are creating jobs for others. Around the globe, the number of channels earning more than $100,000 continues to climb 40% year over year.<br /><br /><br /><br />Openness has also helped foster community. On an open platform, a shared experience can unite people in amazing ways. For example, Ryleigh Hawkins from New Zealand started her channel, <a href=\"https://www.youtube.com/channel/UCNOume_VesWl0SxPJ9vXLTw\" target=\"_blank\">Tourettes Teen</a>, to spread awareness about what it’s like to live with Tourette’s syndrome. Her informative, joyful and humorous videos have earned her fans around the world and let others with this potentially isolating condition know they are not alone. And teens are sharing their <a href=\"https://mashable.com/article/college-rejection-youtube-videos/#FB9y3Wjdtmq7\" target=\"_blank\">college rejection videos</a>, serving as a reminder that this painful moment happens to everyone and people do bounce back.<br /><br /><br /><br />And finally, openness leads to learning. As a daughter of two teachers and a lifelong learner, I’ve been especially inspired to see Edutubers like <a href=\"https://www.youtube.com/channel/UCiB8h9jD2Mlxx96ZFnGDSJw\" target=\"_blank\">Origin of Everything</a>, <a href=\"https://www.youtube.com/user/iberethenorio/about\" target=\"_blank\">Manual do Mundo</a>, <a href=\"https://www.youtube.com/user/misterwootube\" target=\"_blank\">Eddie Woo</a> and <a href=\"https://www.youtube.com/user/ExcelIsFun\" target=\"_blank\">Excel is Fun</a> turn YouTube into the world’s largest classroom. Every time I meet someone new and ask them about YouTube, I hear a story about something they learned on the site: how YouTube helped a student ace her math homework, a mom fix a broken garage door, or an employee master a new job skill.<br /><br /><br /><br />Let me be clear, none of this happens without openness. Without an open system, diverse and authentic voices have trouble breaking through. And the voices that do get a platform often sound like those who already have one. That small business built on someone sharing their passion for soapmaking <a href=\"https://www.youtube.com/watch?v=EkPCzwZ_x58\" target=\"_blank\">never takes off</a>. That bullied teen can’t find a community that looks and feels like them and lets them know that <a href=\"https://www.youtube.com/user/itgetsbetterproject\" target=\"_blank\">it gets better</a>. And that curious person obsessed with <a href=\"https://www.youtube.com/watch?v=qFjw6Lc6J2g\" target=\"_blank\">planetary physics</a> and looking for a few videos is probably out of luck. <br /><br /><br /><br />A commitment to openness is not easy. It sometimes means leaving up content that is outside the mainstream, controversial or even offensive. But I believe that hearing a broad range of perspectives ultimately makes us a stronger and more informed society, even if we disagree with some of those views. A large part of how we protect this openness is not just <a href=\"https://www.youtube.com/yt/about/policies/#community-guidelines\" target=\"_blank\">guidelines</a> that allow for diversity of speech, but the steps that we’re taking to ensure a responsible community. I’ve said a <a href=\"https://youtube-creators.googleblog.com/2019/04/addressing-creator-feedback-and-update.html\" target=\"_blank\">number</a> <a href=\"https://youtube-creators.googleblog.com/search?updated-max=2019-02-19T05:00:00-08:00&amp;max-results=7\" target=\"_blank\">of</a> <a href=\"https://www.nytimes.com/2019/04/17/business/youtube-ceo-susan-wojcicki.html\" target=\"_blank\">times</a> this year that this is my number one priority. A responsible approach toward managing what’s on our platform protects our users and creators like you. It also means we can continue to foster all the good that comes from an open platform. <br /><br /><br /><br />Problematic content represents a fraction of one percent of the content on YouTube and we’re constantly working to reduce this even further. This very small amount has a hugely outsized impact, both in the potential harm for our users, as well as the loss of faith in the open model that has enabled the rise of your creative community. One assumption we’ve heard is that we hesitate to take action on problematic content because it benefits our business. This is simply not true — in fact, the cost of not taking sufficient action over the long term results in lack of trust from our users, advertisers, and you, our creators. We want to earn that trust. <br /><br /><br /><br />This is why we’ve been investing significantly over the past few years in the teams and systems that protect YouTube. Our approach towards responsibility involves four “Rs”:<br /><br /><ul style=\"text-align: left;\"><li>We REMOVE content that violates our policy as quickly as possible. And we’re always looking to make our policies clearer and more effective, as we’ve done with<a href=\"https://support.google.com/youtube/thread/1063345?hl=en\" target=\"_blank\"> pranks and challenges</a>, <a href=\"https://youtube.googleblog.com/2019/06/an-update-on-our-efforts-to-protect.html\" target=\"_blank\">child safety</a>, and <a href=\"https://youtube.googleblog.com/2019/06/our-ongoing-work-to-tackle-hate.html\" target=\"_blank\">hate speech</a> just this year. We aim to be thoughtful when we make these updates and consult a wide variety of experts to inform our thinking, for example we talked to dozens of experts as we developed our updated hate speech policy. We also report on the removals we make in our quarterly Community Guidelines enforcement report. I also appreciate that when policies aren’t working for the creator community, you let us know. One area we’ve heard loud and clear needs an update is creator-on-creator harassment. I said in my <a href=\"https://youtube-creators.googleblog.com/2019/04/addressing-creator-feedback-and-update.html\" target=\"_blank\">last letter</a> that we’d be looking at this and we will have more to share in the coming months.</li></ul><ul style=\"text-align: left;\"><li>We RAISE UP authoritative voices when people are looking for breaking news and information, especially during breaking news moments. Our breaking and top news shelves are available in 40 countries and we’re continuing to expand that number.</li></ul><ul style=\"text-align: left;\"><li>We REDUCE the spread of content that brushes right up against our policy line. Already, in the U.S. where we <a href=\"https://youtube.googleblog.com/2019/01/continuing-our-work-to-improve.html\" target=\"_blank\">made changes</a> to recommendations earlier this year, we’ve seen a 50% drop in watch time to this type of content, meaning quality content has more of a chance to shine. And we've begun experimenting with this change in the UK, Ireland, South Africa and other English-language markets.</li></ul><ul style=\"text-align: left;\"><li>And we set a <a href=\"https://support.google.com/youtube/answer/1311392?hl=en&amp;ref_topic=9153642\" target=\"_blank\">higher bar</a> for what channels can make money on our site, REWARDING trusted, eligible creators. Not all content allowed on YouTube is going to match what advertisers feel is suitable for their brand, we have to be sure they are comfortable with where their ads appear. This is also why we’re <a href=\"https://youtube.googleblog.com/2019/07/live-from-vidcon-creating-new.html\" target=\"_blank\">enabling</a> new revenue streams for creators like Super Chat and Memberships. Thousands of channels have more than doubled their total YouTube revenue by using these new tools in addition to advertising. </li></ul><br /><br /><br /><br />The stories I hear from creators like you inspire me every day. The community you’ve created is living proof that an internet that reflects a broad range of ideas can change the world for the better. You’ve built something incredible; it’s our job to strike the right balance between openness and responsibility so that future generations of creators and users can, as well. <br /><br /><br /><br /><i>Susan Wojcicki</i></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "YouTube Creators",
    "uri": "http://www.blogger.com/profile/00450486760991148551",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}