{
  "title": "The Case for Numba in Community Code",
  "link": "",
  "updated": "2018-01-30T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2018/01/30/the-case-for-numba",
  "content": "<p>The numeric Python community should consider adopting Numba more widely within community code.</p>\n\n<p>Numba is strong in performance and usability, but historically weak in ease of installation and community trust.\nThis blogpost discusses these these strengths and weaknesses from the perspective of a OSS library maintainer.\nIt uses other more technical blogposts written on the topic as references.\nIt is biased in favor of wider adoption given recent changes to the project.</p>\n\n<p>Let’s start with a wildly unprophetic quote from Jake Vanderplas in 2013:</p>\n\n<blockquote>\n  <p>I’m becoming more and more convinced that Numba is the future of fast scientific computing in Python.</p>\n\n  <p>– Jake Vanderplas, 2013-06-15</p>\n\n  <p><a href=\"http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/\">http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/</a></p>\n</blockquote>\n\n<p>We’ll use the following blogposts by other community members throughout this post.  They’re all good reads and are more technical, showing code examples, performance numbers, etc..</p>\n\n<ul>\n  <li><a href=\"https://flothesof.github.io/optimizing-python-code-numpy-cython-pythran-numba.html\">https://flothesof.github.io/optimizing-python-code-numpy-cython-pythran-numba.html</a></li>\n  <li><a href=\"https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/\">https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/</a></li>\n  <li><a href=\"http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/\">http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/</a></li>\n  <li><a href=\"http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/\">http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/</a></li>\n  <li><a href=\"http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/\">http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/</a></li>\n  <li><a href=\"https://murillogroupmsu.com/numba-versus-c/\">https://murillogroupmsu.com/numba-versus-c/</a></li>\n</ul>\n\n<p>At the end of the blogpost these authors will also share some thoughts on Numba today,\nlooking back with some hindsight.</p>\n\n<p><em>Disclaimer: I work alongside many of the Numba developers within the same company and am partially funded through the same granting institution.</em></p>\n\n<h3 id=\"compiled-code-in-python\">Compiled code in Python</h3>\n\n<p>Many open source numeric Python libraries need to write efficient low-level code that works well on Numpy arrays,\nbut is more complex than the Numpy library itself can express.\nTypically they use one of the following options:</p>\n\n<ol>\n  <li><strong>C-extensions:</strong> mostly older projects like NumPy and Scipy</li>\n  <li><strong>Cython:</strong> probably the current standard for mainline projects, like scikit-learn, pandas, scikit-image, geopandas, and so on</li>\n  <li><strong>Standalone C/C++</strong> codebases with Python wrappers: for newer projects that target inter-language operation, like XTensor and Arrow</li>\n</ol>\n\n<p>Each of these choices has tradeoffs in performance, packaging, attracting new developers and so on.\nIdeally we want a solution that is …</p>\n\n<ol>\n  <li><strong>Fast:</strong> about as fast as C/Fortran</li>\n  <li><strong>Easy:</strong> Is accessible to a broad base of developers and maintainers</li>\n  <li><strong>Builds easily:</strong> Introduces few complications in building and packaging</li>\n  <li><strong>Installs easily:</strong> Introduces few install and runtime dependencies</li>\n  <li><strong>Trustworthy:</strong> Is well trusted within the community, both in terms of governance and long term maintenance</li>\n</ol>\n\n<p>The two main approaches today, Cython and C/C++, both do well on most of these objectives.\nHowever neither is perfect.  Some issues that arise include the following:</p>\n\n<ul>\n  <li><strong>Cython</strong>\n    <ul>\n      <li>Often requires effort to make fast</li>\n      <li>Is often only used by core developers.  Requires expertise to use well.</li>\n      <li>Introduces mild packaging pain, though this pain is solved frequently enough that experienced community members are used to dealing with it</li>\n    </ul>\n  </li>\n  <li><strong>Standalone C/C++</strong>\n    <ul>\n      <li>Sometimes introduces complex build and packaging concerns</li>\n      <li>Is often only used by core developers.\nThese projects have difficulty attracting the Python community’s standard developer pool\n(though they do attract developers from other communities).</li>\n    </ul>\n  </li>\n</ul>\n\n<p>There are some other options out there like Numba and Pythran that,\nwhile they provide excellent performance and usability benefits,\nare rarely used.\nLet’s look into Numba’s benefits and drawbacks more closely.</p>\n\n<h3 id=\"numba-benefits\">Numba Benefits</h3>\n\n<p>Numba is generally well regarded from a technical perspective (it’s fast, easy to use, well maintained, etc.)\nbut has historically not been trusted due to packaging and community concerns.</p>\n\n<p>In any test of either performance or usability Numba almost always wins (or ties for the win).\nIt does all of the compiler optimization tricks you expect.\nIt supports both for-loopy code as well as Numpy-style slicing and bulk operation code.\nIt requires almost no additional information from the user (assuming that you’re ok with JIT behavior)\nand so is very approachable, and very easy for novices to use well.</p>\n\n<p>This means that we get phrases like the following:</p>\n\n<ul>\n  <li><a href=\"https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/\">https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/</a>\n    <ul>\n      <li>“This is rightaway faster than NumPy.”</li>\n      <li>“In fact, we can infer from this that numba managed to generate pure C code from our function and that it did it already previously.”</li>\n      <li>“Numba delivered the best performance on this problem, while still being easy to use.”</li>\n    </ul>\n  </li>\n  <li><a href=\"https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/\">https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/</a>\n    <ul>\n      <li>“Using numba is very simple; just apply the jit decorator to the function you want to get compiled. In this case, the function code is exactly the same as before”</li>\n      <li>“Wow! A speedup by a factor of about 400, just by applying a decorator to the function. “</li>\n    </ul>\n  </li>\n  <li><a href=\"http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/\">http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/</a>\n    <ul>\n      <li>“Much better! We’re now within about a factor of 3 of the Fortran speed, and we’re still writing pure Python!”</li>\n      <li>“I should emphasize here that I have years of experience with Cython, and in this function I’ve used every Cython optimization there is …  By comparison, the Numba version is a simple, unadorned wrapper around plainly-written Python code.”</li>\n    </ul>\n  </li>\n  <li><a href=\"http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/\">http://jakevdp.github.io/blog/2013/06/15/numba-vs-cython-take-2/</a>\n    <ul>\n      <li>Numba is extremely simple to use. We just wrap our python function with autojit (JIT stands for “just in time” compilation) to automatically create an efficient, compiled version of the function</li>\n      <li>Adding this simple expression speeds up our execution by over a factor of over 1400! For those keeping track, this is about 50% faster than the version of Numba that I tested last August on the same machine.</li>\n      <li>The Cython version, despite all the optimization, is a few percent slower than the result of the simple Numba decorator!</li>\n    </ul>\n  </li>\n  <li><a href=\"http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/\">http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/</a>\n    <ul>\n      <li>“Using Numba is usually about as simple as adding a decorator to your functions”</li>\n      <li>“Numba is usually easier to write for the simple cases where it works”</li>\n    </ul>\n  </li>\n  <li><a href=\"https://murillogroupmsu.com/numba-versus-c/\">https://murillogroupmsu.com/numba-versus-c/</a>\n    <ul>\n      <li>“Numba allows for speedups comparable to most compiled languages with almost no effort”</li>\n      <li>“We find that Numba is more than 100 times as fast as basic Python for this application. In fact, using a straight conversion of the basic Python code to C++ is slower than Numba.”</li>\n    </ul>\n  </li>\n</ul>\n\n<p>In all cases where authors compared Numba to Cython for numeric code\n(Cython is probably the standard for these cases)\nNumba always performs as-well-or-better and is always much simpler to write.</p>\n\n<p>Here is a code example from Jake’s second blogpost:</p>\n\n<h4 id=\"example-code-complexity\">Example: Code Complexity</h4>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code># From http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/\n\n# Numba                                 # Cython\nimport numpy as np                      import numpy as np\nimport numba                            cimport cython\n                                        from libc.math cimport sqrt\n\n                                        @cython.boundscheck(False)\n@numba.jit                              @cython.wraparound(False)\ndef pairwise_python(X):                 def pairwise_cython(double[:, ::1] X):\n    M = X.shape[0]                          cdef int M = X.shape[0]\n    N = X.shape[1]                          cdef int N = X.shape[1]\n                                            cdef double tmp, d\n    D = np.empty((M, M), dtype=np.float)    cdef double[:, ::1] D = np.empty((M, M),\n                                                                             dtype=np.float64)\n    for i in range(M):                      for i in range(M):\n        for j in range(M):                      for j in range(M):\n            d = 0.0                                 d = 0.0\n            for k in range(N):                      for k in range(N):\n                tmp = X[i, k] - X[j, k]                 tmp = X[i, k] - X[j, k]\n                d += tmp * tmp                          d += tmp * tmp\n            D[i, j] = np.sqrt(d)                    D[i, j] = sqrt(d)\n    return D                                return np.asarray(D)\n</code></pre></div></div>\n\n<p>The algorithmic body of each function (the nested for loops) is identical.\nHowever the Cython code is more verbose with annotations,\nboth at the function definition (which we would expect for any AOT compiler),\nbut also within the body of the function for various utility variables.\nThe Numba code is just straight Python + Numpy code.\nWe could remove the <code class=\"language-plaintext highlighter-rouge\">@numba.jit</code> decorator and step through our function with normal Python.</p>\n\n<h4 id=\"example-numpy-operations\">Example: Numpy Operations</h4>\n\n<p>Additionally Numba lets us use Numpy syntax directly in the function,\nso for example the following function is well accelerated by Numba,\neven though it already fits NumPy’s syntax well.</p>\n\n<div class=\"language-python highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code><span class=\"c1\"># from https://flothesof.github.io/optimizing-python-code-numpy-cython-pythran-numba.html\n</span>\n<span class=\"o\">@</span><span class=\"n\">numba</span><span class=\"p\">.</span><span class=\"n\">jit</span>\n<span class=\"k\">def</span> <span class=\"nf\">laplace_numba</span><span class=\"p\">(</span><span class=\"n\">image</span><span class=\"p\">):</span>\n    <span class=\"s\">\"\"\"Laplace operator in NumPy for 2D images. Accelerated using numba.\"\"\"</span>\n    <span class=\"n\">laplacian</span> <span class=\"o\">=</span> <span class=\"p\">(</span> <span class=\"n\">image</span><span class=\"p\">[:</span><span class=\"o\">-</span><span class=\"mi\">2</span><span class=\"p\">,</span> <span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">]</span> <span class=\"o\">+</span> <span class=\"n\">image</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">:,</span> <span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">]</span>\n                <span class=\"o\">+</span> <span class=\"n\">image</span><span class=\"p\">[</span><span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">2</span><span class=\"p\">]</span> <span class=\"o\">+</span> <span class=\"n\">image</span><span class=\"p\">[</span><span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"mi\">2</span><span class=\"p\">:]</span>\n                <span class=\"o\">-</span> <span class=\"mi\">4</span><span class=\"o\">*</span><span class=\"n\">image</span><span class=\"p\">[</span><span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"mi\">1</span><span class=\"p\">:</span><span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">])</span>\n    <span class=\"n\">thresh</span> <span class=\"o\">=</span> <span class=\"n\">np</span><span class=\"p\">.</span><span class=\"nb\">abs</span><span class=\"p\">(</span><span class=\"n\">laplacian</span><span class=\"p\">)</span> <span class=\"o\">&gt;</span> <span class=\"mf\">0.05</span>\n    <span class=\"k\">return</span> <span class=\"n\">thresh</span>\n</code></pre></div></div>\n\n<p>Mixing and matching Numpy-style with for-loop style is often helpful when writing complex numeric algorithms.</p>\n\n<p>Benchmarks in the these blogposts show that Numba is both simpler to use and often as-fast-or-faster than more commonly used technologies like Cython.</p>\n\n<h3 id=\"numba-drawbacks\">Numba drawbacks</h3>\n\n<p>So, given these advantages why didn’t Jake’s original prophecy hold true?</p>\n\n<p>I believe that there are three primary reasons why Numba has not been more widely adopted among other open source projects:</p>\n\n<ol>\n  <li><strong>LLVM Dependency</strong>: Numba depends on LLVM, which was historically difficult to install without a system package manager (like apt-get, brew) or conda.\nLibrary authors are not willing to exclude users that use other packaging toolchains, particularly Python’s standard tool, <code class=\"language-plaintext highlighter-rouge\">pip</code>.</li>\n  <li><strong>Community Trust:</strong> Numba is largely developed within a single for-profit company (Anaconda Inc.) and its developers are not well known by other library maintainers.</li>\n  <li><strong>Lack of Interpretability:</strong> Numba’s output, LLVM, is less well understood by the community than Cython’s output, C (discussed in original-author comments in the last section)</li>\n</ol>\n\n<p>All three of these are excellent reasons to avoid adding a dependency.\nTechnical excellence alone is insufficient, and must be considered alongside community and long-term maintenance concerns.</p>\n\n<ul>\n  <li><a href=\"http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/\">http://jakevdp.github.io/blog/2015/02/24/optimizing-python-with-numpy-and-numba/</a>\n    <ul>\n      <li>how difficult will it be for your users to install, read, modify, and contribute to your code? In the long run, this may be much more important than shaving a few milliseconds off the execution time</li>\n    </ul>\n  </li>\n  <li><a href=\"http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/\">http://stephanhoyer.com/2015/04/09/numba-vs-cython-how-to-choose/</a>\n    <ul>\n      <li>Cython is easier to distribute than Numba, which makes it a better option for user facing libraries</li>\n      <li>The main issue is that it can be difficult to install Numba unless you use Conda, which is great tool, but not one everyone wants to use</li>\n      <li>Cython is also a more stable and mature platform, whereas the features and performance of Numba are still evolving</li>\n    </ul>\n  </li>\n  <li><a href=\"https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/\">https://dionhaefner.github.io/2016/11/suck-less-scientific-python-part-2-efficient-number-crunching/</a>\n    <ul>\n      <li>Numba still only supports a subset of the Python and NumPy capabilities - and speedups are not always that dramatic.</li>\n    </ul>\n  </li>\n</ul>\n\n<h3 id=\"but-numba-has-evolved-recently\">But Numba has evolved recently</h3>\n\n<h4 id=\"llvm\">LLVM</h4>\n\n<p>Numba now depends on the easier-to-install library, <code class=\"language-plaintext highlighter-rouge\">llvmlite</code>\nwhich, as of a few months ago is pip installable with binary wheels on Windows, Mac, and Linux.\nThe <code class=\"language-plaintext highlighter-rouge\">llvmlite</code> package is still a heavy-ish runtime dependency (42MB),\nbut that’s significantly less than large Cython libraries like Pandas or SciPy.</p>\n\n<p>If your concern was about the average user’s inability to install Numba, then I think that this concern has been resolved.</p>\n\n<h4 id=\"community\">Community</h4>\n\n<p>Numba has three community problems:</p>\n\n<ol>\n  <li>Development of Numba has traditionally happened within the closed walls of Anaconda Inc (formerly Continuum Analytics)</li>\n  <li>The Numba maintainers are not well known within the broader Python community</li>\n  <li>There used to be a proprietary version, Numba Pro</li>\n</ol>\n\n<p>This combination strongly attached Numba’s image to Continuum’s for-profit ventures,\nmaking community-oriented software maintainers understandably wary of dependence,\nfor fear that dependence on this library might be used for Continuum’s financial gain at the expense of community users.</p>\n\n<p>Things have changed significantly.</p>\n\n<p>Numba Pro was abolished years ago.\nThe funding for the project today comes more often from Anaconda Inc. consulting revenue,\nhardware vendors looking to ensure that Python runs as efficiently as possible on their systems,\nand from generous donations from the Gordon and Betty Moore foundation\nto ensure that Numba serves the open source Python community.</p>\n\n<p>Developers outside of Anaconda Inc. now have core commit access,\nwhich forces communication to happen in public channels,\nnotably GitHub (which was standard before) and Gitter chat (which is relatively new).</p>\n\n<p>The maintainers are still fairly relatively unknown within the broader community.\nThis isn’t due to any sort of conspiracy,\nbut is instead due more to shyness or having interests outside of OSS.\nAntoine, Siu, Stan, and Stuart are all considerate, funny, and clever fellows\nwith strong enthusiasm for compilers, OSS, and performance.\nThey are quite responsive on the <a href=\"https://groups.google.com/a/continuum.io/forum/#!forum/numba-users\">Numba mailing list</a>\nshould you have any questions or concerns.</p>\n\n<p><em>If your concern was about Numba trapping users into a for-profit mode,\nthen that seems to have been resolved years ago.</em></p>\n\n<p><em>If your concern is more about not knowing who is behind the project then I encourage you to reach out.\nI would be surprised if you don’t walk away pleased.</em></p>\n\n<h3 id=\"the-continued-cases-against-numba\">The Continued Cases Against Numba</h3>\n\n<p>For completeness, let’s list a number of reasons why it is still quite reasonable to avoid Numba today:</p>\n\n<ol>\n  <li>It isn’t a community standard</li>\n  <li>Numba hasn’t attracted a wide developer base (compilers are hard), and so is probably still dependent on financial support for paid developers</li>\n  <li>You want to speed up non-numeric code that includes classes, dicts, lists, etc. for which I need Cython or PyPy</li>\n  <li>You want to build a library that is useful outside of Python, and so plan to build most numeric algorithms on C/C++/Fortran</li>\n  <li>You prefer ahead-of-time compilation and want to avoid JIT times</li>\n  <li>While <code class=\"language-plaintext highlighter-rouge\">llvmlite</code> is cheaper than LLVM, it’s still 50MB</li>\n  <li>Understanding the compiled results is hard, and you don’t have good familiarity with LLVM</li>\n</ol>\n\n<h3 id=\"numba-features-we-didnt-talk-about\">Numba features we didn’t talk about</h3>\n\n<ol>\n  <li>Multi-core parallelism</li>\n  <li>GPUs</li>\n  <li>Run-time Specialization to the CPU you’re running on</li>\n  <li>Easy to swap out for other JIT compilers, like PyPy, if they arise in the future</li>\n</ol>\n\n<h3 id=\"update-from-the-original-blogpost-authors\">Update from the original blogpost authors</h3>\n\n<p>After writing the above I reached out both to Stan and Siu from Numba\nand to the original authors of the referenced blogposts\nto get some of their impressions now having the benefit of additional experience.</p>\n\n<p>Here are a few choice responses:</p>\n\n<ol>\n  <li>\n    <p>Stan:</p>\n\n    <p><em>I think one of the biggest arguments against Numba still is time.  Due to a massive rewrite of the code base, Numba, in its present form, is ~3 years old, which isn’t that old for a project like this.  I think it took PyPy at least 5-7 years to reach a point where it was stable enough to really trust.  Cython is 10 years old.  People have good reason to be conservative with taking on new core dependencies.</em></p>\n  </li>\n  <li>\n    <p>Jake:</p>\n\n    <p><em>One thing I think would be worth fleshing-out a bit (you mention it in the final bullet list) is the fact that numba is kind of a black box from the perspective of the developer. My experience is that it works well for straightforward applications, but when it doesn’t work well it’s *extremely</em> difficult to diagnose what the problem might be.*</p>\n\n    <p><em>Contrast that with Cython, where the html annotation output does wonders for understanding your bottlenecks both at a non-technical level (“this is dark yellow so I should do something different”) and a technical level (“let me look at the C code that was generated”). If there’s a similar tool for numba, I haven’t seen it.</em></p>\n  </li>\n</ol>\n\n<ul>\n  <li>\n    <p>Florian:</p>\n\n    <p><em>Elaborating on Jake’s answer, I completely agree that Cython’s annotation tool does wonders in terms of understanding your code. In fact, numba does possess this too, but as a command-line utility. I tried to demonstrate this in my blogpost, but exporting the CSS in the final HTML render kind of mangles my blog post so here’s a screenshot:</em></p>\n\n    <p><a href=\"https://mrocklin.github.io/blog/images/numba-html-annotations.png\"><img src=\"https://mrocklin.github.io/blog/images/numba-html-annotations.png\" alt=\"Numba HTML annotations\" width=\"100%\" /></a></p>\n\n    <p><em>This is a case where <code class=\"language-plaintext highlighter-rouge\">jit(nopython=True)</code> works, so there seems to be no coloring at all.</em></p>\n\n    <p>Florian also pointed to the <a href=\"https://www.youtube.com/watch?v=1AwG0T4gaO0\">SciPy 2017 tutorial</a> by Gil Forsyth and Lorena Barba</p>\n  </li>\n  <li>\n    <p>Dion:</p>\n\n    <p><em>I hold Numba in high regard, and the speedups impress me every time. I use it quite often to optimize some bottlenecks in our production code or data analysis pipelines (unfortunately not open source). And I love how Numba makes some functions like <code class=\"language-plaintext highlighter-rouge\">scipy.optimize.minimize</code> or <code class=\"language-plaintext highlighter-rouge\">scipy.ndimage.generic_filter</code> well-usable with minimal effort.</em></p>\n\n    <p><em>However, I would never use Numba to build larger systems, precisely for the reason Jake mentioned. Subjectively, Numba feels hard to debug, has cryptic error messages, and seemingly inconsistent behavior. It is not a “decorate and forget” solution; instead it always involves plenty of fiddling to get right.</em></p>\n\n    <p><em>That being said, if I were to build some high-level scientific library à la Astropy with some few performance bottlenecks, I would definitely favor Numba over Cython (and if it’s just to spare myself the headache of getting a working C compiler on Windows).</em></p>\n  </li>\n  <li>\n    <p>Stephan:</p>\n\n    <p><em>I wonder if there are any examples of complex codebases (say &gt;1000 LOC) using Numba. My sense is that this is where Numba’s limitations will start to become more evident, but maybe newer features like jitclass would make this feasible.</em></p>\n  </li>\n</ul>\n\n<h3 id=\"scipy-tutorial-link\">SciPy tutorial link</h3>\n\n<p>As a final take-away, you might want to follow Florian’s advice and watch\nGil and Lorena’s tutorial here:</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/1AwG0T4gaO0\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen=\"\"></iframe>"
}