{
  "id": "tag:blogger.com,1999:blog-2499715909956774229.post-4877911245149868416",
  "published": "2020-02-18T09:12:00.000-08:00",
  "updated": "2020-02-18T09:12:41.363-08:00",
  "title": "Is Inflation Targeting the Best We Can Do?",
  "content": "In the U.S., the Fed is considering modifications to its <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">longer-run goals and monetary policy strategy</a>, and last year Fed officials went on a <a href=\"https://www.federalreserve.gov/monetarypolicy/review-of-monetary-policy-strategy-tools-and-communications-fed-listens-events.htm\">listening tour</a> to hear public views on its approach to monetary policy. This is new territory for the Fed, but the Bank of Canada does this sort of public outreach on a regular basis, in between renewals of its <a href=\"https://www.bankofcanada.ca/2016/10/renewal-of-the-inflation-control-target-2016/\">policy agreement with the government of Canada.</a> The Bank <a href=\"https://www.bankofcanada.ca/toward-2021-renewing-the-monetary-policy-framework/\">conducts in-house research, runs conferences, and interacts with the public in various ways,</a> to get a fix on whether the Bank's approach needs to be changed. Since 1991, the BoC has had a 2% inflation target, specified in its agreement with the federal government, and changes to that agreement since 1991 have been minor. In <a href=\"https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnwxOTU0c3RlcGhlbndpbGxpYW1zb258Z3g6NTJmNWI3Yjc4Y2FjOWYwZA\">\"The Role of Central Banks,\"</a> I discuss the BoC's inflation-targeting history, and evaluate potential modifications to the Bank's approach. My conclusion is that the BoC's performance has been excellent over the last 29 years, and that it is difficult to make the case that any changes to their approach are necessary.<br /><br />But what about the Fed, which operates under a different mandate, and potentially faces different issues than do other central banks? Since 2012, the FOMC has articulated its approach to fulfilling its Congressional dual mandate in its statement on <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">longer-run goals and monetary policy strategy,</a> which is typically updated each January (with the exception of January 2020). The Fed now has an explicit 2% inflation target, but one could argue that, implicitly, the 2% target was in effect long before 2012. For example, if we plot the path for the PCE deflator from 1995 through the end of 2019, relative to a 2% trend, here's what it looks like:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-zQb4hMmQ-dM/XkmYjmECgVI/AAAAAAAADxc/nfiyiwC9x3EBzhN8AdXdVocCEEireRyVQCNcBGAsYHQ/s1600/pricelevel.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-zQb4hMmQ-dM/XkmYjmECgVI/AAAAAAAADxc/nfiyiwC9x3EBzhN8AdXdVocCEEireRyVQCNcBGAsYHQ/s640/pricelevel.png\" width=\"640\" height=\"520\" data-original-width=\"1031\" data-original-height=\"837\" /></a></div>This is perhaps surprising. The Fed actually does quite well relative to a 2% price <i>level</i> target, but starts to miss on the low side in 2012 - just when it makes the 2% inflation target explicit. Since 2012, average inflation has been 1.4%. Not great, but not bad either, relative to the sated goal.<br /><br />So, could the Fed do better? The Fed's dual mandate is a constraint of course, but Congress wrote the law in a sufficiently vague fashion that the constraint shouldn't bind if the Fed plays its cards correctly. Indeed, the FOMC's \"Statement of Longer-Run...\" skirts around the the second part of the mandate, which Fed officials typically state as \"achieving maximum employment,\" without quantifying the concept. The Fed could change its <i>goals,</i> that is it could specify a different objective rather than 2% inflation - an NGDP (nominal GDP) target for example. It could change its <i>policy rule</i>, that is the mapping from observables to a target for something the Fed can control. For example, the policy rule could be a Taylor rule, which dictates a target for the fed funds rate as a function of current inflation and aggregate output. The Fed could also change its <i>implementation strategy,</i> for example the specific actions or mechanism for achieving a specific fed funds rate target.<br /><br />Potential changes that appear to be taken seriously inside the Fed system are relatively minor tweaks to the Fed's goals, principally makeup-strategy modifications of inflation targeting. These could be categorized as price level targeting and inflation averaging. Under conventional inflation targeting, history is irrelevant. For example, if <i>P(t)</i> is the price level, and <i>i*</i> is the inflation target, then in an period <i>t</i> the target for next period's price level is<br /><br />(1) <i>P*(t+1) = (1+i*)P(t)</i><br /><br />Or, in logs (approximately),<br /><br />(2) <i>p*(t+1) = i* + p(t)</i>.<br /><br />An advantage of this conventional approach is that there is only one number that describes it, <i>i*</i>. That's easy for a central banker to understand, and it's easy for the central banker to communicate what policy is about to the public. Given <i>i*</i>, it's easy to evaluate the central bank's performance. If <i>p(t)-p(t-1)</i> deviates from <i>i*</i>, the central banker needs to explain why, and specify what corrective action is to be taken, if any. Maybe there's some transitory reason for the deviation, and the central banker can provide that reason to justify doing nothing.<br /><br />But, it's possible that there could be some advantage to makeup inflation-targeting strategies, under which history matters. For example, price level targeting can be specified in terms of a base year <i>b</i>, a rate of adjustment <i>a</i>, and an inflation rate <i>i*</i>, which implies (see <a href=\"https://docs.google.com/viewer?a=v&pid=sites&srcid=ZGVmYXVsdGRvbWFpbnwxOTU0c3RlcGhlbndpbGxpYW1zb258Z3g6NTJmNWI3Yjc4Y2FjOWYwZA\">my paper</a>) that next period's price level target is (in logs),<br /><br />(3) <i>p*(t+1) = (1-a)p(t) + ap(b) + [1+a(t-b)]i*</i>.<br /><br />In theory, we can find good reasons why price level targeting, embodied in (3), would be preferable to standard inflation targeting, as in (2). In principle, people care about inflation at all horizons. That is, if we think that the most important nominal contracts are intertemporal contracts - debt contracts of different maturities - then price level targeting has nice properties. Over any future horizon, if the price level target is well-understood, people know what inflation rate to expect, provided the central bank knows how to control the price level relative to the target. But, with standard inflation targeting, given that the central bank does not make up for past misses, the deviation from <i>i*</i> over a long horizon could be substantial, as was the case over the last 6 or so years.<br /><br />Two problems with price level targeting, though. First, it takes three parameters to describe the price level target - one needs to specify a base period, a rate of adjustment to the desired price level path, and a target rate of inflation. But, for conventional inflation targeting, I need to know only one number. With price level targeting, the target rate of inflation over the upcoming period is constantly changing, and that has to be understood by the central banker and communicated to the public.<br /><br />The second problem with inflation targeting lies not with the goal itself, but with the policy rule that goes along with it. People who think that price level targeting would be a good idea typically are not arguing that this will make credit markets more efficient by making inflation predictable over any future horizon. More typical is a type of forward guidance argument, for example <a href=\"https://www.brookings.edu/blog/ben-bernanke/2017/10/12/temporary-price-level-targeting-an-alternative-framework-for-monetary-policy/\">Ben Bernanke's argument for temporary price level targeting.</a> Roughly the argument is that, in a recession, if inflation is below target, and the central bank has driven nominal interest rates to the zero lower bound, price level targeting implies a commitment to making up for misses on low side, and this will cause the central bank to take appropriate actions - staying lower for longer, or QE, for example. Such polices are supported by New Keynesian forward guidance arguments, but ignore Taylor-rule-perils problems. That is, in contrast to what central bankers and most macroeconomists want to believe, in theory and practice, following a Taylor rule prescription for monetary policy can lead to a policy trap in which central banks keep nominal interests rates low in the face of persistently low inflation. Basically, this is due to the force of the Fisher effect. If the central bank cuts the nominal interest rate more than one-for-one in the face of below-target inflation, this tends to reduce inflation even further, leading to further rate cuts, etc., stopping only when the central bank reaches the zero lower bound, or effective lower bound on nominal interest rates. In the limit, every country looks like Japan. The problem with price level targeting, motivated in the way that Bernanke motivates it, is that this just compounds the Taylor-rule-perils problem. Rather than producing higher inflation in a recession than might be the case with standard inflation targeting, the policy just increases the chances the central bank gets stuck in the low-inflation policy trap. The central banker will not be achieving his or her goals, and a frustrated central banker doesn't behave well.<br /><br />But, if Taylor-rule-perils are a problem, why didn't the Fed get stuck at zero after the last recession, or long before that? Does this mean that <a href=\"http://www.columbia.edu/~mu2166/perils.pdf\">Benhabib et al. (2001</a>) were wrong? No. The Fed doesn't follow a Taylor rule. Suppose we look at HP-filtered monthly data for 1995-2019 on the fed funds rate, <i>R(t)</i>, the inflation rate, <i>i(t)</i>, as measured by the year-over-year percentage increase in the pce deflator, and the unemployment rate, <i>u(t)</i>, so as to capture short run policy responses to inflation and unemployment. The next chart shows deviations from trend in the fed funds rate vs. deviations from trend in the inflation rate:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-VRAlgD2YdTk/XkrGh-x-4sI/AAAAAAAADxo/CVRkOBSqEFYXvNmdD-o4MukwUTSqrjExACNcBGAsYHQ/s1600/iresponse.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-VRAlgD2YdTk/XkrGh-x-4sI/AAAAAAAADxo/CVRkOBSqEFYXvNmdD-o4MukwUTSqrjExACNcBGAsYHQ/s640/iresponse.png\" width=\"640\" height=\"529\" data-original-width=\"1012\" data-original-height=\"837\" /></a></div>The correlation coefficient is positive, but small, at 0.3, and the chart does't show evidence of a large response of the fed funds rate to deviations of inflation from trend. If we look at deviations of the fed funds rate from trend vs. deviations of the unemployment rate from trend, we get:<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://4.bp.blogspot.com/-SWKTqafjhMM/XkrV2XrEgTI/AAAAAAAADx0/zAsw7ubDHqMSCuFrM9999NiM4bkI_L-gwCNcBGAsYHQ/s1600/uresponse.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://4.bp.blogspot.com/-SWKTqafjhMM/XkrV2XrEgTI/AAAAAAAADx0/zAsw7ubDHqMSCuFrM9999NiM4bkI_L-gwCNcBGAsYHQ/s640/uresponse.png\" width=\"640\" height=\"522\" data-original-width=\"1023\" data-original-height=\"834\" /></a></div>In this case, the correlation coefficient is -0.5. The most striking thing about this last chart is the absence of observations in the northeast quadrant - the Fed doesn't raise its fed funds target rate when the unemployment rate is above trend. If we run a Taylor-rule regression, we get<br /><br />(4) <i>R(t) = 0.06i(t) - 0.71u(t)<br /></i><br />So, we could interpret the regression as telling us that the fed funds rate target responds mainly to short-run movements in the unemployment rate. Why does this work? To come close to its inflation target, the average level of the nominal interest rate has to be consistent with the target inflation rate. By Fisherian logic, if the average real interest rate is lower, the average nominal interest rate should be lower. If the target inflation rate is higher, the average nominal interest rate has to be higher. But, given the inertia in inflation, the Fed can engage in countercyclical policy without causing untoward variability in inflation. And countercyclical policy gives the Fed an excuse to, on occasion, hike interest rates. In general, a monetary policy rule has to dictate that the nominal interest rate target increase in <i>some</i> states of the world, otherwise the central bank is doomed to perpetually undershooting its inflation target.<br /><br />What about inflation averaging? How does that differ from price level targeting? Inflation averaging is a makeup strategy, but with a moving base year. One way to specify this is to say that the central bank makes up for inflation targeting misses over the last <i>s</i> periods by compensating for these misses over the next <i>s</i> periods. This yields a target for next period's price level,<br /><br />(5) <i>p*(t+1) = (1-1/s)p(t) + (1/s)p(t-s) + 2i*</i><br /><br />Note that (5) is just (3) with <i>a = 1/s</i> and <i>b = t - s</i>. That is, the size of the window, 2s, determines both the speed of adjustment to the desired inflation path, and the base year. Though defining the makeup strategy in this way economizes on parameters - there are two instead of three - inflation averaging has basically the same drawbacks as price level targeting. Inflation averaging is hard for central bankers to understand, and it would confuse communication with the public. And, given the arguments of the promoters of such approaches, it seems clear that inflation averaging would make low-inflation policy traps more likely.<br /><br />Finally, let's deal with NGDP (nominal GDP) targeting. If nothing else, a change in the current regime to either NGDP growth or level targeting attracts the most passionate supporters, who include George Selgin (Cato Institute), David Beckworth and Scott Sumner (both George Mason University, Mercatus Center). That these people are all associated with right-wing think tanks is helpful in understanding what motivates NGDP targeters, though adherents of the approach are certainly not confined to the right. But, roughly, an NGDP targeter appears to be a modern-day monetarist. Monetarism, as practiced by the Volcker Fed, was successful in bringing down inflation, but central banks found that monetarist approaches failed in achieving low and stable inflation on an ongoing basis. Post-1980, changes in regulation and technology created a weak relationship between money growth and inflation, causing central bankers to abandon money growth targeting in favor of direct inflation targeting. A monetarist interpretation of the history might start with the equation that defines the income velocity of money,<br /><br /><i>MV = PY</i>,<br /><br />where <i>M</i> is some measure of money, <i>V</i> is the income velocity of money, <i>P</i> is the price level, and <i>Y</i> is real GDP, so <i>PY</i> is nominal income. One could say that Friedman's argument was that <i>V</i> is predictable, implying a predictable relationship between the money stock and nominal income, but Friedman went further. Friedman's writings indicate that he thought that instability in <i>M</i> caused instability in both <i>P</i> and <i>Y</i>. In practice, <i>V</i> proved to be unstable, which presented a problem for monetarists. But then people sympathetic to monetarism, for example Ben McCallum in the 1980s, argued that, in face of <i>V</i> instability, the central bank might just as well target <i>PY</i>, which would solve the problem.<br /><br />What does NGDP targeting have going for it? It's certainly simple, in the same way a money growth target is simple. We measure nominal income on a quarterly basis, it's easy to describe what the goal is, and it's easy for the public to evaluate performance. It's also connected to the Fed's dual mandate, in that nominal income could be a summary statistic that tells us all we need to know about price stability and the real performance of the economy. But, the key questions are:<br /><br />1. What's the connection between nominal income and the things the Fed should actually care about?<br />2. Is it even feasible for the Fed to achieve an NGDP target, with some reasonable degree of accuracy?<br /><br />In an NGDP targeting regime the central bank would first have to choose a trend growth rate. Then, either this is a simple NGDP growth rate strategy, much like current inflation targeting schemes where history does not matter, or it's a makeup scheme, similar to price level targeting or inflation averaging. As such, any NGDP makeup strategy suffers from the some of the same problems as inflation targeting makeup strategies. First, such strategies are hard to understand, and hard for central bankers to explain. Second, part of the motivation for NGDP targeting comes from an assessment that monetary policy has been too tight in downturns, particularly during the last recession. Actually, Fed intervention, beginning in late 2007, and continuing through late 2015 and beyond, was massive in this episode, and to claim that more should have, or could have, been done seems silly. The Fed cut the target fed funds rate by 325 basis points from July 2007 to May 2008, set up the Term Auction Facility and lent substantially in early 2008 through that facility, and through the discount window. Overnight rates were essentially at zero for seven years, from fall 2008 to December 2015, and there was an unprecedented and large increase in the Fed's balance sheet.<br /><br />It's useful to consider the following experiment. At the beginning of 1995, suppose that the Fed had chosen an NGDP level target, and had conducted policy in the same way as they actually did. How would we be evaluating their performance, and what might they have done differently to achieve the NGDP target? From 1947 to 1995, real GDP grew at about 3.5% per year, so suppose that in 1995 the Fed had set a target path of 5.5% for nominal GDP. The next chart shows actual nominal GDP and the 5.5% target path from 1995-2019.<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-kHDDAsSOmxs/XksPMUZ_slI/AAAAAAAADyA/twxNp2gNe7sgIzXHe6UAe_PYVRGVodYuwCNcBGAsYHQ/s1600/ngdp.png\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" src=\"https://3.bp.blogspot.com/-kHDDAsSOmxs/XksPMUZ_slI/AAAAAAAADyA/twxNp2gNe7sgIzXHe6UAe_PYVRGVodYuwCNcBGAsYHQ/s640/ngdp.png\" width=\"640\" height=\"517\" data-original-width=\"1037\" data-original-height=\"837\" /></a></div>Until the 2008-09 recession, the Fed would have been doing quite well according to this criterion, but then things would have gone awry. But surely the Fed could, and would, have changed policy to achieve the target, right? I don't think so. Given conventional policy thinking, and what appears to be the mindset of anyone advocating NGDP targeting, to achieve the target path in the last chart, the Fed should have been more accommodative - more interest rate cuts and more unconventional easing. But short rates were at zero, and it's not clear that QE was doing much of anything at the time - more QE would likely have meant more nothing. So, having adopted the 5.5% NGDP target, the Fed's failures would be worse in terms of the alternative target, and the Fed would be suffering even more complaints than they are now.<br /><br />A key problem with NGDP targeting is that it requires that the policymaker take a stand on the the future trend growth rate in real GDP, which macroeconomists have no ability to predict. As well, problems can ensue due to short run fluctuations in real GDP. In the worst-case scenario in which monetary policy has no real effects, a nominal GDP target, if achievable, involves forsaking price stability. Thus, to the extent that price stability is desirable, economic welfare declines. The likely outcome, however, is related to what we see in the last chart. It is unlikely that the Fed would actually behave differently in a recession with an NDGP target than with an inflation target. If a recession happened next month, the Fed would cut its policy rate, and then start buying assets when the policy rate hit the zero lower bound, under the current regime, or under NGDP targeting. But, as in the last recession, the Fed would be missing on the low side much more substantially with an NGDP target than with a price level target, which would create pressure to stay lower for longer. Just as with inflation targeting, the result is to increase the chances the Fed gets stuck in a low-inflation policy trap.<br /><br />Advocates of NGDP targeting make three claims:<br /><br />1. The costs of variable inflation are negligible.<br />2. Inflation-targeting central banks - the Fed in particular - are singularly focused on inflation control.<br />3. There are large untapped welfare gains from output stabilization.<br /><br />It seems to me the weight of theory and evidence tells us all three claims are wrong. First, it's no accident that legislation constraining central bank behavior typically mandates that the central bank concern itself with price stability. That extremely high and variable inflation is destructive is self evident. And moderately high inflation in North America in the 1970s produced a consensus in favor of taking action to bring inflation down. The success of inflation targeting is reflected in the lack of attention paid to inflation currently by most individuals. But perhaps macroeconomists have paid insufficient attention to examining why low and stable inflation are beneficial. For example, New Keynesian theory tells us that unpredictable inflation is costly because it creates relative price distortions. But, it seems more likely that inflation variability reduces performance in credit markets. High variability in inflation, combined with nominal debt contracts with various maturities, creates uncertainty for borrowers and lenders in credit markets - uncertainty that is costly, and can be mitigated by the central bank.<br /><br />Second, most inflation-targeting central banks have other important concerns than controlling inflation - they worry in particular about GDP growth, the state of the labor market, and financial stability. The Fed takes its dual mandate seriously, and I showed above that short run movements in the Fed's policy rate are primarily explained by deviations of unemployment from trend.<br /><br />Third, that the Fed could be doing more to stabilize output seems a difficult case to make, particularly as regards the financial crisis and the ensuing recession. In general, the ability of the Fed to affect real outcomes in a good way is limited. Some macroeconomic shocks are not amenable to mitigation by the central bank. Our knowledge of how the economy works is rudimentary. Macroeconomic measurement is not all it could be. Data is not available on as timely a basis as we might like. Decision-making is cumbersome and takes time.<br /><br />Conclusion: The FOMC's <a href=\"https://www.federalreserve.gov/monetarypolicy/files/FOMC_LongerRunGoals.pdf\">\"Statement of Longer-run Goals and Monetary Policy Strategy\"</a> is fine for now. No need for changes.<br /><br /><br /><br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Stephen Williamson",
    "uri": "http://www.blogger.com/profile/01434465858419028592",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 3
}