{
  "title": "Find the Blessing | An Intimate Fireside Chat with Tony and Sage Robbins (Part 1)",
  "pubDate": "Thu, 19 Nov 2020 22:03:50 +0000",
  "guid": "03717eef-2b68-4a3d-9fe2-7f33bf27d743",
  "link": "https://tonyrobbins.libsyn.com/find-the-blessing-an-intimate-fireside-chat-with-tony-and-sage-robbins-part-1",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">Tony and Sage sit down for an intimate fireside chat to personally share what their own experience has been during this time, and also share a message of hope and unity during this unique holiday season. Together they tell us how this is a time to move forward, to create, to be able to step into another dimension of who we are. Because what we get will never make us happy; it’s who we become and what we contribute.</span></p> <p><span style=\"font-weight: 400;\">“We are not the manager of our circumstances, we are the creator of our life experience.”  – Tony Robbins</span></p> <p><span style=\"font-weight: 400;\"><strong>About The Fireside Chat Series:</strong> In the 1930s and 40s, a time when the country was struggling even more than it is today, we had an amazing leader named FDR. He began doing evening radio programs called “fireside chats,” designed to communicate directly with the American people. </span></p> <p><span style=\"font-weight: 400;\">At that time, 90% of people in the U.S at that time had a radio. Today, 96% of people have a cell phone and nearly all have internet access.</span> <span style= \"font-weight: 400;\">Instead of being unified and watching all the same things, and having a collective experience, now we're all kind of separated. And we can see division in our culture. We desperately need a form of unity, a form of connection, more humanity and more kindness in the world.</span></p> <p><span style=\"font-weight: 400;\">Tony and Sage thought to bring back this time-honored tradition of a fireside chat as a means of unity and compassion. We’re entering the winter season, drawing inward into our homes and into ourselves, reflecting on the hardships and blessings alike this unique year has brought. In this three-part series, you will hear them dispel their hopes and dreams for you this holiday season, as well as share some of Tony’s powerful tools and strategies to not only survive the coming months, but to step up and <em>thrive</em>.</span></p>",
  "content:encoded": "<p>Tony and Sage sit down for an intimate fireside chat to personally share what their own experience has been during this time, and also share a message of hope and unity during this unique holiday season. Together they tell us how this is a time to move forward, to create, to be able to step into another dimension of who we are. Because what we get will never make us happy; it’s who we become and what we contribute.</p> <p>“We are not the manager of our circumstances, we are the creator of our life experience.”  – Tony Robbins</p> <p>About The Fireside Chat Series: In the 1930s and 40s, a time when the country was struggling even more than it is today, we had an amazing leader named FDR. He began doing evening radio programs called “fireside chats,” designed to communicate directly with the American people. </p> <p>At that time, 90% of people in the U.S at that time had a radio. Today, 96% of people have a cell phone and nearly all have internet access. Instead of being unified and watching all the same things, and having a collective experience, now we're all kind of separated. And we can see division in our culture. We desperately need a form of unity, a form of connection, more humanity and more kindness in the world.</p> <p>Tony and Sage thought to bring back this time-honored tradition of a fireside chat as a means of unity and compassion. We’re entering the winter season, drawing inward into our homes and into ourselves, reflecting on the hardships and blessings alike this unique year has brought. In this three-part series, you will hear them dispel their hopes and dreams for you this holiday season, as well as share some of Tony’s powerful tools and strategies to not only survive the coming months, but to step up and <em>thrive</em>.</p>",
  "enclosure": "",
  "itunes:duration": "36:04",
  "itunes:explicit": false,
  "itunes:keywords": "holiday,wellness,tonyrobbins",
  "itunes:subtitle": "Tony and Sage sit down for an intimate fireside chat to personally share what their own experience has been during this time, and also share a message of hope and unity during this unique holiday season. Together they tell us how this is a time to...",
  "itunes:episodeType": "full"
}