{
  "published": "2022-11-05T12:24:37-04:00",
  "updated": "2022-11-05T12:24:37-04:00",
  "title": "North Korean missile launches may mean new nuclear tests",
  "content": "<figure>\n      <img alt=\"U.S. Bombers Stage Joint Drills With South Korean Fighter Jets\" src=\"https://cdn.vox-cdn.com/thumbor/-80G1zGgkRpKRBx_DNUwvKzTnb0=/490x0:5718x3921/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71588892/1439166424.0.jpg\" />\n        <figcaption>In this handout image released by the South Korean Defense Ministry, two U.S. B-1B Lancer strategic bombers, four South Korean Air Force F-35 fighter jets and four U.S. Air Force F-16 fighter jets fly over South Korea during the “Vigilant Storm” joint air drill on November 05, 2022. | South Korean Defense Ministry via Getty Images</figcaption>\n    </figure>\n\n  <p>Nuclear diplomacy is urgently needed amid rising tensions but politically untenable. </p> <p id=\"YI0F9Q\">US and South Korean officials believe North Korea may be gearing up for its seventh nuclear test after the country, led by dictator Kim Jong Un, launched a barrage of missiles this week, including an intercontinental ballistic missile (ICBM) in violation of repeated <a href=\"https://www.armscontrol.org/factsheets/UN-Security-Council-Resolutions-on-North-Korea\">United Nations Security Council</a> efforts to stop such actions. </p>\n<p id=\"mKhmuT\">Two US B-1B bombers, along with four F-16s and four South Korean F-35s, flew in South Korean airspace as part of the extended Vigilant Storm training exercises, as North Korea launched an <a href=\"https://apnews.com/article/japan-united-states-south-korea-evacuations-north-5d8f0935f50d013d7e9c375cc27456e5?user_email=d0ae70922af541a4cf45e48d2575200542345a2aa90b689d43e7a2924e4e3869&amp;utm_source=Sailthru&amp;utm_medium=email&amp;utm_campaign=Nov06_MorningWire&amp;utm_term=Morning%20Wire%20Subscribers\">additional four short-range ballistic missiles Saturday</a>. That display capped off a week of surging tensions on the peninsula; North Korea launched 23 missiles on Wednesday — the most it has ever launched on a single day — and six on Thursday including the ICBM, according to<a href=\"https://www.nytimes.com/2022/11/02/world/asia/north-korea-missile-japan.html\"> the New York Times</a>. One of Wednesday’s missiles fell so close to South Korea that Seoul <a href=\"https://apnews.com/article/seoul-south-korea-north-joint-chiefs-of-staff-government-and-politics-7d6079c606fe796dc4771fa48b9c2bfe\">launched its own air-to-surface missile tests in return</a>. </p>\n<p id=\"AT2HpC\">Pyongyang has said the missile launches are its response to military drills the US, Japan, and South Korea routinely conduct in the area. North Korea views such exercises as a provocation; <a href=\"https://apnews.com/article/seoul-south-korea-nuclear-weapons-north-d3a1d9d6633e6fc910bfd8a6eadf9158\">according to the Associated Press</a>, Pyongyang had already obliquely threatened to use nuclear weapons should the US and South Korea launch an attack. </p>\n<p id=\"ZU0Ddr\">South Korean officials indicated that the ICBM launch had failed to reach its intended altitude and speed, and Japanese Defense Minister Yasukazu Hamada refuted early reports that one of the missiles flew over Japanese airspace; still, the launches indicate an increasingly paranoid North Korean regime that has persisted in its weapons development program despite international condemnation.</p>\n<p id=\"RsxBXD\">“The US-ROK [Republic of Korea] response in the last 24 hours — extending the US-ROK drills for a longer period, plus the report that the United States is accelerating the rotation of nuclear-capable fighter jets in the region, is only going to reinforce Kim Jong Un’s paranoia about the capabilities of the United States and the ROK to conduct decapitation strikes on his regime,” Daryl Kimball, executive director of the Arms Control Association told Vox on Friday. </p>\n<p id=\"C1qmpC\">At the very least, according to both US and South Korean officials, as well as experts who spoke to Vox, North Korea is likely planning a nuclear test — <a href=\"https://www.armscontrol.org/factsheets/dprkchron\">the seventh in its history</a> and the fifth under current leader Kim Jong Un. </p>\n<p id=\"d30h6p\">The US and its allies are in an extremely tense and unsustainable standoff with North Korea, and it’s increasingly difficult to find a way to stop it. “We’re in the middle of an escalatory cycle that I think both sides need to step back from,” Kimball said. </p>\n<h3 id=\"8zQHHg\">Nuclear postures are becoming more bellicose</h3>\n<p id=\"qWRE8V\">Since first developing its nuclear weapons program in earnest in the 1990s, North Korea, or its official title, Democratic People’s Republic of Korea (DPRK) has managed to produce some 40 to 50 nuclear warheads, although some estimates put that number as high as 116, according to <a href=\"https://www.washingtonpost.com/business/energy/what-nukes-does-north-korea-have-and-could-they-hit-the-us/2022/11/03/d69177aa-5b35-11ed-bc40-b5a130f95ee7_story.html\">the Washington Post</a>. This week’s missile launches demonstrate how North Korea would deliver those weapons — on short-range missiles to neighboring adversaries like Japan or South Korea, and an ICBM to the United States. </p>\n<p id=\"xoiGI4\">“The frequency of the short-range missile tests that North Korea’s conducting, the scrambling of the aircraft in response to the US-ROK drills — in my view, this indicates that North Korea is very nervous about US-ROK combined capabilities, [and] trying to demonstrate its retaliatory capabilities,” Kimball said. </p>\n<p id=\"Aszhu2\">Nuclear development, production, and testing has accelerated significantly under Kim Jong Un, the country’s third ruler from the Kim dynasty. The DPRK’s weapons program under Kim is developing a missile capable of reaching the Pacific island of Guam, a US territory and military installation, in addition to missiles that can reach US allies in the region like South Korea and Japan. </p>\n<p id=\"tM7Lx0\">Kim has been testing ICBMs, <a href=\"https://www.38north.org/2022/04/revisiting-the-hwasong-17-15-controversy-what-if-north-korea-had-launched-a-hwasong-15/\">the Hwasong-15 and the Hwasong-17</a>, capable of reaching targets in the United States itself since 2017, although there remains some doubt about whether those weapons are consistent and sophisticated enough to actually hit their intended locations. And although Thursday’s test failed, each ICBM launch provides information for the next one.</p>\n<p id=\"iDUGYV\">In addition to technical advancements, Kim has made significant policy changes around nuclear weapons use. <a href=\"https://www.armscontrol.org/act/2022-10/news/north-korea-passes-nuclear-law\">The DPRK’s new nuclear weapons law</a>, which Kim announced in September, maintains that North Korea is officially a nuclear state and will not pursue disarmament. Perhaps more alarmingly, the new policy indicates that the DPRK will launch a nuclear attack in the case of a so-called “decapitation strike” to take out North Korean leadership, or if the DPRK’s military objectives aren’t being met through conventional warfare. </p>\n<p id=\"1Kwu20\">Kim’s increasing fear that his adversaries are planning to take him out isn’t unfounded; South Korea’s military policies in relation to the North are called the Kill Chain — a plan to take out DPRK leadership, including Kim, with conventional weapons — and Korean Massive Punishment and Retaliation (KMPR), which is the military’s retaliatory strategy in case of an attack, as <a href=\"https://carnegieendowment.org/2022/08/15/south-korea-s-decapitation-strategy-against-north-korea-has-more-risks-than-benefits-pub-87672\">the Carnegie Endowment for International Peace’s Ankit Panda wrote in August</a>. </p>\n<p id=\"tjrU5g\">The US’s latest <a href=\"https://fas.org/blogs/security/2022/10/2022-nuclear-posture-review/\">Nuclear Posture Review</a> also contains a new specific threat against the Kim regime: “Any nuclear attack by North Korea against the United States or its Allies and partners is unacceptable and will result in the end of that regime.” Although the new threats are not pre-emptive, they still promise that, ”there is no scenario in which the Kim regime could employ nuclear weapons and survive.”</p>\n<p id=\"0ewvp6\">But part of any deterrent strategy — and a part that seems to be missing in the US and South Korea’s strategy, Panda told Vox, is reassuring an adversary. “That is traditionally a part of deterrence,” he said. “Not just making credible threats, but giving credible assurances that if the adversary doesn’t do the bad thing that you don’t want them to do, you’re not going to inflict pain on them anyway.” </p>\n<p id=\"maxYtw\">There are also indications that the DPRK is preparing for a test, Kimball said, including construction at the DPRK’s Punngye-ri nuclear test site, as well as the fact that Kim has abandoned a unilateral nuclear weapons and long-range missile testing moratorium agreed in April 2018. Furthermore, Kim in 2021 discussed tactical nuclear weapons for the first time publicly; those capabilities had never been part of the DPRK’s military doctrine, but it’s likely that they would be testing lower yield nuclear weapons this time.</p>\n<p id=\"dmhjkF\">“They’ve been telling us that they’re going to do it for a while,” Dalton said.</p>\n<h3 id=\"zLunpJ\">Negotiations have broken down — and it’s not clear how to get them back on track</h3>\n<p id=\"9Ahoyl\"> The <a href=\"https://www.vox.com/2022/3/6/22964312/russia-putin-nuclear-disarmament-nonproliferation-interview\">global status of nuclear treaties</a> overall has seriously declined in recent decades — not that North Korea has considered itself subject to any since <a href=\"https://www.cfr.org/timeline/north-korean-nuclear-negotiations\">unilaterally withdrawing from the Non-Proliferation Treaty in 2003</a>. Nuclear and missile tests in violation of international norms and agreements have become par for the course in the DPRK; it doesn’t mean that nuclear war is about to break out, and it’s not particularly helpful to spin out every time it happens. But it is important to pay attention.</p>\n<p id=\"cPPJQ5\">“[The escalations are] disconcerting and worrisome because there are more missiles being tested in a short period of time, but putting all of this together, this is the unsurprising and worrisome result of some four-and-a-half years of no meaningful diplomatic dialogue about risk reduction, and denuclearization and peace on the peninsula.” Kimball said. </p>\n<p id=\"UBIn3z\">Kimball pointed out that although the US has offered dialogue with North Korea to de-escalate the situation, the DPRK has refused to engage.</p>\n<p id=\"cBWFwv\">Kim likely feels wary of engaging in diplomacy with the US or South Korea because of the <a href=\"http://ytimes.com/2019/03/02/world/asia/trump-kim-jong-un-summit.html\">spectacular breakdown</a> of peace talks with former President Donald Trump, Dalton said. That process ended in a humiliating failure in Hanoi, Vietnam, when Trump tried to push for full denuclearization in return for an end to the punishing sanctions regime the US has built up over the decades. </p>\n<p id=\"Fl9kap\">“[Kim] took some risks in terms of his domestic constituency in terms of pursuing that diplomacy — and then it fell apart and I think he was embarrassed by that,” Dalton said. From North Korea’s perspective, “they’re not willing to trust South Korea or the US to engage in diplomacy,” he told Vox, and the parties involved aren’t even in agreement about what the outcome of that diplomacy would be.</p>\n<p id=\"XDX39N\">Since that breakdown, the global order has shifted, too. “China and Russia have a different view of North Korea and they both view Kim Jong Un as more of an asset than a liability,” Panda said, noting recent reports that North Korea is providing artillery to Russia in its ongoing invasion of Ukraine. “Then we might ask, reasonably, what is the quid pro quo there? <a href=\"https://www.reuters.com/world/asia-pacific/un-chief-urges-north-korea-resume-denuclearization-talks-2022-11-04/\">Probably that Russia is going to support North Korea at the UN Security Council,</a>” he said.</p>\n<p id=\"sE5wvH\">Despite all of these consequential changes, the US and its allies are using the same tools to try and fix the problem of proliferation. While conventional weapons drills and sanctions may have been useful years ago, when the DPRK’s nuclear program was much smaller, Kim has made clear that the calculus has changed and he’s forging ahead with the nuclear program — perhaps with even more determination than in the past. </p>\n<p id=\"7ZXSzy\">Increasingly harsh sanctions have helped push North Korea further away from engagement with the US and toward Russia and China, as well as driving the North Korean people further into extreme poverty. But they haven’t stopped the <a href=\"https://www.nytimes.com/2021/03/24/world/asia/tankers-north-korea-china.html\">illicit trade</a>, <a href=\"https://www.cnn.com/2022/09/08/politics/fbi-north-korea-hackers-30-million-axie-infinity/index.html#:~:text=North%20Korean%20government%2Dbacked%20hackers,according%20to%20the%20United%20Nations.\">outright theft</a>, and sheer determination on the part of the Kim regime to support the nuclear program. </p>\n<p id=\"jdMcS4\">“Kim Jong Un has invested, over his 10-plus years in power now, in domestic talent,” Panda said. “He is ensuring that North Korea has a long-term supply of human resources and talent to sustain their missile and nuclear forces.”</p>\n<p id=\"Lu6P51\">The US could take take the temperature down by removing some sanctions to signal a desire to avoid greater conflict, although that would be “politically controversial,” Dalton said. The US could also recognize in some way North Korea’s demonstrated status as a nuclear state — also an unpopular tack, due to fears that officially recognizing that reality would send Japan and South Korea scrambling for nuclear weapons of their own.</p>\n<p id=\"gOTcjk\">But any deviation from standard practice is unlikely, Dalton said, because “nobody wants to take the blame for allowing North Korea to become a state with nuclear weapons.”</p>",
  "link": "",
  "id": "https://www.vox.com/2022/11/5/23440456/korean-missile-launches-nuclear-tests-china-russia-japan",
  "author": {
    "name": "Ellen Ioanes"
  }
}