{
  "title": "Design and preliminary operation of a laser absorption diagnostic for the SPIDER RF source. (arXiv:2211.01719v1 [physics.plasm-ph])",
  "link": "http://arxiv.org/abs/2211.01719",
  "description": "<p>The ITER Heating Neutral Beam (HNB) injector is required to deliver 16.7 MW\npower into the plasma from a neutralised beam of H-/D- negative ions, produced\nby an RF source and accelerated up to 1 MeV. To enhance the H-/D- production,\nthe surface of the acceleration system grid facing the source (the plasma grid)\nwill be coated with Cs because of its low work function. Cs will be routinely\nevaporated in the source by means of specific ovens. Monitoring the evaporation\nrate and the distribution of Cs inside the source is fundamental to get the\ndesired performances on the ITER HNB. In order to proper design the source of\nthe ITER HNB and to identify the best operation practices for it, the prototype\nRF negative ion source SPIDER has been developed and built in the Neutral Beam\nTest Facility at Consorzio RFX. A Laser Absorption Spectroscopy diagnostic will\nbe installed in SPIDER for a quantitative estimation of Cs density. By using a\nwavelength tunable laser, the diagnostic will measure the absorption spectrum\nof the 852 nm line along 4 lines of sight, parallel to the plasma grid surface\nand close to it. From the absorption spectra the line-integrated density of Cs\nat ground state will be measured. The design of this diagnostic for SPIDER is\npresented, with details of the layout and of the key components. A preliminary\ninstallation of the diagnostic on the test stand for Cs ovens is also\ndescribed, together with its first experimental results; the effect of ground\nstate depopulation on collected measurements is discussed and partially\ncorrected.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Barbisan_M/0/1/0/all/0/1\">M. Barbisan</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Pasqualotto_R/0/1/0/all/0/1\">R. Pasqualotto</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Rizzolo_A/0/1/0/all/0/1\">A. Rizzolo</a>"
}