{
  "title": "S02.19: So You Want to Read a Historical",
  "category": [
    "full-length episode",
    "interstitial",
    "S02 - Interstitials",
    "so you wanna",
    "romance recommendations"
  ],
  "dc:creator": "Sarah MacLean",
  "pubDate": "Wed, 15 Jan 2020 05:00:00 +0000",
  "link": "https://fatedmates.net/episodes/2020/1/14/s0219-so-you-want-to-read-a-historical",
  "guid": "5bc7409ec46f6d369ce5f644:5bcf6773419202388fdccb10:5e1e1ff76fe98418508a46e9",
  "description": "<p class=\"\">Don’t miss a single moment of our 2020 episodes — subscribe on your favorite podcasting platform and like/review the podcast if you’re so inclined!</p><p class=\"\">Next week, we’re talking Kristen Callihan’s <a href=\"https://amzn.to/3005Aa7\"><em>Managed</em></a>, which you may recognize as “SCOTTIE,” which is how Jen refers to it because she loves him so much. We think you’ll love it, too, and if you have time, read the next in the series, <a href=\"https://amzn.to/36JcEe9\"><em>Fall</em></a>, which is one of Sarah’s top 10 romances ever. Read <em>Managed </em>at <a href=\"https://amzn.to/3005Aa7\">Amazon</a>, <a href=\"https://www.barnesandnoble.com/w/managed-kristen-callihan/1124037490?ean=2940158465680\">Barnes & Noble</a>, <a href=\"https://books.apple.com/us/book/managed/id1129493045?app=itunes&at=1l3vpAR&mt=11\">Apple Books</a>, or <a href=\"https://www.kobo.com/us/en/ebook/managed\">Kobo</a>.</p><p class=\"\">Show Notes</p><p class=\"\">RWA imploded and it's such a long, complicated story, but <a href=\"https://www.vox.com/2020/1/10/21055125/rwa-what-happened-resignations-courtney-milan-damon-suede-backstory-2020-ritas-conference\">this article from Vox</a> and <a href=\"https://www.claireryanauthor.com/blog/2019/12/27/the-implosion-of-the-rwa\">this timeline by Claire Ryan</a> are what will catch you up.</p><p class=\"\"><a href=\"https://youtu.be/1RW3nDRmu6k\">Let's start at the very beginning, a very good place to start</a>: there are seven romance subgenres: historical, contemporary, romantic suspense, paranormal, inspirational, erotic romance, and YA.</p><p class=\"\">When it comes to the grandmother of historicals, don't forget that <a href=\"https://en.wikipedia.org/wiki/Jane_Austen\">Jane Austen</a> was writing contemporaries.</p><p class=\"\">Johanna Lindsey died in October, and her family announced it publicly in December. <a href=\"https://twitter.com/JenReadsRomance/status/1209095021019963398\">The New York Times obituary was trash</a>, so read the <a href=\"https://www.washingtonpost.com/local/obituaries/johanna-lindsey-master-of-historical-romance-novels-dies-at-67/2019/12/23/bd5e7cca-2590-11ea-ad73-2fd294520e97_story.html\">Washington Post</a> or <a href=\"https://ew.com/books/2019/12/23/johanna-lindsey-romance-novelist-dies/\">Entertainment Weekly</a> one instead. Check out the Twitter hastag #MyFirstJohanna for people's stories about their first book by Lindsey (<a href=\"https://twitter.com/sarahmaclean/status/1209131730705305600\">including Sarah's</a>), and maybe listen to our episode on <a href=\"https://fatedmates.net/episodes/2019/10/7/s025-gentle-rogue\">Gentle Rogue</a>.</p><p class=\"\">Support <a href=\"https://www.gofundme.com/f/church-organ-in-honor-of-tamara-roybiskie?utm_campaign=p_cp%20share-sheet&utm_medium=copy_link-tip&utm_source=customer\">Farrah Rochon</a> for an organ in her sister's memory. And come this summer, buy her upcoming book <a href=\"https://amzn.to/3adQgLN\">The Boyfriend Project.</a></p><p class=\"\">In <a href=\"https://www.goodreads.com/quotes/8052600-abel-wanted-a-traditional-marriage-with-a-traditional-wife-for\">Born a Crime</a>, Trevor Noah wrote about what his mother said about her second husband wanting to put her in a cage: For a long time I wondered why he ever married a woman like my mom in the first place, as she was the opposite of that in every way. If he wanted a woman to bow to him, there were plenty of girls back in Tzaneen being raised solely for that purpose. The way my mother always explained it, the traditional man wants a woman to be subservient, but he never falls in love with subservient women. He’s attracted to independent women. “He’s like an exotic bird collector,” she said. “He only wants a woman who is free because his dream is to put her in a cage.”</p><p class=\"\"><a href=\"https://www.bbc.co.uk/teach/mary-wollstonecraft-britains-first-feminist/zkpk382\">Mary Wollstonecraft</a> is all the evidence you need that feminists have been around for a long time.</p><p class=\"\">Jen recommends <a href=\"https://amzn.to/2NtNYOZ\">In the Dream House by Carmen Marie Machado</a>, which is about domestic abuse in a queer relationship. The quote from Jose Estaban Munoz is, \"When the historian of queer experience attempts to document a queer past, there is often a gatekeeper representing a straight present.\"</p><p class=\"\">When talking about <a href=\"https://amzn.to/2QRmfd7\">The Doctor's Discretion</a> by EE Ottoman, Sarah is very excited about a book called <a href=\"https://amzn.to/2FS2FHk\">The Butchering Art</a> by medical historian Dr. Lindsey Fitzharris, whose <a href=\"https://www.instagram.com/drlindseyfitzharris/?hl=en\">sometimes very gross Instagram</a> is amazing. <a href=\"https://www.them.us/story/james-barry-ej-levy\">Doctor James Berry</a> was trans man who lived and worked in London in the mid 1800s.</p><p class=\"\">If you haven't listened to <a href=\"https://fatedmates.net/episodes/2019/12/9/s0214-indigo\">our episode about Beverly Jenkins's Indigo</a> what are you waiting for?</p><p class=\"\"><a href=\"https://www.harpercollins.com/corporate/press-releases/introducing-avon-red-new-line-from-leading-womens-fiction-publisher-offers-the-pinnacle-of-sexy-fiction/\">Avon Red</a> was a short-lived series, but then again, so was The Red Shoe Diaries. Sarah recommends <a href=\"https://amzn.to/30j7cMy\">On These Silken Sheets</a> by Sabrina Darby from that series.</p><p class=\"\"><a href=\"https://www.thewhoresofyore.com/\">Whores of Yore</a> is a great blog, and definitely proves Jen's assertion that as soon as someone invented cameras, someone else wanted to get naked in front of it. Dr. Kate Lister, who founded the site, has a book called <a href=\"https://amzn.to/2Nqsdja\">A Curious History of Sex</a> coming out Feb 2020.</p><p class=\"\">Next time you are in New York, visit <a href=\"https://www.museumofsex.com/\">The Museum of Sex</a>. Sarah recommends Hallie Rubenhold's The Covent Garden Ladies: Pimp General Jack and the Extraordinary Story of Harris' List (which out of print, but <a href=\"https://amzn.to/2FPpg7p\">available in audio</a>, and is the book <a href=\"https://www.hulu.com/series/harlots-18edbd1f-3e9f-46a0-8dc4-02ff7b1eef63\">Harlots</a> is based on). <a href=\"https://amzn.to/2tVZ3l9\">Hallie Rubenhold's The Five</a> is not out of print, and also excellent--it is very not a romance, and about the victims of the Ripper killings.</p><p class=\"\"><a href=\"http://kjcharleswriter.com/\">KJ Charles</a> is so ridiculously good. Sarah's favorites are Wanted a Gentleman and Think of England and Jen loves Band Sinister. <a href=\"http://www.nicola-davidson.com/\">Nicola Davidson</a>'s Surrey Sexual Freedom Society series is fantastic. <a href=\"https://alyssacole.com/\">Alyssa Cole</a>'s An Extraordinary Union is amazing. Monica McCarty wrote a historical series that imagines Highlanders as being kind of like Navy SEALs. Sarah talked about one of the books in the series, The Arrow on the <a href=\"https://fatedmates.net/episodes/2019/1/7/65-scotland-interstitial\">Scotland interstitial</a>. Honestly, we talked about so many authors, so just click on any one of the images in the photo gallery below for some of our favorites by those authors.</p><p class=\"\">But <a href=\"https://www.jenreadsromance.com/shop\">stickers and buttons from Kelly</a>, <a href=\"https://jordandene.com/collections/romance-sarah-maclean\">tees and bags from Jordandene</a>, take our <a href=\"https://www.instagram.com/stories/highlights/18123181900012231/\">reading challenge</a>, and answer our <a href=\"https://survey.fatedmates.net/\">survey</a>.</p>",
  "itunes:author": "Fated Mates",
  "itunes:subtitle": "Jen and Sarah vs Historical Romance",
  "itunes:summary": "We’re launching a Special Romance Report here at Fated Mates — a series of interstitials introducing readers to the subgenres of Romance (there are seven!) — we’re talking about why they exist, what they’re trying to do, what to expect from them, what might have readers hesitating, and where to start! This week, we’re starting with Sarah’s favorite subgenre — Historicals! We’re talking about why they’re sexy, progressive, feminist, and very not boring.",
  "itunes:explicit": "yes",
  "itunes:duration": "00:56:59",
  "itunes:image": "",
  "itunes:season": 2,
  "itunes:episode": 19,
  "itunes:title": "S02.19: So You Want to Read a Historical",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "S02.19: So You Want to Read a Historical"
  }
}