{
  "id": "https://bibleinoneyear.org/en/youth/17",
  "title": "Day 17: Five Ways to Fulfil Your Potential",
  "description": "Psalm 10:2-6, Genesis 35:2–3, Matthew 13:3–8.  For I tell you the truth, many prophets and righteous people longed to see what you see but did not see it, and to hear what you hear but did not hear it’ (Matthew 13:16–17) Jesus warns that although there is great *potential* in each of us, there are *pitfalls* ahead",
  "pubDate": "Mon, 17 Jan 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/17/",
  "itunes:duration": "12:37",
  "guid": "enyouth17012022-17",
  "length": 757.5,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 17: Five Ways to Fulfil Your Potential",
  "itunes:subtitle": "Psalm 10:2-6, Genesis 35:2–3, Matthew 13:3–8.  For I tell you the truth, many prophets and righteous people longed to see what you see but did not see it, and to hear what you hear but did not hear it’ (Matthew 13:16–17) Jesus warns that although there is great *potential* in each of us, there are *pitfalls* ahead",
  "itunes:summary": "In life, many people do not reach their full potential. We can become so caught up in the everyday that it is easier to continue in old patterns rather than change. Yet, we all have a God-given desire to live to our full potential. Perhaps you remember this celebrated biography:\n‘Solomon Grundy… Born on a Monday…\nChristened on Tuesday… Married on Wednesday…\nTook ill on Thursday… Grew worse on Friday…\nDied on Saturday… Buried on Sunday…\nAnd that was the end of Solomon Grundy.’\nFor some people, that just about sums up their life. And yet, all of us feel deep down ‘There must be more to life than that’. Jesus says, in effect, ‘Yes, there is!’. The potential for every human being is great.\nJesus wants you to live a highly productive life. He wants you to produce ‘a crop – a hundred, sixty or thirty times what was sown’ (Matthew 13:8). The minimum is a thirty-times multiplication. The key to that potential lies in your relationship with Jesus – a relationship that can be as close as that of a brother or sister or mother (12:50). You can live a life of real purpose that can make a difference to the world, because of what you receive from him (13:11,12,16).\nYour potential is not about being driven by ambition or success; it is about recognising who you are in God. As you seek him and live your life according to his purposes, you will bear much fruit. The more you begin to fulfil your God-given potential, the more he entrusts to you. He wants you to live a life of abundance (v.12).\nThe potential for Israel was very great (Genesis 35:11). God intended that Israel would not only be blessed, but also be a blessing to other nations. You have the potential to live a life of even greater blessing than those you read about in the Old Testament. Jesus says, ‘Blessed are your eyes because they see, and your ears because they hear. For I tell you the truth, many prophets and righteous people longed to see what you see but did not see it, and to hear what you hear but did not hear it’ (Matthew 13:16–17).\nJesus warns that although there is great potential in each of us, there are pitfalls ahead. How can you avoid the pitfalls and fulfil your potential?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 382
}