{
  "id": "tag:blogger.com,1999:blog-7815614485808579332.post-2104338197692959081",
  "published": "2022-08-10T11:21:00.000-07:00",
  "updated": "2022-08-10T11:21:41.334-07:00",
  "category": [
    "",
    ""
  ],
  "title": "Feed label replaces target country in Content API for Shopping",
  "content": "<strong>On August 23, 2022 we will gradually start updating the way country targeting works for shopping products.</strong> As a result, the <code>targetCountry</code> field for newly inserted products and the <code>country</code> field for new datafeeds may be empty in the <a href=\"https://developers.google.com/shopping-content/guides/quickstart\">Content API for Shopping</a>. While <code>targetCountry</code> and <code>country</code> are now deprecated, there are no plans to remove these fields from v2.1 to preserve backward compatibility. We recommend using <a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/products#Product.FIELDS.feed_label\">feedLabel</a> to name new products and feeds, and using the <a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/products#ProductShipping\">shipping</a> field to specify the countries to target.<br /><br /> <strong>If you're accessing accounts whose product data you don’t have total control over and you are unsure whether the products or datafeeds will have ONLY a <code>feedLabel</code> field beginning in late August, we recommend you update your code to support the <code>feedLabel</code> field.</strong><br /><br />   This upcoming change might impact or break your API integration if your application cannot handle <a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/products\">products</a> without a <code>targetCountry</code> or <a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/datafeeds#DatafeedTarget\">datafeeds</a> without a <code>country</code>.<br /><br /> See <a href=\"http://ads-developers.googleblog.com/2022/08/country-targeting-in-shopping-ads.html\">Country targeting in Shopping Ads campaigns is changing in August 2022</a> for how this change will impact Google Ads.<br /><br /> <strong>What’s already changed</strong><br />On <strong>August 8, 2022</strong>, the <a href=\"https://developers.google.com/shopping-content/guides/quickstart\">Content API for Shopping</a> added the <code>feedLabel</code> field to the products resource. As of August 8, 2022, <code>feedLabel</code> can only accept and return two-letter <a href=\"https://github.com/unicode-org/cldr/blob/latest/common/main/en.xml\">CLDR territory codes</a>. Products now require either <code>targetCountry</code> or <code>feedLabel</code>. As long as the <code>feedLabel</code> set is a valid two-letter CLDR code, <code>targetCountry</code> will be backfilled for compatibility.<br /><br /> We have changed the definition of the product identifier (<a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/products#Product.FIELDS.id\">the id</a>, i.e. the <code>REST ID</code>). <code>feedLabel</code> now replaces <code>targetCountry</code> as the third component of the identifier, so it is no longer just a valid two-letter CLDR code. You can find an example shown <a href=\"https://developers.google.com/shopping-content/guides/products/feed-labels#offer_id\">here</a>.<br /><br /> <strong>This change to product identifier is backwards compatible, so existing REST IDs for existing products will continue to work without change.</strong><br /><br />   <strong><em>Important</em></strong>: <code>feedLabel</code> doesn’t impact targeting. This means if you use <code>feedLabel</code> instead of <code>targetCountry</code>, you need to specify all countries you want to target in the <a href=\"https://developers.google.com/shopping-content/reference/rest/v2.1/products#ProductShipping\">shipping</a> attribute.<br /><br /> <strong>What’s coming next</strong><br />We’re starting a gradual rollout to all users on <strong>August 23, 2022</strong>. When the upcoming change reaches you, you’ll be able to create a product or datafeed with any string (not just a two-letter CLDR code) as the <code>feedLabel</code> via the API or the Merchant Center. You’ll still be able to use a two-letter country code in <code>targetCountry</code> for backwards compatibility.<br /><br /> After the upcoming change, if you submit a <code>feedLabel</code> that isn’t a CLDR territory code, the API will return those products without a <code>targetCountry</code> or those datafeeds without a <code>country</code>. Instead, only their <code>feedLabel</code> will be populated. This may break your codebase if your implementation expects a value in <code>targetCountry</code> for products or a value in <code>country</code> for datafeeds.<br /><br /> <strong>How you’re impacted</strong><br /><strong>Products</strong><br />If you continue inserting your products with a <code>targetCountry</code>, you are not required to make any changes at this time, as the <code>feedLabel</code> value in the <code>products</code> REST ID will be identical to the <code>targetCountry</code> you inserted.<br /><br /> However, if you use a <code>feedLabel</code> in Merchant Center or the API that is not a CLDR territory code, we highly recommend you update your codebase to use <code>feedLabels</code> on all product insertions instead of <code>targetCountry</code> to avoid issues with your API integration.<br /><br /> <strong>All products inserted with a <code>feedLabel</code> instead of <code>targetCountry</code>, even if the <code>feedLabel</code> is a CLDR territory code, will not automatically target that country. You must explicitly set the countries you want to target via the <a href=\"https://developers.google.com/shopping-content/guides/targeting-ads-in-multiple-countries#enable_ad_targeting_and_list_your_product_in_multiple_countries_for_specific_products\"><code>shipping</code> field.</a></strong><br /><br /> <strong>Datafeeds</strong><br />Note that starting August 23, 2022, <strong>feed label</strong> will replace the current <strong>country of sale</strong> value in the Merchant Center UI. The Content API will be expected to support this change via the datafeeds service starting mid-September. These new datafeeds will only have the <code>feedLabel</code> field set, not the <code>country</code> field, unless you explicitly set the <code>feedLabel</code> to a CLDR territory code.<br /><br /> To support new users, we highly recommend you update your codebase to use <code>feedLabels</code> on all datafeeds instead of <code>country</code> to avoid issues with your API integration.<br /><br /> <strong>Recommendation for third party integrations</strong><br />If you’re a third party or agency that manages your customers' accounts for them, we highly recommend you check your codebase is able handle products without a <code>targetCountry</code> and datafeeds without a <code>country</code> before August 23, 2022.<br /><br /> After the gradual rollout starting in late August, your merchants will be able to modify products directly in Merchant Center to create a product with a <code>feedLabel</code> that is not a valid two-letter CLDR territory code. When this product is returned via <code>products.list</code>, you could encounter issues if your implementation expects a value in <code>targetCountry</code>.<br /><br /> As well, after the gradual rollout in late August, new users will create datafeeds that by default have a <code>feedLabel</code> and no <code>country</code> field. When this datafeed is returned via <code>datafeeds.list</code>, you could encounter issues if your implementation expects a value in <code>country</code>.<br /><br /> How to detect if you have offers without a country in your Merchant Center account <ol>  <li>Make a request to <code>products.list</code>.</li>  <li>Filter your products to search for products where the <code>targetCountry</code> field does not exist on the product.</li>  <li>If any products appear, you have offers without a country in your Merchant Center.</li></ol> <strong>Detailed Changes</strong><br />To view a detailed breakdown of the changes to the Content API by this feature launch, see the guide <a href=\"https://developers.google.com/shopping-content/guides/products/feed-labels\">here</a>.<br /><br /> <strong>Datafeeds Service</strong><br />Starting mid-September the <code>datafeeds</code> service will begin to return <code>feedLabel</code> on all datafeeds, which will be the <code>country</code> value if that is how the <code>datafeed</code> was created. The <code>datafeeds</code> service will also return the <code>country</code> field if the <code>feedLabel</code> is a valid country code for backwards compatibility.<br /><br /> <strong>Opt out of receiving products and datafeeds without a country</strong><br />If you’re concerned your codebase cannot handle products and datafeeds without a country, and you want to opt out of receiving them via the Content API after August 23, then please fill out the following form: <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSezbSFNu6Hu3XCYVo7qs0hD8yjQML-3pklC_cp-3z-tJnjhgA/viewform?usp=sf_link\">Feed label replaces target country in the Content API for Shopping - temporary exemption</a>. Once you have fully supported feedLabel, you will be able to opt back in to receiving these offers. <br /><br /> If you have any questions or concerns, please don't hesitate to contact us via the <a href=\"https://groups.google.com/g/google-content-api-for-shopping\">forum</a>.<br /> <span class='byline-author'><img height=\"40\" width=\"40\" src=\"https://lh6.googleusercontent.com/3UR5v4kdd7GrfXL7qxf9q5dUhvFCuGpErSk9b_VLFBrxtt2a8nNB4ka6wnxAjf_cESedQlAsF96iW-aNPGDANC2e0PMddceUlVVty7QfxD9qtapM1fRdGnU3qhDOEEQgXuJoQ3qaGumt7JfWD4wEcLsY\" style=\"vertical-align: middle; border:none;\"/> Benji Rothman, Content API for Shopping Team</span>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Ads Developer Advisor",
    "uri": "http://www.blogger.com/profile/16700526826531306391",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}