{
  "title": "A 4 Gyr M-dwarf Gyrochrone from CFHT/MegaPrime Monitoring of the Open Cluster M67. (arXiv:2211.01377v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01377",
  "description": "<p>We present stellar rotation periods for late K- and early M-dwarf members of\nthe 4 Gyr old open cluster M67 as calibrators for gyrochronology and tests of\nstellar spin-down models. Using Gaia EDR3 astrometry for cluster membership and\nPan-STARRS (PS1) photometry for binary identification, we build this set of\nrotation periods from a campaign of monitoring M67 with the\nCanada-France-Hawaii Telescope's MegaPrime wide field imager. We identify 1807\nmembers of M67, of which 294 are candidate single members with significant\nrotation period detections. Moreover, we fit a polynomial to the period versus\ncolor-derived effective temperature sequence observed in our data. We find that\nthe rotation of very cool dwarfs can be explained by a simple solid-body\nspin-down between 2.7 and 4 Gyr. We compare this rotational sequence to the\npredictions of gyrochronological models and find that the best match is\nSkumanich-like spin-down, P_rot \\propto t^0.62, applied to the sequence of\nRuprecht 147. This suggests that, for spectral types K7-M0 with near-solar\nmetallicity, once a star resumes spinning down, a simple Skumanich-like is\nsufficient to describe their rotation evolution, at least through the age of\nM67. Additionally, for stars in the range M1-M3, our data show that spin-down\nmust have resumed prior to the age of M67, in conflict with predictions of the\nlatest spin-down models.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Dungee_R/0/1/0/all/0/1\">Ryan Dungee</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Saders_J/0/1/0/all/0/1\">Jennifer van Saders</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Gaidos_E/0/1/0/all/0/1\">Eric Gaidos</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Chun_M/0/1/0/all/0/1\">Mark Chun</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Garcia_R/0/1/0/all/0/1\">Rafael A. Garcia</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Magnier_E/0/1/0/all/0/1\">Eugene A. Magnier</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Mathur_S/0/1/0/all/0/1\">Savita Mathur</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Santos_A/0/1/0/all/0/1\">Angela R. G. Santos</a>"
}