{
  "title": "#421: Sidecar Blues (Hagrid's Magical Creatures Motorbike Adventure Ride Review)",
  "link": "https://audioboom.com/posts/7291370",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4673,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Universal Orlando's Wizarding World of Harry Potter has just opened its latest coaster, Hagrid's Magical Creatures Motorbike Adventure, and we review it!</li>\n<li>We're joined by The Insider's Kirsten Acuna, who rode the Motorbike Adventure with Andrew.</li>\n<li>Check out Kirsten's <a href=\"https://www.insider.com/hagrids-magical-creatures-motorbike-adventure-review-2019-6\">review of the ride</a> and her report on the <a href=\"https://www.insider.com/hagrids-magical-creatures-motorbike-adventure-easter-eggs-2019-6\">queue's easter eggs</a>! And here's <a href=\"https://www.hypable.com/hagrids-magical-creatures-motorbike-adventure-review/\">Andrew's review</a> on Hypable.</li>\n<li>The ride's queue is intriguing: It's the ruins of Hogwarts, with inscriptions and art from students over the decades. It's here where Hagrid also birthed a Blast-Ended Skrewt.</li>\n<li>Soooo about this Blast-Ended Skrewt: What large hole is spraying us while we're on the Motorbike Adventure??? </li>\n<li>Andrew and Kirsten review the ride, which is a thrilling technological marvel. And riding it at night is a whole different experience! </li>\n<li>The fandom has a new debate on their hands: Is the Motorbike or Sidecar the better vehicle to ride in?</li>\n<li>We take questions from Patreon supporters: How does this ride compare to the others? How intense is it?</li>\n<li>\n<a href=\"https://www.patreon.com/posts/bonus-mugglecast-27696613\">In this week's Bonus MuggleCast</a>, available exclusively on Patreon, we analyze the connection between Fawkes and Dumbledore, and what makes it so special.</li>\n<li>This week's episode is sponsored by HelloFresh (For $80 off your first month, go to <a href=\"http://HelloFresh.com/MuggleCast80\">HelloFresh.com/MuggleCast80</a> and use promo code MuggleCast80) and the Harry Potter Figurine Collection (Visit <a href=\"http://HeroCollector.com/Wizards\">HeroCollector.com/Wizards</a> to get two figurines for $9.95, and free shipping).</li>\n</ul>\n",
  "pubDate": "Mon, 17 Jun 2019 15:29:23 +0000",
  "guid": "tag:audioboom.com,2019-06-17:/posts/7291370",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}