{
  "title": "127: Where Is Robert Fisher?",
  "link": "https://audioboom.com/posts/7549703",
  "itunes:episode": 127,
  "itunes:title": "Where Is Robert Fisher?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3534,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div> In 2001, Robert Fisher murdered his wife and two young kids. And then vanished into thin air. Is he dead, or did he escape to a new life…THIS IS THE QUESTION POSED TO THE PSYCHIC WHO CLOSES OUT THIS….”DOCUMENTARY?” This film, amateur as it is…and we complain about it the whole time…tells the story of the events leading up to the murders and explores ALL the theories of where Robert Fisher could be today. It’s exactly as fascinating and exasperating as it sounds. <br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<a href=\"https://www.obsessedwithpod.com/\"><strong>WE LAUNCHED A NEW PODCAST!</strong></a> \"Obsessed With: Abducted In Plain Sight\" is a 4-part podcast series hosted by Patrick Hinds and Skye Borgman, the director of <em>Abducted in Plain Sight. </em>The podcast takes you behind the scenes of the smash hit documentary by sharing new interview with Jan and her parents, deleted scenes, AN INSANE PLOT LINE THAT LEFT OUT OF THE FILM THAT YOU WON'T BELIEVE, and audio journal recorded by the kidnapper himself and later recovered by the FBI. <strong>BINGE ALL 4 EPISODES NOW WHEREVER YOU GET YOUR PODCASTS!</strong>\n</div>\n",
  "pubDate": "Tue, 07 Apr 2020 04:05:00 +0000",
  "guid": "tag:audioboom.com,2020-04-07:/posts/7549703",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}