{
  "title": "Star Formation Variability as a Probe for the Baryon Cycle within Galaxies. (arXiv:2211.01922v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01922",
  "description": "<p>We investigate the connection of the regulation of star formation and the\ncycling of baryons within and in and out of galaxies. We use idealized\nnumerical simulations of Milky Way-mass galaxies, in which we systemically vary\nthe galaxy morphology (bulge-to-total mass ratio) and stellar feedback strength\n(total eight setups with 80 simulations). By following individual gas parcels\nthrough the disk, spiral arms, and massive star-forming clumps, we quantify how\ngas moves and oscillates through the different phases of the interstellar\nmedium (ISM) and forms stars. We show that the residence time of gas in the\ndense ISM phase ($\\tau_{\\rm SF}$), the nature of spiral arms (strength,\nnumber), and the clump properties (number, mass function, and young star\nfraction) depend on both the galaxy morphology and stellar feedback. Based on\nthese results, we quantify signatures of the baryon cycle within galaxies using\nthe temporal and spatial power spectrum density (PSD) of the star formation\nhistory (SFH). Stronger stellar feedback leads to more bursty star formation\nwhile the correlation timescale of the SFH is longer, because stronger feedback\ndissolves the dense, star-forming ISM phase, leading to a more homogeneous ISM\nand a decrease in $\\tau_{\\rm SF}$. The bulge strength has a similar effect: the\ndeep gravitational potential in a bulge-dominant galaxy imposes a strong shear\nforce that effectively breaks apart gas clumps in the ISM; this subsequently\ninhibits the fragmentation of cool gas and therefore the star formation in the\ndisk, leading to a decrease in the spatial power on scales of $\\sim$ 1 kpc. We\nconclude that measurements of the temporal and spatial PSD of the SFH can\nprovide constraints on the baryon cycle and the star formation process.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Shin_E/0/1/0/all/0/1\">Eun-jin Shin</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Tacchella_S/0/1/0/all/0/1\">Sandro Tacchella</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kim_J/0/1/0/all/0/1\">Ji-hoon Kim</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Iyer_K/0/1/0/all/0/1\">Kartheik G. Iyer</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Semenov_V/0/1/0/all/0/1\">Vadim A. Semenov</a>"
}