{
  "title": "Climate protesters blamed for patient’s death",
  "link": "https://www.rt.com/news/565957-germany-woman-dies-climate-protest/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565957-germany-woman-dies-climate-protest/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6365285720302721e2560a19.jpg\" /> The German interior minister lashed out at road-blocking climate protesters after a woman died in a vehicular incident  <br/><a href=\"https://www.rt.com/news/565957-germany-woman-dies-climate-protest/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A German minister has called for a ‘crackdown’ on activists for disrupting the work of rescue services</strong></p>\n            \n                        \n            <p></p>\n<p><strong></strong>German Interior Minister Nancy Fraser has called for a police <em>&ldquo;crackdown&rdquo;</em> on climate activists who block roads as part of their protests after a female cyclist died in a traffic accident in Berlin while emergency services were stuck in a traffic jam caused by the protest.</p>\n<p><em>&ldquo;Blocking escape routes puts lives at risk,&rdquo;</em> Fraser tweeted on Thursday. <em>&ldquo;The police have my full support for a crackdown.&rdquo;</em>&nbsp;</p>\n<p>She added that climate activists who break the law <em>&ldquo;must be prosecuted quickly and consequently.&rdquo;&nbsp;</em></p>\n<p><em>&ldquo;When crimes are committed and other people are endangered, then every limit of legitimate protest has been breached,&rdquo;</em> Fraser said. She was among several top officials who criticized the activists this week.&nbsp;</p>\n<p>The 44-year-old cyclist was run over by a concrete mixer truck on Monday. According to Berlin&rsquo;s fire department, the woman sustained life-threatening injuries and was trapped under the truck, while the arrival of an emergency vehicle was delayed for several minutes because of a traffic jam caused by climate activists who had glued themselves to a road sign.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636500442030277c925e16f3.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565946-poll-germans-want-more-diplomacy-ukraine/\">Germans want more diplomacy over Ukraine conflict – survey</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The woman was eventually transported to a hospital, where she died on Thursday evening. According to German media outlets, the police are investigating two members of the climate activist group &lsquo;Last Generation&rsquo; in connection to the incident.&nbsp;&nbsp;</p>\n<p>Newspaper S&uuml;ddeutsche Zeitung cited an internal report by the fire brigade on Friday, which stated that the rescue vehicle may have not been needed after all because the rescuers had found another safe way to pull the cyclist from underneath the truck.</p>\n<p>Despite the tragedy, &lsquo;Last Generation&rsquo; vowed to continue with their protests, including those that disrupt traffic. <em>&ldquo;At the moment, we don&rsquo;t know what exactly happened. We only have the information that an emergency vehicle was stuck in a traffic jam. But we don&rsquo;t know for how long, or what role it played in the rescue,&rdquo;</em> the group&rsquo;s spokeswoman, Aimee van Baalen, told news website T-Online on Wednesday.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 21:03:19 +0000",
  "dc:creator": "RT"
}