{
  "title": "Sad: All about feelings, pt. 2",
  "guid": "01DD3T0R6DVZWTWEED0N5RNHXV",
  "itunes:author": "American Public Media",
  "description": "<p>This is the second episode in our four-part series on feelings! In this episode, we're covering the small and big parts of sadness.</p>\n<p>Because this episode touches on some heavy pieces of sadness -- we recommend kids listening along with an adult, so you can talk over any questions that come up. But this episode has plenty of fun stuff, too!</p>\n<p>We'll learn about how social animals -- from goldfish and penguins, to humans -- all seem to get sad sometimes. We'll talk about some ways to help handle sad feelings (doctor-approved pet cuddles, anyone?). And Neptune and Pluto will join us to cover a few ways to help friends or family members who are feeling blue.</p>\n<p>Mallika Chopra will also share a meditation to help with sad feelings. In fact, she leads meditations in each episode of this series. For more, <a href=\"http://https://www.hachettebookgroup.com/titles/mallika-chopra/just-breathe/9780762491582/\">you can check out Mallika Chopra's book for kids, Just Breathe</a>.</p>\n<p>Another note about sadness: everybody feels sad sometimes, and that's totally normal. It can help to talk about your sadness with someone, like a friend or parent. But sometimes sadness can feel overwhelming. If you don't feel like you have anybody to talk to and feel unsafe, there are people ready to listen. Call 800 273-8255. It's a free phone call, and people are there all the time, ready to listen and help.</p>\n<p>This series is a collaboration with <a href=\"http://https://www.calltomindnow.org/\">Call to Mind</a>, American Public Media's mental health initiative.</p>\n<p>This episode is sponsored by Rebel Girls the Podcast (rebelgirls.co/podcast), KiwiCo (kiwico.com/BRAINSON for a free trial), Relay (relaygo.com/BRAINS for 15% your Relay purchase on Amazon) and New Cloud Control Cat Litter by Arm & Hammer.</p>\n",
  "enclosure": "",
  "pubDate": "Tue, 11 Jun 2019 17:40:21 +0000",
  "itunes:duration": "00:37:12",
  "itunes:explicit": "no"
}