{
  "id": "tag:blogger.com,1999:blog-1176949257541686127.post-1350669566602288553",
  "published": "2022-10-20T13:01:00.000-04:00",
  "updated": "2022-10-20T13:01:02.521-04:00",
  "title": "Announcing GUAC, a great pairing with SLSA (and SBOM)!",
  "content": "<span class=\"byline-author\">Posted by Brandon Lum, Mihai Maruseac, Isaac Hepworth, Google Open Source Security Team </span><p>Supply chain security is at the fore of the industry’s collective consciousness. We’ve recently seen a significant <a href=\"https://www.sonatype.com/press-releases/sonatype-finds-700-average-increase-in-open-source-supply-chain-attacks\">rise in software supply chain attacks</a>, a Log4j vulnerability of catastrophic severity and breadth, and even an <a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/\">Executive Order on Cybersecurity</a>.  </p><p>It is against this background that Google is seeking contributors to a new open source project called GUAC (pronounced like the dip). GUAC, or Graph for Understanding Artifact Composition, is in the early stages yet is <strong>poised to change how the industry understands software supply chains</strong>. GUAC addresses a need created by the burgeoning efforts across the ecosystem to generate software build, security, and dependency metadata. True to Google’s mission to organize and make the world’s information universally accessible and useful, GUAC is meant to democratize the availability of this security information by making it freely accessible and useful for every organization, not just those with enterprise-scale security and IT funding.  </p><p>Thanks to community collaboration in groups such as <a href=\"https://openssf.org/\">OpenSSF</a>, <a href=\"http://slsa.dev\">SLSA</a>, <a href=\"http://spdx.dev\">SPDX</a>, <a href=\"https://cyclonedx.org/\">CycloneDX</a>, and others, organizations increasingly have ready access to: </p><ul> <li>Software Bills of Materials (SBOMs) (with <a href=\"https://github.com/opensbom-generator/spdx-sbom-generator\">SPDX-SBOM-Generator</a>, <a href=\"https://github.com/anchore/syft\">Syft</a>, <a href=\"https://github.com/kubernetes-sigs/bom\">kubernetes bom tool</a>)  </li><li>signed attestations about how software was built (e.g. <a href=\"https://slsa.dev/\">SLSA</a> with <a href=\"https://slsa.dev/blog/2022/08/slsa-github-workflows-generic-ga\">SLSA3 Github Actions Builder, Google Cloud Build</a>)  </li><li>vulnerability databases that aggregate information across ecosystems and make vulnerabilities more discoverable and actionable (e.g. <a href=\"https://osv.dev/\">OSV.dev</a>, <a href=\"https://globalsecuritydatabase.org/\">Global Security Database (GSD)</a>).   </li></ul><p>These data are useful on their own, but it’s difficult to combine and synthesize the information for a more comprehensive view. The documents are scattered across different databases and producers, are attached to different ecosystem entities, and cannot be easily aggregated to answer higher-level questions about an organization’s software assets. </p><p>To help address this issue we’ve teamed up with Kusari, Purdue University, and Citi to create GUAC, a free tool to bring together many different sources of software security metadata. We’re excited to share the project’s proof of concept, which lets you query a small dataset of software metadata including SLSA provenance, SBOMs, and <a href=\"https://securityscorecards.dev/\">OpenSSF Scorecards</a>.   </p><h1>What is GUAC</h1>  <p>Graph for Understanding Artifact Composition (GUAC) aggregates software security metadata into a high fidelity graph database—normalizing entity identities and mapping standard relationships between them. Querying this graph can drive higher-level organizational outcomes such as audit, policy, risk management, and even developer assistance. </p><p>Conceptually, GUAC occupies the “aggregation and synthesis” layer of the software supply chain transparency logical model: </p><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhmDzAO2_-eCS88hfdrax64UfGbRlaPYT23jAvuag6L7JOP5yJ81iKqnp5YULhE9ghit94LbE99ZDe89vysWGrNbpIGiJquBM_stGfocTVYSL9YMj641uVqNa7wDoVfFuSLCk40PRzyQ-Lwyspu4YUiuqiM1Y5Ed9QG37i4cw1qcTJIJetRhp63FCgU8A/s1600/GUAC%20image%201%20.png\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"802\" data-original-width=\"1044\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhmDzAO2_-eCS88hfdrax64UfGbRlaPYT23jAvuag6L7JOP5yJ81iKqnp5YULhE9ghit94LbE99ZDe89vysWGrNbpIGiJquBM_stGfocTVYSL9YMj641uVqNa7wDoVfFuSLCk40PRzyQ-Lwyspu4YUiuqiM1Y5Ed9QG37i4cw1qcTJIJetRhp63FCgU8A/s1600/GUAC%20image%201%20.png\" /></a></div><p>GUAC has four major areas of functionality: </p><ol style=\"text-align: left;\"> <li><strong>Collection</strong><br />GUAC can be configured to connect to a variety of sources of software security metadata. Some sources may be open and public (e.g., OSV); some may be first-party (e.g., an organization’s internal repositories); some may be proprietary third-party (e.g., from data vendors). <br /> </li><li><strong>Ingestion</strong><br />From its upstream data sources GUAC imports data on artifacts, projects, resources, vulnerabilities, repositories, and even developers.<br /> </li><li><strong>Collation</strong><br />Having ingested raw metadata from disparate upstream sources, GUAC assembles it into a coherent graph by normalizing entity identifiers, traversing the dependency tree, and reifying implicit entity relationships, e.g., project → developer; vulnerability → software version; artifact → source repo, and so on.<br /> </li><li><strong>Query</strong><br />Against an assembled graph one may query for metadata attached to, or related to, entities within the graph. Querying for a given artifact may return its SBOM, provenance, build chain, project scorecard, vulnerabilities, and recent lifecycle events — and those for its transitive dependencies. <div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgeBVObufbFPQFpDBXRdcLpLr9CpmZRINhr0d6iemWDlm-NZTGRymZ5wYTgAEOSS1IFKp1xlz8tibS3BQKVwQ63r08Yj-yIcbOwEec7MjgvGQPqFqVik3-VOJw5qZc0vcmPgiHKw87SLx2q6-McEW-LL5zFdCGAH3s-24qBD0Vh8C-Pi0UYDizzSxF14w/s1600/GUAC%20image%202.png\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"854\" data-original-width=\"1360\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgeBVObufbFPQFpDBXRdcLpLr9CpmZRINhr0d6iemWDlm-NZTGRymZ5wYTgAEOSS1IFKp1xlz8tibS3BQKVwQ63r08Yj-yIcbOwEec7MjgvGQPqFqVik3-VOJw5qZc0vcmPgiHKw87SLx2q6-McEW-LL5zFdCGAH3s-24qBD0Vh8C-Pi0UYDizzSxF14w/s1600/GUAC%20image%202.png\" /></a></div><p>A CISO or compliance officer in an organization wants to be able to reason about the risk of their organization. An open source organization like the Open Source Security Foundation wants to identify critical libraries to maintain and secure. Developers need richer and more trustworthy intelligence about the dependencies in their projects. </p><p>The good news is, increasingly one finds the upstream supply chain already enriched with attestations and metadata to power higher-level reasoning and insights. The bad news is that it is difficult or impossible today for software consumers, operators, and administrators to gather this data into a unified view across their software assets. </p><p>To understand something complex like the blast radius of a vulnerability, one needs to trace the relationship between a component and everything else in the portfolio—a task that could span thousands of metadata documents across hundreds of sources. In the open source ecosystem, the number of documents could reach into the millions. </p><p>GUAC aggregates and synthesizes software security metadata at scale and makes it meaningful and actionable. With GUAC in hand, we will be able to answer questions at three important stages of software supply chain security: </p><ul> <li><strong>Proactive</strong>, e.g.,  <ul>  <li>What are the most used critical components in my software supply chain ecosystem?    </li><li>Where are the weak points in my overall security posture?   </li><li>How do I prevent supply chain compromises before they happen?   </li><li>Where am I exposed to risky dependencies? </li>  </ul> </li><li><strong>Operational</strong>, e.g.,  <ul>  <li>Is there evidence that the application I’m about to deploy meets organization policy?   </li><li>Do all binaries in production trace back to a securely managed repository? </li>  </ul> </li><li><strong>Reactive</strong>, e.g.,  <ul>  <li>Which parts of my organization’s inventory is affected by new vulnerability X?   </li><li>A suspicious project lifecycle event has occurred. Where is risk introduced to my organization?   </li><li>An open source project is being deprecated. How am I affected?<p></p></li></ul></li></ul></li></ol><div class=\"separator\" style=\"clear: both;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEispPLuVOA_GxcT5Twn81VVbMksuIX_xEvksTLzCPxqPs26Yt14--Kn9ZpeAEsMpdBhgovvF_BEhPrYYnctzv2zQTFGbgRDvO0qTkapXRlVtrWIUOq21Kyr7Ffw2LAEuBfQXIjZfb9XrtYBzcigK4h-3LPr_Wk2HpxkCgC_exw7XOX_vFKqYR8yYPNCyg/s1600/GUAC%203.png\" style=\"display: block; padding: 1em 0px; text-align: center;\"><img alt=\"\" border=\"0\" data-original-height=\"616\" data-original-width=\"1262\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEispPLuVOA_GxcT5Twn81VVbMksuIX_xEvksTLzCPxqPs26Yt14--Kn9ZpeAEsMpdBhgovvF_BEhPrYYnctzv2zQTFGbgRDvO0qTkapXRlVtrWIUOq21Kyr7Ffw2LAEuBfQXIjZfb9XrtYBzcigK4h-3LPr_Wk2HpxkCgC_exw7XOX_vFKqYR8yYPNCyg/s1600/GUAC%203.png\" /></a></div><p></p><blockquote style=\"border: none; margin: 0 0 0 40px; padding: 0px;\"><h1 style=\"text-align: left;\">Get Involved</h1></blockquote><blockquote style=\"border: none; margin: 0 0 0 40px; padding: 0px;\"><p style=\"text-align: left;\"><a href=\"https://github.com/guacsec/guac\">GUAC is an Open Source project on Github</a>, and we are excited to get more folks involved and contributing (read the <a href=\"https://github.com/guacsec/guac/blob/main/CONTRIBUTING.md\">contributor guide</a> to get started)! The project is still in its early stages, with a <a href=\"https://github.com/guacsec/guac/blob/main/SETUP.md\">proof of concept</a> that can ingest SLSA, SBOM, and Scorecard documents and support simple queries and exploration of software metadata. The next efforts will focus on scaling the current capabilities and adding new document types for ingestion. We welcome help and contributions of code or documentation.  </p></blockquote><blockquote style=\"border: none; margin: 0 0 0 40px; padding: 0px;\"><p style=\"text-align: left;\">Since the project will be consuming documents from many different sources and formats, we have put together a group of “Technical Advisory Members'' to help advise the project. These members include representation from companies and groups such as SPDX, CycloneDX Anchore, Aquasec, IBM, Intel, and <a href=\"https://github.com/guacsec/guac/blob/main/TECHNICAL_ADVISORY_MEMBERS\">many more</a>. If you’re interested in participating as a contributor or advisor representing end users’ needs—or the sources of metadata GUAC consumes—you can register your interest in the relevant <a href=\"https://github.com/guacsec/guac/issues/1\">GitHub issue</a>. </p></blockquote><blockquote style=\"border: none; margin: 0 0 0 40px; padding: 0px;\"><p style=\"text-align: left;\">The GUAC team will be showcasing the project at Kubecon NA 2022 next week. Come by our <a href=\"https://sched.co/182Jr\">session</a> if you’ll be there and have a chat with us—we’d be happy to talk in person or virtually!</p></blockquote>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google",
    "uri": "http://www.blogger.com/profile/11822708545141062574",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}