{
  "title": "Wandering through Sforza castle",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/25/wandering-through-sforza-castle/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/25/wandering-through-sforza-castle/#comments",
  "dc:creator": "Lizzie",
  "pubDate": "Tue, 25 Oct 2022 18:05:37 +0000",
  "category": [
    "Miscellaneous Science",
    "Sociology",
    "Teaching"
  ],
  "guid": "https://statmodeling.stat.columbia.edu/?p=48133",
  "description": "Weekend before last I spent a day in Milan to see an old colleague (I am on leave in Zurich just now so miraculous things like a dayhop to Milan are feasible). He used to be a research technician in &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/25/wandering-through-sforza-castle/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p><a href=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/10/sm-1.jpg\"><img loading=\"lazy\" class=\"alignnone  wp-image-48134\" src=\"https://statmodeling.stat.columbia.edu/wp-content/uploads/2022/10/sm-1-1024x768.jpg\" alt=\"\" width=\"474\" height=\"345\" /></a></p>\n<p>Weekend before last I spent a day in Milan to see an old colleague (I am on leave in Zurich just now so miraculous things like a dayhop to Milan are feasible). He used to be a research technician in my lab where he did the classical ecology lab tasks of things like identifying and tagging trees in forests, making thousands of observations of leaf unfolding in a growth chamber experiment (on paper! Though that part was neither my idea nor his) and nudged the lab forward through working on automating photo capture of leaf unfolding. The resulting images and time lapse videos were gorgeous, but they didn&#8217;t change how I did science.</p>\n<p>But since then my Bayesian models have become far more generative&#8212;many thanks to my Stan collaborators&#8211;and I have started to realize some sad hard truths about my data and my science. The first is that you need a lot more data than I often have to fit some of the models I think underlie the processes I am studying. I work on winegrapes because they have way more data than other systems I am interested in (such as forests, which critically store carbon) and when I don&#8217;t have enough data to fit a temperature response curve for winegrapes I can skip trying it on more `natural systems.&#8217; The second is that we also need way better data. A stats-department colleague said to me this year, &#8216;it&#8217;s not like you don&#8217;t have a lot of data, it&#8217;s like the data you have are quarters [and you need higher denominations].&#8217; By later in the day when he next picked up the metaphor, but was now calling my data pennies. (Sigh.)</p>\n<p>He&#8217;s not wrong. Ecology has a history of valuing what you can learn staring intently at a backyards pond or an artificial pool near Palermo full of water bugs. We need to understand the &#8216;natural history&#8217; well to understand systems. Very true, but I sometimes wonder how we advance. A massive NSF project to collect lots of large-scale, <a href=\"https://www.neonscience.org/\" target=\"_blank\" rel=\"noopener\">NEON</a>, has not revolutionized much. For my own research, I think we need to cover greater temperature variation &#8212; and work harder to know what happens at the extremes (you have to wait a long time for plants to do something at 5C, but maybe we need to wait for that; at the other end many warming chambers don&#8217;t function about 30 C well, but that&#8217;s well below what&#8217;s too hot for most plants), we need more replicates and we need to collect better data, at finer scales.</p>\n<p>Which is part of why I went to Milan. To pick my colleague&#8217;s brain about how my lab can best break out. He&#8217;s now building up new FabLab for his company&#8217;s new North American headquarters in Chicago, and had some useful ideas.</p>\n<p>At the end of our meeting he asked if he should go to grad school, which struck me. It struck me for a lot of reasons, one is that some undergrads in my lab, who I think could bridge new technologies to ecology, are getting scooped up by start-ups digitizing agriculture, and putting their undergrad degrees on a possibly never-ending pause.</p>\n<p>The same weekend I saw a colleague from my long-lost <a href=\"https://en.wikipedia.org/wiki/National_Center_for_Ecological_Analysis_and_Synthesis\" target=\"_blank\" rel=\"noopener\">NCEAS</a> days. In between nerd-crushing/raving about our colleague Jim Regetz, we discussed the apparent disconnect between the number of PhDs being awarded (erm, not sure about that verb) and the number of job openings where a PhD is critical. Some of his former postdocs were starting a new company, trying to make theoretical ecological models more useful to the point of underpinning a for-profit company.</p>\n<p>I imagine academia often feels to be falling behind, but this weekend I felt it a little more acutely. We&#8217;re supposed to have the freedom and metaphorical space to be racing ahead. But it doesn&#8217;t feel that way when I can easily see why students in my lab would &#8216;pause&#8217; undergrad to race around North America to improve how we harvest wheat, when we churn out publications faster and faster at the expense of the time it takes to really advance science (it&#8217;s so much quicker to grab a p-value than to develop a model with parameters you care about, then step back and gape at that the uncertainty around the estimates; p-values are so happy to hide your meaningful parameters and their uncertainty from you), or similarly churn out PhDs without a clear idea of their job prospects (hello Canada&#8217;s `HQP&#8217;). I am not so worried about folks in my lab, we train strongly in computational methods and how to design and answer useful questions&#8212;skills industry and beyond needs, but I worry about the future, and I could certainly train in this area better if there was more pressure, recognition, and support for it in ecology.</p>\n<p>On the good news side, I enjoyed my take-out pizza from Milan for two glorious dinners!</p>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/25/wandering-through-sforza-castle/feed/",
  "slash:comments": 3
}