{
  "guid": "urn:uuid:91b69762-abad-4368-8dab-3fcceb9a775f",
  "link": "https://www.who.int/news/item/01-04-2022-who-qatar-fifa-leaders-agree-actions-to-promote-health-at-fifa-world-cup-qatar-2022",
  "a10:author": {
    "a10:name": ""
  },
  "title": "WHO, Qatar, FIFA leaders agree actions to promote health at FIFA World Cup Qatar 2022™",
  "description": "<p>As part of a unique global partnership to promote health, the senior leadership of the World Health Organization (WHO), the State of Qatar and FIFA today agreed a range of measures that will be implemented at this year&rsquo;s <a href=\"https://www.who.int/initiatives/sports-and-health/healthy-2022-world-cup\">FIFA World Cup Qatar 2022&trade;</a> to protect and encourage health; and take lessons learned from the first tournament in the\n    Middle East and Arab world to share with future mega sporting events.<br /></p><p>The heads of WHO, Qatar Ministry of Public Health, FIFA and the Supreme Committee for Delivery &amp; Legacy (SC) met together for the first Steering Committee meeting of the &ldquo;Healthy FIFA World Cup Qatar 2022&trade; &ndash; Creating Legacy for Sport&nbsp;and\n    Health&rdquo;&nbsp;partnership. Launched in late 2021, the partnership is committed to:<br /></p><ul><li>protecting the health of all those involved in the FIFA World Cup Qatar 2022&trade;:<sup> <br /></sup>FIFA, WHO and Qatar have teamed up to ensure the FIFA World Cup Qatar 2022&trade; is a healthy and safe event from the implementation of precautions\n        to prevent the spread of COVID-19 to the provision of healthy menu options;</li><li>using the FIFA World Cup Qatar 2022&trade; as a platform to promote healthy lifestyles:<br />The tournament will inspire millions around the world to play more football and be more active including a global campaign to raise awareness of the\n        health benefits of physical activity. The State of Qatar have also signed a 3-year partnership with WHO to improve healthcare access and promote healthy lifestyles across the country; and<br /></li><li>creating a blueprint to protect and promote health at future mass gatherings: <br />The FIFA World Cup Qatar 2022&trade;<sup></sup>represents a unique opportunity to develop a new approach to organizing mega sports events factoring-in lessons learnt from\n        the pandemic and reinforcing sports and health as a pathway for recovery.</li></ul><p>\"The State of Qatar is proud to be the first country from the Middle East to host the FIFA World Cup,&rdquo; said HE Dr Hanan Mohamed Al Kuwari, Qatar&rsquo;s Minister of Public Health and Chair of the Steering Committee Meeting. &ldquo;Our overall goal\n    is not just to hold a successful sporting event, but to also show how football and sports in general can be drivers of better health for all people. This is why we are working so closely with WHO, FIFA and the Supreme Committee for Delivery &amp;\n    Legacy.&rdquo;</p><p><span style=\"background-color:transparent;text-align:inherit;text-transform:inherit;white-space:inherit;word-spacing:normal;caret-color:auto;\">At today&rsquo;s meetings, the Steering Committee leaders agreed a range of action areas to be taken for the FIFA World Cup Qatar 2022&trade; and future events, including:</span></p><ul><li>build on actions taken at the FIFA Arab Cup&trade; in late 2021, strengthen health emergency preparedness and ensure maintenance of precautionary measures for containing infectious diseases, including COVID-19, to keep people safe and healthy;</li><li>provide healthy food options inside stadiums and fan zones; </li><li>enhance tobacco prevention in stadiums, fan zones and other areas;</li><li>start collaborative agreements with countries to benchmark legacy building activities; and<br /></li><li>exchange lessons learned with the International Olympic Committee for Paris 2024 and Milano Cortina 2026.</li></ul><p>&ldquo;WHO is committed to working with the State of Qatar and FIFA to leverage the global power of football to help people lead the healthiest lives possible,&rdquo; said Dr Tedros Adhanom Ghebreyesus, WHO Director-General. &ldquo;This partnership will\n    help to make the FIFA World Cup Qatar 2022 a role model for healthy sporting events.&rdquo; <br /></p><p>The first-of-its-kind agreement was also lauded by FIFA President Gianni Infantino, who said, &ldquo;It&rsquo;s important that the first FIFA World Cup in the Middle East will be the healthiest World Cup ever. Here, we put our efforts together through\n    this innovative partnership to promote health in a different way, using the power of football to communicate certain messages. We have been working together on different awareness campaigns and what better platform now than the FIFA World Cup for\n    passing the Health for All message?\"<br /></p><p>&ldquo;You have to do whatever you can to protect your health and that of those around you. That is part of education and that is why we are proud to be part of this team here. We need health for football, and we need football for health. Let&rsquo;s\n    win this World Cup, our World Cup, which is a World Cup of humanity in the end,&rdquo; Mr Infantino added.<br /></p><p>As part of the agreement, two SC legacy programmes &ndash; Generation Amazing and B4Development (B4D) &ndash; will provide operational and technical collaboration on a range of projects. Generation Amazing is a football for development programme that\n    has positively impacted more than 725 000 people globally since being launched during Qatar&rsquo;s bid to host the FIFA World Cup&trade;, while B4D is the region&rsquo;s first &ldquo;nudge unit&rdquo; that utilizes behavioural science to solve a\n    range of societal issues. <br /></p><p>H.E. Hassan Al Thawadi, SC Secretary General, said, &ldquo;As FIFA World Cup hosts, Qatar has worked to underscore the importance of leaving sustainable and transformative social legacies that improve lives &ndash; in Qatar, within our region and around\n    the world.&rdquo; <br /></p><p>&ldquo;This partnership is critical for us as we prepare for hosting the world at the end of this year in the context of the pandemic, which has affected so many lives around the world.&nbsp; We&rsquo;re engaging in every effort along with local and international\n    partners to ensure a healthy and safe FIFA World Cup.&rdquo;<br /></p><p>&ldquo;Together, our work with FIFA and WHO will add to our current efforts, including&nbsp;projects delivered by our legacy programmes such as Generation Amazing and B4Development, to ensure the first FIFA World Cup in our region serves as a benchmark\n    for future mega-events across the globe,&rdquo; he added. <br /></p><p>Dr Ahmed Al-Mandhari, WHO Regional Director for the Eastern Mediterranean, reinforced the Organization&rsquo;s commitment to advancing health for all in the Region, and said that the partnership between WHO and Qatar would support improvements in physical\n    activity, mental health and organized sports. <br /></p><p>&ldquo;WHO looks forward to working closely with Qatar in the months ahead to use the platform that sporting events offer to bring people together and foster solidarity, which is the core of our regional vision of 'Health for all by all: a call for solidarity\n    and action', while at the same time promoting healthier habits, from diet to physical activity, for people of all ages, genders and cultures.&rdquo;</p>",
  "pubDate": "Fri, 01 Apr 2022 15:05:56 Z"
}