{
  "id": "https://bibleinoneyear.org/en/youth/34",
  "title": "Day 34: Three Types of Victory in Your Life",
  "description": "Psalm 18:17,19, Job 31:6, Matthew 22:34–46.  But there are also *times of victory*  In the passages for today we see three different types of victory",
  "pubDate": "Thu, 03 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/34/",
  "itunes:duration": "13:34",
  "guid": "enyouth03022022-34",
  "length": 814.32,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 34: Three Types of Victory in Your Life",
  "itunes:subtitle": "Psalm 18:17,19, Job 31:6, Matthew 22:34–46.  But there are also *times of victory*  In the passages for today we see three different types of victory",
  "itunes:summary": "José Henriquez was one of the thirty-three miners trapped 2,300 feet underground when a section of the San José copper mine in Northern Chile collapsed. It was 5 August 2010. For seventeen days all rescue attempts failed. There was no sign of life in the copper mine. The trapped miners had enough food for three days and a little drinking water. They faced the prospect of an agonising death through starvation.\nI interviewed José Henriquez and his wife Bianca at HTB. He told how they had prayed to God for a miracle. He described the moment, on 22 August, when a drill broke through into the tunnel where the men were trapped. They hammered the drill with iron rods. They sprayed paint on it. They sent up many messages on it. Only one stayed on the drill as it went back up to the surface. The message read, ‘We’re fine. The 33 in the shelter.’\nIn total, the men survived a record sixty-nine days underground before they were brought to the surface. More than a billion people watched the rescue live on television. There were extraordinary scenes as everyone celebrated a wonderful victory.\nThe life of faith is full of challenges, difficulties and trials. But there are also times of victory. In the passages for today we see three different types of victory.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 399
}