{
  "title": "Will a Baby Born Today Grow up to Live Like the Jetsons?",
  "link": "https://spectrum.ieee.org/the-jetsons",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-blue-and-yellow-lunch-box-decorated-with-cartoon-characters-from-the-future.jpg?id=30262353&width=1245&height=700&coordinates=0%2C195%2C0%2C195\"/><br/><br/><p><a href=\"https://en.wikipedia.org/wiki/The_Jetsons\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>“The Jetsons”</strong></a><strong> premiered</strong> on ABC on 23 September 1962. Set 100 years in the future, the animated comedy series followed the Jetson family—George and Jane and their kids, Judy and Elroy—as they went about their futurist yet surprisingly relatable lives in Orbit City, in a tech-laden house on adjustable columns, commuting by flying car and gliding along moving sidewalks, even in their own home. Although the series ran for just one season, the Jetsons and their wacky space-age world have remained pop-culture touchstones ever since, thanks to near-continuous syndication, two later seasons in the 1980s, and several TV specials and movies. </p><p>And, of course, merchandise. A year after the premiere of “The Jetsons,” Aladdin Industries manufactured the steel lunch box pictured above. Plain, dome-style lunch boxes had long been used by factory workers, but this one, adorned with the Jetson family, Astro the dog, and Rosey the robot maid, was intended for the grade-school set.</p><hr/><p>Food technology is a recurring theme on the show. In Episode 1, the <a href=\"https://thejetsons.fandom.com/wiki/Foodarackacycle\" target=\"_blank\">Foodarackacycle</a>, a push-button meal dispenser, badly malfunctions, leading to the hiring of Rosey, the robot maid with a Brooklyn accent and a heart of gold. In a later episode, Jane Jetson uses the (rotary) Dial-a-Meal to order up a complete breakfast, including burnt toast, in pill form—yet coffee remains a liquid served in a cup. And in the opening credits, Elroy zooms off to school in a space pod but toting a solidly 20th-century lunch box.  </p><p>If the Jetsons’ food tech was a push button too far, many of the other gadgets that they used are commonplace today: video calls, e-readers and tablets, smart watches. I am still waiting for my jet pack and flying car. For a deep dive into the culture and technology of “The Jetsons,” check out Matt Novak’s <a href=\"https://paleofuture.com/\" target=\"_blank\">Paleofuture</a> blog. Back in 2012, for the show’s <a href=\"https://paleofuture.com/blog/2012/9/19/50-years-of-the-jetsons-why-the-show-still-matters\" target=\"_blank\">50th anniversary</a>, he dissected all 24 episodes of the original series. Not all of the episode breakdowns are still available, but <a href=\"https://paleofuture.com/blog/2012/9/24/recapping-the-jetsons-episode-01-rosey-the-robot\" target=\"_blank\">his discourse on Episode 1</a> is worth a read.  </p><p>“The Jetsons” was the first program broadcast in color on ABC. Unfortunately, only viewers in a few select markets—Chicago, Detroit, Los Angeles, New York, and San Francisco—could actually see the show in color. Elsewhere, it aired in black and white. The network had been slow to jump on the color-TV bandwagon, not quite convinced the technology was here to stay. After all, RCA had just started turning a profit on color televisions the previous year, and only 3 percent of Americans owned color televisions at the time.</p><p class=\"pull-quote\">The series ran for just one season, and yet the Jetsons and their wacky space-age world have remained pop-culture touchstones ever since.</p><p>As a cultural historian who trained as an electrical engineer, I’m impressed by how pervasively “The Jetsons” has seeped into society. While researching this piece, I came across an academic article that used the show in a mock court case, another one that invoked George Jetson and the tragedy of the commons to analyze the problem of waste management, and countless news articles that name-checked the Jetsons in their headlines to draw attention to new inventions. In 2007 <em>Forbes </em>did a <a href=\"https://www.forbes.com/2007/12/10/largest-fictional-companies-oped-books-fict1507-cx_mn_de_1211company_slide.html\" target=\"_blank\">ranking of the top 25 fictional companies</a>; Spacely Space Sprockets, where George Jetson worked, came in dead last, with estimated annual sales of US $1.3 billion. The lunch box pictured at top is in the collection of the <a href=\"https://americanhistory.si.edu/collections/search/object/nmah_1250108\" target=\"_blank\">Smithsonian’s National Museum of American History</a>. </p><p>“The Jetsons” clearly has staying power. I peg much of its enduring popularity to the fact that it was in almost nonstop syndication for decades as part of the Saturday morning cartoon lineup. That’s where I first saw the show, over and over again, until a second season of 41 episodes was added in 1985. Ten more episodes came out in 1987, followed by a smattering of movies, TV specials, and direct-to-video or -DVD releases. So many kids grew up watching “The Jetsons” from the 1960s through the 1980s that the show has become a handy shortcut for talking about futuristic technology. </p><p>And in the Jetsons’ world, that futuristic technology might occasionally backfire, but it is never menacing or threatening. Automation has finally delivered on its labor-saving promise, and George works just 3 hours a day, 3 days a week. Everyone is living their best lives. What’s not to love?</p><h2>Happy Birthday, George Jetson!</h2><p>And now for the impetus for this month’s column: According to devoted “Jetsons” fans and Internet sleuths, George Jetson was born right about now—as in July or August 2022. It’s a little difficult to pinpoint the exact birth date of a fictional cartoon character of the future who was introduced almost 60 years ago yet won’t reach adulthood for a couple more decades. But here is what we know.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"The cardboard cover of a board game called \\u201cThe Jetsons Game\\u201d shows a cartoon family of four plus two pets in a spacecraft.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"ac4eb6afaf5217404d4697d9d836510b\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"2e56d\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/the-cardboard-cover-of-a-board-game-called-u201cthe-jetsons-game-u201d-shows-a-cartoon-family-of-four-plus-two-pets-in-a-spacec.jpg?id=30262441&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">This board game came out in 1985, with the second season of “The Jetsons” and more than two decades after the original show aired.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">The Strong, Rochester, N.Y.</small></p><p>Speculations about George’s birthday saw an uptick last November, with various <a href=\"https://knowyourmeme.com/memes/george-jetson-is-almost-here\" target=\"_blank\">wikis and memes</a> suggesting that it falls on either 31 July or 27 August 2022. Although George never celebrates his birthday in any episode, fans combed the Hanna-Barbera canon to arrive at the date, even if it meant doing some mathematical gymnastics to get there.<br/></p><p class=\"pull-quote\">So many kids grew up watching “The Jetsons” that the show has become a handy shortcut for talking about futuristic technology. </p><p>According to various Internet sources, the original promotional materials for “The Jetsons” described its setting as exactly 100 years in the future—September 2062, in other words. From the opening credits, we learn that George is a happily married, middle-aged father of two. His son, Elroy, is in elementary school, while his daughter, Judy, attends Orbit High. </p><p>George’s age is revealed in the episode “Test Pilot,” in which George’s boss sends him to the doctor for an annual checkup. (George needs this physical for insurance coverage; even in the second half of the 21st century, people don’t have universal health care.) Due to a mix-up at the lab, George thinks his death is imminent, so he agrees to engage in high-risk behavior—namely, testing the survivability of the Spacely Lifejacket, a supposedly indestructible garment. George’s doctor eventually reveals the mix-up and tells George that he will live to 150. George, wearing the lifejacket and about to be fired upon by missiles, screams, “I got 110 good years ahead of me!” Do the math: He must be 40 years old. So happy birthday, Mr. Jetson.  </p><p>That also means the high-tech world inhabited by the Jetsons is just 40 years away. Will food replicators cook our meals by then? Maybe. Will our flying cars fold up into briefcases? Maybe not. </p><p><em>Part of a </em><a href=\"https://spectrum.ieee.org/search/?q=past+forward\" target=\"_self\"><em>continuing series</em></a><em> </em><em>looking at photographs of historical artifacts that embrace the boundless potential of technology.</em> </p><p><em>An abridged version of this article appears in the August 2022 print issue as “Lunch Box of the Future.”</em></p>",
  "pubDate": "Fri, 29 Jul 2022 15:00:00 +0000",
  "guid": "https://spectrum.ieee.org/the-jetsons",
  "category": [
    "Past forward",
    "Pop culture",
    "Space age",
    "The jetsons",
    "Tv shows",
    "Type:departments"
  ],
  "dc:creator": "Allison Marsh",
  "media:content": ""
}