{
  "title": "S16 Ep32: Darkness Radio presents Holzer's Ghosts - The Hungry Ghosts of The Queen Mary",
  "link": "https://audioboom.com/posts/8098379",
  "itunes:episode": 32,
  "itunes:title": "Darkness Radio presents Holzer's Ghosts - The Hungry Ghosts of The Queen Mary",
  "itunes:season": 16,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5663,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<p>Darkness Radio presents Holzer's Ghosts - The Hungry Ghosts of The Queen Mary with guests Cindy Kaza, Shane Pittman and Erika Frost</p>\n\n<p>Tonight, host Dave Schrader shares never before heard, frightening EVP from their investigation and guests Cindy Kaza, Shane Pittman and Erika Frost discuss aspects of the case that did not make it on screen and dive deep into the history and haunting of The Grey Ghost, The Queen Mary!</p>\n\n<p>Legendary Ghost Hunter Hans Holzer was the first to investigation the notoriously haunted Queen Mary in Long Beach, California. When he and trance medium Sybil Leek boarded in 1976, they encountered an unsettling darkness aboard. </p>\n\n<p>Over the decades since that first pivotal investigation, thousands have visited the ship in search of the world-famous spirits aboard, and that entity that Hans and Sybil found seems to have sunk into the shadows. </p>\n\n<p>However, with the ship shut down and closed for over six months, the skeleton crew of workers has had terrifyingly aggressive encounters that bear a disturbing similarity to that which Sybil and Hans found long before this was a known paranormal mecca. </p>\n\n<p>Now, nearly half a century after Holzer's first visit, his hidden case file is finally reopened as paranormal investigator Dave Schrader, psychic medium Cindy Kaza, equipment expert Shane Pittman along with new insights from researcher Gabe Roth and Holzer's own daughter, Alexandra embark on an investigation unlike any other conducted aboard The Queen Mary, as the only living souls aboard the completely empty ship. However, as they submerse themselves in the rampant paranormal activity, they find that the well-known haunting has a dark undercurrent that just may pull them under.</p>\n\n<p>Visit The Queen Mary here: <a href=\"http://www.queenmary.com/\">www.QueenMary.com</a></p>\n\n<p>Visit Erika Frost here: <a href=\"http://www.erikafrost.com/\">www.erikafrost.com</a></p>\n\n<p>Visit Cindy Kaza here: <a href=\"http://www.mediumcindykaza.com/\">www.MediumCindyKaza.com</a></p>\n\n<p>Visit Shane Pittman here: <a href=\"http://www.officialshanepittman.com/\">www.OfficialShanePittman.com</a></p>\n\n<p>Listen the the best in Paranormal Talk Radio, Darkness Radio here:<a href=\"http://www.stitcher.com/show/darkness-radio\">www.stitcher.com/show/darkness-radio</a> </p>\n",
  "itunes:summary": "Darkness Radio presents Holzer's Ghosts - The Hungry Ghosts of The Queen Mary with guests Cindy Kaza, Shane Pittman and Erika Frost\n\nTonight, host Dave Schrader shares never before heard, frightening EVP from their investigation and guests Cindy Kaza, Shane Pittman and Erika Frost discuss aspects of the case that did not make it on screen and dive deep into the history and haunting of The Grey Ghost, The Queen Mary!\n\nLegendary Ghost Hunter Hans Holzer was the first to investigation the notoriously haunted Queen Mary in Long Beach, California. When he and trance medium Sybil Leek boarded in 1976, they encountered an unsettling darkness aboard. \n\nOver the decades since that first pivotal investigation, thousands have visited the ship in search of the world-famous spirits aboard, and that entity that Hans and Sybil found seems to have sunk into the shadows. \n\nHowever, with the ship shut down and closed for over six months, the skeleton crew of workers has had terrifyingly aggressive en...",
  "pubDate": "Fri, 19 Mar 2021 08:00:00 +0000",
  "guid": "28950eb3-07ec-4c86-957b-acf0005390b5",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}