{
  "title": "How we’re making it easier to share files with nearby devices",
  "link": "https://blog.google/products/android/better-together-nearby-share/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"frly2\">We built Nearby Share to make it easier to send your content across your devices that are nearby, whether it’s a photo, link, document or even a <a href=\"https://blog.google/products/chromebooks/better-with-other-devices\">Wi-Fi password</a>. There are so many ways Nearby Share can help you throughout your day — and some you might not even know about.</p><p data-block-key=\"7itd8\">To learn more about the technology and how it works, I sat down with Alice Zheng, the product lead for Nearby Share, to have her walk me through some of my most common scenarios.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--4 h-c-grid__col--6 h-c-grid__col-l--offset-4 h-c-grid__col--offset-3\"><a class=\"article-image--link\"><img alt=\"Phone on left showing contacts to send a photo to with Nearby Share next to a tablet on the right with the image being received\" class=\"article-image--medium\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/1._Nearby_Share_4ThnaH5.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/1._Nearby_Share_4ThnaH5.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/1._Nearby_Share_4ThnaH5.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"frly2\"><b>Can I share files between my own devices?</b></p><p data-block-key=\"f4q57\">Yes! In fact, this is one of the most common ways people use Nearby Share. Not only can you share files between your own devices, the process is getting even easier.</p><p data-block-key=\"8p22p\">In the coming weeks, we’re <a href=\"https://blog.google/products/android/new-android-features-September-2022/\">introducing</a> a new update that makes it faster to share files on your own Android devices with Nearby Share. This means that devices logged into your Google account will automatically accept your transfers. This feature will be rolling out over the next few weeks and will be available on devices running Android 6 and above.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--4 h-c-grid__col--6 h-c-grid__col-l--offset-4 h-c-grid__col--offset-3\"><a class=\"article-image--link\"><img alt=\"A phone animation showing option to send an image to contacts, cursor selects sharing with your own tablet. Screen changes to the tablet automatically accepting the image.\" class=\"article-image--medium\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/2._Nearby_Share_self_share.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"frly2\"><b>Does Nearby Share only work on my phone?</b></p><p data-block-key=\"2aroe\">Nope! You can use Nearby Share across Android phones and tablets, as well as Chrome OS devices. We are also hard at work bringing Nearby Share to the devices that you most frequently use and would want to share files with, and that includes <a href=\"https://www.blog.google/products/android/ces2022-bettertogether/\">support for more platforms, like Windows PCs</a>, over time.</p><p data-block-key=\"dc8iq\"><b>If my phone doesn’t have Internet service, can I still get the funny photo my friend took of me on our hike?</b></p><p data-block-key=\"vpu3\">Absolutely! Nearby Share works even when you don’t have Internet service. We use a variety of connection technologies, including Bluetooth, WiFi, NFC, UWB and WebRTC, to automatically find an efficient way for your friend to send you the photo, even if you’re not online.</p><p data-block-key=\"188al\"><b>Can anyone send me files?</b></p><p data-block-key=\"6in2u\">There are various ways to share and receive files and it is all up to what you want. With Nearby Share, we offer a set of device visibility settings so you have control over your privacy and how you appear to others. Your device can be visible to Everyone, a subset of your Contacts or just your own devices.</p><p data-block-key=\"em61d\">For Everyone, you can choose to have this mode on temporarily or all the time. This means if you just met someone and they aren’t saved to your contacts, but you want to get a photo from them, you can turn this on to have them send you a file. Then, your setting will automatically switch back to your last used setting. If you have your setting set to Everyone all the time, we will also send you a reminder in case you want to change it.</p><p data-block-key=\"df20u\">Under Contacts, you have the option to have your device visible to all your saved contacts, or you can select only a subset of contacts to be visible to. And the last option, Your devices, allows you to only be visible to other devices that are logged into your Google account.</p><p data-block-key=\"3j2b4\"><b>Can I send files to anyone?</b></p><p data-block-key=\"5bmvf\">Just like how we protect your privacy by giving you control on who can discover you, you will also be able to share files with devices that are made visible to you.</p><p data-block-key=\"9ka1r\">To protect your privacy, your Google account profile image will only be visible to people in your contact list. Others will see a generic device icon next to the device name you choose for yourself. This way, you won’t need to worry about disclosing your account information like when sharing directions with a stranger.</p><p data-block-key=\"6n281\"><b>But wait - I'm afraid strangers are going to send me inappropriate stuff if I leave my device visible to everyone. How can I stay protected?</b></p><p data-block-key=\"4lcid\">As I mentioned, you can control your visibility settings with the options available in Nearby Share; we also offer other features to protect your privacy. With Nearby Share, we will first show you who is trying to send you a file and what the file name is, and only after you accept the transfer will we show you the actual photo or video. This way if you’re somewhere public and you receive a share request, you’ll never have to see a preview of something you don’t want to unless you first accept. And if you’ve made yourself visible to Everyone, with one quick tap you can turn this off and stop receiving sharing requests from people you don’t trust.</p></div></div></body></html>",
  "pubDate": "Thu, 08 Sep 2022 16:00:00 +0000",
  "guid": "https://blog.google/products/android/better-together-nearby-share/",
  "category": [
    "Chromebooks",
    "Android"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "How we’re making it easier to share files with nearby devices",
    "description": "There are so many ways Nearby Share can help you throughout your day – and some you might not even know about.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/0._Blog_header_q5SYcPz.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/android/better-together-nearby-share/"
  },
  "author": {
    "name": "Ivy Hunt",
    "title": "Keyword Contributor",
    "department": "",
    "company": ""
  }
}