{
  "id": "yt:video:jLTsQt5wibQ",
  "yt:videoId": "jLTsQt5wibQ",
  "yt:channelId": "UCkLHy_jxeaHTZCfGalg6QaA",
  "title": "A Deep Dive Into Periodic Lockout/Tagout Inspections",
  "link": "",
  "author": {
    "name": "Conn Maciel Carey LLP",
    "uri": "https://www.youtube.com/channel/UCkLHy_jxeaHTZCfGalg6QaA"
  },
  "published": "2022-08-19T14:14:53+00:00",
  "updated": "2022-10-29T20:07:12+00:00",
  "media:group": {
    "media:title": "A Deep Dive Into Periodic Lockout/Tagout Inspections",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Year in and year out, OSHA’s Lockout/Tagout (Energy Control) standard is one of the most frequently cited standards. With the National Emphasis Program on Amputations continuing in 2022, employers are subject to inspections focusing on their LOTO programs and practices even if there are no serious injuries or complaints made about them. With increased scrutiny comes a greater risk of citations—particularly repeat violations—which can lead to employers being placed in OSHA’s Severe Violator Enforcement Program. Despite being such an important standard, OSHA’s LOTO rule continues to be one of the least understood. This webinar will take a deep dive into arguably one of the most confusing (not to mention, one of the most frequently cited) aspects of the LOTO rule – periodic inspections.\n\nParticipants in this webinar will learn about:\n\n• OSHA’s enforcement of LOTO violations, including those around periodic inspections\n• What the LOTO standard requires with respect to periodic inspections and how to conduct them in a manner that complies with the standard\n• Common mistakes employers make regarding periodic LOTO inspections\n• Compliance tips and best practices to help protect against Lockout/Tagout periodic inspection violations\n\nA webinar from Conn Maciel Carey LLP.\n\nUse of this video does not in any manner constitute or establish an attorney-client relationship between Conn Maciel Carey and the viewer. This video may be deemed \"attorney advertising\" in jurisdictions from which it is accessed. The decision to hire a lawyer is a serious one and should be undertaken after consideration of all relevant information, not only information on this video.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}