{
  "title": "458 - A National PrEP Program to End the Nation’s HIV Epidemic",
  "itunes:title": "458 - A National PrEP Program to End the Nation’s HIV Epidemic",
  "pubDate": "Wed, 20 Apr 2022 10:00:00 +0000",
  "guid": "a8c218ec-549c-40b6-90ed-06625c691602",
  "link": "https://johnshopkinssph.libsyn.com/458-a-national-prep-program-to-end-the-nations-hiv-epidemic",
  "itunes:image": "",
  "description": "<p><span style=\"font-weight: 400;\">The Biden administration recently approved nearly $10 billion to broaden access to PrEP, a medication that is 99% effective at preventing HIV and key to ending the nation’s HIV epidemic.</span> <strong>Amy Killelea</strong><span style=\"font-weight: 400;\">, a policy expert on HIV and public health financing, talks with</span> <strong>Stephanie Desmon</strong> <span style= \"font-weight: 400;\">about why health policies have meant this game-changing drug hasn’t yet delivered on its potential, how experts hope Biden’s budget will build a better nationwide PrEP distribution system, and how much is at stake at this particular turning point in the epidemic.</span></p>",
  "content:encoded": "<p>The Biden administration recently approved nearly $10 billion to broaden access to PrEP, a medication that is 99% effective at preventing HIV and key to ending the nation’s HIV epidemic. Amy Killelea, a policy expert on HIV and public health financing, talks with Stephanie Desmon about why health policies have meant this game-changing drug hasn’t yet delivered on its potential, how experts hope Biden’s budget will build a better nationwide PrEP distribution system, and how much is at stake at this particular turning point in the epidemic.</p>",
  "enclosure": "",
  "itunes:duration": "16:56",
  "itunes:explicit": false,
  "itunes:keywords": "HIV,aids,Pandemic,epidemic,prep,Biden,covid",
  "itunes:subtitle": "The Biden administration recently approved nearly $10 billion to broaden access to PrEP, a medication that is 99% effective at preventing HIV and key to ending the nation’s HIV epidemic. Amy Killelea, a policy expert on HIV and public health...",
  "itunes:season": 5,
  "itunes:episode": 458,
  "itunes:episodeType": "full",
  "itunes:author": "The Johns Hopkins Bloomberg School of Public Health"
}