{
  "title": "DataRobot AI Cloud Achieves Google Cloud Ready &#8211; BigQuery Designation",
  "link": "https://www.datarobot.com/newsroom/press/datarobot-ai-cloud-achieves-google-cloud-ready-bigquery-designation/",
  "dc:creator": "Stephanie Rogers",
  "pubDate": "Tue, 11 Oct 2022 16:00:00 +0000",
  "category": "Press Releases",
  "guid": "https://www.datarobot.com/?p=40778",
  "description": "<p>DataRobot Strengthens Partnership with Google Cloud and Support for Joint Customers October 11, 2022 — BOSTON — AI Cloud leader DataRobot today announced that it has successfully achieved Google Cloud Ready &#8211; BigQuery Designation, enabling more customers to accelerate and scale their impact with AI.&#160; By earning this designation, DataRobot has proven its integration for...</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/datarobot-ai-cloud-achieves-google-cloud-ready-bigquery-designation/\">DataRobot AI Cloud Achieves Google Cloud Ready &#8211; BigQuery Designation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "content:encoded": "\n<p><em>DataRobot Strengthens Partnership with Google Cloud and Support for Joint Customers</em></p>\n\n\n\n<p><strong>October 11, 2022 — BOSTON —</strong> AI Cloud leader <a href=\"https://www.datarobot.com\">DataRobot</a> today announced that it has successfully achieved<strong> </strong>Google Cloud Ready &#8211; BigQuery<strong> </strong>Designation, enabling more customers to accelerate and scale their impact with AI.&nbsp;</p>\n\n\n\n<p>By earning this designation, DataRobot has proven its integration for the DataRobot AI Cloud platform meets a core set of functional and interoperability requirements around BigQuery. This designation from Google Cloud gives our customers an additional level of confidence that DataRobot AI Cloud works seamlessly with BigQuery to generate even more intelligent business solutions. Together, DataRobot AI Cloud and BigQuery provide data analytics teams with simplified access to enterprise-wide data and the ability to write model predictions back to BigQuery, enabling faster decision making.</p>\n\n\n\n<p><a href=\"https://cloud.google.com/bigquery/docs/bigquery-ready-overview\" rel=\"noindex nofollow noopener\"  target=\"_blank\">Google Cloud Ready &#8211; BigQuery</a> is a partner integration validation program that intends to increase customer confidence in partner integrations into <a href=\"https://cloud.google.com/bigquery\" rel=\"noindex nofollow noopener\"  target=\"_blank\">BigQuery</a>. As part of this program, Google Cloud engineering teams validate partner integrations into BigQuery in a three phase process: run a series of data integration tests and compare results against benchmarks, work closely with partners to fill any gaps, and refine documentation for our mutual customers.&nbsp;&nbsp;</p>\n\n\n\n<p>With this expanded strategic partnership, DataRobot will also collaborate closely with Google Cloud partner engineering and BigQuery teams to develop joint roadmaps and continue improving our partnership offerings for our customers. This designation follows the <a href=\"https://www.datarobot.com/newsroom/press/datarobot-ai-cloud-launches-on-google-cloud-marketplace/\">announcement</a> of DataRobot AI Cloud availability on Google Cloud Marketplace in June 2022.</p>\n\n\n\n<p>“Companies are working with a range of partners and applications alongside BigQuery to create new value with their data as they digitally transform their business,” said Ritika Suri, Director, Technology Partnerships, Google Cloud. “The Google Cloud Ready – BigQuery designation indicates that DataRobot’s integrations with BigQuery help deliver excellent value and results for customers that are looking to drive data-driven decisions across their organization.”</p>\n\n\n\n<p>“This integration with BigQuery enables data analytics teams and data scientists to quickly enrich datasets and build powerful machine learning models, for faster and more impactful business outcomes,” said Sirisha Kadamalakalva, SVP, Alliances and Partnerships, DataRobot. “We’re excited to continue to expand our strategic partnership with Google Cloud to deliver more value to our joint customers.”&nbsp;&nbsp;</p>\n\n\n\n<p>DataRobot AI Cloud is powered by a global ecosystem of strategic technology, solution and consulting partners. Built as a multi-cloud platform, DataRobot AI Cloud can be deployed in a combination of public clouds, data centers, or at the edge.&nbsp;</p>\n\n\n\n<p>To learn more about DataRobot expertise with Google Cloud, visit <a href=\"https://www.datarobot.com/partners/cloud-alliance/google-cloud-platform/\">https://www.datarobot.com/partners/cloud-alliance/google-cloud-platform/</a>.</p>\n\n\n\n<p>To learn more about Google Cloud Ready &#8211; BigQuery and its benefits, visit <a href=\"https://cloud.google.com/bigquery/docs/bigquery-ready-overview#scope_of_the_program_and_partner_benefits\" rel=\"noindex nofollow noopener\"  target=\"_blank\">https://cloud.google.com/bigquery/docs/bigquery-ready-overview#scope_of_the_program_and_partner_benefits</a>.</p>\n\n\n\n<p><strong>About DataRobot </strong></p>\n\n\n\n<p>DataRobot AI Cloud is the next generation of AI. DataRobot’s AI Cloud vision is to bring together all data types, all users, and all environments to deliver critical business insights for every organization. DataRobot is trusted by global customers across industries and verticals, including a third of the Fortune 50. For more information, visit <a href=\"http://www.datarobot.com/\">https://www.datarobot.com/</a>.&nbsp;</p>\n\n\n\n<p class=\"has-text-align-center\">###</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.datarobot.com/newsroom/press/datarobot-ai-cloud-achieves-google-cloud-ready-bigquery-designation/\">DataRobot AI Cloud Achieves Google Cloud Ready &#8211; BigQuery Designation</a> appeared first on <a rel=\"nofollow\" href=\"https://www.datarobot.com\">DataRobot AI Cloud</a>.</p>\n",
  "media:content": ""
}