{
  "id": "tag:blogger.com,1999:blog-17171206.post-4449493430080955379",
  "published": "2011-07-18T22:32:00.000-07:00",
  "updated": "2011-07-20T23:45:07.868-07:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Walk the Talk: On the Combination of Implicit and Explicit Feedback",
  "content": "Last week, <a href=\"http://www.sis.pitt.edu/%7Edparra/\">Denis Parra</a> presented our paper entitled \"Walk the Talk: Analyzing the Relation between Implicit and Explicit Feedback for Preference Elicitation\" at the <a href=\"http://www.umap2011.org/\">UMAP conference</a>. The paper won Denis the best-student paper award (Congratulations!).<br /><br />The paper presents our initial work in analyzing the relation between implicit and explicit feedback. In short, the main question we wanted to answer is how does the self-reported preferences users give in a typical 5-star interface relate to what they actually do when looking at their consumption patterns. Our hypothesis was that there should exist simple models that relate both kinds of feedback. Finding a way to robustly convert implicit feedback into explicit ratings would open up the door to applying well-known methods with implicit feedback. But, much more importantly, we could then combine both kinds of input in a single model.<br /><br />In order to test our hypothesis, we prepared an experiment in the music domain. We asked last.fm users to take a <a href=\"http://technocalifornia.blogspot.com/2010/08/study-on-online-music-taste-call-for.html\">survey</a> in which we queried them about how much they liked albums that were already in their listening history. With this data in hand, we could analyze the relation between implicit and explicit feedback and try to fit a simple model.<br /><br />I recommend you read the <a href=\"http://bit.ly/r1mvkK\">full paper</a> if you want to get the longer story of our findings, but here is a brief summary:<ul><li>There is a strong correlation between implicit feedback and self-reported preference (see figure below)<br /></li><li>Variables such as recentness of interaction or overall popularity do not have significant effect. Note that in <a href=\"http://www.princeton.edu/%7Emjs3/salganik_watts08.pdf\">a previous study</a> by Salganik &amp; Duncan Watts, global popularity was found to affect users perceived quality. However, in that case and as opposed to ours, users were made aware of the popularity.<br /></li><li>Interaction effect: When listening to music, some people prefer to listen to isolated songs or albums. The way they interact with music, affects the way they report their taste.<br /></li></ul><a onblur=\"try {parent.deselectBloggerImageGracefully();} catch(e) {}\" href=\"http://1.bp.blogspot.com/-gtrwSvrIpEI/TifEaf_CfYI/AAAAAAAAANI/IzeMVpRZbaQ/s1600/up-box.png\"><img style=\"display: block; margin: 0px auto 10px; text-align: center; cursor: pointer; width: 514px; height: 357px;\" src=\"http://1.bp.blogspot.com/-gtrwSvrIpEI/TifEaf_CfYI/AAAAAAAAANI/IzeMVpRZbaQ/s320/up-box.png\" alt=\"\" id=\"BLOGGER_PHOTO_ID_5631685818591640962\" border=\"0\" /></a><br />After our analysis, we then construct a linear model that takes into account these variables by performing a linear regression. Once we have built these models, we can evaluate their performance in a regular recommendation scenario by measuring the error in predicting ratings in a hold-out dataset.<br /><br />This paper represents an initial but very promising line of work that we have already improved in several ways such as the use of logistic instead of linear regression to account for the non-linearity of the rating scale or the use of the regression model as a way to combine both implicit and explicit feedback. But I will leave those findings for a future post.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Xavier Amatriain",
    "uri": "http://www.blogger.com/profile/14166119485952054870",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 0
}