{
  "id": "yt:video:dh4G1Gjv7bA",
  "yt:videoId": "dh4G1Gjv7bA",
  "yt:channelId": "UC2PA-AKmVpU6NKCGtZq_rKQ",
  "title": "Violence & Protest | Philosophy Tube",
  "link": "",
  "author": {
    "name": "Philosophy Tube",
    "uri": "https://www.youtube.com/channel/UC2PA-AKmVpU6NKCGtZq_rKQ"
  },
  "published": "2021-12-03T20:00:12+00:00",
  "updated": "2022-07-22T05:29:33+00:00",
  "media:group": {
    "media:title": "Violence & Protest | Philosophy Tube",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "CuriosityStream - https://curiositystream.com/philosophytube\n\nA video about protest, direct action, and revolution in the context of the climate crisis ⚔️⚔️⚔️ https://www.patreon.com/PhilosophyTube\n\nSubscribe! http://tinyurl.com/pr99a46\n\nPaypal.me/PhilosophyTube\n\nTwitter: @PhilosophyTube\n\nEmail: philosophytubebusiness@gmail.com\n\nFacebook: http://tinyurl.com/jgjek5w\n\nrealphilosophytube.tumblr.com\n\nBIBLIOGRAPHY\n\nMusa Al-Gharbi, “There is no social change without coercion: Race, Baltimore, and how violence makes nonviolence possible”, in Salon\nAvram Alpert, “Philosophy Against and in Praise of Violence: Kant, Thoreau and the Revolutionary Spectator,” in Theory, Culture & Society\nThomas Aquinas, Summa Theologica\nSidney Axinn, “Kant, Authority, and the French Revolution,” in Journal of the History of Ideas\nÉtienne Balibar, Violence and Civility\nÉtienne Balibar, We, the People of Europe?\nJorge Barrera, “Land Back Movement Leader Flagged  by Police as ‘Violent’,” in CBC\nWalter Benjamin, “Critique of Violence”\nJames Butler, “A Coal Mine for Every WIldfire,” in London Review of Books \nJudith Butler, The Force of Nonviolence\nPeter Gelderloos, How Nonviolence Protects the State\nEdward Herman & Noam Chomsky, Manufacturing Consent\nThomas E. Hill, “A Kantian Perspective on Political Violence,” in The Journal of Ethics\nThomas Hobbes, Leviathan\nSeung-hoon Jeong, “Sovereign Agents of Mythical and (Pseudo-)Divine Violence,” in The Philosophical Journal of Conflict and Violence\nJohn Jordan, “The Day We Stopped Europe’s Biggest Polluter In Its Tracks,” in The Guardian \nImmanuel Kant, Metaphysics of Justice\nImmanuel Kant, “The Contest of Faculties”\nImmanuel Kant,  “On the Common Saying ‘This May be True in Theory, But It Does Not Apply in Practice”\nImmanuel Kant, “Perpetual Peace”\nChristine Korsgaard, “Taking the law into our own hands: Kant on the right to revolution,” in The Constitution of Agency\nJohn Lancaster, “Warmer, Warmer,” in The London Review of Books \nAndreas Malm, How To Blow Up A Pipeline\nAchille Mbembe, Necropolitics\n“MLSA: Journalists, Activists, Increasingly Charged with Terrorism in 2021,” in BIA \nEdgar Sandoval, “Why These Young Men Carry Guns,” in The New York Times \nRachel Shabi, “Baltimore and the media tyranny of nonviolence,” in Al Jazeera \nDuncan Stuart, “Walter Benjamin’s “Critique of Violence” is A Revolutionary Call To Arms,” in Jacobin \nRachel Swaner et. al, “Guns, Safety, and the Edge of Adulthood in New York City,” in Center for Court Innovation \nPBS Idea Channel, What is Violence?\nDelio Vasquez, “The Poor Person’s Defense of Riots,” in Counterpunch \nSimone Weil, “The Iliad, or the Poem of Force”\nSlavoj Zizek, Violence\n\nSelect Images by Getty Images, Ende Gelande, Jannis Grosse, Fabian Melder\n\n'Revolutionary Doubt' by Space Baby https://www.youtube.com/channel/UC__UuPAX7TvF3hGYb5ciVpQ\n\nWe Always Thought the Future Would Be Kind of Fun by Chris Zabriskie is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\nSource: http://chriszabriskie.com/darkglow/\nArtist: http://chriszabriskie.com/\n\nUnfoldment, Revealment, Evolution, Exposition, Integration by Chris Zabriskie is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\nSource: http://chriszabriskie.com/reappear/\nArtist: http://chriszabriskie.com/\n\nCylinder Two by Chris Zabriskie is licensed under a Creative Commons Attribution 4.0 license. https://creativecommons.org/licenses/by/4.0/\nSource: http://chriszabriskie.com/cylinders/\nArtist: http://chriszabriskie.com/\n\n#Protest #Climate",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}