{
  "title": "Social Security and Wealth Inequality with Sylvain Catherine and Natasha Sarin",
  "pubDate": "Mon, 20 Jul 2020 17:00:00 +0000",
  "guid": "e4fb1a56-fdaa-4507-8be4-b886cda9e927",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/147_Catherine-Sarin.mp3",
  "itunes:image": "",
  "description": "<p>Today's guests are Sylvain Catherine and Natasha Sarin of the University of Pennsylvania. They discuss their research on wealth inequality, specifically with respect to social security's impact on calculated wealth inequality. When you account for the value of all future payroll taxes into Social Security and all future benefit payments from Social Security, the present value of that stream of payments accounts for a large fraction of the wealth held by the bottom 90% of households.</p> <blockquote>Recent influential work finds large increases in inequality in the U.S., based on measures of wealth concentration that notably exclude the value of social insurance programs. This paper revisits this conclusion by incorporating Social Security retirement benefits into measures of wealth inequality. Wealth inequality has not increased in the last three decades when Social Security is accounted for. When discounted at the risk-free rate, real Social Security wealth increased substantially from $5.6 trillion in 1989 to just over $42.0 trillion in 2016. When we adjust for systematic risk coming from the covariance of Social Security returns with the market portfolio, this increase remains sizable, growing from over $4.6 trillion in 1989 to $34.0 trillion in 2016. Consequently, by 2016, Social Security wealth represented 58% of the wealth of the bottom 90% of the wealth distribution. Redistribution through programs like Social Security increases the progressivity of the economy, and it is important that our estimates of wealth concentration reflect this.</blockquote> <hr />",
  "content:encoded": "<p>Today's guests are Sylvain Catherine and Natasha Sarin of the University of Pennsylvania. They discuss their research on wealth inequality, specifically with respect to social security's impact on calculated wealth inequality. When you account for the value of all future payroll taxes into Social Security and all future benefit payments from Social Security, the present value of that stream of payments accounts for a large fraction of the wealth held by the bottom 90% of households.</p> Recent influential work finds large increases in inequality in the U.S., based on measures of wealth concentration that notably exclude the value of social insurance programs. This paper revisits this conclusion by incorporating Social Security retirement benefits into measures of wealth inequality. Wealth inequality has not increased in the last three decades when Social Security is accounted for. When discounted at the risk-free rate, real Social Security wealth increased substantially from $5.6 trillion in 1989 to just over $42.0 trillion in 2016. When we adjust for systematic risk coming from the covariance of Social Security returns with the market portfolio, this increase remains sizable, growing from over $4.6 trillion in 1989 to $34.0 trillion in 2016. Consequently, by 2016, Social Security wealth represented 58% of the wealth of the bottom 90% of the wealth distribution. Redistribution through programs like Social Security increases the progressivity of the economy, and it is important that our estimates of wealth concentration reflect this. ",
  "enclosure": "",
  "itunes:duration": "52:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guests are Sylvain Catherine and Natasha Sarin of the University of Pennsylvania. They discuss their research on wealth inequality, specifically with respect to social security's impact on calculated wealth inequality. When you account for the...",
  "itunes:episode": 147,
  "itunes:episodeType": "full"
}