{
  "title": "Colorado Suspends One Family Court Custody Expert, Reviews All Custody Evaluators Following ProPublica Investigation",
  "link": "https://www.propublica.org/article/colorado-suspends-custody-evaluator",
  "pubDate": "Mon, 31 Oct 2022 14:00:00 -0400",
  "guid": "https://www.propublica.org/article/colorado-suspends-custody-evaluator",
  "description": "\n                <p class=\"byline\">\n                by <a class=\"name\" href=\"https://www.propublica.org/people/hannah-dreyfus-2\">Hannah Dreyfus</a>                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. <a href=\"https://www.propublica.org/newsletters/dispatches?source=54G&placement=top-note&region=local\">Sign up for Dispatches</a>, a newsletter that spotlights wrongdoing around the country, to receive our stories in your inbox every week.</p>\n\n            \n\n                \n\n      \n  \n\n\n\n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.0\">The Colorado courts have suspended a well-known custody evaluator and launched a review of the entire state-approved roster, following a ProPublica investigation that <a href=\"https://www.propublica.org/article/parental-responsibility-evaluators-colorado\">found some evaluators had continued to work after being disciplined</a> by state regulators and accused of domestic violence.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.1\">Jaime Watman, of the State Court Administrator’s Office, confirmed the audit of all custody evaluators and said that Mark Kilmer, who has served for decades as an evaluator in Colorado family courts, has been suspended while his “continued suitability” is reviewed. <a href=\"https://www.propublica.org/article/parental-responsibility-evaluators-colorado\">Kilmer was arrested and charged with assault</a> in 2006 after his then-wife said he pushed her to the bathroom floor, according to police reports.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.2\">Kilmer pleaded guilty to harassment in 2007; the charge was dismissed by the court after Kilmer successfully completed domestic violence counseling and 24 months of probation.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.3\">In an interview with ProPublica, Kilmer denied the allegations and said his guilty plea was a result of poor legal representation.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.4\">Watman noted that because judges appoint evaluators to the cases they preside over, her office “has no authority to terminate an appointment” that is currently underway. Any action on “current appointments,” she said, will be determined by “the judicial officer presiding over the case.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.5\">Kilmer, who was suspended last week, did not respond to a request for comment on the suspension.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.6\">In an interview with ProPublica, Kilmer said he does not believe 90% of the abuse allegations he hears during the course of his work.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.7\">ProPublica found that Kilmer is one of four parental responsibility evaluators, or PREs, on the state roster who have been charged with harassment or domestic violence. In one case, the charges were dismissed. In the two others, it is unclear how the charges were resolved.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.8\">ProPublica also found that 1 in 5 PREs, including Kilmer, has been publicly sanctioned by the Colorado State Board of Psychologist Examiners, six times the rate of discipline for all psychologists with active licenses in the state. Evaluators were sanctioned for misrepresenting their credentials, failing to keep client’s information confidential and, in one case detailed by the Gazette, of Colorado Springs, failing to disclose a conflict of interest that is alleged to have <a href=\"https://gazette.com/colorado-watch/mother-blames-parental-evaluator-for-the-death-of-her-10-year-old-son/article_eea6f57a-48fe-11ed-9f86-4320528f7896.html\">contributed to the death of a 10-year-old</a>, according to a complaint filed by the child’s mother with the state board. (In his response to the complaint, the PRE said he never perceived threats to the child’s safety.)</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.9\">None of the sanctioned or arrested PREs lost their licenses or had them suspended.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.10\">ProPublica spoke to 45 Colorado parents who were involved in custody disputes with allegations of child and domestic abuse. In cases evaluated by a PRE with a criminal or disciplinary record, the parents said they only learned about their evaluator’s background after the court had appointed them.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.11\">Multiple parents who alleged they had experienced abuse in their relationships said evaluators downplayed or omitted the abuse from their reports to the court.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.12\">Judges are not obligated to follow evaluators’ recommendations, but PREs acknowledge their opinions are very influential. “At this point in my career, sometimes the judge just cuts and pastes all my recommendations and puts it into the court order,” Kilmer told ProPublica.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.13\">The State Court Administrator’s Office, which is responsible for vetting PREs and other court-appointed custody evaluators, said a criminal misdemeanor conviction older than 15 years does not disqualify a custody evaluator from family court appointments. The office also said that discipline by the State Board of Psychologist Examiners does not disqualify an evaluator unless it currently affects their license.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.14\">A Colorado law that took effect in January placed court evaluators under the supervision of the State Court Administrator’s Office. Before then, evaluators were not formally vetted by the court and operated with little to no supervision. Watman said the court does not have authority “to consider complaints arising in cases filed prior to” Jan. 1.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.15\">The new law also requires court evaluators to receive additional training on how to identify domestic violence and child abuse and on how abuse should be weighed in custody recommendations.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.16\">Rep. Meg Froelich, the bill’s sponsor, told ProPublica she will push for additional family court reforms in the next legislative session, including requiring additional education for family court judges.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.17\">Froelich said she will model legislation after a Pennsylvania measure, known as Kayden’s Law, that mandates judges and court personnel receive training about child abuse and domestic violence and adds to the evidence judges must consider in custody decisions.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"1.18\">In March, President Joe Biden signed a law that adds language from Kayden’s Law to the reauthorized federal Violence Against Women Act, allocating additional federal funds to states that update their child custody laws to better protect at-risk children.</p>\n        \n                                   ",
  "dc:subject": "",
  "dc:date": "2022-10-31T14:00:00-04:00",
  "dc:creator": "by Hannah Dreyfus"
}