{
  "id": "yt:video:LazH8zytt8k",
  "yt:videoId": "LazH8zytt8k",
  "yt:channelId": "UCUk0AvSMU5CJ0wUqJf9TX8g",
  "title": "The Art Of Meditation with Samaneri Jayasāra",
  "link": "",
  "author": {
    "name": "Coleman Hughes",
    "uri": "https://www.youtube.com/channel/UCUk0AvSMU5CJ0wUqJf9TX8g"
  },
  "published": "2022-10-14T20:00:14+00:00",
  "updated": "2022-10-15T16:31:14+00:00",
  "media:group": {
    "media:title": "The Art Of Meditation with Samaneri Jayasāra",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "My guest today is Samaneri Jayasāra. Samaneri is a Buddhist nun and spiritual teacher. Her YouTube channel where she shares her lectures has over 80,000 subscribers.\n\nIn this episode, Samaneri and I discuss the purpose of meditation, the true nature of emotions, the core teachings of Buddhism, the illusion of boredom, the difference between Buddhism and the Abrahamic religions, the possibility of enlightenment, the cycle of pleasure and pain, and much more.\n\nCheck out Samaneri Jayasāra's Channel :\n\"Wisdom of the Masters\" - https://bit.ly/3VqelXr\n\n#Hyundai \nHyundai’s 2023 Tucson lineup pairs the tech you want with sleek and stylish designs. They paid\nattention to all of the details – the seats, the dash, the available panoramic roof! You\nname it, Hyundai thought of it...all while making sure each trim has enough room to hold space\nfor your grocery runs, festival nights, and tailgates!\nWhen it comes to your journey, Hyundai is there for every mile.\nVisit https://www.hyundaiusa.com to learn more about the 2023 Hyundai Tucson.\n\n#Indeed \nIndeed is the hiring platform where you can Attract, Interview, and Hire all in one place. Finding great talent doesn’t have to be a second job. You can reclaim your time and find top talent fast with Indeed. Find top talent fast with Indeed’s suite of powerful hiring tools like Indeed Instant Match, Assessments, and Virtual Interviews. Indeed’s Virtual Interview tool means there’s nothing to download–just click and talk. With Virtual Interviews, Indeed saves you time. You can message, schedule, and interview top talent all in one place. \nJoin over three million businesses worldwide using INDEED to hire great talent fast.\nVisit https://www.indeed.com/Conversations to start hiring now\n\n#ButcherBox \nButcherBox was started with the idea that everyone should have access to high quality humanely raised meat. Each month ButcherBox delivers 100% grass-fed beef, pork raised crate free, and free-range organic chickens straight to your door. Plus, this Thanksgiving ButcherBox has the very best free-range turkeys with no antibiotics or added hormones. \nAll of their meat is humanely raised with no antibiotics or added hormones. You can get whatever you want delivered right to your doorstep with free shipping for the continental US and no surprise fees. You can choose from a variety of box plan options from curated to customize and change your plan whenever you want. This November butcher box can solve your Thanksgiving problem especially if you want to have a delicious turkey, but don't have time to go pick one out yourself. \nButcherBox is offering our listeners Free Turkey with their first order.\nSign up today at https://www.butcherbox.com/COLEMAN and use code COLEMAN to get one 10-\n14 lb Turkey FREE in your first box.\n\n\n\nFOLLOW COLEMAN \n\nYouTube - http://bit.ly/38kzium \nTwitter - http://bit.ly/2rbAJue \nFacebook - http://bit.ly/2LiAXH3 \nInstagram - http://bit.ly/2SDGo6o \nPodcast -https://bit.ly/3oQvNUL \nWebsite - https://colemanhughes.org/ \nLimited Edition Merch - https://bit.ly/CWCMerch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}