{
  "title": "What Happens to Your Body When You Eat Healthy & Cut Out Sugar",
  "pubDate": "Fri, 02 Feb 2018 03:18:56 +0000",
  "guid": "cadd267e143f44fa0ae3c963099dcae1",
  "link": "http://sites.libsyn.com/45911/what-happens-to-your-body-when-you-eat-healthy-cut-out-sugar",
  "itunes:image": "",
  "description": "<p>Learn what happens to your body when you eat healthy and cut out sugar following a keto diet and how a keto diet follows ancestral eating patterns of eating food when it's in season and from what you can hunt, gather, forage and provide for yourself.<br /> <br /> Learn how your genetics play into what foods work for your body. Plus all your answers from Dr. Hillary Lampers answered on going keto, if it's safe for certain diseases or conditions, and what's going to be best for you. </p>",
  "content:encoded": "<p>Learn what happens to your body when you eat healthy and cut out sugar following a keto diet and how a keto diet follows ancestral eating patterns of eating food when it's in season and from what you can hunt, gather, forage and provide for yourself.  Learn how your genetics play into what foods work for your body. Plus all your answers from Dr. Hillary Lampers answered on going keto, if it's safe for certain diseases or conditions, and what's going to be best for you. </p>",
  "enclosure": "",
  "itunes:duration": "01:18:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Seasonal & Ancestral Eating for Homesteaders",
  "itunes:episodeType": "full",
  "author": "melissa@melissaknorris.com (Melissa K. Norris 5th Generation Homesteader)",
  "itunes:author": "Melissa K. Norris 5th Generation Homesteader",
  "itunes:summary": "Learn what happens to your body when you eat healthy and cut out sugar following a keto diet and how a keto diet follows ancestral eating patterns of eating food when it's in season and from what you can hunt, gather, forage and provide for yourself. Learn how your genetics play into what foods work for your body. Plus all your answers from Dr. Hillary Lampers answered on going keto, if it's safe for certain diseases or conditions, and what's going to be best for you."
}