{
  "title": "Episode 30: &#8220;Bo Diddley&#8221; by Bo Diddley",
  "link": "https://500songs.com/podcast/episode-30-bo-diddley-by-bo-diddley/",
  "pubDate": "Mon, 29 Apr 2019 22:17:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=662",
  "description": "<p>Welcome to episode thirty of <em>A History of Rock Music in Five Hundred Songs</em>. This is the last of our three-part look at Chess Records, and focuses on \"Bo Diddley\" by Bo Diddley. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-bo-diddley/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.I accidentally used a later rerecording of \"I Wish You Would\" by Billy Boy Arnold on the playlist, but I use the correct version in the podcast itself. Sorry about that.</p>\n<p>As this is part three of the Chess Records trilogy, you might want to listen to part one, on <a href=\"https://www.500songs.com/e/episode-28-sincerely-by-the-moonglows/\">the Moonglows</a>, and part two, on <a href=\"https://www.500songs.com/e/episode-29-maybellene-by-chuck-berry/\">Chuck Berry,</a> if you haven't already.</p>\n<p>Along with the resources mentioned in the previous two episodes, the resource I used most this time was <a href=\"https://amzn.to/2LcGb9J\"><em>Bo Diddley: Living Legend</em> by George R. White</a>, a strong biography told almost entirely in Diddley's own words from interviews, and the only full-length book on Diddley.</p>\n<p><a href=\"https://amzn.to/2GRdrz3\">This compilation</a> contains Diddley's first six albums plus a bunch of non-album and live tracks, and has everything you're likely to want by Diddley on it, for under ten pounds.</p>\n<p>If you want to hear more Muddy Waters after hearing his back-and-forth with Diddley, <a href=\"https://amzn.to/2UOmDrA\">this double CD set</a> is a perfect introduction to him.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Welcome to the final part of our trilogy about Chess Records. Last week, we looked at Chuck Berry. This week, we're going to deal with someone who may even have been more important.</p>\n<p>One of the many injustices in copyright law -- and something that we'll have a lot of cause to mention during the course of this series -- is that, for the entire time period covered by this podcast, it was impossible to copyright a groove or a rhythm, but you could copyright a melody line and lyric. And this has led to real inter-racial injustice.</p>\n<p>In general, black musical culture in the USA has emphasised different aspects of musical invention than white culture has. While white American musical culture -- particularly *rich* white musical culture -- has stressed inventive melodies and harmonic movement -- think of, say, Burt Bacharach or George Gershwin -- it has not historically stressed rhythmic invention. On the other hand, black musical culture has stressed that above everything else -- you'll notice that all the rhythmic innovations we've talked about in this series so far, like boogie woogie, and the backbeat, and the tresillo rhythm, all came from black musicians.</p>\n<p>That's not, of course, to say that black musicians can't be melodically inventive or white musicians rhythmically -- I'm not here saying \"black people have a great sense of rhythm\" or any of that racist nonsense. I'm just talking about the way that different cultures have prioritised different things.</p>\n<p>But this means that when black musicians have produced innovative work, it's not been possible for them to have any intellectual property ownership in the result. You can't steal a melody by Bacharach, but anyone can play a song with a boogie beat, or a shuffle, or a tresillo... or with the Bo Diddley beat.</p>\n<p>[Very short excerpt: “Bo Diddley”, Bo Diddley]</p>\n<p>Elias McDaniel's distinctive sound came about because he started performing so young that he couldn't gain entrance to clubs, and so he and his band had to play on street corners. But you can't cart a drum kit around and use it on the streets, so McDaniel and his band came up with various inventive ways to add percussion to the act. At first, they had someone who would come round with a big bag of sand and empty it onto the pavement. He'd then use a brush on the sand, and the noise of the brushing would provide percussion -- at the end of the performance this man, whose name was Sam Daniel but was called Sandman by everyone, would sweep all the sand back up and put it back into his bag for the next show.</p>\n<p>Eventually, though, Sandman left, and McDaniel hit on the idea of using his girlfriend's neighbour Jerome Green as part of the act.</p>\n<p>We heard Jerome last week, playing on \"Maybellene\", but he's someone who there is astonishingly little information about. He doesn't even have a Wikipedia page, and you'll find barely more than a few paragraphs about him online. No-one even knows when he was born or died – *if* he died, though he seems to have disappeared around 1972. And this is quite astonishing when you consider that Green played on all Bo Diddley's classic records, and sang duet on a few of the most successful ones, *and* he played on many of Chuck Berry's, and on various other records by Willie Dixon, Otis Spann, the Moonglows... yet when you Google him, the third hit that comes up is about Robson Green and Jerome Flynn, a nineties soft-pop duo who span out of a soap opera.</p>\n<p>At first, Jerome's job was to pass the hat around and collect the money, but McDaniel decided to build Jerome a pair of maracas, and teach him how to play. And he learned to play very well indeed, adding a Latin sound to what had previously been just a blues band.</p>\n<p>Jerome's maracas weren't the only things that Elias McDaniel built, though. He had a knack for technology, though he was always rather modest about his own abilities. He built himself one of the very first tremelo systems for a guitar, making something out of old car bits and electronic junk that would break the electronic signal up. Before commercial tremelo systems existed, McDaniel was the only one who could make his guitar sound like that.</p>\n<p>The choppy guitar, with its signal breaking up deliberately, and the maracas being shook frantically, gave McDaniel's music a rhythmic drive unlike anything else in rock and roll.</p>\n<p>McDaniel and his band eventually got their music heard by Leonard Chess at Chess Records. Chess was impressed by a song called \"Uncle John\", which had lyrics that went \"Uncle John's got corn ain't never been shucked/Uncle John's got daughters ain't never been... to school\"; but he said the song needed less salacious lyrics, and he suggested retitling it “Bo Diddley”, which also became the stage name of the man who up until now had been called Elias McDaniel.</p>\n<p>The new lyrics were inspired by the black folk song \"Hambone\", which a few years earlier had become a novelty hit:</p>\n<p>[Excerpt: \"Hambone\", Red Saunders Orchestra with the Hambone Kids]</p>\n<p>Now, I have to be a bit careful here, because here I'm talking about something that's from a different culture from my own, and my understanding of it is that of an outsider. To *me*, \"Hambone\" seems to be a unified thing that's part song, part dance, part game. But my understanding may be very, very flawed, and I don't want to pretend to knowledge I don't have. But this is my best understanding of what “Hambone” is.</p>\n<p>\"Hambone\", like many folk songs, is not in itself a single song, but a collection of different songs with similar elements. The name comes from a dance which, it is said, dates back to enslaved people attempting to entertain themselves. Slaves in most of the US were banned from using drums, because it was believed they might use them to send messages to each other, so when they wanted to dance and sing music, they would slap different parts of their own bodies to provide percussive accompaniment.</p>\n<p>Now, I tend to be a little dubious of narratives that claim that aspects of twentieth-century black culture date back to slavery or, as people often claim, to Africa. A lot of the time these turn out to be urban myths of the \"ring a ring a roses is about the bubonic plague\" kind. One of the real tragedies of slavery is that the African culture that the enslaved black people brought over to the US was largely lost in the ensuing centuries, and so there's a very strong incentive to try to find things that could be a continuation of that. But that's the story around “Hambone”, which is also known as the “Juba beat”.</p>\n<p>Another influence Diddley would always cite for the lyrical scansion is the song “Hey Baba Reba”, which he would usually misremember as having been by either Cab Calloway or Louis Jordan, but was actually by Lionel Hampton:</p>\n<p>[Excerpt: Lionel Hampton, “Hey Baba Reba”]</p>\n<p>But the important thing to note is that the rhythm of all these records is totally different from the rhythm of the song \"Bo Diddley\". There's a bit of misinformation that goes around in almost every article about Diddley, saying \"the Bo Diddley beat is just the 'Hambone' beat\", and while Diddley would correct this in almost every interview he ever gave, the misinformation would persist -- to the point that when I first heard \"Hambone\" I was shocked, because I'd assumed that there must at least have been some slight similarity. There's no similarity at all.</p>\n<p>And that's not the only song where I've seen claims that there's a Bo Diddley beat where none exists. As a reminder, here's the actual Bo Diddley rhythm:</p>\n<p>[Very short excerpt: Bo Diddley, “Bo Diddley”]</p>\n<p>Now the PhD thesis on the development of the backbeat which I talked about back in episode two claims that the beat appears on about thirteen records before Diddley's, mostly by people we've discussed before, like Louis Jordan, Johnny Otis, Fats Domino, and Roy Brown.</p>\n<p>But here's a couple of examples of the songs that thesis cites. Here's \"Mardi Gras in New Orleans\" by Fats Domino:</p>\n<p>[Excerpt: \"Mardi Gras in New Orleans, Fats Domino]</p>\n<p>And here's \"That's Your Last Boogie\", by Joe Swift, produced by Johnny Otis:</p>\n<p>[Excerpt: Joe Swift, \"That's Your Last Boogie\"]</p>\n<p>As you can hear, they both have something that's *sort of* the Bo Diddley beat, but not really, among their other rhythms. It's most notable at the very start of \"That's Your Last Boogie\"</p>\n<p>[Intro: \"That's Your Last Boogie\"]</p>\n<p>That's what's called a clave beat -- it's sort of like the tresillo, with an extra bom-bom on the end. Bom bom-bom, bom-bom. That's not the Bo Diddley beat. The Bo Diddley beat actually varies subtly from bar to bar, but it's generally a sort of chunk-a chunk-a-chunk a-chunk a-chunk ah. It certainly stresses the five beats of the clave, but it's not them, and nor is it the \"shave and a haircut, two bits\" rhythm other people seem to claim for it.</p>\n<p>Most ridiculously, Wikipedia even claims that the Andrews Sisters' version of Lord Invader's great calypso song, \"Rum and Coca Cola\", has the Bo Diddley beat:</p>\n<p>[Excerpt: \"Rum and Coca Cola\", the Andrews Sisters]</p>\n<p>Both records have maracas, but that's about it. Incidentally, that song was, in the Andrews Sisters version, credited to a white American thief rather than to the black Trinidadian men who wrote it. Sadly appropriate for a song about the exploitation of Trinidadians for \"the Yankee dollar\".</p>\n<p>But none of these records have the Bo Diddley beat, despite what anyone might say. None of them even sound very much like Diddley's beat at all.</p>\n<p>The origins of the Bo Diddley beat were, believe it or not, with Gene Autry. We've talked before about Autry, who was the biggest Western music star of the late thirties and early forties, and who inspired all sorts of people you wouldn't expect, from Les Paul to Hank Ballard. But Diddley hit upon his rhythm when trying to play Autry's \"I've Got Spurs That Jingle Jangle Jingle\".</p>\n<p>[excerpt, Gene Autry, \"I've Got Spurs that Jingle Jangle Jingle\"]</p>\n<p>No, I don't see the resemblance either. But this ties back into what we were talking about last week, with the influence of country musicians on the blues and R&B musicians at Chess.</p>\n<p>And if you become familiar with his later work, it becomes clear that Diddley truly loved the whole iconography of the Western, and country music. He did albums called \"Have Guitar Will Travel\" (named after the Western TV show \"Have Gun Will Travel\") and \"Bo Diddley is a Gunslinger\". Diddley's work is rooted in black folklore -- things like hambone, but also the figure of Stagger Lee and other characters like the Signifying Monkey -- but it should be understood that black American folklore has always included the image of the black cowboy.</p>\n<p>The combination of these influences – the “Hambone” lyrical ideas, the cowboy rhythm, and the swaggering character Diddley created for himself – became this:</p>\n<p>[Excerpt: “Bo Diddley” by Bo Diddley]</p>\n<p>The B-side to the record, meanwhile, was maybe even more important. It's also an early example of Diddley *not* just reusing his signature rhythm. The popular image of Diddley has him as a one-idea artist remaking the same song over and over again -- and certainly he did often return to the Bo Diddley beat -- but he was a far more interesting artist than that, and recorded in a far wider variety of styles than you might imagine. And in \"I'm A Man\" he took on another artist's style, beating Muddy Waters at his own game.</p>\n<p>\"I'm A Man\" was a response to Waters' earlier \"Hoochie Coochie Man\":</p>\n<p>[Excerpt: \"Hoochie Coochie Man\", Muddy Waters]</p>\n<p>\"Hoochie Coochie Man\" had been written for Muddy Waters by Willie Dixon and was, as far as I can tell, the first blues record ever to have that da-na-na na-na riff that later became the riff that for most people defines the blues.</p>\n<p>\"Hoochie Coochie Man\" had managed to sum up everything about Waters' persona in a way that Waters himself had never managed with his own songs. It combined sexual braggadocio with hoodoo lore -- the character Waters was singing in was possessed of supernatural powers, from the day he was born, and he used those powers to \"make pretty women jump and shout\". He had a black cat bone, and a mojo, and a John the Conqueror root.</p>\n<p>It was a great riff, and a great persona, and a great record. But it was still a conventionally structured sixteen-bar blues, with the normal three chords that almost all blues records have.</p>\n<p>But Bo Diddley heard that and decided that was two chords too many. When you've got a great riff, you don't *need* chord changes, not if you can just hammer on that riff. So he came up with a variant of Dixon's song, and called it \"I'm a Man\". In his version, there was only the one chord:</p>\n<p>[Excerpt: Bo Diddley, \"I'm a Man\"]</p>\n<p>Willie Dixon guested on bass for that song, as it wasn't felt that Diddley's own bass player was getting the feeling right. There were also some changes made to the song in the studio -- as Diddley put it later: \"They wanted me to spell 'man', but they weren't explaining it right. They couldn't get me to spell 'man'. I didn't understand what they were talking about!\"</p>\n<p>But eventually he did sing that man is spelled m-a-n, and the song went on to be covered by pretty much every British band of the sixties, and become a blues standard. The most important cover version of it though was when Muddy Waters decided to make his own answer record to Diddley, in which he stated that *he* was a man, not a boy like Diddley. Diddley got a co-writing credit on this, though Willie Dixon, whose riff had been the basis of \"I'm a Man\", didn't.</p>\n<p>[Excerpt: Muddy Waters, \"Mannish Boy\"]</p>\n<p>And then there was Etta James' answer record, \"W.O.M.A.N.\", which once again has wild west references in it:</p>\n<p>[Excerpt: Etta James, \"W.O.M.A.N.\"]</p>\n<p>And that… \"inspired\" Jerry Leiber and Mike Stoller to write this for Peggy Lee:</p>\n<p>[Excerpt: Peggy Lee, \"I'm A Woman\"]</p>\n<p>Of course, none of those records, except Muddy Waters', gave Bo Diddley a writing credit, just as Diddley didn't credit Dixon for his riff.</p>\n<p>At the same session as the single was recorded, Diddley's harmonica player, Billy Boy Arnold, recorded a single of his own, backed by Diddley and his band. \"I'm Sweet on you Baby\" wasn't released at the time, but it's a much more straightforward blues song, and more like Chess' normal releases. Chess were interested in making more records with Arnold, but we'll see that that didn't turn out well:</p>\n<p>[Excerpt: Billy Boy Arnold, \"I'm Sweet on you Baby\"]</p>\n<p>Despite putting out a truly phenomenal single, Diddley hit upon a real problem with his career, and one that would be one of the reasons he was never as popular as contemporaries like Chuck Berry. The problem, at first, looked like anything but. He was booked on the Ed Sullivan Show to promote his first single.</p>\n<p>The Ed Sullivan Show was the biggest TV show of the fifties and sixties. A variety show presented by the eponymous Sullivan, who somehow even after twenty years of presenting never managed to look or sound remotely comfortable in front of a camera, it was the programme that boosted Elvis Presley from stardom to superstardom, and which turned the Beatles from a local phenomenon in the UK and Europe into the biggest act the world had ever seen.</p>\n<p>Getting on it was the biggest possible break Diddley could have got, and it should have made his career. Instead, it was a disaster, all because of a misunderstanding.</p>\n<p>At the time, the country song \"Sixteen Tons\" by Tennessee Ernie Ford was a big hit:</p>\n<p>[Excerpt: \"Sixteen Tons\", Tennessee Ernie Ford]</p>\n<p>Diddley liked the song -- enough that he would later record his own version of it:</p>\n<p>[Excerpt: Bo Diddley, \"Sixteen Tons\"]</p>\n<p>And so he was singing it to himself in his dressing room. One of the production staff happened to walk past and hear him, and asked if he could perform that song on the show. Diddley assumed he was being asked if he would do it as well as the song he was there to promote, and was flattered to be asked to do a second song.</p>\n<p>[Excerpt: Ed Sullivan introducing \"Dr Jive\", with all the confusion about what words he's using]</p>\n<p>When he got out on to the stage he saw the cue card saying \"Bo Diddley Sixteen Tons\", assumed it meant the song \"Bo Diddley\" followed by the song \"Sixteen Tons\", and so he launched into \"Bo Diddley\". After all, why would he go on the show to promote someone else's record? He was there to promote his own debut single. So of course he was going to play it.</p>\n<p>This was not what the production person had intended, and was not what Ed Sullivan wanted. Backstage, there was a confrontation that got so heated that Diddley had to be physically restrained from beating Sullivan with his guitar after Sullivan called Diddley a “black boy” (according to Diddley, “black” at that time and in that place, was a racial slur, though it's the polite term to use today). Sullivan yelled and screamed at Diddley and told him he would be blacklisted from network TV, and would certainly never appear on Sullivan's show again under any circumstances. After that first TV appearance, it would be seven years until Diddley's second.</p>\n<p>And unlike all his contemporaries he didn't even get to appear in films. Even Alan Freed, who greatly respected Diddley and booked him on his live shows, and who Diddley also respected, didn't have him appear in any of the five rock and roll films he made. As far as I can tell, the two minutes he was on the Ed Sullivan show is the only record of Bo Diddley on film or video from 1955 through 1962.</p>\n<p>And this meant, as well, that Chess put all their promotional efforts behind Chuck Berry, who for all his faults was more welcome in the TV studios. If Diddley wanted success, he had to let his records and live performances do the work for him, because he wasn't getting any help from the media.</p>\n<p>Luckily, his records were great. Not only was Diddley's first hit one of the great two-sided singles of all time, but his next single was also impressive. The story of \"Diddley Daddy\" dates back to one of the white cover versions of \"Bo Diddley\". Essex Records put out this cover version by Jean Dinning, produced by Dave Miller, who had earlier produced Bill Haley and the Comets' first records:</p>\n<p>[Excerpt: Jean Dinning, \"Bo Diddley\"]</p>\n<p>And, as with Georgia Gibbs' version of “Tweedle Dee”, the record label wanted to make the record sound as much like the original as possible, and so tried to get the original musicians to play on it, and made an agreement with Chess. They couldn't get Bo Diddley himself, and without his tremelo guitar it sounded nothing like the original, but they *did* get Willie Dixon on bass, Diddley's drummer Clifton James (who sadly isn't the same Clifton James who played the bumbling sheriff in \"Live and Let Die\" and \"Superman II\", though it would be great if he was), and Billy Boy Arnold on harmonica.</p>\n<p>But Billy Boy Arnold made the mistake of going to Chess and asking for the money he was owed for the session. Leonard Chess didn't like when musicians wanted paying, and complained to Bo Diddley about Arnold. Diddley told Arnold that Chess wasn't happy with him, and so Arnold decided to take a song he'd written, \"Diddy Diddy Dum Dum\", to another label rather than give it to Chess. He changed the lyrics around a bit, and called it \"I Wish You Would\":</p>\n<p>[Excerpt: Billy Boy Arnold, \"I Wish You Would\"]</p>\n<p>Arnold actually recorded that for Vee-Jay Records on the very day that Bo Diddley's second single was due to be recorded, and the Diddley session was held up because nobody knew where Arnold was. They eventually found him and got him to Diddley's session -- where Diddley started playing \"Diddy Diddy Dum Dum\". Leonard Chess suggested letting Arnold sing the song, but Arnold said \"I can't -- I just recorded that for VeeJay\", and showed Chess the contract.</p>\n<p>Diddley and Harvey Fuqua, who was there to sing backing vocals with the rest of the Moonglows, quickly reworked the song. Arnold didn't want to play harmonica on something so close to a record he'd just made, though he played on the B-side, and so Muddy Waters' harmonica player Little Walter filled in instead. The new song, entitled \"Diddley Daddy\", became another of Diddley's signature songs:</p>\n<p>[Excerpt: Bo Diddley, \"Diddley Daddy\"]</p>\n<p>but the B-side, \"She's Fine, She's Mine\", was the one that would truly become influential:</p>\n<p>[Excerpt: Bo Diddley, \"She's Fine, She's Mine\"]</p>\n<p>That song was later slightly reworked into this, by Willie Cobbs:</p>\n<p>[Excerpt: Willie Cobbs, \"You Don't Love Me\"]</p>\n<p>That song was covered by pretty much every white guitar band of the late sixties -- the Grateful Dead, Quicksilver Messenger Service, the Allman Brothers, Steve Stills and Al Kooper... the list goes on. But Cobbs' song itself was also slightly reworked, by Dawn Penn, in 1967, and became a minor reggae classic. Twenty-seven years later, in 1994, Penn rerecorded her song, based on Cobbs' song, based on Bo Diddley's song, and it became a worldwide smash hit, with Diddley getting cowriting credit:</p>\n<p>[Excerpt: Dawn Penn, \"You Don't Love Me (No, No, No)\"]</p>\n<p>And *that* has later been covered by Beyonce and Rhianna, and sampled by Ghostface Killah and Usher. And that's how important Bo Diddley was at this point in time. The B-side to his less-good follow-up to his debut provided enough material for sixty years' worth of hits in styles from R&B to jam band to reggae to hip-hop.</p>\n<p>And the song “Bo Diddley” itself, of course, would provide a rhythm for generations of musicians to take, everyone from Buddy Holly:</p>\n<p>[Excerpt: Buddy Holly, “Not Fade Away”]</p>\n<p>to George Michael:</p>\n<p>[Excerpt George Michael, “Faith”]</p>\n<p>to U2:</p>\n<p>[Excerpt: U2, “Desire”]</p>\n<p>Because that rhythm was so successful – even though most of the success went to white people who didn't credit or pay Diddley – people tend to think of Diddley as a one-idea musician, which is far from the truth. Like many of his contemporaries he only had a short period where he was truly inventive -- his last truly classic track was recorded in 1962. But that period was an astoundingly inventive one, and we're going to be seeing him again during the course of this series. In his first four tracks, Diddley had managed to record three of the most influential tracks in rock history. But the next time we look at him, it will be with a song he wrote for other people -- a song that would indirectly have massive effects on the whole of popular music.</p>",
  "itunes:subtitle": "Welcome to episode thirty of A History of Rock Music in Five Hundred Songs. This is the last of our three-part look at Chess Records, and focuses on Bo Diddley by Bo Diddley. Click the full post to read liner notes, links to more information, and a trans",
  "itunes:keywords": "Billy Boy Arnold,Bo Diddley,Chess Records,copyright law,country and western,Dave Miller,Ed Sullivan,Gene Autry,Harvey Fuqua,Jerome Green,Leonard Chess,Lionel Hampton,Muddy Waters,racism,riffs,Tennessee Ernie Ford,the blues,The Moonglows,white cover versions,Willie Dixon",
  "content:encoded": "<p>Welcome to episode thirty of <em>A History of Rock Music in Five Hundred Songs</em>. This is the last of our three-part look at Chess Records, and focuses on \"Bo Diddley\" by Bo Diddley. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n<p><strong>Resources</strong></p>\n<p>As always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-bo-diddley/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.I accidentally used a later rerecording of \"I Wish You Would\" by Billy Boy Arnold on the playlist, but I use the correct version in the podcast itself. Sorry about that.</p>\n<p>As this is part three of the Chess Records trilogy, you might want to listen to part one, on <a href=\"https://www.500songs.com/e/episode-28-sincerely-by-the-moonglows/\">the Moonglows</a>, and part two, on <a href=\"https://www.500songs.com/e/episode-29-maybellene-by-chuck-berry/\">Chuck Berry,</a> if you haven't already.</p>\n<p>Along with the resources mentioned in the previous two episodes, the resource I used most this time was <a href=\"https://amzn.to/2LcGb9J\"><em>Bo Diddley: Living Legend</em> by George R. White</a>, a strong biography told almost entirely in Diddley's own words from interviews, and the only full-length book on Diddley.</p>\n<p><a href=\"https://amzn.to/2GRdrz3\">This compilation</a> contains Diddley's first six albums plus a bunch of non-album and live tracks, and has everything you're likely to want by Diddley on it, for under ten pounds.</p>\n<p>If you want to hear more Muddy Waters after hearing his back-and-forth with Diddley, <a href=\"https://amzn.to/2UOmDrA\">this double CD set</a> is a perfect introduction to him.</p>\n<p><strong>Patreon</strong></p>\n<p>This podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?</p>\n<p><strong>Transcript</strong></p>\n<p>Welcome to the final part of our trilogy about Chess Records. Last week, we looked at Chuck Berry. This week, we're going to deal with someone who may even have been more important.</p>\n<p>One of the many injustices in copyright law -- and something that we'll have a lot of cause to mention during the course of this series -- is that, for the entire time period covered by this podcast, it was impossible to copyright a groove or a rhythm, but you could copyright a melody line and lyric. And this has led to real inter-racial injustice.</p>\n<p>In general, black musical culture in the USA has emphasised different aspects of musical invention than white culture has. While white American musical culture -- particularly *rich* white musical culture -- has stressed inventive melodies and harmonic movement -- think of, say, Burt Bacharach or George Gershwin -- it has not historically stressed rhythmic invention. On the other hand, black musical culture has stressed that above everything else -- you'll notice that all the rhythmic innovations we've talked about in this series so far, like boogie woogie, and the backbeat, and the tresillo rhythm, all came from black musicians.</p>\n<p>That's not, of course, to say that black musicians can't be melodically inventive or white musicians rhythmically -- I'm not here saying \"black people have a great sense of rhythm\" or any of that racist nonsense. I'm just talking about the way that different cultures have prioritised different things.</p>\n<p>But this means that when black musicians have produced innovative work, it's not been possible for them to have any intellectual property ownership in the result. You can't steal a melody by Bacharach, but anyone can play a song with a boogie beat, or a shuffle, or a tresillo... or with the Bo Diddley beat.</p>\n<p>[Very short excerpt: “Bo Diddley”, Bo Diddley]</p>\n<p>Elias McDaniel's distinctive sound came about because he started performing so young that he couldn't gain entrance to clubs, and so he and his band had to play on street corners. But you can't cart a drum kit around and use it on the streets, so McDaniel and his band came up with various inventive ways to add percussion to the act. At first, they had someone who would come round with a big bag of sand and empty it onto the pavement. He'd then use a brush on the sand, and the noise of the brushing would provide percussion -- at the end of the performance this man, whose name was Sam Daniel but was called Sandman by everyone, would sweep all the sand back up and put it back into his bag for the next show.</p>\n<p>Eventually, though, Sandman left, and McDaniel hit on the idea of using his girlfriend's neighbour Jerome Green as part of the act.</p>\n<p>We heard Jerome last week, playing on \"Maybellene\", but he's someone who there is astonishingly little information about. He doesn't even have a Wikipedia page, and you'll find barely more than a few paragraphs about him online. No-one even knows when he was born or died – *if* he died, though he seems to have disappeared around 1972. And this is quite astonishing when you consider that Green played on all Bo Diddley's classic records, and sang duet on a few of the most successful ones, *and* he played on many of Chuck Berry's, and on various other records by Willie Dixon, Otis Spann, the Moonglows... yet when you Google him, the third hit that comes up is about Robson Green and Jerome Flynn, a nineties soft-pop duo who span out of a soap opera.</p>\n<p>At first, Jerome's job was to pass the hat around and collect the money, but McDaniel decided to build Jerome a pair of maracas, and teach him how to play. And he learned to play very well indeed, adding a Latin sound to what had previously been just a blues band.</p>\n<p>Jerome's maracas weren't the only things that Elias McDaniel built, though. He had a knack for technology, though he was always rather modest about his own abilities. He built himself one of the very first tremelo systems for a guitar, making something out of old car bits and electronic junk that would break the electronic signal up. Before commercial tremelo systems existed, McDaniel was the only one who could make his guitar sound like that.</p>\n<p>The choppy guitar, with its signal breaking up deliberately, and the maracas being shook frantically, gave McDaniel's music a rhythmic drive unlike anything else in rock and roll.</p>\n<p>McDaniel and his band eventually got their music heard by Leonard Chess at Chess Records. Chess was impressed by a song called \"Uncle John\", which had lyrics that went \"Uncle John's got corn ain't never been shucked/Uncle John's got daughters ain't never been... to school\"; but he said the song needed less salacious lyrics, and he suggested retitling it “Bo Diddley”, which also became the stage name of the man who up until now had been called Elias McDaniel.</p>\n<p>The new lyrics were inspired by the black folk song \"Hambone\", which a few years earlier had become a novelty hit:</p>\n<p>[Excerpt: \"Hambone\", Red Saunders Orchestra with the Hambone Kids]</p>\n<p>Now, I have to be a bit careful here, because here I'm talking about something that's from a different culture from my own, and my understanding of it is that of an outsider. To *me*, \"Hambone\" seems to be a unified thing that's part song, part dance, part game. But my understanding may be very, very flawed, and I don't want to pretend to knowledge I don't have. But this is my best understanding of what “Hambone” is.</p>\n<p>\"Hambone\", like many folk songs, is not in itself a single song, but a collection of different songs with similar elements. The name comes from a dance which, it is said, dates back to enslaved people attempting to entertain themselves. Slaves in most of the US were banned from using drums, because it was believed they might use them to send messages to each other, so when they wanted to dance and sing music, they would slap different parts of their own bodies to provide percussive accompaniment.</p>\n<p>Now, I tend to be a little dubious of narratives that claim that aspects of twentieth-century black culture date back to slavery or, as people often claim, to Africa. A lot of the time these turn out to be urban myths of the \"ring a ring a roses is about the bubonic plague\" kind. One of the real tragedies of slavery is that the African culture that the enslaved black people brought over to the US was largely lost in the ensuing centuries, and so there's a very strong incentive to try to find things that could be a continuation of that. But that's the story around “Hambone”, which is also known as the “Juba beat”.</p>\n<p>Another influence Diddley would always cite for the lyrical scansion is the song “Hey Baba Reba”, which he would usually misremember as having been by either Cab Calloway or Louis Jordan, but was actually by Lionel Hampton:</p>\n<p>[Excerpt: Lionel Hampton, “Hey Baba Reba”]</p>\n<p>But the important thing to note is that the rhythm of all these records is totally different from the rhythm of the song \"Bo Diddley\". There's a bit of misinformation that goes around in almost every article about Diddley, saying \"the Bo Diddley beat is just the 'Hambone' beat\", and while Diddley would correct this in almost every interview he ever gave, the misinformation would persist -- to the point that when I first heard \"Hambone\" I was shocked, because I'd assumed that there must at least have been some slight similarity. There's no similarity at all.</p>\n<p>And that's not the only song where I've seen claims that there's a Bo Diddley beat where none exists. As a reminder, here's the actual Bo Diddley rhythm:</p>\n<p>[Very short excerpt: Bo Diddley, “Bo Diddley”]</p>\n<p>Now the PhD thesis on the development of the backbeat which I talked about back in episode two claims that the beat appears on about thirteen records before Diddley's, mostly by people we've discussed before, like Louis Jordan, Johnny Otis, Fats Domino, and Roy Brown.</p>\n<p>But here's a couple of examples of the songs that thesis cites. Here's \"Mardi Gras in New Orleans\" by Fats Domino:</p>\n<p>[Excerpt: \"Mardi Gras in New Orleans, Fats Domino]</p>\n<p>And here's \"That's Your Last Boogie\", by Joe Swift, produced by Johnny Otis:</p>\n<p>[Excerpt: Joe Swift, \"That's Your Last Boogie\"]</p>\n<p>As you can hear, they both have something that's *sort of* the Bo Diddley beat, but not really, among their other rhythms. It's most notable at the very start of \"That's Your Last Boogie\"</p>\n<p>[Intro: \"That's Your Last Boogie\"]</p>\n<p>That's what's called a clave beat -- it's sort of like the tresillo, with an extra bom-bom on the end. Bom bom-bom, bom-bom. That's not the Bo Diddley beat. The Bo Diddley beat actually varies subtly from bar to bar, but it's generally a sort of chunk-a chunk-a-chunk a-chunk a-chunk ah. It certainly stresses the five beats of the clave, but it's not them, and nor is it the \"shave and a haircut, two bits\" rhythm other people seem to claim for it.</p>\n<p>Most ridiculously, Wikipedia even claims that the Andrews Sisters' version of Lord Invader's great calypso song, \"Rum and Coca Cola\", has the Bo Diddley beat:</p>\n<p>[Excerpt: \"Rum and Coca Cola\", the Andrews Sisters]</p>\n<p>Both records have maracas, but that's about it. Incidentally, that song was, in the Andrews Sisters version, credited to a white American thief rather than to the black Trinidadian men who wrote it. Sadly appropriate for a song about the exploitation of Trinidadians for \"the Yankee dollar\".</p>\n<p>But none of these records have the Bo Diddley beat, despite what anyone might say. None of them even sound very much like Diddley's beat at all.</p>\n<p>The origins of the Bo Diddley beat were, believe it or not, with Gene Autry. We've talked before about Autry, who was the biggest Western music star of the late thirties and early forties, and who inspired all sorts of people you wouldn't expect, from Les Paul to Hank Ballard. But Diddley hit upon his rhythm when trying to play Autry's \"I've Got Spurs That Jingle Jangle Jingle\".</p>\n<p>[excerpt, Gene Autry, \"I've Got Spurs that Jingle Jangle Jingle\"]</p>\n<p>No, I don't see the resemblance either. But this ties back into what we were talking about last week, with the influence of country musicians on the blues and R&B musicians at Chess.</p>\n<p>And if you become familiar with his later work, it becomes clear that Diddley truly loved the whole iconography of the Western, and country music. He did albums called \"Have Guitar Will Travel\" (named after the Western TV show \"Have Gun Will Travel\") and \"Bo Diddley is a Gunslinger\". Diddley's work is rooted in black folklore -- things like hambone, but also the figure of Stagger Lee and other characters like the Signifying Monkey -- but it should be understood that black American folklore has always included the image of the black cowboy.</p>\n<p>The combination of these influences – the “Hambone” lyrical ideas, the cowboy rhythm, and the swaggering character Diddley created for himself – became this:</p>\n<p>[Excerpt: “Bo Diddley” by Bo Diddley]</p>\n<p>The B-side to the record, meanwhile, was maybe even more important. It's also an early example of Diddley *not* just reusing his signature rhythm. The popular image of Diddley has him as a one-idea artist remaking the same song over and over again -- and certainly he did often return to the Bo Diddley beat -- but he was a far more interesting artist than that, and recorded in a far wider variety of styles than you might imagine. And in \"I'm A Man\" he took on another artist's style, beating Muddy Waters at his own game.</p>\n<p>\"I'm A Man\" was a response to Waters' earlier \"Hoochie Coochie Man\":</p>\n<p>[Excerpt: \"Hoochie Coochie Man\", Muddy Waters]</p>\n<p>\"Hoochie Coochie Man\" had been written for Muddy Waters by Willie Dixon and was, as far as I can tell, the first blues record ever to have that da-na-na na-na riff that later became the riff that for most people defines the blues.</p>\n<p>\"Hoochie Coochie Man\" had managed to sum up everything about Waters' persona in a way that Waters himself had never managed with his own songs. It combined sexual braggadocio with hoodoo lore -- the character Waters was singing in was possessed of supernatural powers, from the day he was born, and he used those powers to \"make pretty women jump and shout\". He had a black cat bone, and a mojo, and a John the Conqueror root.</p>\n<p>It was a great riff, and a great persona, and a great record. But it was still a conventionally structured sixteen-bar blues, with the normal three chords that almost all blues records have.</p>\n<p>But Bo Diddley heard that and decided that was two chords too many. When you've got a great riff, you don't *need* chord changes, not if you can just hammer on that riff. So he came up with a variant of Dixon's song, and called it \"I'm a Man\". In his version, there was only the one chord:</p>\n<p>[Excerpt: Bo Diddley, \"I'm a Man\"]</p>\n<p>Willie Dixon guested on bass for that song, as it wasn't felt that Diddley's own bass player was getting the feeling right. There were also some changes made to the song in the studio -- as Diddley put it later: \"They wanted me to spell 'man', but they weren't explaining it right. They couldn't get me to spell 'man'. I didn't understand what they were talking about!\"</p>\n<p>But eventually he did sing that man is spelled m-a-n, and the song went on to be covered by pretty much every British band of the sixties, and become a blues standard. The most important cover version of it though was when Muddy Waters decided to make his own answer record to Diddley, in which he stated that *he* was a man, not a boy like Diddley. Diddley got a co-writing credit on this, though Willie Dixon, whose riff had been the basis of \"I'm a Man\", didn't.</p>\n<p>[Excerpt: Muddy Waters, \"Mannish Boy\"]</p>\n<p>And then there was Etta James' answer record, \"W.O.M.A.N.\", which once again has wild west references in it:</p>\n<p>[Excerpt: Etta James, \"W.O.M.A.N.\"]</p>\n<p>And that… \"inspired\" Jerry Leiber and Mike Stoller to write this for Peggy Lee:</p>\n<p>[Excerpt: Peggy Lee, \"I'm A Woman\"]</p>\n<p>Of course, none of those records, except Muddy Waters', gave Bo Diddley a writing credit, just as Diddley didn't credit Dixon for his riff.</p>\n<p>At the same session as the single was recorded, Diddley's harmonica player, Billy Boy Arnold, recorded a single of his own, backed by Diddley and his band. \"I'm Sweet on you Baby\" wasn't released at the time, but it's a much more straightforward blues song, and more like Chess' normal releases. Chess were interested in making more records with Arnold, but we'll see that that didn't turn out well:</p>\n<p>[Excerpt: Billy Boy Arnold, \"I'm Sweet on you Baby\"]</p>\n<p>Despite putting out a truly phenomenal single, Diddley hit upon a real problem with his career, and one that would be one of the reasons he was never as popular as contemporaries like Chuck Berry. The problem, at first, looked like anything but. He was booked on the Ed Sullivan Show to promote his first single.</p>\n<p>The Ed Sullivan Show was the biggest TV show of the fifties and sixties. A variety show presented by the eponymous Sullivan, who somehow even after twenty years of presenting never managed to look or sound remotely comfortable in front of a camera, it was the programme that boosted Elvis Presley from stardom to superstardom, and which turned the Beatles from a local phenomenon in the UK and Europe into the biggest act the world had ever seen.</p>\n<p>Getting on it was the biggest possible break Diddley could have got, and it should have made his career. Instead, it was a disaster, all because of a misunderstanding.</p>\n<p>At the time, the country song \"Sixteen Tons\" by Tennessee Ernie Ford was a big hit:</p>\n<p>[Excerpt: \"Sixteen Tons\", Tennessee Ernie Ford]</p>\n<p>Diddley liked the song -- enough that he would later record his own version of it:</p>\n<p>[Excerpt: Bo Diddley, \"Sixteen Tons\"]</p>\n<p>And so he was singing it to himself in his dressing room. One of the production staff happened to walk past and hear him, and asked if he could perform that song on the show. Diddley assumed he was being asked if he would do it as well as the song he was there to promote, and was flattered to be asked to do a second song.</p>\n<p>[Excerpt: Ed Sullivan introducing \"Dr Jive\", with all the confusion about what words he's using]</p>\n<p>When he got out on to the stage he saw the cue card saying \"Bo Diddley Sixteen Tons\", assumed it meant the song \"Bo Diddley\" followed by the song \"Sixteen Tons\", and so he launched into \"Bo Diddley\". After all, why would he go on the show to promote someone else's record? He was there to promote his own debut single. So of course he was going to play it.</p>\n<p>This was not what the production person had intended, and was not what Ed Sullivan wanted. Backstage, there was a confrontation that got so heated that Diddley had to be physically restrained from beating Sullivan with his guitar after Sullivan called Diddley a “black boy” (according to Diddley, “black” at that time and in that place, was a racial slur, though it's the polite term to use today). Sullivan yelled and screamed at Diddley and told him he would be blacklisted from network TV, and would certainly never appear on Sullivan's show again under any circumstances. After that first TV appearance, it would be seven years until Diddley's second.</p>\n<p>And unlike all his contemporaries he didn't even get to appear in films. Even Alan Freed, who greatly respected Diddley and booked him on his live shows, and who Diddley also respected, didn't have him appear in any of the five rock and roll films he made. As far as I can tell, the two minutes he was on the Ed Sullivan show is the only record of Bo Diddley on film or video from 1955 through 1962.</p>\n<p>And this meant, as well, that Chess put all their promotional efforts behind Chuck Berry, who for all his faults was more welcome in the TV studios. If Diddley wanted success, he had to let his records and live performances do the work for him, because he wasn't getting any help from the media.</p>\n<p>Luckily, his records were great. Not only was Diddley's first hit one of the great two-sided singles of all time, but his next single was also impressive. The story of \"Diddley Daddy\" dates back to one of the white cover versions of \"Bo Diddley\". Essex Records put out this cover version by Jean Dinning, produced by Dave Miller, who had earlier produced Bill Haley and the Comets' first records:</p>\n<p>[Excerpt: Jean Dinning, \"Bo Diddley\"]</p>\n<p>And, as with Georgia Gibbs' version of “Tweedle Dee”, the record label wanted to make the record sound as much like the original as possible, and so tried to get the original musicians to play on it, and made an agreement with Chess. They couldn't get Bo Diddley himself, and without his tremelo guitar it sounded nothing like the original, but they *did* get Willie Dixon on bass, Diddley's drummer Clifton James (who sadly isn't the same Clifton James who played the bumbling sheriff in \"Live and Let Die\" and \"Superman II\", though it would be great if he was), and Billy Boy Arnold on harmonica.</p>\n<p>But Billy Boy Arnold made the mistake of going to Chess and asking for the money he was owed for the session. Leonard Chess didn't like when musicians wanted paying, and complained to Bo Diddley about Arnold. Diddley told Arnold that Chess wasn't happy with him, and so Arnold decided to take a song he'd written, \"Diddy Diddy Dum Dum\", to another label rather than give it to Chess. He changed the lyrics around a bit, and called it \"I Wish You Would\":</p>\n<p>[Excerpt: Billy Boy Arnold, \"I Wish You Would\"]</p>\n<p>Arnold actually recorded that for Vee-Jay Records on the very day that Bo Diddley's second single was due to be recorded, and the Diddley session was held up because nobody knew where Arnold was. They eventually found him and got him to Diddley's session -- where Diddley started playing \"Diddy Diddy Dum Dum\". Leonard Chess suggested letting Arnold sing the song, but Arnold said \"I can't -- I just recorded that for VeeJay\", and showed Chess the contract.</p>\n<p>Diddley and Harvey Fuqua, who was there to sing backing vocals with the rest of the Moonglows, quickly reworked the song. Arnold didn't want to play harmonica on something so close to a record he'd just made, though he played on the B-side, and so Muddy Waters' harmonica player Little Walter filled in instead. The new song, entitled \"Diddley Daddy\", became another of Diddley's signature songs:</p>\n<p>[Excerpt: Bo Diddley, \"Diddley Daddy\"]</p>\n<p>but the B-side, \"She's Fine, She's Mine\", was the one that would truly become influential:</p>\n<p>[Excerpt: Bo Diddley, \"She's Fine, She's Mine\"]</p>\n<p>That song was later slightly reworked into this, by Willie Cobbs:</p>\n<p>[Excerpt: Willie Cobbs, \"You Don't Love Me\"]</p>\n<p>That song was covered by pretty much every white guitar band of the late sixties -- the Grateful Dead, Quicksilver Messenger Service, the Allman Brothers, Steve Stills and Al Kooper... the list goes on. But Cobbs' song itself was also slightly reworked, by Dawn Penn, in 1967, and became a minor reggae classic. Twenty-seven years later, in 1994, Penn rerecorded her song, based on Cobbs' song, based on Bo Diddley's song, and it became a worldwide smash hit, with Diddley getting cowriting credit:</p>\n<p>[Excerpt: Dawn Penn, \"You Don't Love Me (No, No, No)\"]</p>\n<p>And *that* has later been covered by Beyonce and Rhianna, and sampled by Ghostface Killah and Usher. And that's how important Bo Diddley was at this point in time. The B-side to his less-good follow-up to his debut provided enough material for sixty years' worth of hits in styles from R&B to jam band to reggae to hip-hop.</p>\n<p>And the song “Bo Diddley” itself, of course, would provide a rhythm for generations of musicians to take, everyone from Buddy Holly:</p>\n<p>[Excerpt: Buddy Holly, “Not Fade Away”]</p>\n<p>to George Michael:</p>\n<p>[Excerpt George Michael, “Faith”]</p>\n<p>to U2:</p>\n<p>[Excerpt: U2, “Desire”]</p>\n<p>Because that rhythm was so successful – even though most of the success went to white people who didn't credit or pay Diddley – people tend to think of Diddley as a one-idea musician, which is far from the truth. Like many of his contemporaries he only had a short period where he was truly inventive -- his last truly classic track was recorded in 1962. But that period was an astoundingly inventive one, and we're going to be seeing him again during the course of this series. In his first four tracks, Diddley had managed to record three of the most influential tracks in rock history. But the next time we look at him, it will be with a song he wrote for other people -- a song that would indirectly have massive effects on the whole of popular music.</p>",
  "enclosure": "",
  "itunes:summary": "Welcome to episode thirty of A History of Rock Music in Five Hundred Songs. This is the last of our three-part look at Chess Records, and focuses on \"Bo Diddley\" by Bo Diddley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.I accidentally used a later rerecording of \"I Wish You Would\" by Billy Boy Arnold on the playlist, but I use the correct version in the podcast itself. Sorry about that.\nAs this is part three of the Chess Records trilogy, you might want to listen to part one, on the Moonglows, and part two, on Chuck Berry, if you haven't already.\nAlong with the resources mentioned in the previous two episodes, the resource I used most this time was Bo Diddley: Living Legend by George R. White, a strong biography told almost entirely in Diddley's own words from interviews, and the only full-length book on Diddley.\nThis compilation contains Diddley's first six albums plus a bunch of non-album and live tracks, and has everything you're likely to want by Diddley on it, for under ten pounds.\nIf you want to hear more Muddy Waters after hearing his back-and-forth with Diddley, this double CD set is a perfect introduction to him.\nPatreon\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\nTranscript\nWelcome to the final part of our trilogy about Chess Records. Last week, we looked at Chuck Berry. This week, we're going to deal with someone who may even have been more important.\nOne of the many injustices in copyright law -- and something that we'll have a lot of cause to mention during the course of this series -- is that, for the entire time period covered by this podcast, it was impossible to copyright a groove or a rhythm, but you could copyright a melody line and lyric. And this has led to real inter-racial injustice.\nIn general, black musical culture in the USA has emphasised different aspects of musical invention than white culture has. While white American musical culture -- particularly *rich* white musical culture -- has stressed inventive melodies and harmonic movement -- think of, say, Burt Bacharach or George Gershwin -- it has not historically stressed rhythmic invention. On the other hand, black musical culture has stressed that above everything else -- you'll notice that all the rhythmic innovations we've talked about in this series so far, like boogie woogie, and the backbeat, and the tresillo rhythm, all came from black musicians.\nThat's not, of course, to say that black musicians can't be melodically inventive or white musicians rhythmically -- I'm not here saying \"black people have a great sense of rhythm\" or any of that racist nonsense. I'm just talking about the way that different cultures have prioritised different things.\nBut this means that when black musicians have produced innovative work, it's not been possible for them to have any intellectual property ownership in the result. You can't steal a melody by Bacharach, but anyone can play a song with a boogie beat, or a shuffle, or a tresillo... or with the Bo Diddley beat.\n[Very short excerpt: “Bo Diddley”, Bo Diddley]\nElias McDaniel's distinctive sound came about because he started performing so young that he couldn't gain entrance to clubs, and so he and his band had to play on street corners. But you can't cart a drum kit around and use it on the streets, so McDaniel and his band came up with various inventive ways to add percussion to the act. At first, they had someone who would come round with a big bag of sand and empty it onto the pavement. He'd then use a brush on the sand, and the noise of the brushing would provide percussion -- at the end of the performance this man, whose name was Sam Daniel but was called Sandman by everyone, would sweep all the sand back up and put it back into his bag for the next show.\nEventually, though, Sandman l",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode thirty of A History of Rock Music in Five Hundred Songs. This is the last of our three-part look at Chess Records, and focuses on \"Bo Diddley\" by Bo Diddley. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nResources\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.I accidentally used a later rerecording of \"I Wish You Would\" by Billy Boy Arnold on the playlist, but I use the correct version in the podcast itself. Sorry about that.\nAs this is part three of the Chess Records trilogy, you might want to listen to part one, on the Moonglows, and part two, on Chuck Berry, if you haven't already.\nAlong with the resources mentioned in the previous two episodes, the resource I used most this time was Bo Diddley: Living Legend by George R. White, a strong biography told almost entirely in Diddley's own words from interviews, and the only full-length book on Diddley.\nT",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}