{
  "id": "yt:video:Sx9YhjiXdQg",
  "yt:videoId": "Sx9YhjiXdQg",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "“ONE WAY TICKET TO HELL” 1955 DRUG ADDICTION SCARE FILM   PART ONE    XD49854",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-10-31T19:30:03+00:00",
  "updated": "2022-10-31T19:30:03+00:00",
  "media:group": {
    "media:title": "“ONE WAY TICKET TO HELL” 1955 DRUG ADDICTION SCARE FILM   PART ONE    XD49854",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Want to support this channel and help us preserve old films? Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nPart 2: https://youtu.be/pM6lK4OQ4pM\n\nThis black and white, mono-sound fictional film is the first half of “One Way Ticket to Hell”, a drug addiction scare film that was apparently first released in late 1955 under the title \"Teenage Devil Dolls\".  It was made on a shoestring budget of $4000. The storyline spans from 1949-1952 and portrays a young girl named Cassandra Lee, who makes friends with the wrong crowd and becomes addicted to drugs. And as the story proceeds, she is caught in a downward spiral of addiction and crime. The film is directed, written, edited, and presented by B. Lawrence Price, Jr. (aka Bamlet Lawrence Price Jr. ) with photography by William R. Lieb and S. David Saxon, and is narrated by Kurt Martell. One critic described the film as \"an obscure, anti-drug, anti-juvenile delinquent anti-rebellion morality story, all told in not-so-glorious Dragnet style narration\".\n\nThe film begins with a written disclaimer on screen (00:09). A city view with buildings (00:34), and a hospital zone (00:54). A man named Chola Martinez is sitting inside a parked car outside the hospital (01:01). Cassandra Lee exits the hospital with her family and narcotics police officer David Jason (01:11). The family and officer Jason drives away, and Martinez follows (01:57). “One Way Ticket” title banner (02:34). The family arrives at the Southern Pacific train station, and Martinez continues following them on foot (04:55). People are waiting on the perron as the “Eastbound Limited” train arrives (05:44). *Three years earlier* Cassandra is driving on the back of Russel Packard’s motorcycle alongside a group of other riders with passengers (06:23). Cassandra is working as a stock girl (06:41) across from a motorcycle shop where she meets Russel and his friends (06:45). Cassandra’s mother yells when she sees Cassandra talking to Russel (07:02), and Cassandra escaped with Russel on his motorcycle (07:37). The group of friends sit down, and they smoke marijuana (07:48). Cassandra is sitting against a rock laughing and smoking marijuana (09:26). Cassandra’s old friend Johnny Adams waits for her outside of their high school campus, but she never shows up (09:59). The group of motorcycle riders driving (10:30). Cassandra waves goodbye to them, and runs towards Johnny, who was still waiting at nightfall (11:02). Johnny and Cassandra exit a church after getting married (11:35). To depict Cassandra’s discontentment with her new life, she angrily rips down clothing from a drying rack while drying (12:03). Johnny brings home a dog to make his wife happier (12:31). Cassandra arrives with a bus in town and meets with Russel (14:18). She drives with the group on motorcycles and smokes marijuana (14:42). She is fights with her husband (15:30). Russel and his friends bring Cassandra to a cocktail bar (15:54). Johnny is sleeping alone, as Cassandra arrives drunkenly in the middle of the night (16:29). Johnny finds and overturned trash can outside their home and discovers numerous empty pill bottles, and Cassandra is nearly unconscious in the backyard (18:00). Johnny calls for help, meanwhile Cassandra attempts to drive away and collides with a car outside their house (20:09). A police car drives Cassandra to her parents’ house after her arrest (21:10). She walks through town carrying a suitcase (21:50). Police officer David Jason follows her (22:16). Officer Jason and Cassandra are driving around town, helping each other look for Russel (23:50). Cassandra is working as a waitress at a drive-in restaurant, which also sells marijuana in secret (25:57). To police officers surveil the drive-in restaurant from an apartment (26:48). Cassandra is caught doing drugs she was supposed to sell (27:08). Police raids an apartments and arrest Cassandra and other youngsters (28:27). She is interrogated at the police station (29:10). Other groups of young criminals are arrested (30:31). \n\nThe film was shot in California. The music is composed and conducted by Robert Jackson Drasnin. Edith Gross is the script and screenplay supervisor, and Anthony Gorsline, Raymond Pearson, and Perry Grey were production assistants.  The cast consists of Barbara Marks as Cassandra Lee, Robert A. Sherry as Officer Jason, Robert Norman as Johnny Adams, William Kendell as Russel Packard, further including Elaine Lindenbaum, Joel Climenhaga, Lucille Price, B. L. Price, Sr., Victor Schwartz, Anthony Gorsline, B. Lawrence Prince, Jr., and Joe Popavich. \n\nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}