{
  "title": "S14 Ep104: Supernatural News/Parashare: Seasons Greetings Edition",
  "link": "https://audioboom.com/posts/8098526",
  "itunes:episode": 104,
  "itunes:title": "Supernatural News/Parashare: Seasons Greetings Edition",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 8101,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the DARKNESS Supernatural News ParaShare Seasons Greetings Edition with Dave Schrader & Tim Dennis!<br>\n<br>\nTexas invites us to view its black hole, we witness Ghosts in Fancy Dress, Boos at a Brothel PLUS Your Calls and emails of Paranormal Encounters!<br>\n<br>\nGet your cool paranormal swag here: <a href=\"https://www.amazon.com/shop/darknessradiodave\">https://www.amazon.com/shop/darknessradiodave</a><br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nAre you playing along with Beyond the Darkness on the Podcast One/ <a href=\"http://Betonline.AG\">Betonline.AG</a> Sportsnet Challenge?!  Each Week Dave and Tim are picking the winners of five NFL gam,es and playing against the hosts of different Podcast One shows!  If you play aloing with Dave and Tim on <a href=\"http://BetOnline.AG\">BetOnline.AG</a>, and they win the week, you qualify to be one of five winners splitting a $500 weekly prize! To sign up go to <a href=\"https://promotions.betonline.ag/podcastone\">https://promotions.betonline.ag/podcastone</a><br>\n<br>\nPluto TV is the leading free streaming television service. Watch over 100 TV channels and 1000s of movies on demand all completely free.  You can download Pluto TV for free on all of your favorite devices today including your phone, Roku, Amazon Fire TV, Apple TV, Smart TVs, Playstation and anywhere else you stream.<br>\n<br>\nDo you experience stress?  Or have anxiety…Or chronic pain ...Or have trouble sleeping at least once a week? You’re NOT alone! Feals is a better way to feel better. Our premium CBD will keep your head clear and help you feel your best. Become a member today by going to <a href=\"http://Feals.com/darkness\">Feals.com/darkness</a> and you'll get 50% off your first order with free shipping.  <br>\n<br>\nWe all know mental health is a big part of self-care. But changing mental habits is easier said than done. Luckily, Talkspace online therapy gives you a convenient and affordable way to improve your mental health.  Our listeners can get $100 off their first month by using code DARKNESS at <a href=\"http://talkspace.com\">talkspace.com</a> right now!",
  "itunes:summary": "BEYOND the DARKNESS Supernatural News ParaShare Seasons Greetings Edition with Dave Schrader & Tim Dennis!\n\nTexas invites us to view its black hole, we witness Ghosts in Fancy Dress, Boos at a Brothel PLUS Your Calls and emails of Paranormal...",
  "pubDate": "Sat, 21 Dec 2019 10:00:00 +0000",
  "guid": "2742b0a2-c414-4dc5-bb18-56aa4c39b3cf",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}