{
  "title": "Elections and Demography: A Final Look at the Polls",
  "link": "https://www.aei.org/politics-and-public-opinion/elections-and-demography-a-final-look-at-the-polls/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 03 Nov 2022 16:04:46 +0000",
  "category": [
    "Politics and Public Opinion",
    "Demographics",
    "Elections",
    "Midterm elections",
    "Politics and Public Opinion Responses on Polling",
    "Polls"
  ],
  "guid": "https://www.aei.org/?p=1008664679",
  "description": "<p>In this final edition of an AEIdeas series on elections and demography, Republicans are increasing their lead in the generic ballot just before the elections on November 8.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-a-final-look-at-the-polls/\">Elections and Demography: A Final Look at the Polls</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"2554\" height=\"546\" src=\"https://www.aei.org/wp-content/uploads/2022/10/AEI-Elections-Demography-banner.jpg?x91208\" alt=\"\" class=\"wp-image-1008662428\"/></figure>\n\n\n\n<p>This is the final pre-election issue of an AEIdeas series that focuses on elections and demographic voting patterns. After the election, we will look at what we learned from the 2022 results and move forward to future elections in 2023 and 2024. During the 2022 campaign, we have looked weekly at demographic subgroup averages from a month of polls.</p>\n\n\n\n<p>Since this project began in July, midterm momentum has swung back and forth several times. Republicans entered the summer in an incredibly strong position, before Democrats came roaring back in late July and August. Surprising special election results offered even more summer optimism for congressional Democrats. Just as pundits were ready to declare 2022 a midterm akin to 1998 and 2002, Republicans picked up the momentum again. With millions of votes already cast, our final averages offer a snapshot of polling demographics before Election Day. Republicans appear poised to win the generic ballot: The most recent high-quality polls suggest somewhere in the range of 2–4 points. The swings we have seen over the summer and fall may seem small, but they could make a difference of 10 or 20 seats in the House—and several Senate seats.</p>\n\n\n\n<p>Any polling discussion is incomplete without recognizing the intense difficulties facing even the most reputable pollsters. After a couple cycles with significant polling errors, the total number of surveys fell dramatically this year. District-level polls were nearly non-existent. Nate Cohn of the <em>New York Times</em> has noted that response rates have cratered, particularly among Republican-leaning voters. This has made polling even more time consuming and expensive.</p>\n\n\n\n<p>Between opaque methodologies and differential response rates, neutral aggregators like our own are all the more essential.</p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" width=\"565\" height=\"630\" src=\"https://www.aei.org/wp-content/uploads/2022/11/image-1.png?x91208\" alt=\"\" class=\"wp-image-1008664715\"/></figure></div>\n\n\n<p><strong>Key Findings</strong></p>\n\n\n\n<ul><li>After retaking the generic ballot lead last week, Republicans increased their edge by a half-point this week. Compared to our late September average, Republicans have picked up 3.6 points—a profound swing for just a month-long difference.</li><li>Since the Democratic peak in September, women have moved sharply towards Republicans. While President Biden carried women by 13 points in 2020, the Democratic advantage today is down to just 6.4 points. This week’s <a href=\"https://s3.documentcloud.org/documents/23257500/cnn-poll.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">CNN/SSRS poll</a> has Democrats up just 6 points among women and <a href=\"https://maristpoll.marist.edu/wp-content/uploads/2022/11/NPR_PBS-NewsHour_Marist-Poll_USA-NOS-and-Tables_202210281214.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">NPR/PBS/Marist</a> shows just a 4-point Democratic lead with them. Prospects for a <em>Dobbs</em>-generated gender shift towards Democrats have evaporated in recent weeks. It now appears incredibly unlikely that congressional Democrats will match Biden’s margin with women on Tuesday.</li><li>White college voters also standout in the recent rightward shift. Once a double-digit lead, the Democratic advantage has shrunk over the past few weeks. <a href=\"https://www.monmouth.edu/polling-institute/region/national/\" target=\"_blank\" rel=\"noreferrer noopener\">Monmouth</a> and CNN/SSRS actually have Democrats <em>losing </em>white college voters in their most recent polls. As inflation and the economy have moved front of mind, some white college voters—perhaps once motivated by abortion—now plan to vote for Republicans.</li><li>Generally, our data indicate that educational polarization will be a huge factor in this election, just as it was in 2020. Our average shows, as have many individual polls, support among college-educated and non-college voters being almost mirror images of each other—an advantage for Democrats among the college-educated being matched by an almost equal deficit among non-college voters.</li><li>Even as most pollsters have shifted to likely voter screens, almost 14 percent of Hispanic voters remain undecided. With Democrats stuck at just a 19-point margin among them, these late-deciding voters could make or break Democratic chances in several essential contests—particularly Senate races in Arizona and Nevada. As we noted last week, however, undecideds appear to be moving towards Republicans.</li><li>The Democrats’ margin among black voters also is running far under the advantage Democrats have enjoyed in previous elections.</li></ul>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full\"><img loading=\"lazy\" width=\"700\" height=\"738\" src=\"https://www.aei.org/wp-content/uploads/2022/11/image.png?x91208\" alt=\"\" class=\"wp-image-1008664682\"/></figure></div>\n\n\n<p><em>Previous election data is drawn from Catalist crosstab estimates. Catalist is a Democratic data analytics organization.</em></p>\n\n\n\n<p><em>*How we did this: This month-long average is a compilation of online and live-caller polls that release crosstabs. Internal and explicitly partisan polls are excluded. This edition averages polls from Monmouth University, Grinnell College/Selzer & Company, Economist/YouGov, Morning Consult/Politico, Harvard/Harris, CBS News, Emerson, Marist, Yahoo News, Rasmussen, Echelon Insights, Marist College/NPR/PBS NewsHour, New York Times/Siena College, and Fox News.</em></p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-undecideds-break-for-republicans/\">Elections and Demography: Undecideds Break for Republicans</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-democrats-lose-ground-need-strong-turnout/\">Elections and Demography: Democrats Lose Ground, Need Strong Turnout</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections/elections-and-demography-one-month-to-go/\">Elections and Demography: One Month to Go</a> | <a href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-signs-of-a-tightening-race/\">Elections and Demography: Signs of a Tightening Race</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/politics-and-public-opinion/elections-and-demography-a-final-look-at-the-polls/\">Elections and Demography: A Final Look at the Polls</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}