{
  "itunes:episode": 62,
  "title": "Retooling Cool With Kevin Kelly",
  "pubDate": "Thu, 13 Feb 2014 15:04:24 +0000",
  "link": "http://newdisrupt.org/blog/2014/2/13/whole-earth-pun-with-kevin-kelly-episode-62",
  "description": "<p>Kevin Kelly's <em><a href=\"http://kk.org/books/cool-tools-a-catalog-of-possibilities.php\">Cool Tools</a></em> re-imagines the <em><a href=\"http://www.wholeearth.com/index.php\">Whole Earth Catalog</a></em>, of which he was an editor and publisher, for the Internet era: crowdsourced, crowdmade, crowdmanaged. He's been on the Internet for as long as there's been an Internet for all us to get on. He was part of the founding team of <em>Wired</em> magazine, and the author of many inspiring books and essays about technological change and self-empowerment, including \"<a href=\"http://kk.org/thetechnium/archives/2008/03/1000_true_fans.php\">1,000 True Fans</a>.\" We talk about collaboration, old and new technology, and making books.</p>\n\n<p>We had a full transcript of this interview made, which also has sources linked in for further reading.</p>\n\n<p>Sponsored by:</p>\n\n<p><a href=\"http://www.TheFogHornMagazine.com/?utm_source=newdisruptors&utm_medium=podcast&utm_campaign=advert\">The Fog Horn</a>: A new short fiction magazine for the iPhone, iPad and iPod Touch. Four stories a month, 12 issues a year from exciting Hollywood writers and new voices. Free 7-day trial.\n\n<p><a href=\"http://www.lynda.com/promo/trial/Default.aspx?lpk35=5865&utm_medium=podcast&utm_source=tnd&utm_campaign=link-sponsor-notes\">lynda.com</a>: Over 2,000 high-quality and engaging video courses taught by industry experts — with new courses added daily. Listeners get a free 7-day trial with full access to all content by visiting <a href=\"http://www.lynda.com/promo/trial/Default.aspx?lpk35=5865&utm_medium=podcast&utm_source=tnd&utm_campaign=link-sponsor-notes\">lynda.com/tnd</a> and signing up.</p>\n\n<p><a href=\"http://mediatemple.net/?utm_source=thenewdisruptors&utm_medium=banner&utm_content=feb_podcast&utm_campaign=general\">Media Temple</a>: Web hosting for artists, designers, and Web developers since 1998. Media Temple hosts beautiful websites and great ideas. Use code \"tnd\" to get 25% off your first month.</p>\n",
  "guid": "tag:soundcloud,2010:tracks/134545568",
  "enclosure": "",
  "itunes:image": "",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:duration": "01:13:21",
  "itunes:subtitle": "Kevin Kelly's Cool Tools re-imagines the Whole Earth Catalog.",
  "itunes:summary": "Kevin Kelly's Cool Tools re-imagines the Whole Earth Catalog, of which he was an editor and publisher, for the Internet era: crowdsourced, crowdmade, crowdmanaged. He's been on the Internet for as long as there's been an Internet for all us to get on. He was part of the founding team of Wired magazine, and the author of many inspiring books and essays about technological change and self-empowerment, including \"1,000 True Fans.\" We talk about collaboration, old and new technology, and making books.\n\nWe had a full transcript of this interview made, which also has sources linked in for further reading. https://medium.com/the-magazine/2f18c20498e4\n\nSponsored by:\n\nThe Fog Horn: A new short fiction magazine for the iPhone, iPad and iPod Touch. Four stories a month, 12 issues a year from exciting Hollywood writers and new voices. Free 7-day trial. http://TheFogHornMagazine.com/tnd\n\nlynda.com: Over 2,000 high-quality and engaging video courses taught by industry experts — with new courses added daily. Listeners get a free 7-day trial with full access to all content by visiting http://lynda.com/tnd and signing up. \n\nMedia Temple: Web hosting for artists, designers, and Web developers since 1998. Media Temple hosts beautiful websites and great ideas. Use code \"tnd\" to get 25% off your first month. http://bit.ly/LXoVkt"
}