{
  "title": "Anthony Mackie | Stone Cold Steve Austin | Therapy Sparring Session",
  "description": "<p>Subscribe, Rate, and Leave a Review!\n\n-Update on the bodybuilder who we talked about that married his sex doll is now cheating on her\n-Another body builder had a freak accident after falling down a spiral staircase\n-KFC designs the new Modern Home\n-Updates on the Armie Hammer allegations of cannibalism\n-AITA Thursday\n-Voicemails\n\n(01:37:30) Anthony Mackie joins the show. We chop it up with Anthony about how New Yorkers need to get out of New Orleans, how his Juliard training became useful joining the Avengers, the thrill of starring in action movies, Will Smith punching him in the face, the iconic scenes of 8 Mile, Captain America, and much more.\n\n(02:10:45) Stone Cold Steve Austin returns to the show! We talk about his new season of Straight Up with Steve Austin and how much fun it was to hang out with Bert Kreischer. We discuss his transition out of wrestling and into entertainment, the infamous Rock and Mankind chair match, Jake Paul attempting to bait Conor McGregor into a fight, and much more.\n\nLet us know what you think on twitter:\n@KFCRadio @KFCBarstool @Feitsbarstool @AnthonyMackie @SteveAustinBSR \n\nSubscribe to the KFC Radio Youtube Channel for the full podcast:\n\nwww.youtube.com/c/kfcradio\n\n\nSubscribe to the KFC Radio Clips Youtube Channel for the best clips:\n\nhttps://www.youtube.com/channel/UCspldj_2KhBix7eVxe2H8xg\n\nIf you've read to this point, let me know on twitter @nickhammy. I'm genuinely curious.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/kfcr\">barstool.link/kfcr</a></p>",
  "guid": "95e3a08c-714f-4eba-a2d0-ab6685e60d5c",
  "pubDate": "Thu, 14 Jan 2021 09:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/kfc-radio",
  "itunes:explicit": "yes",
  "itunes:duration": "02:36:08",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}