{
  "title": "64: Richard Diedrichs- Living in Blue Sky Mind: Living in Blue Sky Mind: Basic Buddhist Teachings for a Happy Life",
  "pubDate": "Thu, 08 Dec 2016 06:34:52 +0000",
  "guid": "aa59fd5e0649c0e1df32de58323abe27",
  "link": "https://lifeonpurpose.libsyn.com/64-richard-diedrichs-living-in-blue-sky-mind-living-in-blue-sky-mind-basic-buddhist-teachings-for-a-happy-life",
  "itunes:image": "",
  "description": "<p>For <strong>Life on Purpose Episode #64</strong>, my guest is Zen priest and teacher <strong>Richard Diedrichs</strong>, whose work presents basic Buddhist teachings that keep you on the wholesome path of self-realization toward a happy life.<br /> <br /> <strong>Richard</strong> joined me for an inspiring chat about his new book <em><strong>Living in Blue Sky Mind: Basic Buddhist Teachings for a Happy Life</strong></em>, in which he offers simple lessons, anecdotes of personal transformation, and reflective questions to guide us along Buddha’s enlightened way.<br /> <br /> We also discussed the opportunity to learn, grow, and practice these principles when host Greg mistakenly lost the audio file of the original interview that was taped and had to admit his mistake and request a second interview.<br /> <br /> Says <strong>Richard</strong> about the book: <em>“Living in Blue Sky Mind began as short talks that I gave to children, parents, and grandparents at Daifukuji Zen Buddhist temple in Kona, Hawaii.  (For the youngest among us in the family gatherings, I read a children's picture book.) To further spread the Dharma, I had the idea of publishing the talks in a blog that I called, \"I Can See Clearly Now.\"</em><br /> <br /> <em>By the time I published about a hundred talks as posts, the blog had amassed nearly twelve thousand views.  Like myself, I think people are searching for ways in which they can think, say, and do things that bring caring and wisdom into their lives and into the lives of everyone around them.  We all want to be happy!”</em><br /> <br /> About: We live with minds as open and spacious as the deep blue sky. <strong>Living in Blue Sky Mind</strong> presents basic Buddhist teachings that keep us on the wholesome path of self-realization and oriented toward a happy life. Zen priest and teacher, Richard Gentei Diedrichs, offers simple lessons, anecdotes of personal transformation, and reflective questions to guide us along Buddha’s enlightened way.<br /> <br /> <strong>Richard Gentei Diedrichs</strong> grew up in Los Angeles. He edited travel and health magazines in Seattle, worked as an editor at the schools of Engineering and Public Health at the University of California, Berkeley, and then taught in public elementary schools in the San Francisco Bay Area.<br /> <br /> The author of four books, <strong>Richard</strong> was fully ordained a Zen priest in 1990 by Genki Takabayashi Roshi. Currently, he is a Dharma teacher at Daifukuji Zen Temple in Hawaii.<br /> <br /> To learn more about <strong>Richard</strong> and his work, visit: https://richardgenteidiedrichs.wordpress.com/ or https://livinginblueskymind.com/.</p>",
  "content:encoded": "<p>For Life on Purpose Episode #64, my guest is Zen priest and teacher Richard Diedrichs, whose work presents basic Buddhist teachings that keep you on the wholesome path of self-realization toward a happy life.  Richard joined me for an inspiring chat about his new book <em>Living in Blue Sky Mind: Basic Buddhist Teachings for a Happy Life</em>, in which he offers simple lessons, anecdotes of personal transformation, and reflective questions to guide us along Buddha’s enlightened way.  We also discussed the opportunity to learn, grow, and practice these principles when host Greg mistakenly lost the audio file of the original interview that was taped and had to admit his mistake and request a second interview.  Says Richard about the book: <em>“Living in Blue Sky Mind began as short talks that I gave to children, parents, and grandparents at Daifukuji Zen Buddhist temple in Kona, Hawaii.  (For the youngest among us in the family gatherings, I read a children's picture book.) To further spread the Dharma, I had the idea of publishing the talks in a blog that I called, \"I Can See Clearly Now.\"</em>  <em>By the time I published about a hundred talks as posts, the blog had amassed nearly twelve thousand views.  Like myself, I think people are searching for ways in which they can think, say, and do things that bring caring and wisdom into their lives and into the lives of everyone around them.  We all want to be happy!”</em>  About: We live with minds as open and spacious as the deep blue sky. Living in Blue Sky Mind presents basic Buddhist teachings that keep us on the wholesome path of self-realization and oriented toward a happy life. Zen priest and teacher, Richard Gentei Diedrichs, offers simple lessons, anecdotes of personal transformation, and reflective questions to guide us along Buddha’s enlightened way.  Richard Gentei Diedrichs grew up in Los Angeles. He edited travel and health magazines in Seattle, worked as an editor at the schools of Engineering and Public Health at the University of California, Berkeley, and then taught in public elementary schools in the San Francisco Bay Area.  The author of four books, Richard was fully ordained a Zen priest in 1990 by Genki Takabayashi Roshi. Currently, he is a Dharma teacher at Daifukuji Zen Temple in Hawaii.  To learn more about Richard and his work, visit: https://richardgenteidiedrichs.wordpress.com/ or https://livinginblueskymind.com/.</p>",
  "enclosure": "",
  "itunes:duration": "57:03",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "For Life on Purpose Episode #64, my guest is Zen priest and teacher Richard Diedrichs, whose work presents basic Buddhist teachings that keep you on the wholesome path of self-realization toward a happy life.  Richard joined me for an inspiring chat..."
}