{
  "title": "US is not invincible – Iran",
  "link": "https://www.rt.com/news/565835-us-not-invincible-iran/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565835-us-not-invincible-iran/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362c41e85f54005914ce3ec.jpg\" /> Despite seeming to be an “untouchable power,” the US has its weaknesses, Iran’s Supreme Leader Ayatollah Ali Khamenei has said <br/><a href=\"https://www.rt.com/news/565835-us-not-invincible-iran/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The 1979 US embassy takeover shows the country can be “vulnerable,” Ayatollah Ali Khamenei has said</strong></p>\n            \n                        \n            <p>The US is not as invincible as it might seem, Iranian Supreme Leader Ayatollah Ali Khamenei told students on Wednesday ahead what is called the National Day of Fight against Global Arrogance, celebrated on November 4.</p>\n<p><em>&ldquo;Some think that America is an untouchable power, but if we look at the events of this day [November 4], it turns out that no, it is completely vulnerable,&rdquo;</em> Khamenei said, referring to the 1979 US embassy takeover, which was carried out by a Muslim student movement.</p>\n<p>A total of 52 US diplomats and their family members were taken hostage in the incident and were only released 444 days later, on January 20, 1981.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63628b572030270e804a699c.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565824-white-house-iran-saudi-tensions/\">US weighs in on key ally's tensions with Iran</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Yet, according to Khamenei, this was not the event that triggered the decades-long rivalry between Washington and Tehran. The turning point in relations between the two nations had come almost three decades earlier when the US, together with the UK, orchestrated a coup that overthrew the government of the Iranian prime minister, Mohammad Mosaddegh, the supreme leader said.</p>\n<p>The US and its British allies sought to control Iran&rsquo;s oil reserves, and that is why they turned against Mosaddegh, who was not an advocate of Islamic rule, Khamenei argued.</p>\n<p>Mosaddegh&rsquo;s government had sought to audit the Anglo-Iranian Oil Company, which was controlled by the British, to verify that it was paying the contracted royalties to Iran. The company refused to cooperate, prompting the Iranian parliament to nationalize the oil industry altogether. The UK and US then used their leverage to undermine Mosaddegh&rsquo;s government through their agents in Iran.</p>\n<p>The US formally acknowledged its role in the coup back in 2013, when it released a trove of previously unpublished documents related to the case.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 16:08:51 +0000",
  "dc:creator": "RT"
}