{
  "id": "yt:video:Ih3aBGxWzJA",
  "yt:videoId": "Ih3aBGxWzJA",
  "yt:channelId": "UCMm211NGh4Ls5SAMZJF7E8A",
  "title": "SM64 - Snowman's Big Head - No Buttons Allowed",
  "link": "",
  "author": {
    "name": "pannenkoek2012",
    "uri": "https://www.youtube.com/channel/UCMm211NGh4Ls5SAMZJF7E8A"
  },
  "published": "2015-07-30T04:32:14+00:00",
  "updated": "2022-05-20T14:08:37+00:00",
  "media:group": {
    "media:title": "SM64 - Snowman's Big Head - No Buttons Allowed",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "I collect the star Snowman's Big Head in Snowman's Land without using any buttons (I only use the joystick and adjust the camera angle).\n\nHere are the specifics of what I do. I first moved a moneybag all the way over to the shell's item block, duplicated the moneybag excessively, and then rode over to the shell by repeatedly bouncing on the moneybags. From there, I use the shell to gain hyper speed in order to reenter fly guy's zone exactly in front of him, causing him to lunge forwards. I then move far away enough from fly guy to deactivate him. Note that in order to manipulate fly guy, he needs to be deactivated 2000+ units away from his starting point, so to accomplish this, it was necessary to have him lunge away and then quickly deactivate him before he turned back. From there, I repeatedly manipulate fly guy to transport him closer to the snowman. Then I climb the snowman, reactivate fly guy, and bounce on him as he flies by. The twirl from bouncing on him provided Mario with enough height to get onto the snowman's head to collect the star.\n\n.m64 stats:\nLength: 41 minutes and 18 seconds\nRe-records: 9309 [2431 since branching off]\nFrames: 148695 (73950 input)\nTime to Make: 12 hours [5 hours since branching off]\n\nThe song I used was Sword Lord's remix of the William tell Overture, which can be found at: http://youtu.be/P7svUxY2Gns.\n\nTo see more of my No Buttons Allowed videos, you can go to my playlist of them here: https://www.youtube.com/playlist?list=SPmvvhlevqC2fXLL55ZQT1cesNmM2qHPn1",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}