{
  "title": "Photon Rings Around Warped Black Holes. (arXiv:2211.01674v1 [gr-qc])",
  "link": "http://arxiv.org/abs/2211.01674",
  "description": "<p>The black hole photon ring is a prime target for upcoming space-based VLBI\nmissions seeking to image the fine structure of astrophysical black holes. The\nclassical Lyapunov exponents of the corresponding nearly bound null geodesics\ncontrol the quasinormal ringing of a perturbed black hole as it settles back\ndown to equilibrium, and they admit a holographic interpretation in terms of\nquantum Ruelle resonances of the microstate dual to the Kerr black hole. Recent\nwork has identified a number of emergent symmetries related to the intricate\nself-similar structure of the photon ring. Here, we explore this web of\ninterrelated phenomena in an exactly soluble example that arises as an\napproximation to the near-extremal Kerr black hole. The self-dual warped\nAdS$_3$ geometry has a photon ring as well as $\\mathsf{SL}(2,\\mathbb{R})$\nisometries and an exactly calculable quasinormal mode (QNM) spectrum. We show\nexplicitly that the geometric optics approximation reproduces the eikonal limit\nof the exact QNM spectrum, as well as the approximate \"near-ring\"\nwavefunctions. The $\\mathsf{SL}(2,\\mathbb{R})$ isometries are directly related\nto the emergent conformal symmetry of the photon ring in black hole images but\nare distinct from a recently discussed conformal symmetry of the eikonal QNM\nspectrum. The equivalence of the classical QNM spectrum -- and thus the photon\nring -- to the quantum Ruelle resonances in the context of a spacetime with a\nputative holographic dual suggests that the photon ring of a warped black hole\nis indeed part of the black hole hologram.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/gr-qc/1/au:+Kapec_D/0/1/0/all/0/1\">Daniel Kapec</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Lupsasca_A/0/1/0/all/0/1\">Alexandru Lupsasca</a>, <a href=\"http://arxiv.org/find/gr-qc/1/au:+Strominger_A/0/1/0/all/0/1\">Andrew Strominger</a>"
}