{
  "title": "243: How to GET UP from Setbacks with Dr. Heather Smith-Fernandez",
  "pubDate": "Mon, 09 Aug 2021 19:23:36 +0000",
  "guid": "b4f166c1-5500-4202-b5b6-0a5ef7949274",
  "link": "https://sites.libsyn.com/94610/243-how-to-get-up-from-setbacks-with-dr-heather-smith-fernandez",
  "itunes:image": "",
  "description": "<p>How do you get back up after a setback?<br /> <br /> There’s a success quote that says the key to success is falling down seven times but getting back up eight. It’s a message of resilience. But how do you get back up when you’ve been knocked down in business, relationships, or even your health? Is there a strategy to getting back up?</p> <p>We have a very special guest, Dr. Heather Smith-Fernandez, today to talk about the steps you can take to get up after a setback. She’s the founder and director at the Regenerative Institute and is the inventor of Peptology, a non-invasive treatment protocol to help repair and restore health on a cellular level.</p> <p>Everyone gets knocked down. What matters is how you get back up and what you do after falling. If you’re dealing with a setback right now, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "content:encoded": "<p>How do you get back up after a setback?  There’s a success quote that says the key to success is falling down seven times but getting back up eight. It’s a message of resilience. But how do you get back up when you’ve been knocked down in business, relationships, or even your health? Is there a strategy to getting back up?</p> <p>We have a very special guest, Dr. Heather Smith-Fernandez, today to talk about the steps you can take to get up after a setback. She’s the founder and director at the Regenerative Institute and is the inventor of Peptology, a non-invasive treatment protocol to help repair and restore health on a cellular level.</p> <p>Everyone gets knocked down. What matters is how you get back up and what you do after falling. If you’re dealing with a setback right now, this episode is for you.</p> <p class=\"p1\">*** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. ***</p>",
  "enclosure": "",
  "itunes:duration": "19:35",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you get back up after a setback?  There’s a success quote that says the key to success is falling down seven times but getting back up eight. It’s a message of resilience. But how do you get back up when you’ve been knocked down in...",
  "itunes:episodeType": "full"
}