{
  "title": "SADIE CROWELL WANTS TO TAME JOSH RICHARDS — BFFs EP. 95",
  "description": "<p>We start the show with heavily requested guest Sadie Crowell, who has history with both Bri, and Josh. We go through her and Josh’s beef originating in him flaking on her, her relationship with Baylen Levine, hanging out in Nashville with Tayler Holder, if she has anything going on with Rocky Yarbrough, and what happened with her and a certain enemy of the pod. We finish with a game of FMK that pits DILFs, Tik Tok stars, and her friends up against each other.\n\nWe then get into headlines with the big story of Yung Gravy and Sheri Nicole making out at the VMA’s. We talk about who is at fault, how it is impacting Addison, Monty’s reaction, Dave’s beef with Monty after last week’s pod, Taylor Swift’s VMA redemption, and go through all the VMA looks.\n\nWe continue with Charli and Heidi D’Amelio joining Dancing With The Stars, Bryce Hall continuing to beef with Tayler Holder, KSI fighting two people at once, Austin Mahones clarifying why he tried to steal Amanda Diaz from Kio, Gabbie Hanna going wild on Tik Tok, Olivia Wilde lying about Shia Lebouf’s firing, and reacting to Harry Styles acting.\n\nWe finish with BFFs corner where we figure out whether or not Josh is making a disstrack with Landon Barker, and get to the bottom of whose house Josh was at when he filmed his response to not looking at Nessa in Canada. \n\nSupport Our Sponsors!\nTakis : Try Takis and face the intensity!\nBirddogs: Go to https://barstool.link/BirddogsBSS and use promo code BFF for a free Birddogs rope hat!</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "a770e0b1-b8e5-484d-871f-27ac25a595cd",
  "pubDate": "Thu, 1 Sep 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "00:59:56",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}