{
  "title": "The double white dwarf merger progenitors of SDSS J2211+1136 and ZTF J1901+1458. (arXiv:2208.09506v2 [astro-ph.SR] UPDATED)",
  "link": "http://arxiv.org/abs/2208.09506",
  "description": "<p>Double white dwarf (DWD) mergers are possibly the leading formation channel\nof massive, rapidly rotating, high-field magnetic white dwarfs (HFMWDs).\nHowever, the direct link connecting a DWD merger to any observed HFMWD is still\nmissing. We here show that the HFMWDs SDSS J221141.80+113604.4 (hereafter\nJ2211+1136) and ZTF J190132.9+145808.7 (hereafter J1901+1458), might be DWD\nmerger products. J2211+1136 is a $1.27\\, M_\\odot$ WD with a rotation period of\n$70.32$ s and a surface magnetic field of $15$ MG. J1901+1458 is a\n$1.327$--$1.365\\, M_\\odot$ WD with a rotation period of $416.20$ s, and a\nsurface magnetic field in the range $600$--$900$ MG. With the assumption of\nsingle-star evolution, the currently measured WD masses and surface\ntemperatures, the cooling ages of J2211+1136 and J1901+1458 are, respectively,\n$2.61$--$2.85$ Gyr and $10$--$100$ Myr. We hypothesize that these WDs are DWD\nmerger products and compute the evolution of the post-merged configuration\nformed by a central WD surrounded by a disk. We show that the post-merger\nsystem evolves through three phases depending on whether accretion, mass\nejection (propeller), or magnetic braking dominates the torque onto the central\nWD. We calculate the time the WD spends in each of these phases and obtain the\naccretion rate and disk mass for which the WD rotational age, i.e., the total\ntime elapsed since the merger to the instant where the WD central remnant\nreaches the current measured rotation period, agrees with the estimated WD\ncooling age. We infer the mass values of the primary and secondary WD\ncomponents of the DWD merger that lead to a post-merger evolution consistent\nwith the observations.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Sousa_M/0/1/0/all/0/1\">M. F. Sousa</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Coelho_J/0/1/0/all/0/1\">J. G. Coelho</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Araujo_J/0/1/0/all/0/1\">J. C. N. de Araujo</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kepler_S/0/1/0/all/0/1\">S. O. Kepler</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rueda_J/0/1/0/all/0/1\">J. A. Rueda</a>"
}