{
  "id": "yt:video:_golgUfke8Q",
  "yt:videoId": "_golgUfke8Q",
  "yt:channelId": "UCMjTcpv56G_W0FRIdPHBn4A",
  "title": "100k Q&A",
  "link": "",
  "author": {
    "name": "Biblaridion",
    "uri": "https://www.youtube.com/channel/UCMjTcpv56G_W0FRIdPHBn4A"
  },
  "published": "2021-08-25T16:30:02+00:00",
  "updated": "2022-06-04T22:40:10+00:00",
  "media:group": {
    "media:title": "100k Q&A",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "In which I come across as overly stern for some reason, spend too much time complaining about Alien Biospheres, and say \"like I said\" a lot.\n\nPATREON: https://www.patreon.com/biblaridion \nMAIN DISCORD: https://discord.gg/JPdnvvD\nALIEN BIOSPHERES DISCORD: https://discord.gg/hZgnWzW\n\nArtifexian podcast:\nhttps://www.youtube.com/channel/UC21W40YFzSs9imQYRXdaQKw\n\nAlien biospheres wiki: \nhttps://alien-biospheres.fandom.com/wiki/Main\n\nC.M. Kosemen:\nhttps://www.youtube.com/channel/UCMy7mRjghOxB8h3nv60SU4w\nhttps://www.patreon.com/cmkosemen/posts\n\nJuno Does Worldbuidling:\nhttps://www.youtube.com/channel/UCzVLcQZPYMICPvAEybb9Fzg\n\nSpaceDirt:\nhttps://www.youtube.com/channel/UCKWW2E_Z6cFfaHeTLry3azw\n\n0:00 Intro\nPART 1: Random stuff\n00:38 What made you want to start a youtube channel in the first place?\n3:12 How exactly did you get so interested in both language and ecology?\n6:38 How do you stay motivated to keep working on your projects?\n8:26 Where do you personally draw the line of what's realistic when worldbuilding?\n10:28 How do you do your research? What’s your academic background?\n11:48 How’s your language learning going?\n12:29 What’s the conlanging case study language for?\nPART 2: Conlanging and Linguistics\n15:40 What linguistic features do you like/dislike that you have/haven’t used in a conlang?\n21:39 If you could revive one extinct language, what would it be?\n22:20 Are you still planning on remaking the How to make a Language series?\n23:29 Are there any other languages in the refugium you could share?\n26:35 Have you ever tried making a creole?\nPART 3: Refugium stuff that doesn’t specifically have to do with conlanging\n27:33 Will you make more videos about the Refugium?\n29:25 What’s it like in the night lands?\n31:48 What was the Refugium like when it was still in its beginning stages of development?\n34:53 If you were to ever finish the main story of the Refugium, how would you release it?\n35:47 Are there any cultures in the Refugium outside the ones you’ve detailed in your videos?\n35:59 During the wars between Tsannur and Thirēa, what was the weaponry like? \nPART 4: Alien Biospheres and speculative biology\n37:53 What’s your process for making an Alien Biospheres video?\n47:43 How far ahead do you plan for Alien Biospheres?\n49:37 Will you ever stop working on Alien Biospheres?\n50:51 What’s your favorite clade from Alien Biospheres?\n53:32 If you could go back in time to when you started Alien Biospheres, what would you change?\n56:26 Are there any clades you designed for Alien Biospheres that didn’t make it into the final cut?\n\n58:19 How do you keep track of everything for Alien Biospheres?\n59:12 What do you think about C.M. Kösemen and All Tomorrows?  \n1:01:54 Are there any species that scare you?\n1:03:49 What do you think about people who were inspired by Alien Biospheres and started similar projects?",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}