{
  "title": "Rethinking How We Measure Companies on Social and Environmental Impact",
  "link": "https://sloanreview.mit.edu/article/rethinking-how-we-measure-companies-on-social-and-environmental-impact/",
  "comments": "https://sloanreview.mit.edu/article/rethinking-how-we-measure-companies-on-social-and-environmental-impact/#comments",
  "pubDate": "Thu, 06 Oct 2022 11:00:37 +0000",
  "dc:creator": "Nicholas Andreou and Marya Besharov. <p>Nicholas Andreou is founder of Impact Edge Consulting and a visiting fellow at the University of Oxford’s Skoll Centre for Social Entrepreneurship at Saïd Business School. Marya Besharov is professor of organizations and impact and academic director at the Skoll Centre.</p>\n",
  "category": [
    "Business and the Environment",
    "Environmental Sustainability",
    "Sustainable Investing",
    "Corporate Social Responsibility",
    "Social Responsibility",
    "Strategy",
    "Sustainability"
  ],
  "description": "The COVID-19 pandemic, the war in Ukraine, and the ongoing climate crisis have put a spotlight on the central role businesses can play in tackling global challenges. We need companies to step up and help solve social and environmental problems at scale — for the sake of the economy as well as people and the [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_10_06-Andreou-ESG-Impact-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>The COVID-19 pandemic, the war in Ukraine, and the ongoing climate crisis have put a spotlight on the central role businesses can play in tackling global challenges. We need companies to step up and help solve social and environmental problems at scale — for the sake of the economy as well as <a href=\"https://hbr.org/2021/09/the-net-positive-manifesto\">people and the planet</a>.</p>\n<p>Yet one of the incentives companies have for being more socially and environmentally active — shareholder influence — is limited by existing approaches for assessing a company’s social and environmental performance. The predominant frameworks are too narrow and fail to fully address key stakeholder concerns on their own. Environmental, social, and governance (ESG) assessments focus on internal operational matters, such as labor relations and supply chain sustainability, but don’t fully consider the impact that a company’s products or services can have on outside stakeholders. Impact investing, in contrast, focuses on external issues, such as whether products and services address the needs of the poor, but it overlooks internal considerations, such as how companies treat their employees.</p>\n<p>In reality, a company’s social and environmental impact is multifaceted. Consider Tesla, which builds electric vehicles that significantly reduce emissions across their life cycles but faces <a href=\"https://www.morningstar.co.uk/uk/news/221629/this-is-why-teslas-esg-rating-isnt-great.aspx\">questions about its labor practices</a>. From an impact-investing perspective, the company might achieve high marks, but it rates lower from an ESG standpoint, with neither framework capturing the whole picture. As a result, frustration with both approaches is mounting: <a href=\"https://www.bloomberg.com/news/articles/2022-05-19/tesla-s-removal-from-s-p-index-sparks-debate-about-esg-ratings#xj4y7vzkg\">Tesla’s recent removal</a> from the S&P 500 ESG Index prompted CEO Elon Musk to describe ESG ratings as “<a href=\"https://www.bloomberg.com/news/articles/2022-05-18/musk-says-esg-an-outrageous-scam-after-tesla-index-exclusion#xj4y7vzkg\">an outrageous scam</a>,” while criticism of impact investing has pushed some large asset managers to tone down the language of their impact funds and <a href=\"https://www.responsible-investor.com/blackrock-renames-impact-funds-to-esg-following-criticism/\">rebrand them</a>.</p>\n<p></p>\n<p>It’s time for an integrated framework for assessing impact — one that accounts for both the external and internal facets of a company’s social and environmental performance. Only then can managers and investors provide accurate evaluations and influence companies to tackle complex global challenges.</p>\n<h3>An Integrated Approach to Impact</h3>\n<p>Drawing on several decades of collective experience leading and researching socially and environmentally sustainable businesses, we offer a holistic approach to assessing and benchmarking companies’ impact performance, based on four different levers a company can pull to effect social and environmental changes. While each lever is distinct, the real value comes from considering all four together. By capturing the full range of ways that a company can have impact, our framework will help direct capital flows toward sustainable businesses.</p>\n<p></p>\n<p>To develop this comprehensive framework, we started with a shared understanding of what <em>impact</em> truly means. The Impact Management Project (IMP) <a href=\"https://impactfrontiers.org/norms/\">frames impact</a> as “a change in an outcome caused by an organization. An impact can be positive or negative, intended or unintended.” Managing impact requires identifying the positive and negative effects on people and the planet to increase positives and reduce negatives. For companies, it is only when initiatives translate into improved outcomes for people’s lives or the planet’s health that they create impact. Which kinds of outcomes should qualify? The <a href=\"https://sdgs.un.org/goals\">United Nations’ Sustainable Development Goals</a> offer a comprehensive list that can be used as a guide; the goals include good health and well-being, quality education, gender equality, clean water and sanitation, affordable and clean energy, and decent work and economic growth.</p>\n<p>We then considered the different levers that businesses can use to create impact across these areas. Our work has identified four critical levers: (1) the products and services a company develops or sells, (2) the customer segments it targets, (3) changes in operations, and (4) how profits are used.</p>\n<p>Below, we explain these four areas of impact, highlight links to the legacy concepts of ESG and impact investing, and identify existing tools for assessing a company’s performance along each one.</p>\n<p><strong>Create products and services that deliver positive social or environmental value.</strong> This lever focuses on the extent to which a company’s core products and services improve people’s lives or the planet’s health. It can be the most powerful lever, particularly if a company reaches significant scale, as improvements can then reach billions of people worldwide.</p>\n<p>Headspace Health, the company behind the popular meditation app, has always been centered around helping people develop mindfulness and improve their well-being. Tesla has used this lever by focusing on electric vehicles designed to have a lower environmental footprint than internal combustion engine vehicles. In each case, scaling up to reach more customers not only increases revenues for the company; it also dramatically improves outcomes for people and the planet.</p>\n<p><strong>Improve the affordability and accessibility of products and services to reach marginalized populations.</strong> Here, the focus is on the degree to which a company makes its products and services affordable and accessible to those most in need. Consider the examples of Lemonade, which provides low-cost insurance products in the U.S. and some European countries, and Grameen Bank, a microfinance organization that offers financial services to the world’s poorest populations.</p>\n<p></p>\n<p>These first two levers draw inspiration from impact investing’s external focus in measuring company impact. Assessment tools developed for impact investors, such as IMP’s general <a href=\"https://impactfrontiers.org/norms/\">dimensions of impact</a> or Omidyar Network’s more specialized <a href=\"https://omidyar.com/introducing-the-ethical-explorer-pack/\">Ethical Explorer Pack</a>, can be used to measure a company’s performance on both levers. Big Society Capital, for example, uses IMP tools to <a href=\"https://bigsocietycapital.com/latest/what-is-an-impact-startup/\">assess impact-driven startups</a>.</p>\n<p><strong>Embed social and environmental considerations into a company’s operations.</strong> This lever is about <em>how</em> a company delivers its products and services, and the effect it has on people and the planet through those choices. As such, it is most closely aligned with existing ESG and sustainability approaches, including the <a href=\"https://www.globalreporting.org/\">Global Reporting Initiative</a>, the <a href=\"https://mneguidelines.oecd.org/\">OECD Guidelines for Multinational Enterprises</a>, and the <a href=\"https://www.iso.org/iso-26000-social-responsibility.html\">ISO 26000</a> standard for social responsibility.</p>\n<p>Companies focusing on this lever include <a href=\"https://www.unilever.com/planet-and-society/\">Unilever</a>, which embeds sustainability principles and practices across the design of the entire value chain, and Apple, which prioritizes <a href=\"https://www.apple.com/uk/privacy/\">customer privacy</a> in its product designs.</p>\n<p><strong>Use profits to support social or environmental value creation.</strong> Companies bring positive impact by directing profits or cash reserves to benefit people and the planet through philanthropy, cross-subsidization, or <a href=\"https://www.greenbiz.com/article/how-treasurers-can-lead-their-companys-impact-investing\">cash investments</a>. For example, <a href=\"https://www.innocentfoundation.org/about-us/about-the-foundation/\">Innocent Drinks</a> donates 10% of its profits to charities, while <a href=\"https://bulletin.ids.ac.uk/index.php/idsbo/article/view/2930/Online%20article\">Danone</a> uses profits from its traditional, well-established brands to subsidize its nutrition-fortified yogurt, enabling it to reach low-income customers.</p>\n<p>This lever is most closely aligned with existing corporate social responsibility (CSR) and corporate philanthropy approaches. Several CSR tools can be used to assess performance in this area, including <a href=\"https://www.carbonbankroll.com/\">The Carbon Bankroll</a>, which estimates the carbon footprint of major companies’ cash investments; <a href=\"https://www.csrhub.com/csrhub/\">CSRHub</a>, which provides CSR ratings and information; and records of corporate giving, such as those tracked by <cite>The Chronicle of Philanthropy</cite>.</p>\n<h3>Implementing the Framework</h3>\n<p><a href=\"https://www.nytimes.com/2022/09/14/climate/patagonia-climate-philanthropy-chouinard.html\">Patagonia’s recent decision</a> to place company governance in the hands of a trust dedicated to preserving its purpose and to give all profits to a climate action charity is a striking example of a company achieving impact across all four levers. But unfortunately, it’s all too rare. Most companies focus on just one or two areas, overlooking opportunities for positive growth. </p>\n<p>Implementing all four levers in the framework is challenging, but it can be done. It requires organizations to assess the quality and quantity of impact across each lever; the balance of positive and negative impacts, as well as intentional and unintentional impacts; and the materiality for people and the planet, not just shareholders. Companies assessing themselves can use the following key questions as a guide:</p>\n<p><strong>1. What is the quality of the impact, and how much impact does each lever create?</strong> Clearly, more is better, but how much is enough? How can companies and investors benchmark across peer organizations? IMP’s <a href=\"https://impactfrontiers.org/norms/abc-of-enterprise-impact/\">ABC framework</a> offers a useful starting point by distinguishing between efforts that avoid harm, those that benefit particular stakeholder groups, and those that contribute solutions to broader social and environmental problems such as climate change.</p>\n<p><strong>2. Are both positive and negative impacts accounted for?</strong> No company will have solely positive impacts. Corporate leaders, as well as investors, need to take negative as well as positive impacts into account to arrive at a net impact assessment.</p>\n<p><strong>3. Is double materiality considered?</strong> ESG analysis currently focuses on factors that are material to investors — an approach referred to as <em>single materiality</em>. <em><a href=\"https://www.lse.ac.uk/granthaminstitute/news/double-materiality-what-is-it-and-why-does-it-matter/\">Double materiality</a></em> is when that analysis also considers business-related factors that are material to society and the environment. From an impact perspective, the rationale for double materiality is clear, but the business community has so far resisted embracing this approach. As markets are increasingly affected by social and environmental factors, however, we anticipate that investors will increasingly take double materiality into account, and thus, so will companies.</p>\n<p></p>\n<p><strong>4. Does the assessment include unintentional as well as intentional impacts?</strong> The history of social policy, international development, and the third sector is littered with examples of unintended consequences arising from well-intentioned actions. Insecticide-treated <a href=\"https://www.theguardian.com/environment/2018/jan/31/global-use-of-mosquito-nets-for-fishing-endangering-humans-and-wildlife\">malaria nets inadvertently polluted the ocean</a> when repurposed as fishing tools, for instance, and some crime prevention programs actually <a href=\"https://www.college.police.uk/research/crime-reduction-toolkit/scared-straight?InterventionID=2\">increased people’s likelihood of offending</a>. Businesses entering the arena of creating social and environmental good need to be mindful of the complexities involved in effecting change. Through robust impact analysis, they should consider the degree to which they are accounting for potential unintended consequences and taking steps to mitigate the associated risks.</p>\n<p></p>\n<p>Adopting an integrative framework for impact is critical for moving away from assessments that aren’t working in their current form, but it’s only the first step. To move forward, companies and stakeholders alike will need to work their way through all four levers of impact in the framework. Founders and management teams need to consider these levers if they want to optimize their business for social and environmental impact, and socially minded and environmentally conscious employees should use them when choosing where to devote their careers. Ratings agencies need to provide data against these levers so that stakeholders can make informed decisions, and investors will need to broaden their scope to include all these levers when choosing where to deploy capital. Together, these changes will help all of us to realize business’s potential to address the world’s most pressing problems.</p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/rethinking-how-we-measure-companies-on-social-and-environmental-impact/feed/",
  "slash:comments": 1
}