{
  "id": "yt:video:3zxKf_Lyk0Q",
  "yt:videoId": "3zxKf_Lyk0Q",
  "yt:channelId": "UCweDKPSF65wRw5VHFUJYiow",
  "title": "The Dragon Journals | Speculative Biology",
  "link": "",
  "author": {
    "name": "Curious Archive",
    "uri": "https://www.youtube.com/channel/UCweDKPSF65wRw5VHFUJYiow"
  },
  "published": "2022-05-27T17:39:24+00:00",
  "updated": "2022-08-19T15:51:52+00:00",
  "media:group": {
    "media:title": "The Dragon Journals | Speculative Biology",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "What might the biology of a tiny order of dragons look like? A detailed exploration the Dragons of Wales worldbuilding series, Andy Frazer’s excellent speculative project. \n---\nDragons of Wales Store: https://www.etsy.com/shop/DragonsofWales\nAndy Frazer’s Patreon: https://www.patreon.com/dragonsofwales\nAndy Frazer’s Twitter: https://twitter.com/DragonsofWales\nAndy Frazer’s Instagram: https://www.instagram.com/dragonsofwales/\n\nDragons cast a large shadow over the mythologies of the world. Few legendary monsters can compare to these gigantic beasts. But what if dragons cast… a slightly smaller shadow?\n\nWhat if some dragons weren’t huge monsters, but strange and secretive creatures evolved to live hidden lives in the shadows and margins of the world? The amazing artist and writer Andy Frazer imagines a world where dragons are all around us, from the highest mountains to the deepest forest. Concentrated primarily in the author’s homeland of Wales, these smaller dragons — or ‘Microdragons’ as I call them – make up for their reduced size with their incredible diversity and ingenious survival strategies. The author has released many field guides on these tiny wonders that explore their evolution, anatomy, behavior, and habitats in great detail. \n\nSo, for this entry into the archive, I’ll assume the role of a naturalist and observe some of these creatures out in the field…\n\n0:00 World of Dragons\n1:18 Draco Nothophthalmus \n2:26 Emerald Saeth \n3:28 Draco Cepediana \n4:29 Draco Ilexis \n5:20 Draco Acidium\n6:29 Draco Muscipula \n7:18 Draco Favilla \n8:05 Draco Coccineus \n9:00 Draco Caudatae \n9:46 Crimson Cimwch \n10:41 North Nofiwr \n11:32 Seren y Storm \n12:23 Draco Aerilingii \n13:15 Draco Borealis \n14:07 Draco Babirusis \n14:58 Draco Lampyridae \n15:45 Draco Johanseni \n16:38 Draco Ignisprehendri \n17:32 More Dragons…\n\nCopyright Disclaimer: Under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education, and research. All video/image content is edited under fair use rights for reasons of commentary.\n\nI do not own the images, music, or footage used in this video. All rights and credit goes to the original owners.\n\n♫ Music by Kevin MacLeod (incompetech.com): \nBeauty Flow, Firesong, Impact Lento, Majestic Hills, Floating Cities\nLicensed under Creative Commons: By Attribution 3.0\nhttp://creativecommons.org/licenses/by/3.0/  \n\n#CuriousArchive #Dragons #SpeculativeBiology",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}