{
  "title": "Smart Nation Expo 2022 Records Huge Success",
  "link": "https://www.iaasiaonline.com/smart-nation-expo-2022-records-huge-success/",
  "dc:creator": "Tzelong",
  "pubDate": "Tue, 01 Nov 2022 07:56:28 +0000",
  "category": [
    "Industry News",
    "Recent News",
    "Smart Nation",
    "Taitra",
    "Tarsus"
  ],
  "guid": "https://www.iaasiaonline.com/?p=38742",
  "description": "<p>Smart Nation Expo 2022 Records Huge Success With Over 14,000 Attendees And 500 Exhibitors   The recently concluded SMART NATION EXPO 2022 held at the MITEC, Kuala Lumpur exceeded all expectations as reported by AMB Tarsus Events Group, the event organisers. With 14,000 attendees from 54 countries and over 500 exhibitors covering over 12,000sqm, SMART &#8230;</p>\n<p class=\"read-more\"> <a class=\"\" href=\"https://www.iaasiaonline.com/smart-nation-expo-2022-records-huge-success/\"> <span class=\"screen-reader-text\">Smart Nation Expo 2022 Records Huge Success</span> Read More &#187;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/smart-nation-expo-2022-records-huge-success/\">Smart Nation Expo 2022 Records Huge Success</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n",
  "content:encoded": "<p><strong>Smart Nation Expo 2022 Records Huge Success With Over 14,000 Attendees And 500 Exhibitors</strong></p>\n<p><strong> </strong></p>\n<p><strong>T</strong>he recently concluded SMART NATION EXPO 2022 held at the MITEC, Kuala Lumpur exceeded all expectations as reported by AMB Tarsus Events Group, the event organisers. With 14,000 attendees from 54 countries and over 500 exhibitors covering over 12,000sqm, SMART NATION EXPO is the largest event on 5G, Smart Cities, IR4.0 and Emerging Technologies in the region.<span id=\"more-38742\"></span></p>\n<p>&nbsp;</p>\n<p>The organisers announced that 91% of exhibitors rated the event a success and met or exceeded their expectations. In addition, 94% of exhibitors were satisfied with the quality of visitors.</p>\n<p>&nbsp;</p>\n<p>“We would like to thank all exhibitors, visitors and delegates for attending the event and we are planning to increase the number of booths by 50%. This is to meet demand by existing exhibitors with many asking for bigger booths. In addition, we also received many requests for Pavilions from trade associations and Government bodies,” said Ms Rina Fadzil, Project Director of SMART NATION EXPO.</p>\n<p>&nbsp;</p>\n<p>Among the exhibitors include MyDigital Corporation, TM, Celcom, Maxis, Time DotCom, Hitachi, Fujitsu, Huawei, Taiwan Electronics Equipment Industry Association and the Electrical and Electronics Association, Malaysia</p>\n<p>&nbsp;</p>\n<p>Five leading companies from Taiwan, including Axiomtek, iAmech, NexAIoT, SOLOMON, and HwaCom have reported many successful business connections at the recently concluded SMART NATION EXPO 2022 held at MITEC, Kuala Lumpur. Smart Technologies including IR4.0, IoT, Robotics, 5G, Mobility Software, Embedded computing and E-Commerce technologies were on show that attracted strong interest among the 14,000+ trade buyers that attended the 3-day event.</p>\n<p>&nbsp;</p>\n<p>SMART NATION 2022 is the region’s biggest 5G, Smart Cities, IR4.0 and Emerging Technologies Exhibition and featured 550+ exhibitors from 23 countries. The project &#8220;Smart Machinery Overseas Promotion Program &#8220;, currently under the helm of PMC and TAITRA, is one of the key projects of the Bureau of Foreign Trade of MOEA, which provide assistance to Taiwan&#8217;s smart machinery industry in expanding its international market capabilities through digital marketing and business opportunity chains and to seek overseas business opportunities, at the same time driving the export output value. It made the Expo the platform business to facilitate cooperation between Malaysian and Taiwanese companies in digital transformation.</p>\n<p>&nbsp;</p>\n<p>According to Mr. Henry, a representative of TEEIA, SMART NATION 2022 can also enhance the international visibility of Taiwan&#8217;s smart manufacturing and smart city industry and are well equipped to respond to the needs of manufacturers in their business ventures in New Southbound countries. The Expo allow the project to demonstrate to the international buyers on Taiwan ‘s smart manufacturing total solution and differentiated competitive strengths, enhance the international image of Taiwan&#8217;s industry and assist the sector to strive for overseas business opportunities.</p>\n<p>&nbsp;</p>\n<p>The Innovative Technology and Product Launch & Business Matching is hosted by the Bureau of Foreign Trade, Ministry of Economic Affairs, Taiwan (MOEA) to represents the Smart Manufacturing and digital transformation in Taiwan, aims to expand businesses in the ASEAN and South Asian region.</p>\n<p>&nbsp;</p>\n<p>At the event, Mr. James Chang who is from the Economic Division of Taipei Economic and Cultural Office in Malaysia, in his opening remark, mentioned that this is an important platform for the Taiwanese companies to present their newest technology and technical capabilities overseas while he is strongly looking forward to facilitate the cooperation between Malaysian and Taiwanese companies in digital transformation initiatives. Also during the event, the Secretary General for the Ministry of Housing and Local Government of Penang island in Malaysia together with few VIP representatives visited the booths. In essence, this event has successfully enhanced the international visibility of Taiwan’s smart manufacturing and smart city industry.<!--more--></p>\n<p><strong><b>CLICK </b></strong><a href=\"https://www.iaasiaonline.com/industry-news/\"><strong><u><b>HERE</b></u></strong></a><strong><b> FOR LATEST NEWS.</b></strong></p>\n<p><strong><b>READ CURRENT AND PAST </b></strong><a href=\"https://www.iaasiaonline.com/magazine/\"><strong><u><b>ISSUES</b></u></strong></a><strong><b> OF IAA.</b></strong></p>\n<p><strong><b>KEEP YOURSELF UPDATED, </b></strong><a href=\"https://www.iaasiaonline.com/subscription/\"><strong><u><b>SUBSCRIBE</b></u></strong></a><strong><b> TO IAA NOW!</b></strong></p>\n<p><strong><b>AND DON’T FORGET FOLLOW US ON </b></strong><a href=\"https://www.facebook.com/IAAsia/\"><strong><u><b>FACEBOOK</b></u></strong></a><strong><b>,</b></strong><a href=\"https://www.linkedin.com/showcase/industrial-automation-asia/\"><strong><u><b> LINKEDIN</b></u></strong></a><strong><b> AND </b></strong><a href=\"https://twitter.com/IAA_Asia\"><strong><u><b>TWITTER!</b></u></strong></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com/smart-nation-expo-2022-records-huge-success/\">Smart Nation Expo 2022 Records Huge Success</a> appeared first on <a rel=\"nofollow\" href=\"https://www.iaasiaonline.com\">IAA - Industrial Automation</a>.</p>\n"
}