{
  "guid": "prx_126_9bf30773-38cf-43be-8979-0cbc8fd95702",
  "title": "The Summer of Night Vale Presents, Part 4",
  "pubDate": "Fri, 27 Jul 2018 04:00:00 -0000",
  "link": "https://beta.prx.org/stories/250062",
  "description": "<p>Welcome to the fourth and final week of the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network. This week, hear previews of two upcoming Night Vale Presents shows, and full episodes from <a href=\"https://www.wnycstudios.org/shows/orbitinghumancircus\" rel=\"nofollow\" target=\"_blank\">The Orbiting Human Circus (of the Air)</a> and <a href=\"http://goodmorningnightvale.com\" rel=\"nofollow\" target=\"_blank\">Good Morning Night Vale</a>.</p>\n\n<p>To get updates on our new shows, Adventures in New America and Dreamboy, sign up for the <a href=\"http://eepurl.com/b19UIv\" rel=\"nofollow\" target=\"_blank\">Night Vale Presents newsletter</a>, or follow us on <a href=\"https://www.facebook.com/nightvalepresents/\" rel=\"nofollow\" target=\"_blank\">Facebook</a> and <a href=\"http://twitter.com/nvpresents\" rel=\"nofollow\" target=\"_blank\">Twitter</a>.</p>\n\n<p><a href=\"https://www.wnycstudios.org/shows/orbitinghumancircus\" rel=\"nofollow\" target=\"_blank\">The Orbiting Human Circus (of the Air)</a> is a surreal and funny audio drama about a lonely janitor at the Eiffel Tower who longs to be part of the most popular radio show in the world. Recently, we re-issued the first season in partnership with WNYC. This special edition has brand new behind-the-scenes commentary in every episode and a director’s cut of the season finale, and is the perfect excuse to either re-listen or dive in for the very first time.</p>\n\n<p><a href=\"http://goodmorningnightvale.com\" rel=\"nofollow\" target=\"_blank\">Good Morning Night Vale</a> is the official Welcome to Night Vale recap show, hosted by cast members Meg Bashwiner, Symphony Sanders, and Hal Lublin. Each week, our hosts do a deep dive into one episode of Welcome to Night Vale, starting with the very first episode from 2012. Tune in for behind-the-scenes stories, interviews with the cast and creators, fan theories, and THROAT SPIDERS.</p>",
  "enclosure": "",
  "itunes:subtitle": "Welcome to the fourth and final week of the Summer of Night Vale Presents, a celebration and sampling of some of the shows across our network.",
  "itunes:episodeType": "full",
  "itunes:duration": "01:41:42"
}