{
  "title": "The Ministry of Truth (and Energy): FERC’s Proposed Candor Rule",
  "link": "https://www.heritage.org/government-regulation/report/the-ministry-truth-and-energy-fercs-proposed-candor-rule",
  "description": "<p>Earlier this year, the Biden Administration (reluctantly) abandoned its plan to create a new Disinformation Governance Board within the Department of Homeland Security. Yet the Administration remains convinced that unpoliced speech threatens its ability to govern, and its hunt for disinformation in all corners of American life continues apace. Thus, the truth-vetting functions have not disappeared with the ill-fated board; instead, they are scattering to other executive agencies, including the Federal Energy Regulatory Commission (FERC or the Commission).</p>\n\n<p>In August, the Commission, which regulates wholesale markets for oil, natural gas, and hydroelectric power, issued a notice of proposed rulemaking announcing its intention to adopt a new “candor rule.” This rule would allow the Commission to scrutinize communications by any individual or entity with “the Commission, Commission-approved market monitors, Commission-approved regional transmission organizations, Commission-approved independent system operators, jurisdictional transmission or transportation providers, or the Electric Reliability Organization and its associated Regional Entities,”<span class=\"annotation__highlight\" data-annotation=\"<p>See Fed. Energy Reg. Comm’n, Notice of Proposed Rule Making (Aug. 12, 2022) [hereafter NPRM], § 1(d).1, https://www.ferc.gov/media​/m-1-rm22-20-000.</p>\"><span class=\"annotation-link\">REF</span></span> so long as that communication relates to a subject within the Commission’s jurisdiction. The proposal empowers FERC to take punitive action not only when parties’ communications contain false information, but when they contain “misleading information, or omit material information” as well.<span class=\"annotation__highlight\" data-annotation=\"<p>Id. ¶ 1.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The proposed expansion of Commission authority is breathtaking. For years, the Commission used a tailored rule to protect the integrity of its markets by requiring candor in communications from energy wholesalers. Now the Commission desires to regulate an array of new parties who communicate with the entities listed above whenever those parties discuss matters merely “related” in some way to the range of subjects within the Commission’s jurisdiction.</p>\n\n<p>FERC might seem like an unlikely entity to deputize in the federal government’s new war on misinformation, but one should recall that the Commission regulates the permitting, production, and sale of energy from a wide variety of sources. Its jurisdiction sits at the nexus of energy policy and environmental policy, two areas of keen public interest and heated public debate whether it concerns grid reliability, domestic economic considerations, local or climatological environmental degradation, or even energy independence and its connection to national security. Moreover, if the recent practice of other agencies is any indication, FERC will interpret the scope of its authority in a maximalist way as, for instance, the Occupational Safety and Health Administration (OSHA) did when it determined that its authority over workplace hazards included the power to mandate vaccines for 80 million members of the nation’s workforce. When considered in this light, FERC’s power to police communications relating to subjects in its purview for their truthfulness becomes a matter of serious concern.</p>\n\n<p>The government’s response to the COVID-19 pandemic taught the nation that career federal administrators are, to put it mildly, not necessarily disinterested pursuers of truth. A variety of motivations—some noble, some less so—can lead them to downplay or dismiss credible opinions as invalid when those opinions dissent from views the government is not inclined to question.<span class=\"annotation__highlight\" data-annotation=\"<p>See, e.g., Jayanta Bhattacharya, Martin Kulldorff, The Collins and Fauci Attack on Traditional Public Health, Brownstone Institute (Jan. 2, 2022) https://​brownstone.org/articles/the-collins-and-fauci-attack-on-traditional-public-health/; Kerrington Powell and Vinay Prasad, The Noble Lies of COVID-19, Slate (July 28, 2021), https://slate.com/technology/2021/07/noble-lies-covid-fauci-cdc-masks.html.</p>\"><span class=\"annotation-link\">REF</span></span> Of course, the government is not required to <i>adopt</i> dissenting views, but the authority to <i>penalize</i> dissenting views and push them out of the public discourse is a powerful tool of suppression.</p>\n\n<p>Concern is heightened here by the lack of well-defined standards constraining the Commission’s review. Agencies often decline to articulate concrete standards in favor of a “flexible” approach to enforcement, as FERC has done in its proposed candor rule. This raises several questions. For example:</p>\n\n<ul><li>Could FERC penalize communications that it labels a denial of anthropogenic climate change?</li>\n\t<li>Could a discussion of the benefits of domestic liquid natural gas be deemed misleading because it omits a discussion of the local environmental impacts of pipeline construction that the Commission finds “material”?</li>\n\t<li>If a market participant states that wind-energy reliance impacts grid reliability without mentioning its offset to carbon emissions, is he misrepresenting the merits of renewable energies?</li>\n</ul><p>FERC does not tell us, but the rule is broad enough to enable what we might call a politicized application of expertise; that is, the quasi-official adoption of certain scientific hypotheses as a standard of truth, which entails the suppression of alternative hypotheses and dissenting views. Thus, skepticism is warranted when, as here, an agency appoints itself the final arbiter of whether a statement is truthful, material, or misleading while telling the public little about how it will accomplish this task.</p>\n\n<p>Concern is only heightened by the fact that there is no pressing or obvious need for the new rule. The current candor rule applicable to wholesalers was adopted in response to a specific crisis created by wholesalers’ intentional misstatements. Here, by contrast, the impetus for FERC’s new, considerably broader rule is obscure. This suggests that the rule is less a response to a particular problem in the wholesale markets and more an effort to enlarge the Commission’s jurisdiction permanently by establishing an expansive precedent. What’s more, the Commission need not exercise its censorious power to be effective; so long as the fear of prosecution and uncertain penalties looms, participants in the energy market will be wary about anything they put in writing.</p>\n\n<p>Layman’s wisdom suggests that an energy regulator might not be the natural arbiter of what is truthful and complete. As it turns out, that wisdom corresponds with legal hurdles the Commission faces in its efforts to adopt the new candor rule. As discussed below, by adopting the sweeping new candor rule, FERC may be acting outside the authority conferred on it by Congress. FERC has also acted arbitrarily by not adequately supporting its conclusion that the new rule will address the Commission’s own concerns and by disregarding the considerable regulatory burdens it intends to foist upon parties who are not prepared to bear them. Moreover, concerns with respect to market functionality and free speech loom large against a rule that threatens to chill the sharing of information that is important to experts and market actors alike. All of this is on top of the likelihood that the Commission seems to be trying to solve a problem that is more imagined than real.</p>\n\n<h3>Misusing Regulatory Authority to Address a Phantom Problem</h3>\n\n<p>The Commission’s Notice of Proposed Rule Making (Notice) describes a problem of inaccurate communications affecting the energy markets, but FERC offers nothing to substantiate its view that the problem is concrete. That is, the Commission nowhere indicates that the supposed gaps in the existing requirements of honesty, candor, etc. actually undermine its ability to discharge its regulatory mandate of ensuring that wholesale energy prices are “just and reasonable.”<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶ 36.</p>\"><span class=\"annotation-link\">REF</span></span> The Notice contains not a single example of a currently unregulated communication that introduced inaccuracy into the wholesale energy markets or the Commission’s regulation thereof.</p>\n\n<p>At various points, the Notice speaks in broad hypothetical terms about “inaccurate information inhibit[ing] the Commission’s regulatory oversight”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. ¶ 3.</p>\"><span class=\"annotation-link\">REF</span></span> which “could lead to substantial harm”<span class=\"annotation__highlight\" data-annotation=\"<p>Id.</p>\"><span class=\"annotation-link\">REF</span></span> or the possibility that the “omission of material information…could lead the Commission to make decisions it otherwise would not have made.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. ¶ 26.</p>\"><span class=\"annotation-link\">REF</span></span> But the Notice gives the impression that this harm is purely theoretical and that the Commission is not aware of, or has yet to identify, instances where inaccuracies in unregulated communications have come to the Commission’s attention, let alone caused discernible market aberrations. In other words, the proposed rule is a solution in search of problem.</p>\n\n<p>This contrasts with the impetus for 18 C.F.R. § 35.41(b), also known as Market Behavior Rule 3, which the Commission invokes as the basis for the proposed extension of the duty of candor. When the Commission adopted Market Behavior Rule 3 in 2003, it did so in response to a specific, well-documented failure in the western states energy markets.<span class=\"annotation__highlight\" data-annotation=\"<p>See Investigation of Terms & Conditions of Pub. Util. Mkt.-Based Rate Authorizations, 105 FERC ¶ 61,218, 62,142 (2003).</p>\"><span class=\"annotation-link\">REF</span></span> Then, as now, the Commission opined that the “integrity of the processes established by the Commission for open competitive markets rely on the openness and honesty of market participant communications.”<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶¶ 17, 34.</p>\"><span class=\"annotation-link\">REF</span></span> Yet, in response to a documented crisis in the western states, the Commission deemed it sufficient to impose explicit duties of candor only on sellers in the wholesale market.</p>\n\n<p>Now, with no crisis apparent and no specific failures identified, the Commission has determined without a reasoned explanation that Market Rule 3, which is nearly two decades old, has suddenly become inadequate. The Commission acknowledges that, in addition to communications by sellers, existing duties of candor and oath requirements already cover filings with the Commission, periodic and annual reports, as well the submission of evidence, testimony, and written statements in connection with Commission investigations. The Commission then puzzlingly concludes that these duties are “limited”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. ¶¶ 8, 15.</p>\"><span class=\"annotation-link\">REF</span></span> and goes on to malign the current network of requirements as a “patchwork.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. ¶¶ 2, 7, 36.</p>\"><span class=\"annotation-link\">REF</span></span> The existing duties are limited in the sense that they cover a smaller range of speakers than the Commission now proposes to regulate, but rather than seeing these duties as a “patchwork,” they are better viewed as targeted toward those speakers and that speech most likely to affect the Commission’s mandate. The fact that other speakers and other speech could be regulated does not mean that there is a reason for the Commission to do so. If the current candor duty is truly inadequate, then at some point in the nearly two-decade existence of § 35.41(b) one would expect to see evidence thereof, such as instances where inaccurate communications have manifested as actual market problems. The problem is that the Notice identifies none.</p>\n\n<p>Accuracy in all communications “relat[ing] to a matter subject to the jurisdiction of the Commission” may be desirable, but the Commission is not authorized to pursue this without regard to the costs. “[N]o legislation pursues its purposes at all costs. . . . [I]t frustrates rather than effectuates legislative intent simplistically to assume that whatever furthers the statute’s primary objective must be the law.”<span class=\"annotation__highlight\" data-annotation=\"<p>Rodriguez v. United States, 480 U.S. 522, 525–26 (1987) (emphasis omitted).</p>\"><span class=\"annotation-link\">REF</span></span> To show that the proposal’s benefits are worth its costs, the Commission must begin by identifying benefits of some sort, and that means identifying a problem the proposal would address. But here, “conclusory statements” that inaccurate communications by unregulated parties could inhibit the Commission’s mandate “do not suffice to explain its decision.”<span class=\"annotation__highlight\" data-annotation=\"<p>Encino Motorcars, LLC v. Navarro, 579 U.S. 211, 224 (2016).</p>\"><span class=\"annotation-link\">REF</span></span> The Commission is not entitled to rest its regulation on “unsupported speculation,” but instead must provide some “factual basis for this belief” that speech or speakers outside the scope of the current candor rules realistically threaten its ability to ensure just and reasonable energy pricing.<span class=\"annotation__highlight\" data-annotation=\"<p>New York v. United States Dep’t of Homeland Sec., 969 F.3d 42, 83 (2d Cir. 2020).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The Commission’s failure to apprise the public of the scope or gravity of the problem posed by unregulated, inaccurate communications makes it impossible to evaluate the proportionality of the proposed rule and its attendant costs, which are discussed further below. It is the Commission’s responsibility to show that its proposed rule would do more good than harm; the failure to do so is arbitrary and capricious.<span class=\"annotation__highlight\" data-annotation=\"<p>Md. People’s Counsel v. FERC, 761 F.2d 768, 779 (D.C. Cir. 1985) (an agency’s failure to show that “more good than harm will come of its action” is arbitrary and capricious).</p>\"><span class=\"annotation-link\">REF</span></span> Moreover, a regulation responding to a specific problem is “highly capricious if that problem does not exist.”<span class=\"annotation__highlight\" data-annotation=\"<p>Alltel Corp. v. FCC, 838 F.2d 551, 561 (D.C. Cir. 1988).</p>\"><span class=\"annotation-link\">REF</span></span> Therefore, the Commission needs more than truisms about the value of accurate information to demonstrate that there is, in fact, a problem affecting energy rates at which this sweeping proposed rule is aimed.</p>\n\n<h3>Exceeding the Commission’s Lawful Jurisdiction</h3>\n\n<p>The proposed candor rule extends the Commission’s regulatory reach beyond the bounds of its jurisdiction. “FERC is a creature of statute, having no constitutional or common law existence or authority, but <i>only</i> those authorities conferred upon it by Congress.”<span class=\"annotation__highlight\" data-annotation=\"<p>Atl. City Elec. Co. v. FERC, 295 F.3d 1, 8 (D.C. Cir. 2002) (internal quotation marks omitted).</p>\"><span class=\"annotation-link\">REF</span></span> Although the Commission is authorized to “ensure the integrity and smooth functioning of the [energy] markets,”<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶ 36 (quoting Kourouma v. FERC, 723 F.3d 274, 276 (D.C. Cir. 2013)).</p>\"><span class=\"annotation-link\">REF</span></span> that authority is limited “to rules or practices that <i>directly</i> affect the [wholesale] rate.”<span class=\"annotation__highlight\" data-annotation=\"<p>FERC v. Elec. Power Supply Ass’n, 577 U.S. 260, 278 (2016).</p>\"><span class=\"annotation-link\">REF</span></span> This limited authority is the basis for the existing duty of candor in § 35.41(b).<span class=\"annotation__highlight\" data-annotation=\"<p>FERC v. Coaltrain Energy, L.P., No. 2:16-CV-732, 2018 WL 7892222, at *23–24 (S.D. Ohio Mar. 30, 2018).</p>\"><span class=\"annotation-link\">REF</span></span> Given the demonstrated ability of sellers’ communications with the Commission to affect wholesale markets, as exemplified by the western states energy crisis, it was reasonable for the Commission to conclude that regulating these parties’ communications was within its jurisdiction. Sellers are entrusted by the Commission with market-based rate authority, and no imagination is needed to appreciate how these entities affect wholesale market rates.</p>\n\n<p>No similar justification exists for the proposed extension of the duty of candor, which would cover a varied host of new speakers. The Commission now proposes to regulate the communications of every “entity,” including organizations and individuals as well as their employees, agents, and contractors so long as the communication “relates” to a matter within the Commission’s jurisdiction.<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶¶ 40–41.</p>\"><span class=\"annotation-link\">REF</span></span> Yet the Commission has given no apparent consideration to whether communications from these sources have any capacity to exert direct influence on the wholesale energy markets. Consequently, the Commission has failed to show that the proposed rule’s scope would cover only (or mostly) communications that exert a direct influence over wholesale energy markets.</p>\n\n<p>When the direct influence of communications on wholesale energy markets is considered, it becomes apparent that the existing candor rule is not artificially “limited” but intentionally “targeted” at actors in the wholesale markets with the power to affect those markets directly. While sellers are able to influence the wholesale markets, the likelihood of more attenuated actors being able to do so through their communications seems remote. Whatever effects these communications could produce on the wholesale energy market, they appear more likely to be “indirect or tangential impacts” which “fall outside FERC jurisdiction.”<span class=\"annotation__highlight\" data-annotation=\"<p>Coal. for Competitive Elec., Dynegy Inc. v. Zibelman, 272 F. Supp. 3d 554, 572 (S.D.N.Y. 2017).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>The Commission nonetheless maintains that the “underlying rationale” of § 35.41(b) “applies more broadly” beyond sellers.<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶ 33.</p>\"><span class=\"annotation-link\">REF</span></span> Of course it does. But that is precisely why the Supreme Court prevented the Commission from adopting a “hyperliteral” reading of its governing statutes: to protect the public from the excesses of the Commission’s unrestrained exercises in logic and to keep the Commission’s regulatory mandate from “assuming near-infinite breadth.”<span class=\"annotation__highlight\" data-annotation=\"<p>FERC v. Elec. Power Supply Ass’n, 577 U.S. at 278.</p>\"><span class=\"annotation-link\">REF</span></span> While the proposed regulation is not infinite in scope, as written and interpreted, it is likely to cover a large number of communications that do not and cannot directly affect wholesale energy markets. Adopting a regulation that exceeds or disregards known limitations on the Commission’s jurisdiction is arbitrary and capricious.</p>\n\n<h3>Failure to Consider the First Amendment Implications of the Proposed Rule</h3>\n\n<p>The proposed rule raises weighty First Amendment concerns which are not adequately addressed by the Notice of Proposed Rule Making.</p>\n\n<p>The proposed rule encompasses any communication relating to any matter subject to the Commission’s jurisdiction so long as the communication is made to one of the numerous listed entities. “The word ‘relates’ is highly general,” and courts tend to “interpret[] it broadly.”<span class=\"annotation__highlight\" data-annotation=\"<p>Barnett Bank of Marion Cty., N.A. v. Nelson, 517 U.S. 25, 38 (1996); see also United States v. Slatten, 865 F.3d 767, 780 (D.C. Cir. 2017) (“We have noted that the ‘ordinary meaning’ of ‘relating to’ is a broad one and that ‘a statutory provision containing the phrase therefore has ‘broad scope.’”).</p>\"><span class=\"annotation-link\">REF</span></span> A literal interpretation of “relates to” could result in the Commission regulating a nearly unlimited number of subjects, provided some nexus can be found with the immediate subjects of the Commission’s authority.<span class=\"annotation__highlight\" data-annotation=\"<p>See FERC v. Elec. Power Supply Ass’n, 577 U.S. at 278 (“As we have explained in addressing similar terms like ‘relating to’ or ‘in connection with,’ a non-hyperliteral reading is needed to prevent the statute from assuming near-infinite breadth.”).</p>\"><span class=\"annotation-link\">REF</span></span> Even if the Commission interprets the subjects falling under this rule less expansively, as FERC Commissioner James Danly noted in his dissent to the proposed rule, the Commission’s core subject matter areas involve “matter of political, social, or other concern.” This observation is confirmed by the fact that the Commission’s jurisdiction covers interstate transmission of electricity and natural gas, including the reliability of both, as well as environmental matters related to natural gas. These matters intersect or overlap with important areas of scientific and policy debate concerning the relative merits of energy sources, their reliability, and their sustainability.</p>\n\n<p>Could matters of scientific debate under these headings be labeled disinformation by those wielding the federal government’s regulatory power? Recent experience informs us that this is a real possibility.<span class=\"annotation__highlight\" data-annotation=\"<p>See Bhattacharya and Kulldorff, supra note 3.</p>\"><span class=\"annotation-link\">REF</span></span> If so-called climate-change deniers communicate with a Commission-regulated entity, could their words serve as the basis for imposing federal penalties? Perhaps market participants critical of the unreliable nature of current renewable energy sources will have their communications reviewed with particular attention. Should the Commission’s composition shift, those critical of pipeline construction’s environmental impacts might have their communications closely examined for material omissions. After all, to find an omission, one need only take an expansive view of what is material to the discussion at issue. If the Commission wanted to target falsehoods in permit applications or statements that directly influenced market rates, it could have done so. But it didn’t. Instead, the Commission drafted a rule both flexible in application and capacious in scope such that it could be applied against otherwise lawful communications.</p>\n\n<p>Despite the Commission’s authority to ensure fair and just rates in the wholesale market, it is not the Commission’s job to police the boundaries of discussion on unsettled matters touching on energy policy or related environmental concerns. The shadow of broadened enforcement power cast by the proposed rule and its “flexible standard” of enforcement may chill discussion of these issues among actors in the wholesale energy markets, particularly as those actors struggle to divine what information is material and cannot be omitted from their communications.<span class=\"annotation__highlight\" data-annotation=\"<p>FERC’s bid to extend its jurisdiction through the NPRM also raises concern about the proposed rule’s interaction with the criminal penalties in 18 U.S.C. § 1001. That section states in relevant part that “whoever, in any matter within the jurisdiction of the executive, legislative, or judicial branch of the Government of the United States, knowingly and willfully…makes any materially false, fictitious, or fraudulent statement or representation; or [] makes or uses any false writing or document knowing the same to contain any materially false, fictitious, or fraudulent statement or entry; shall be fined under this title, imprisoned not more than 5 years….” By bringing a new range of communications and speakers under its jurisdiction, FERC potentially renders those communications the basis for criminal penalties under § 1001 as well. Unlike the proposed rule, § 1001 requires that the statements be made knowingly and willfully, but as with many other aspects of the proposed rule, the NPRM does not consider the chilling effect that is added when the Commission’s civil penalties are supplemented by the possibility of criminal sanctions.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>To these concerns, the Commission’s citation to <i>Kourouma v. FERC</i> is no answer. In that case, an energy trader, Kourouma, <i>admitted</i> to filing false information with the Commission in an application for approval of his new energy trading firm. The court of appeals treated Kourouma as a seller, meaning that he was squarely within the Commission’s jurisdiction over wholesale markets. The only challenge Kourouma asserted to § 35.41(b) was that it provided “no notice that FERC would read the Rule so broadly and might move against those who lacked intent to deceive FERC or regional transmission organizations.”<span class=\"annotation__highlight\" data-annotation=\"<p>Kourouma, 723 F.3d at 279.</p>\"><span class=\"annotation-link\">REF</span></span> The district court easily disposed of this intent-based challenge because the regulation’s text made it clear that only those who had exercised diligence would be excused and because “Kourouma’s actions were worse than careless.”<span class=\"annotation__highlight\" data-annotation=\"<p>Id. at 278.</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>In short, <i>Kourouma</i> was not a close case. Because a seller conceded that he made false statements directly to the Commission, the court had no opportunity to consider whether such phrases as “omit material information,” “relates to a matter subject to the jurisdiction of the Commission,” or “exercises due diligence” give reasonable notice as to what might be encompassed within them and whether they are overbroad especially as applied to the new range of regulated communications between customers and other market participants. Thus, <i>Kourouma </i>is not a prospective judicial blessing for the proposed rule, and the decision provides virtually no guidance to the host of newly regulated speakers who are not making patently false statements directly to the Commission.</p>\n\n<p>In sum, the Notice evinces no serious consideration of the significant First Amendment concerns raised by the proposed rule. To the extent the Commission has failed to consider these concerns, that failure is both arbitrary and capricious.</p>\n\n<h3>Failure to Consider Adequately the Costs Imposed by the Proposed Rule</h3>\n\n<p>The Commission opines that “the burden associated with the proposed regulation should be minimal” because “almost all entities…regularly communicate with accuracy and honesty,” and most such “communications already regularly occur with due diligence exercised.”<span class=\"annotation__highlight\" data-annotation=\"<p>NPRM ¶ 48.</p>\"><span class=\"annotation-link\">REF</span></span> The Commission seems to concede that the proposed regulation will not actually affect the behavior of wholesale market actors, meaning that any improvement in the accuracy of communications will either be minimal or nonexistent, which begs the question: Why adopt a new rule?</p>\n\n<p>While the proposed rule is not likely to produce a net positive effect on the accuracy of communications, the Commission has either ignored or discounted potentially considerable costs arising from its proposal. Extension of this broad duty of candor and the corresponding requirement of diligence creates considerable uncertainty for parties that are not accustomed to proving the rigorous accuracy of their communications. Because due diligence is an affirmative defense, the burden falls on the speaker to come forward with evidence of its efforts.<span class=\"annotation__highlight\" data-annotation=\"<p>Coaltrain Energy, L.P., 501 F. Supp. 3d at 526.</p>\"><span class=\"annotation-link\">REF</span></span> Therefore, the issue is not necessarily that these parties’ communications are untruthful; the issue is that it would now be incumbent on parties to demonstrate that each communication was both factually accurate and properly contextualized or that the communication was formulated according to a process meant to ensure accuracy and guard against error.</p>\n\n<p>The few judicial decisions interpreting § 35.41(b) indicate that evidence of some such process is the bare minimum of what is needed to prove due diligence. To the extent there is some lesser requirement for individuals or less sophisticated entities, the Commission provides no meaningful guidance on what that requirement is. Thus, the Commission foists the greatest degree of uncertainty onto the parties that are least able to bear the associated costs.</p>\n\n<p>The extended duty of candor means that each communication touching on matters of Commission jurisdiction would entail a greater but still uncertain risk. That uncertainty is amplified by the amorphous nature of key concepts in the proposed regulation like materiality and due diligence combined with the Commission’s highly discretionary approach to enforcement. Increased uncertainty about the risks of covered communications and the vagueness regarding penalties inhibits rational assessment of how newly regulated entities should respond.</p>\n\n<p>Thus, two responses to the proposed rule—both costly—are likely. One is for entities to commit more resources than needed to compliance. Adopting or augmenting processes to ensure accuracy will inevitably entail compliance costs whether these are incurred on systems for document retention and storage, on compliance staff, on precommunication internal reviews, on centralized monitoring of communications with other market participants, or on consultation with lawyers regarding risk assessments and questions of materiality or due diligence.</p>\n\n<p>Individuals and entities that are not willing or able to commit more resources to compliance are likely to curtail their communications at least as they relate to matters within the Commission’s jurisdiction. This too comes at a cost. Rather than increasing the accuracy of information, the proposed rule may simply decrease the flow of information without meaningfully affecting the quality. By inhibiting the free flow of communication both between market actors and from market actors to the Commission, the proposed rule will make the wholesale energy markets more opaque and thus less functional as participants will have less information to guide their decisions. This outcome is antithetical to the Commission’s objective: “to promote a free market in wholesale electricity” and “enhance competition.”<span class=\"annotation__highlight\" data-annotation=\"<p>Louisville Gas & Elec. Co. v. FERC, 988 F.3d 841, 844 (6th Cir. 2021).</p>\"><span class=\"annotation-link\">REF</span></span></p>\n\n<p>It is not evident from the Notice that the Commission has factored these costs into its assessment of whether the proposed rule is an advisable extension of existing duties, but failure to consider the likely negative consequences of the proposed rule would also be an arbitrary and capricious decision-making failure.</p>\n\n<h3>Conclusion</h3>\n\n<p>The decision-making process behind FERC’s proposed candor rule was patently inadequate. The Commission should therefore end its efforts to adopt the rule or, at a minimum, issue a supplemental notice addressing the defects in its current proposal. If the rule is ultimately adopted and broad applications ensue, FERC will have set a dangerous precedent that will be noted by other federal agencies.</p>\n\n<p>According to the <i>Federal Register</i>, there are 434 agencies within the federal government. Their jurisdictions meander across areas such as elections, health care, labor, national security, agriculture, and the environment, to name but a few. Which among these agencies could not claim that accurate information is indispensable to its regulatory mandate? Might some of them look at FERC’s example and conclude that their own authority includes the power to probe communications touching on their respective subject matters for material omissions?</p>\n\n<p>Given the many facets of American life already touched on by federal agencies, the scope of overlapping speech regulations could bring an alarming number of communications under the scrutiny of the administrative state. When agencies assert the right to suppress disinformation and the right to define the concept as well, a likely byproduct is the withering of public discussion and debate in precisely those areas where it is most needed.</p>\n\n<p><i><b>Jack Fitzhenry</b> is Senior Legal Policy Analyst in the Edwin Meese III Center for Legal and Judicial Studies at The Heritage Foundation. </i></p>",
  "pubDate": "Thu, 03 Nov 2022 13:30:01 -0400",
  "dc:creator": "Jack Fitzhenry",
  "guid": "https://www.heritage.org/government-regulation/report/the-ministry-truth-and-energy-fercs-proposed-candor-rule"
}