{
  "id": "yt:video:v5OvogF0neE",
  "yt:videoId": "v5OvogF0neE",
  "yt:channelId": "UC5Jz6SBlu2Sv61kfssv4DOw",
  "title": "Manufacturing Micro-granular Crystals and Other Advanced Microstructures Using Optical Tweezers",
  "link": "",
  "author": {
    "name": "The FACTs of Mechanical Design",
    "uri": "https://www.youtube.com/channel/UC5Jz6SBlu2Sv61kfssv4DOw"
  },
  "published": "2021-07-05T20:21:09+00:00",
  "updated": "2022-08-19T15:47:39+00:00",
  "media:group": {
    "media:title": "Manufacturing Micro-granular Crystals and Other Advanced Microstructures Using Optical Tweezers",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "This video was made by Prof. Jonathan Hopkins at UCLA in response to a special talk invitation at ASME’s 2021 Manufacturing Science and Engineering Conference (MSEC) virtual conference during the COVID-19 Pandemic.\n\nThe talk is about how optical tweezers and two-photon stereolithography can be used to fabricate micro-granular crystals by assembling and joining microspheres together using laser beams. The talk also discusses other advanced structures that can be fabricated using the same system including structures that can be printed with embedded strain energy. Compliant Rolling-contact Architected Materials (CRAMs) are also shown toward the end.\n\nIf you’re interested in this video, be sure to see my other videos on the topic:\n\nhttps://www.youtube.com/watch?v=2PD48xgHvjs&t=1s \n\nIf you’d like to learn more, I recommend reading the following paper:\n\nChizari, S., Lim, M.P., Shaw, L.A., Austin, S.P., Hopkins, J.B., 2020, “Automated Optical-tweezers Assembly of Engineered Microgranular Crystals,” Small, 16(25): 2000314 (6 pages) \n\nPorter, M.D., Giera, B., Panas, R.M., Shaw, L.A., Shusteff, M., Hopkins, J.B., 2018, “Experimental Characterization and Modeling of Optical Tweezer Particle Handling Dynamics,” Applied Optics, 57(22): pp. 6565-6571\n\nShaw, L.A., Chizari, S., Hopkins, J.B., 2018, “Improving the Throughput of Automated Holographic Optical Tweezers,” Applied Optics, 57(22): pp. 6396-6402\n\nShaw, L.A., Panas, R.M., Spadaccini, C.M., Hopkins, J.B., 2017, “Scanning Holographic Optical Tweezers,” Optics Letters, 42(15): pp. 2862-2865 (highlighted on the journal’s website as the editor’s pick)\n\nChizari, S., Shaw, L.A., Hopkins, J.B., 2019, “Simultaneous Printing and Deformation of Microsystems via Two-Photon Lithography and Holographic Optical Tweezers,” Materials Horizons, 6(2): pp. 350-355\n\nShaw, L.A., Chizari, S., Dotson, M.B., Song, Y., Hopkins, J.B., 2018, “Compliant Rolling-contact Architected Materials for Shape Reconfigurability,” Nature Communications, 9(1): 4594 (12 pages)\n\nDisclaimer: Responsibility for the content of this video is my own. The University of California, Los Angeles is not involved with this channel nor does it endorse its content.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}