{
  "id": "yt:video:SCa4jHDVkFo",
  "yt:videoId": "SCa4jHDVkFo",
  "yt:channelId": "UC6dI8msF1_I9HuDSvMtk_nQ",
  "title": "Nintendo Is Not As Friendly As You Think",
  "link": "",
  "author": {
    "name": "Akshon Esports",
    "uri": "https://www.youtube.com/channel/UC6dI8msF1_I9HuDSvMtk_nQ"
  },
  "published": "2022-09-24T15:00:14+00:00",
  "updated": "2022-09-29T18:21:27+00:00",
  "media:group": {
    "media:title": "Nintendo Is Not As Friendly As You Think",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Nintendo. Beloved video game company. Safe. Warm. Nurturing. \n\nFor anyone who has played video games, this Japanese company has a very special place in our hearts. Gamers of all ages get nostalgic thinking about that first time playing Mario, Donkey Kong, or Zelda. But what if I told you that this company has a much, much darker history.\n\nThat’s right, much like Disney and movies, once you push past Nintendo’s family-friendly image, the company’s practices start to paint a different picture. From their treatment of their own employees, to destroying the communities who play their games, it becomes quickly apparent that Nintendo, the billion dollar corporation that defined your childhood, isn’t the fatherly figure they make themselves out to be. Today, we’ll be exploring some of the unethical things that Nintendo has done over the years, and present a different angle of this beloved developer. \n\nThis is the dark side of Nintendo\n\nSupport us on Patreon: https://patreon.com/akshonesports\nSubscribe to our channel! https://goo.gl/OvCljl\n\nJoin our Discord community: https://discord.gg/ZHeCNJQUpY\n\nBecome a Member to support us: https://www.youtube.com/channel/UC6dI8msF1_I9HuDSvMtk_nQ/join\n\nFollow us to stay up to date with our releases! \n\nWebsite: https://www.akshonmedia.com/\nFacebook: https://www.facebook.com/akshonesports/\nInstagram: https://www.instagram.com/akshonesports/\nTwitter: https://twitter.com/akshonesports\n\n#nintendo #gaming",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}