{
  "title": "S1E31 - When the Journey Brings You Full Circle with Olympic Diver and Coach Gabi Chereches",
  "guid": "https://pinecast.com/guid/d3fa5e7b-0d65-4059-b84c-1e07b865e5c5",
  "pubDate": "Tue, 26 Jan 2021 07:30:00 -0000",
  "itunes:duration": "00:50:36",
  "description": "<p>Laura’s longtime friend, Gabi Chereches, joins her for a very special episode this week. Currently a coach at The Woodlands Diving Academy, where he and Laura first met almost 30 years ago, Gabi’s many diving accomplishments include 3 Olympic Games, and 9 NCAA All-American honors. As a coach, he has guided athletes to both Junior and Senior titles and at numerous World Championships, and he was named the 2014 USA Diving Developmental Coach of the Year. Gabi has led an incredible life and he shares his fascinating story with Laura and all of you here today.\n \nTheir conversation tracks Gabi’s life and career from his days growing up in Romania through his remarkably successful diving career and up to the current day where he is proving equally successful as a diving coach. In the process, Gabi shares such details as what his life was like during Romania’s revolution, experiencing great success at an early age, his life changing interview at the Barcelona Games, and his move to live in the USA. Learning to speak English, his differing Olympics experiences, his college years, and how he handles tough or disappointing moments in his life are also discussed. Gabi draws the episode to a close by describing the weirdest time in his life, his coaching career and coming full circle in his life, what success means to him now, and by offering some parting advice for athletes and coaches. Laura and Gabi’s close friendship is fully evident in this heartfelt conversation today, as Gabi reviews his remarkable life, the lessons he has learned throughout, and the wisdom he has to offer us all regarding what is truly important in the arenas of both sports and life.</p>\n<p>Episode Highlights:\n \n·   Gabi’s start in diving\n·   Growing up in Romania during the revolution\n·   Enjoying so much success at such a young age\n·   The impact of his NBC interview at the Barcelona Olympics\n·   His move to the USA and his American family\n·   How Gabi learned to speak English\n·   His differing Olympic experiences\n·   His college experience\n·   Gabi’s third Olympics Games\n·   Handling disappointment\n·   The weirdest time of his life\n·   His start and progression as a coach\n·   Coming full circle\n·   Gabi’s current definition of success\n·   His parting words of wisdom</p>\n<p>Quotes:\n \n“I still remember my first jump off the 10 meter…it was scary.”\n \n“Diving is a very scary sport sometimes…if you have that ‘no fear’ it helps a lot.”\n \n“I actually appreciate that I went through that because…now that you reflect back, it makes you a better person.”\n \n“When you have a team like that, it becomes your family.”\n  \n“It was such a unique experience…it was awesome…I got spoiled pretty quickly.”\n \n“I was watching ‘Beavis and Butthead’.”\n \n“All you guys were pretty tough on me.”\n \n“We’ll call you out when you’re being a punk, you know, but we’re going to love you no matter what you do, for sure.”\n \n“Going into Atlanta, it felt more like home.”\n \n“Going to Tennessee, it was a no-brainer.”\n \n“Unfortunately, I just did not have a great performance in the 2000 Olympic Games.”\n \n“It’s not just one meet – it’s the journey.”\n \n“We’re just going to keep pulling you back in, too.”\n \n“This is how I’m going to give back.”\n \n“If you guide them through that process, then their journey becomes a little bit better, a little bit more family-type feeling for them.”\n \n“You have to figure it out, how to make them feel ready and right in their mind to approach certain skills and certain dives.”\n \n“I’m very lucky that I’m able to experience this.”\n \n“It’s been a cool ride so far.”\n \n“Let’s learn from each other.”</p>\n<p>Links:\nThe Pursuit of Gold homepage: <a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">  http://thepursuitofgold.com/</a> \n5 Smart Strategies to Confidence: <a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">  https://www.laurawilkinson.com/learn </a>\nLaura’s Social Media:\nInstagram: <a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">  https://www.instagram.com/lala_the_diver</a>  \nFacebook: <a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">  https://www.facebook.com/TheLauraWilkinson</a> \n \nLearn more about Gabi:\n \n<a href=\"https://www.teamusa.org/-/media/USA-Diving/Elections/2020/CCE-and-Senior-Elite-Coach-Rep/Senior-Elite-Coach-Rep-Candidate---Gabi-Chereches.pdf?la=en&hash=47DEEF6571B767C228E3F956B32A45BA04C35EFC\" rel=\"nofollow\">Gabi Chereches - TeamUSA</a>\nWoodlands Diving Team: <a href=\"http://woodlandsdiving.org\" rel=\"nofollow\">Woodlandsdiving.org</a></p>",
  "itunes:title": "When the Journey Brings You Full Circle with Olympic Diver and Coach Gabi Chereches",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 31
}