{
  "title": "Is Google Spying on your Conversations?",
  "link": "https://petewarden.com/2022/04/11/is-google-spying-on-your-conversations/",
  "comments": "https://petewarden.com/2022/04/11/is-google-spying-on-your-conversations/#respond",
  "dc:creator": "Pete Warden",
  "pubDate": "Mon, 11 Apr 2022 00:02:41 +0000",
  "category": "Uncategorized",
  "guid": "http://petewarden.com/?p=7656",
  "description": "Ok, I thought about leaving this as a one-word blog post, but even though I can categorically state that it isn&#8217;t happening, the fact that this question comes up regularly in my everyday life, and that I worked on always-on audio when I was at Google, makes me want to expand on this a bit. [&#8230;]",
  "content:encoded": "\n<figure class=\"wp-block-image size-large\"><a href=\"https://petewarden.files.wordpress.com/2022/04/no.png\"><img data-attachment-id=\"7657\" data-permalink=\"https://petewarden.com/no/\" data-orig-file=\"https://petewarden.files.wordpress.com/2022/04/no.png\" data-orig-size=\"368,247\" data-comments-opened=\"1\" data-image-meta=\"{\"aperture\":\"0\",\"credit\":\"\",\"camera\":\"\",\"caption\":\"\",\"created_timestamp\":\"0\",\"copyright\":\"\",\"focal_length\":\"0\",\"iso\":\"0\",\"shutter_speed\":\"0\",\"title\":\"\",\"orientation\":\"0\"}\" data-image-title=\"no\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://petewarden.files.wordpress.com/2022/04/no.png?w=300\" data-large-file=\"https://petewarden.files.wordpress.com/2022/04/no.png?w=368\" src=\"https://petewarden.files.wordpress.com/2022/04/no.png?w=368\" alt=\"\" class=\"wp-image-7657\" srcset=\"https://petewarden.files.wordpress.com/2022/04/no.png 368w, https://petewarden.files.wordpress.com/2022/04/no.png?w=150 150w, https://petewarden.files.wordpress.com/2022/04/no.png?w=300 300w\" sizes=\"(max-width: 368px) 100vw, 368px\" /></a><figcaption>No.</figcaption></figure>\n\n\n\n<p>Ok, I thought about leaving this as a one-word blog post, but even though I can categorically state that it isn&#8217;t happening, the fact that this question comes up regularly in my everyday life, and that I worked on always-on audio when I was at Google, makes me want to expand on this a bit.</p>\n\n\n\n<p>A good starting point is this BBC article from 2016 asking &#8220;<a href=\"https://www.bbc.com/news/technology-35639549\">Is your smartphone listening to you?</a>&#8220;, which includes the common anecdote of an ad that seems like it was triggered by a recent conversation, an investigation into the technical possibility that it could be happening, and denials from Google, Facebook, and Amazon that what users suspect is actually occurring. I worked for years on <a href=\"https://www.tensorflow.org/lite/microcontrollers\">the infrastructure Google uses for the machine learning models</a> to recognize speech triggers like &#8220;Hey Google&#8221;, so if you trust me you can take my word that we didn&#8217;t have the capability to do what people are concerned about. Even if you don&#8217;t trust me, there are public papers from <a href=\"https://arxiv.org/pdf/1812.02802.pdf\">Google</a> and <a href=\"https://machinelearning.apple.com/research/hey-siri\">Apple</a> that go into detail about how the always-on system in Android and iOS phones works. The summary is that in order to run even when most of the phone (including the CPU) is powered down, the microphone data has to be processed by a subsystem that is extremely constrained, because to avoid draining the battery it can only consume something like ten milliwatts. For comparison, a Cortex A processor used for the main CPU (or application processor) can easily burn a watt or more. To run at such low power, this subsystem has a lot less memory and compute than the application processor, often only a few hundred kilobytes of RAM and runs at a frequency in the low hundreds of megahertz. This makes running full speech recognition, or even listening for more than a few keywords, impractical from an engineering perspective. The Google research teams have managed some minor miracles like squeezing &#8220;<a href=\"https://support.google.com/pixelphone/answer/7535326?hl=en\">Now Playing</a>&#8221; onto the Pixel&#8217;s always-on subsystem, listening out for when music is playing and waking up the application processor to identify it, but it took incredible ingenuity to fit that into the memory budget available. Even though the article states the security researchers built a proof of concept app that didn&#8217;t use much power, they don&#8217;t link to any code or power measurements. Since regular Android developers can&#8217;t run apps on the always-on subsystem (it&#8217;s restricted to phone manufacturers) their app must have been running on the application processor, and I&#8217;m willing to bet a lot of money you&#8217;d notice your battery draining fast if the main CPU was awake for long periods.</p>\n\n\n\n<p>So, I would have been directly involved in any code that did the kind of conversational spying that many people incorrectly suspect is happening, and I&#8217;m in a good position to categorically say it isn&#8217;t. Why should you trust me though? Or to put it another way, how can an everyday user verify my statement? The BBC article is a bit unsatisfying, because they have security researchers create a proof of concept for an app that listens to conversations, and then state that the companies involved deny that they are doing this. Even if you have faith in the big tech firms involved, I know from <a href=\"https://petewarden.com/2010/04/05/how-i-got-sued-by-facebook/\">my own</a> <a href=\"https://www.today.com/money/your-iphone-secretly-tracking-you-all-time-123700\">experience</a> that their engineers can make mistakes and leak information accidentally. My knowledge is also aging, technology keeps improving and running full speech recognition on an always-on chip won&#8217;t always be out of reach.</p>\n\n\n\n<p>That gap, the fact that we have to trust the word of phone manufacturers that they aren&#8217;t spying on us and that there&#8217;s no good way for a third party to verify that promise, is what I&#8217;ll be focusing on in <a href=\"https://petewarden.com/2022/02/14/leaving-google-starting-stanford/comment-page-1/\">my research</a>. I believe it should be possible to build voice interfaces and other devices with microphones and cameras in such a way that someone like Underwriters&#8217; Laboratories or Consumer Reports can test their privacy guarantees. I&#8217;ve already explored <a href=\"https://openreview.net/forum?id=rlHeH9tx3SM\">some technical solutions</a> in the past, but I think it&#8217;s important to gather a coalition of people interested in the broader questions. With that in mind, if you are a researcher or engineer either in academia or industry who&#8217;s interested in this area, drop me an email at <a href=\"mailto:peteward@stanford.edu\">peteward@stanford.edu</a>. I&#8217;m hoping we can organize some kind of symposium and discussion groups to figure out the best practices. I believe that we as computer scientists can do better than just asking the public to blindly trust corporations to do the right thing, so let&#8217;s figure out how!</p>\n",
  "wfw:commentRss": "https://petewarden.com/2022/04/11/is-google-spying-on-your-conversations/feed/",
  "slash:comments": 0,
  "media:content": [
    {
      "media:title": "petewarden"
    },
    ""
  ]
}