{
  "title": "#410: Auto joErotic A Fixation with Joe Rogan (plus Ryan Oneill joins for the intro)",
  "itunes:title": "Auto joErotic A Fixation with Joe Rogan",
  "pubDate": "Mon, 14 Dec 2020 09:30:00 +0000",
  "guid": "fb6b790c-8974-454e-9201-0889ae5a5919",
  "link": "https://shaffir1.libsyn.com/410-auto-joerotic-a-fixation-with-joe-rogan-plus-ryan-oneill-joins-for-the-intro",
  "itunes:image": "",
  "description": "<p>Joe Rogan loves two things. Fast cars and dank weed. And he's owned plenty of both. Joe and I talked about where his automobile obsession came from, the coolest cars he's ever driven, road handies, and much more. Joe smoked a fat cigar as I was watched with jealous eyes as I was stuck inside what looked like a Chechnyan prison where they had a no-smoking policy. We talked about the old days vs new days of the Store and how cool it is that comedy is dangerous again. Rogan and I were both sitting behind tables the whole time so there's no way to know what our pants situation was for this. You'll learn a ton about cars in this one and it was legit a hella great time laughing and talking to my buddy.</p> <div class=\"adL\"> <div class=\"im\"> <div>Valpo's finest, Ryan \"Dr Dingus\" O'neill, joined me for the intro and outro. I amazed Ryan with stories of real-life freak show, Dog Boy. Talked about cars a little with him too, and then we took some callers at the end of the outro to get the best road sex stories among some other fun topics. You will learn absolutely nothing during the intro and outro. It was a legit hella great time laughing and talking to my buddy but for real, your life will be in no way enriched by the intro and outro to this podcast. You might actually become worse as a person for listening to me and O'neill. Again, quite funny. But zero social merit.</div> <div><br /> Thank you to the <strong>Stereo App</strong> for sponsoring today's podcast. If you were on Stereo, you could've left messages for me and Ryan to comment on while we were recording. Get on there before I record the next one. </div> <div> </div> <div> </div> <div><strong><em>The Music</em></strong></div> <div> <p dir=\"ltr\">Gary Numan - Cars</p> <p dir=\"ltr\">Janis Joplin - Mercedez Benz</p> <p dir=\"ltr\">Heart - Barracuda</p> <p dir=\"ltr\">Led Zeppelin - Whole Lotta Love</p> <p dir=\"ltr\">Bitchin Camaro - Dead Milkmen</p> <p dir=\"ltr\">Queen - I’m in Love With My Car</p> </div> <div><strong><em> </em></strong></div> <div><strong><em>Patreon:</em></strong></div> <div>Please help support me by joining my Patreon. You could've watched this one days before anybody else and there's plenty of Patreon exclusive content on there. For $5 a month, it really helps keep me in business.</div> <div><a href=\"http://www.patreon.com/arishaffir\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl= \"https://www.google.com/url?q=http://www.patreon.com/arishaffir&source=gmail&ust=1607988456497000&usg=AFQjCNEJrMprBi5bxlK4x7AHM-sNMXsb-g\"> www.patreon.com/arishaffir</a></div> </div> </div>",
  "content:encoded": "<p>Joe Rogan loves two things. Fast cars and dank weed. And he's owned plenty of both. Joe and I talked about where his automobile obsession came from, the coolest cars he's ever driven, road handies, and much more. Joe smoked a fat cigar as I was watched with jealous eyes as I was stuck inside what looked like a Chechnyan prison where they had a no-smoking policy. We talked about the old days vs new days of the Store and how cool it is that comedy is dangerous again. Rogan and I were both sitting behind tables the whole time so there's no way to know what our pants situation was for this. You'll learn a ton about cars in this one and it was legit a hella great time laughing and talking to my buddy.</p>   Valpo's finest, Ryan \"Dr Dingus\" O'neill, joined me for the intro and outro. I amazed Ryan with stories of real-life freak show, Dog Boy. Talked about cars a little with him too, and then we took some callers at the end of the outro to get the best road sex stories among some other fun topics. You will learn absolutely nothing during the intro and outro. It was a legit hella great time laughing and talking to my buddy but for real, your life will be in no way enriched by the intro and outro to this podcast. You might actually become worse as a person for listening to me and O'neill. Again, quite funny. But zero social merit.  Thank you to the Stereo App for sponsoring today's podcast. If you were on Stereo, you could've left messages for me and Ryan to comment on while we were recording. Get on there before I record the next one.      <em>The Music</em>  <p dir=\"ltr\">Gary Numan - Cars</p> <p dir=\"ltr\">Janis Joplin - Mercedez Benz</p> <p dir=\"ltr\">Heart - Barracuda</p> <p dir=\"ltr\">Led Zeppelin - Whole Lotta Love</p> <p dir=\"ltr\">Bitchin Camaro - Dead Milkmen</p> <p dir=\"ltr\">Queen - I’m in Love With My Car</p>  <em> </em> <em>Patreon:</em> Please help support me by joining my Patreon. You could've watched this one days before anybody else and there's plenty of Patreon exclusive content on there. For $5 a month, it really helps keep me in business. <a href=\"http://www.patreon.com/arishaffir\" target=\"_blank\" rel=\"noopener\" data-saferedirecturl= \"https://www.google.com/url?q=http://www.patreon.com/arishaffir&source=gmail&ust=1607988456497000&usg=AFQjCNEJrMprBi5bxlK4x7AHM-sNMXsb-g\"> www.patreon.com/arishaffir</a>  ",
  "enclosure": "",
  "itunes:duration": "04:30:45",
  "itunes:explicit": true,
  "itunes:keywords": "",
  "itunes:subtitle": "Joe Rogan loves two things. Fast cars and dank weed. And he's owned plenty of both. Joe and I talked about where his automobile obsession came from, the coolest cars he's ever driven, road handies, and much more. Joe smoked a fat cigar as I was...",
  "itunes:episode": 410,
  "itunes:episodeType": "full",
  "itunes:author": "Ari Shaffir"
}