{
  "id": "yt:video:tFHMkB6dZxI",
  "yt:videoId": "tFHMkB6dZxI",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "DC League of Super-Pets | Meet The Pets - Chip",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-06-24T17:02:42+00:00",
  "updated": "2022-06-24T17:02:42+00:00",
  "media:group": {
    "media:title": "DC League of Super-Pets | Meet The Pets - Chip",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "https://www.facebook.com/DCLeagueOfSu...\nhttps://www.instagram.com/dcleagueofs...\nhttps://twitter.com/DCSuperPets\n\n-----------------\n\nDwayne Johnson stars as the voice of Krypto the Super-Dog in Warner Bros. Pictures’ animated action adventure feature film “DC League of Super-Pets,” from director Jared Stern.\n\nThe film also stars the voices of Kevin Hart (the “Jumanji” and “Secret Life of Pets” films), Kate McKinnon (“Saturday Night Live,” the “Magic School Bus Rides Again” films, “Ferdinand”), John Krasinski (the “Quiet Place” films, “Free Guy”), Vanessa Bayer (“Saturday Night Live,” “Office Christmas Party,” “Trainwreck”), Natasha Lyonne (“Show Dogs,” “Ballmastrz 9009”), Diego Luna (“Rogue One: A Star Wars Story,” “Maya and the Three”), Marc Maron (“Joker,” “GLOW”), Thomas Middleditch (“Godzilla: King of the Monsters,” “Captain Underpants: The First Epic Movie”), Ben Schwartz (“Sonic the Hedgehog,” “Duck Tales”), and Keanu Reeves (the “Matrix” and “John Wick” films).\n\nIn “DC League of Super-Pets,” Krypto the Super-Dog and Superman are inseparable best friends, sharing the same superpowers and fighting crime in Metropolis side by side. When Superman and the rest of the Justice League are kidnapped, Krypto must convince a rag-tag shelter pack—Ace the hound, PB the potbellied pig, Merton the turtle and Chip the squirrel—to master their own newfound powers and help him rescue the Super Heroes.\n\nStern, a veteran writer/consultant on the “LEGO®” movies, makes his animated feature film directorial debut, directing from a screenplay he wrote with frequent collaborator John Whittington, based on characters from DC, Superman created by Jerry Siegel and Joe Shuster. The film is produced by Patricia Hicks, Dwayne Johnson, Dany Garcia, Hiram Garcia and Jared Stern. The executive producers are John Requa, Glenn Ficarra, Nicholas Stoller, Allison Abbate, Chris Leahy, Sharon Taylor and Courtenay Valenti.\nStern’s creative team includes production designer Kim Taylor (“The LEGO® Ninjago Movie”) and editors David Egan (“Game Night,” “Vacation”) and Jhoanne Reyes (“Teen Titans GO!” “Young Justice”). The music is by Steve Jablonsky (the “Transformers” films).\n\nWarner Bros. Pictures Presents A Seven Bucks Production, “DC League of Super-Pets.” The film will be released by Warner Bros. Pictures in theaters internationally beginning 27 July 2022 and in North America on July 29, 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}