{
  "title": "Face In The Window | Best of RGSO",
  "link": "https://audioboom.com/posts/8158395",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1913,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Who was the face that was seen through a car window late in the night? Here is a preview of the story. “I had to call the police to get him to the hospital because he wouldn't go with me alone. As it turns out we went to a behavioral hospital to admit him for the doming week for observation and medication adjustments. While I was there one day a doctor talked to my husband about how he was a survivor. He had survived Covid 19 and now carbon monoxide poisoning. The doctor told him that most people don't survive longer than 15 minutes in a running car and he had been in the car for 45 minutes and was unscathed. My husband talked to me about this conversation before I left to come home from the visitation that day and on the way home his father's face popped up just below the rear view mirror of my car (his father had been dead since 1974 and had taken his own life in a running car in the garage of their home). I hadn't even thought about his father's death before that moment. HIs dad spoke to me saying \"I was with him in the car the whole time\" and then the face vanished.” Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a> If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802! If you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a> Follow Tony: Instagram: <a href=\"http://www.instagram.com/tonybrueski\">HTTP://www.instagram.com/tonybrueski</a> TikToc: <a href=\"https://www.tiktok.com/@tonybrueski\">https://www.tiktok.com/@tonybrueski</a> Facebook: <a href=\"https://www.facebook.com/tony.brueski\">https://www.facebook.com/tony.brueski</a>\n</div>\n",
  "pubDate": "Thu, 15 Sep 2022 15:28:56 +0000",
  "guid": "tag:audioboom.com,2022-09-15:/posts/8158395",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}