{
  "title": "S1E53 - Coming Back Stronger with Diving Olympic Bronze Medalist Krysta Palmer",
  "guid": "https://pinecast.com/guid/bbca80ec-32d0-4059-ad2d-569a2fcbdc78",
  "pubDate": "Tue, 14 Sep 2021 17:33:27 -0000",
  "itunes:duration": "01:21:38",
  "description": "<p>Today’s guest made history in Tokyo this summer, becoming the first woman to medal in springboard diving at the Olympics since Kelly McCormick won Bronze 33 years ago in Seoul, Korea in 1988. Krysta Palmer made her first Olympic team this summer at the age of 29. Watching her smile and giggle at the podium with her Bronze Medal proudly hanging around her neck warmed hearts all over the country. Krysta’s positivity is infectious and her perseverance throughout her journey to get to the Olympic podium is absolutely inspiring. Today she opens up about the injuries that took her out of contention in the sport of trampoline, what it was like to start a brand new sport at the age of 20, and she walks us through her extraordinary adventure in Tokyo, from a close call in the preliminary round to the very moment she realized she had medaled. Krysta offers mindset tips all along the journey, and she shares with us her favorite way to process both the good and the bad so that she can keep coming back stronger. </p>\n<p>Krysta begins with her unique journey in sports, and reflects on coming back stronger from her recurring injuries, as well as how she ultimately found diving at the age of 20. She talks about transitioning her skills from trampoline to diving, working with her coach, Jianli You, to change certain habits, and entering the 2016 Olympic Team Trials following her graduation from the University of Nevada. Krysta tells Laura about a training trip to China that served as a turning point in her path to becoming an Olympian, as well as how her own experience as a coach has helped her as an athlete, and what she learned from competing in the 2017 and 2019 World Championships (her first international meet). She explains how her mindset to learn and grow from setbacks has helped her through the pandemic, and shares the moving story of receiving her Olympic ring from Laura. You’ll hear about Krysta’s memorable experience at the Tokyo Olympics, how her faith keeps her grounded, and the surreal and exciting moment she realized she had medaled in Tokyo.</p>\n<p>Krysta’s honesty and perseverance throughout today’s conversation are sure to motivate and inspire as she shares her incredible journey, and everything she has overcome to be able to do what she loves to do.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Krysta’s journey in sports, beginning with gymnastics and trampoline at a young age</li>\n<li>Coming back stronger from her heartbreaking injuries and finding diving at the age of 20</li>\n<li>Transitioning her skills from trampoline to diving, changing certain habits, learning new dives on the fast track</li>\n<li>Entering the 2016 Olympic Team Trials following her graduation from the University of Nevada</li>\n<li>Her training trip to China in 2016, and how it brought her closer to becoming an Olympian</li>\n<li>The difference between platform and springboard diving, and Krysta’s transition from platform to springboard</li>\n<li>Supporting her athletic training after college through coaching, and how this has helped her become a better athlete</li>\n<li>Her experience at the World Championships in 2017 and 2019</li>\n<li>Learning and growing the most from disappointments or poor competitions</li>\n<li>How this mentality helped her make the most of trials and tribulations brought on by the pandemic</li>\n<li>Training through injuries and her family’s support throughout her career</li>\n<li>Krysta’s very special memory of receiving her Olympic ring from Laura</li>\n<li>Her unique experience at the Tokyo Olympics</li>\n<li>The importance of Krysta’s faith</li>\n<li>The surreal and exciting experience of realizing she had medaled in Tokyo</li>\n<li>How Krysta continues to process her accomplishment and what the next season of her life looks like</li>\n<li>Continuing her education and studying toward an MBA</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“At the age of five, when I was young, I really really had this lifelong dream of being an Olympian one day.”</li>\n<li>“You're always having to use your visual awareness to spot where you are. And make changes based on where you are. So I learned that through trampoline, and that actually really progressed well into my diving career.”</li>\n<li>“I've had two big struggles in learning how to make a proper entry. And also learning how to get the rhythm and the timing with the springboard, because also trampoline is very quick - quick twitch muscle work.”</li>\n<li>“I competed platform in the 2016 Olympic Trials because we weren't quite there yet with springboard. And my coach had always said, Give it time. Because springboard diving...you need time to develop the skill of it.”</li>\n<li>“I came into the team mid-semester, so in January. And I had to learn all my springboard dives for 1-meter/3-meter before Conference in February.”</li>\n<li>“I think the biggest thing was just trusting my coach [Jianli You], because I knew that she has the knowledge and the skill to teach me, whatever it is. I'm learning and I have the talent to try it. And it only takes me trying it to learn something new.”</li>\n<li>“That was the trip that made me stronger as a diver and as a person.”</li>\n<li>“I really gained a whole other level of respect for my coach at that time, because I really saw how respected she is amongst all the Chinese coaches and athletes.”</li>\n<li>“For me, it really made me appreciate my sport and my country and our freedom to choose to be able to do sports.”</li>\n<li>“I think that was the biggest takeaway for me from the trials is just feeling like I fit in. But I know that there's still more in me and I still need to learn more in order to get to that point.”</li>\n<li>“We really did take a step back from platform at that time. Then springboard started to pick up, and I was competing in it at all the Nationals and getting better and better.”</li>\n<li>“The springboard is very similar to trampoline, and I can do a lot of the same skills that I would typically do on a trampoline as well.”</li>\n<li>“I was coaching our club team. And that's really the majority of where I got money in order to survive and make a living. And so I was starting to see things from a coaching perspective, which actually helped me as an athlete as well.”</li>\n<li>“That's been a big learning lesson as I transition from a college athlete to now a professional athlete, is just to really pay attention to everything that surrounds me as an athlete, and what's going to help me achieve my dream.”</li>\n<li>“My first ever international competition was the World Championships in 2017.”</li>\n<li>“Coming back from that competition, I really had done a lot of processing and journaling, writing things down of what went wrong. What I learned was my mentality going into this event - I really learned that I had put a lot of pressure on myself. And nobody else did that. I was the one that did it to myself.”</li>\n<li>“I really needed to learn from that. And not necessarily get dragged down by the failure of it. But stepping into, kind of, that failure and learning from it, and then growing from it, and taking the next step into the next chapter, and facing what happened… These competitions were actually the ones that I've learned and grown the most from.”</li>\n<li>“I think my mentality through all my injuries really helped me through the pandemic, because it was really, Be stronger than you were before the injury. And coming into the pandemic, I could see it two different ways - I could see it as a disappointment and as a setback. Or I could see it as an opportunity and an area to grow, and another year of training, which is really beneficial for me because I’m still a new diver.”</li>\n<li>“I really chose to look at it that way and took that mentality from the injury standpoint and said, Hey, I'm going to be stronger than I was before the pandemic.”</li>\n<li>“For me, it's a performance. I love getting out there and just showing off what I love to do.”</li>\n<li>“That was just a beautiful, beautiful moment for me to receive [my Olympic ring] from you. And you're telling the story - I'm still getting chills because it's special for me.”</li>\n<li>“For me, what keeps me grounded is reading the Bible and getting my time with God.”</li>\n<li>“At that point, [Coach Jianli You] knew that I had medaled. And so I gave her this big hug. And she just held me tight. And she just said, We did it. We did it. And so that's just - that was a beautiful moment.”</li>\n<li>“I don't think this is my peak performance as a diver... I know that there's so much more that I still have left in me.”</li>\n</ul>\n<p>Show Links</p>\n<p><a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold Homepage</a>\n<a href=\"https://www.amazon.com/Life-10-Meters-Lessons-Champion/dp/B096CQW2L7/ref=sr_1_3?crid=2AXVGI3HL987J&dchild=1&keywords=laura+wilkinson+life+at+10+meters&qid=1624113646&sprefix=Laura+Wilkinson%2Caps%2C227&sr=8-3\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a>\n<a href=\"https://www.laurawilkinson.com/learn\" rel=\"nofollow\">5 Smart Strategies to Confidence</a>\n<a href=\"https://laurawilkinson.mykajabi.com/email-capture-0d05ebf5-739d-43b0-a4ab-5f4ea91a24e6\" rel=\"nofollow\">Conquer Your Fear in 5 Days</a>      \n        \nLaura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura's Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura's Facebook page</a></p>\n<p>Krysta’s Social Media:\n<a href=\"https://www.instagram.com/krystapalmer/?hl=en\" rel=\"nofollow\">Krysta Palmer’s Instagram</a>\n<a href=\"https://www.facebook.com/teamkrysta/\" rel=\"nofollow\">Cheer for Krysta Facebook Page</a>\n<a href=\"https://twitter.com/palmerkrysta?lang=en\" rel=\"nofollow\">Krysta Palmer’s Twitter @PalmerKrysta</a></p>",
  "itunes:title": "Coming Back Stronger with Diving Olympic Bronze Medalist Krysta Palmer",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 53
}