{
  "title": "Episode 57: Expectancy Theory, Goal Setting and Getting in Shape!",
  "pubDate": "Fri, 16 May 2008 13:30:40 +0000",
  "guid": "episode-57-expectancy-theory-goal-setting-and-ge",
  "link": "http://www.thepsychfiles.com/2008/05/16/episode-57-expectancy-theory-goal-setting-and-getting-in-shape/",
  "itunes:image": "",
  "description": "Trying to get in shape and lose weight?  What's the psychology behind getting in shape? Well, first forget the psychobabble.  In this episode of The Psych Files podcast I examine two established theories of human motivation - goal setting and expectancy theory.  If you've tried the Atkins diet, the south beach diet some other low carb diet plan or even (yikes!) a lemonade diet, then it's time to try something different - get into your head just a little bit and see what's going on in there.  Join me for a different perspective on weight loss, exercise and fitness.",
  "content:encoded": "Trying to get in shape and lose weight?  What's the psychology behind getting in shape? Well, first forget the psychobabble.  In this episode of The Psych Files podcast I examine two established theories of human motivation - goal setting and expectancy theory.  If you've tried the Atkins diet, the south beach diet some other low carb diet plan or even (yikes!) a lemonade diet, then it's time to try something different - get into your head just a little bit and see what's going on in there.  Join me for a different perspective on weight loss, exercise and fitness.",
  "enclosure": "",
  "itunes:duration": "24:19",
  "itunes:explicit": false,
  "itunes:keywords": "loss,fitness,Sports,psychology,lecture,diet,weight",
  "itunes:subtitle": "Trying to get in shape and lose weight? What's the psychology behind getting in shape? First forget the psychobabble. In this episode of The Psych Files podcast I examine two established theories of human motivation - goal setting and expectancy theory.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "Trying to get in shape and lose weight? What's the psychology behind getting in shape? Well, first forget the psychobabble. In this episode of The Psych Files podcast I examine two established theories of human motivation - goal setting and expectancy theory. If you've tried the Atkins diet, the south beach diet some other low carb diet plan or even (yikes!) a lemonade diet, then it's time to try something different - get into your head just a little bit and see what's going on in there. Join me for a different perspective on weight loss, exercise and fitness."
}