{
  "id": "tag:blogger.com,1999:blog-10004977.post-596785853901324196",
  "published": "2022-11-03T10:14:00.003-04:00",
  "updated": "2022-11-03T10:14:13.345-04:00",
  "title": "ISM® Services Index Decreased to 54.4% in October",
  "content": "(Posted with permission).  The&nbsp;<a href=\"http://ismrob.org/\">ISM® Services index</a> was at 54.4%, down from 56.7% last month. The employment index decreased to 49.1%, from 53.0%.  Note: Above 50 indicates expansion, below 50 in contraction. <br /><br />From the Institute for Supply Management: <a href=\"https://www.ismworld.org/supply-management-news-and-reports/reports/ism-report-on-business/services/october/\">Services PMI® at 54.4% October 2022 Services ISM® Report On Business®</a><blockquote>Economic activity in the services sector grew in October for the 29th month in a row — <b>with the Services PMI® registering 54.4 percent</b> — say the nation's purchasing and supply executives in the latest Services ISM® Report On Business®.<br /><br />The report was issued today by Anthony Nieves, CPSM, C.P.M., A.P.P., CFPM, Chair of the Institute for Supply Management® (ISM®) Services Business Survey Committee: “In October, the Services PMI® registered 54.4 percent, 2.3 percentage points lower than September’s reading of 56.7 percent. This is the lowest reading since May 2020, when the index registered 45.2 percent. The Business Activity Index registered 55.7 percent, a decrease of 3.4 percentage points compared to the reading of 59.1 percent in September. The New Orders Index figure of 56.5 percent is 4.1 percentage points lower than the September reading of 60.6 percent.<br /><span style=\"font-size: x-small;\">emphasis added</span></blockquote>This was lower than expected and the employment index was below 50.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Calculated Risk",
    "uri": "http://www.blogger.com/profile/08664541332908374389",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}