{
  "title": "Investors Skittish Over China's Covid Policy",
  "description": "Continued lockdown regime makes EU companies bearish on China",
  "link": "https://www.asiasentinel.com/p/investors-skittish-china-covid-policy",
  "guid": "https://www.asiasentinel.com/p/investors-skittish-china-covid-policy",
  "pubDate": "Sat, 22 Oct 2022 03:42:33 GMT",
  "enclosure": "",
  "content:encoded": "<h5>By: Toh Han Shih</h5><div class=\"captioned-image-container\"><figure><a class=\"image-link is-viewable-img image2\" target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg\"><div class=\"image2-inset\"><picture><source type=\"image/webp\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_webp,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 1456w\" sizes=\"100vw\"><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg\" width=\"1379\" height=\"919\" data-attrs=\"{\"src\":\"https://bucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com/public/images/ffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg\",\"fullscreen\":null,\"imageSize\":null,\"height\":919,\"width\":1379,\"resizeWidth\":null,\"bytes\":282612,\"alt\":null,\"title\":null,\"type\":\"image/jpeg\",\"href\":null,\"belowTheFold\":false,\"internalRedirect\":null}\" class=\"sizing-normal\" alt=\"\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fffc91b6c-9d73-417b-b05f-7e2810f75c89_1379x919.jpeg 1456w\" sizes=\"100vw\"></picture><div class=\"image-link-expand\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" viewBox=\"0 0 24 24\" fill=\"none\" stroke=\"#FFFFFF\" stroke-width=\"2\" stroke-linecap=\"round\" stroke-linejoin=\"round\" class=\"lucide lucide-maximize2\"><polyline points=\"15 3 21 3 21 9\"></polyline><polyline points=\"9 21 3 21 3 15\"></polyline><line x1=\"21\" y1=\"3\" x2=\"14\" y2=\"10\"></line><line x1=\"3\" y1=\"21\" x2=\"10\" y2=\"14\"></line></svg></div></div></a></figure></div><p>China&#8217;s stringent Zero-Covid-19 policy has cut so far into foreign investment that investors from the 27-country European Union put more money into the US state of Texas, with 2021 GDP of US$1.9 trillion, than they did into China (US$17.74 trillion) last year, according to Joerg Wuttke, president of the EU Chamber of Commerce in China.</p><p>Nonetheless, Chinese leader Xi Jinping reaffirmed the strict lockdown at China&#8217;s 20th quadrennial Party Congress in Beijing this week. The week-long congress, which opened on October 16, is expected to give Xi an unprecedented third term, breaking the two-term limit for Chinese presidents laid down by the late Chinese leader Deng Xiaoping.</p><p>A UBS report forecast that the country&#8217;s restrictions will be eased significantly after the National People&#8217;s Congress in March 2023, though there is a risk that the current Zero-Covid policy may stay unchanged for longer, especially with the recent arrival in Asia of a swarm of variants.</p><p>&#8220;China with this rigid closing of the country is opening the doors for other countries for European investment,&#8221; said Wuttke at a <a href=\"https://sgc.frankfurt-school.de/\">virtual roundtable</a> of the Sino-German Center of the Frankfurt School. EU investment in China is currently &#8220;limping along&#8221; at an average of &#8364;2 billion per quarter, while last year, he said, it was 20 times more in the US.</p><p>&#8220;We have seen (EU) companies going to other countries and looking for options, China plus one or China plus two. That is maybe good for Southeast Asia,&#8221; Wuttke said. &#8220;For us in China, it is a bit of an unheard-of situation. It used to be in beauty contests, it was China and China only.&#8221;&nbsp;</p><p>Some foreign companies are moving their regional headquarters out of Shanghai because of the Covid-19 restrictions in that city which recently saw an upsurge in the pandemic, he said.</p><p>Strict Covid-19 containment policies continue to complicate China&#8217;s economic interaction with the outside world, and with the significant uptick of Omicron variant infections, international travel restrictions are likely to remain in place for much of 2022, said the EU Chamber of Commerce in China&#8217;s position paper which was released on September 21.</p><p>&#8220;This will further drag on the pace of deal-making and hinder due diligence processes,&#8221; according to the document. &#8220;In fact, the growing list of challenges is pushing many (European companies) to reduce, localize and silo their China operations, with an increasing number creating two separate systems&#8212;one for China and one for the rest of the world&#8212;which is an expensive and inefficient solution.&#8221;</p><p>According to the results of a flash survey by the European Chamber on the impact of both Covid-19 containment measures of China and the Russian invasion of Ukraine, 23 percent of respondents are considering shifting current or planned investments outside of China.</p><p>China&#8217;s GDP growth is expected to slow sharply to 2.8 percent in 2022 from 8.1 percent in 2021, the World Bank <a href=\"https://www.worldbank.org/en/country/china/overview\">predicted</a>. &#8220;Wide-spread Omicron outbreaks and extreme weather have weakened economic growth.&#8221;</p><p>Wuttke said a GDP growth of 2.8 percent is nearly a recession for China&#8217;s economy. &#8220;For the first time since 1990, the rest of Asia is nearly growing twice as fast as China, and that of course is courtesy to the zero-tolerance policy,&#8221; he added.</p><p>&#8220;Hong Kong has lost a lot of its allure for international finance. Singapore is overrun with business,&#8221; Wuttke said.</p><p>In recent weeks, Asia Sentinel observed large numbers of foreign businessmen attending multiple conferences and the Formula One race during a visit to Singapore. In contrast, Hong Kong, where this correspondent lives, is more subdued in terms of foreign business visits.</p><p>The EU has free trade agreements with Singapore, Vietnam, South Korea, and Japan, which EU companies should exploit, Wuttke urged. His bearish outlook on China contrasts with the upbeat statements of Wang Wenbin, a Chinese Foreign Ministry spokesman at the ministry&#8217;s <a href=\"https://www.fmprc.gov.cn/mfa_eng/xwfw_665399/s2510_665401/202209/t20220927_10772627.html\">press conference</a> on September 27.</p><p>For the first eight months of this year, Wang said, China-EU trade increased by 8.8 percent year-on-year and EU investment in China went up by 123.7 percent. But Rhodium Group, a US consultancy, gives less euphoric figures, saying first-half FDI from the EU into China rose 14.6 percent year-on-year to &#8364;5.5 billion.</p><p>Greenfield FDI in China hit a historic low in the first half of this year, according to fDi Intelligence, a provider of FDI data. In the first half of this year, 177 greenfield projects were announced by foreign investors in China, slightly down from the 191&nbsp;projects over the same period of 2020, according to fDi which is affiliated with the Financial Times.</p><p>The 20th Party Congress report on which Xi based his October 16 speech mentions Marx or Marxism 31 times, but mentions &#8220;market&#8221; 19 times. The report&#8217;s more frequent mention of Marx over the market gives a taste of what will happen to the Chinese economy, Wuttke commented. &#8220;Ideology trumps the economy.&#8221;</p><p>Among the 2,296 delegates who attended the 20th Party Congress, only 18 were from the private sector, Wuttke noted. That is fewer than the 27 businessmen who attended the Party Congress in 2017 and the 34 in 2012.</p><p>&#8220;China is pushing more private entrepreneurs against the wall, which is of course not very good,&#8221; Wuttke said.</p><p>Enodo Economics, a UK think tank focusing on China, said, &#8220;Enodo believes that the renewed commitment to Xi&#8217;s policy preferences will be bearish for China equities, absent a softening of zero-Covid or warming of US-China relations. Xi&#8217;s speech on Sunday, at the opening of the Party Congress, gave no indication that either was in the cards.&#8221;</p><p><em><strong>Toh Han Shih</strong> is chief analyst of Headland Intelligence, a Hong Kong risk consultancy.</em></p>"
}