{
  "id": "yt:video:3DC8INr7tvQ",
  "yt:videoId": "3DC8INr7tvQ",
  "yt:channelId": "UC-3SbfTPJsL8fJAPKiVqBLg",
  "title": "This Parasite is Cramping The Monarch Butterfly’s Style | Deep Look",
  "link": "",
  "author": {
    "name": "Deep Look",
    "uri": "https://www.youtube.com/channel/UC-3SbfTPJsL8fJAPKiVqBLg"
  },
  "published": "2022-10-11T13:00:25+00:00",
  "updated": "2022-10-31T07:27:24+00:00",
  "media:group": {
    "media:title": "This Parasite is Cramping The Monarch Butterfly’s Style | Deep Look",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Monarchs are locked in a battle with Ophryocystis elektroscirrha (OE), a parasite that can trap a butterfly in its own chrysalis and deform its beautiful wings. Turns out there is a wrong way, and a *right way,* for you to help these butterflies in your backyard.\n\nSUBSCRIBE to Deep Look! https://www.youtube.com/user/kqeddeeplook?sub_confirmation=1\nPlease join our community on Patreon! https://www.patreon.com/deeplook\n\nDEEP LOOK is a ultra-HD (4K) short video series created by KQED San Francisco and presented by PBS Digital Studios. Explore big scientific mysteries by going incredibly small.\n\n---\n\nMonarch butterflies are one of the most recognizable animals in the world, but these beloved insects face have lost much of their historic milkweed habitat to agriculture and development. As a result, monarchs are more concentrated on the milkweed plants they have left. \n\nMonarch caterpillars are completely reliant on milkweed for food and many people plant milkweed in their yards to help them. But not all milkweed is the same.\n\nTropical milkweed, with its pretty orange and red flowers, doesn’t die back in the fall and that means that the protozoan parasite Ophryocystis elektroscirrha (OE) has more time to build up on its leaves.\n\nMonarch caterpillars inadvertently ingest the spores, which release the microscopic parasites into the caterpillar’s flesh. When a heavily infected monarch goes through metamorphosis, the butterfly will have lesions on its abdomen, making it stick to the inside of its chrysalis.\n\n“It gets stuck and you really see the butterfly struggle at that point which is a sad sight,” says Jacobus de Roode, a researcher at Emory University in Atlanta who studies the relationship between monarchs and OE. \n\n“Normally the butterfly comes out very smoothly, it pops out and starts pumping up those wings. But when they get stuck you can see them for minutes or even hours struggling and they just can’t get out. It’s kind of traumatic.” \n\n--\n\n--- How do monarch butterflies help humans?\nMonarch butterflies are important pollinators that are hugely beneficial to the ecosystems in which they are found. \n\n--- Where do monarch butterflies migrate each year?\nIn the fall, monarch butterflies travel to their overwintering locations. The majority of monarchs live east of the Rock Mountains and they travel to central Mexico. The monarchs that spend their summers west of the Rockies travel to the central California coast. There is some overlap between the populations of monarchs.\n\n--- How do monarch butterflies protect themselves?\nMonarch caterpillars feed on milkweed plants, which contain toxic substances called cardiac glycosides that accumulate in the caterpillar’s flesh and stay with it even after it metamorphoses into a butterfly. Both monarch caterpillars and butterflies have vibrant warning colors that tell predators that they don’t taste good.\n\n\n---+ Find additional resources and a transcript on KQED Science:\n\nhttps://www.kqed.org/science/1980427/this-nasty-parasite-is-ruining-monarch-butterfly-wings\n\n---+ For more information:\n\nThe de Roode Lab at Emory University in Atlanta: https://deroodelab.org/\n\n---+ More Great Deep Look episodes:\n\nGlasswing Butterflies Want To Make Something Perfectly Clear | Deep Look\nhttps://youtu.be/LYxTyMF9k_4\n\nThe Pipevine Caterpillar Thrives in a Toxic Love Triangle | Deep Look\nhttps://youtu.be/TQQv7h11g_c\n\n---+ Shoutout!\n\n 🏆Congratulations🏆 to these fans on our Deep Look Community Tab to correctly answer our GIF challenge! \n\nJodie B\nAmy\nB.C.\nkingLorshi\nLauren Petro\n\n---+ Thank you to our Top Patreon Supporters ($10+ per month)!\n\nJessica\nBurt Humburg\nKaren Reynolds\nDaisuke Goto\nAllison & Maka Masuda\nDavid Deshpande\nChris B Emrick\nTianxing Wang\nCompanion Cube\nWade Tregaskis\nMark Jobes\nKevin Judge\nBlanca Vides\nLaurel Przybylski \nJana Brenning \nAnastasia Grinkevic\nTitania Juang\nSupernovabetty \nmonoirre \nAurora \nRoberta K Wright\nKW \nEl Samuels\nCarrie Mukaida\nSyniurge \nKimberly Hall\nJessica Hiraoka\nJellyman\nCristen Rasmussen\nMehdi\nNicky Orino\nSueEllen McCann\nKelly Hong\nCindy McGill\nNoreen Herrington\nLaurel Przybylski\nShelley Pearson Cranshaw\nLouis O'Neill\nJeremiah Sullivan\nNicolette Ray\nLevi Cai\nElizabeth Ann Ditz\nCaitlin McDonough\nSilvan\nDelphine Tseng\nTierZoo \nKenneth Fyrsterling\n\n\n---+ Follow Deep Look and KQED Science on social:\n \nhttps://www.tiktok.com/@deeplookofficial\nhttps://www.patreon.com/deeplook\nInstagram: https://www.instagram.com/kqedscience/\nTwitter: https://www.twitter.com/kqedscience\n\n---+ About KQED\n\nKQED, an NPR and PBS affiliate in San Francisco, CA, serves Northern California and beyond with a public-supported alternative to commercial TV, Radio and web media.\n\nFunding for Deep Look is provided in part by PBS Digital Studios. Deep Look is a project of KQED Science, the largest science and environment reporting unit in California. KQED Science is supported by the Dirk and Charlene Kabcenell Foundation, Campaign 21 and the members of KQED.\n\n#deeplook",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}