{
  "title": "Episode 47: &#8220;Goodnight My Love&#8221; by Jesse Belvin",
  "link": "https://500songs.com/podcast/episode-47-goodnight-my-love-by-jesse-belvin/",
  "pubDate": "Mon, 26 Aug 2019 12:56:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=608",
  "description": "Welcome to episode forty-seven of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Goodnight My Love\" by Jesse Belvin, and at the many groups he performed with, and his untimely death. . Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus podcast, on <a href=\"https://www.patreon.com/posts/500-songs-bonus-29451213\">\"In the Still of the Night\" by the Five Satins</a>\n\n\n\nBefore getting to the resources, I wanted to preserve a comment left on the site's old host, the single most touching thing anyone has said about this podcast:\n\"​Jesse Belvin is my Beloved Uncle, my mother's brother. I've been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 💯correct!Joann and Jesse practically raised me. Can't express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother's living room. I think I'm his last living closest relative, that knows everything in this podcast is true. THANK YOU. Debra A. Frazier#I was there\"\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-47-goodnight-my-love/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy principal source for this episode was<a href=\"https://amzn.to/2Zr1Xwc\"> this CD</a>, whose liner notes provided the framework to which I added all the other information from a myriad other books and websites, including but not limited to <a href=\"https://jackiewilsonlover.wordpress.com/\">Jackie Wilson Lovers</a>, <a href=\"http://uncamarvy.com/\">Marv Goldberg's website</a>, and <a href=\"https://amzn.to/2KVUcGI\">Etta James' autobiography</a>. But as I discuss in this episode this is one of those where I've pulled together information from so many sources, a full list would probably be longer than the episode itself.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore we begin, a quick content warning. This episode contains material dealing with the immediate aftermath of a death in a car crash. While I am not explicit, this might be upsetting for some.\n\nJesse Belvin is a name that not many people recognise these days -- he's a footnote in the biographies of people like Sam Cooke or the Penguins, someone whose contribution to music history is usually summed up in a line or two in a book about someone else.\n\nThe problem is that Jesse Belvin was simply too good, and too prolific, to have a normal career. He put out a truly astonishing number of records as a songwriter, performer, and group leader, under so many different names that it's impossible to figure out the true extent of his career. And people like that don't end up having scholarly books written about them.\n\nAnd when you do find something that actually talks about Belvin himself, you find wild inaccuracies. For example, in researching this episode, I found over and over again that people claimed that Barry White played piano on the song we're looking at today, \"Goodnight My Love\". Now, White lived in the same neigbourhood as Belvin, and they attended the same school, so on the face of it that seems plausible. It seems plausible, at least, until you realise that Barry White was eleven when \"Goodnight My Love\" came out.\n\nEven so, on the offchance, I tracked down an interview with White where he confirmed that no, he was not playing piano on doo-wop classics before he hit puberty. But that kind of misinformation is all over everything to do with Jesse Belvin.\n\nThe end result of this is that Jesse Belvin is someone who exists in the gaps of other people's histories, and this episode is an attempt to create a picture out of what you find when looking at the stories of other musicians. As a result, it will almost certainly be less accurate than some other episodes. There's so little information about Belvin that if you didn't know anything about him, you'd assume he was some unimportant, minor, figure.\n\nBut in 1950s R&B -- among musicians, especially those on the West Coast -- there was no bigger name than Jesse Belvin. He had the potential to be bigger than anyone, and he would have been, had he lived. He was Stevie Wonder's favourite singer of all time, and Etta James argued to her dying day that it was a travesty that she was in the rock and roll hall of fame while he wasn't. Sam Cooke explicitly tried to model his career after Belvin, to the extent that after Cooke's death, his widow kept all of Cooke's records separate from her other albums -- except Belvin's, which she kept with Cooke's.\n\nMarv Goldberg, who is by far the pre-eminent expert on forties and fifties black vocal group music, refers to Belvin as the genre's \"most revered stylist\". And at the time he died, he was on the verge of finally becoming as well known as he deserved to be. So let's talk about the life -- and the tragic death -- of Mr Easy himself:\n\n[Excerpt: Jesse Belvin, \"Goodnight My Love\"]\n\nLike so many greats of R&B and jazz, Belvin had attended Jefferson High School and studied music under the great teacher Samuel Browne, who is one of the great unsung heroes of rock and roll music. One of the other people that Browne had taught was the great rhythm and blues saxophone player Big Jay McNeely.\n\nMcNeely was one of the all-time great saxophone honkers, inspired mostly by Illinois Jacquet, and he had become the lead tenor saxophone player with Johnny Otis' band at the Barrelhouse Club, and played on records like Otis' \"Barrel House Stomp\":\n\n[Excerpt: Johnny Otis, \"Barrel House Stomp\"]\n\nAs with many of the musicians Otis worked with, McNeely soon went on to a solo career of his own, and he formed a vocal group, \"Three Dots and a Dash\".\n\nThree Dots and a Dash backed McNeely's saxophone on a number of records, and McNeely invited Belvin to join them as lead singer. Belvin's first recording with the group was on \"All That Wine is Gone\", an answer record to \"Drinking Wine Spo-De-O-Dee\".\n\n[Excerpt: Big Jay McNeely with Three Dots and a Dash, \"All That Wine is Gone\"]\n\nAfter recording two singles with McNeely, Belvin went off to make his own records, signing to Specialty Records. His first solo single, \"Baby Don't Go\", was not especially successful, so he teamed up with the songwriter Marvin Phillips in a duo called Jesse and Marvin. The two of them had a hit with the song \"Dream Girl\":\n\n[Excerpt: Jesse and Marvin, \"Dream Girl\"]\n\n\"Dream Girl\" went to number two on the R&B charts, and it looked like Jesse and Marvin were about to have a massive career. But shortly afterwards, Belvin was drafted.\n\nIt was while he was in the armed forces that “Earth Angel” became a hit -- a song he co-wrote, and which we discussed in a previous episode, which I'll link in the show notes. Like many of the songs Belvin wrote, he ended up not getting credit for that one -- but unlike most of the others, he went to court over it and got some royalties in the end.\n\nMarvin decided to continue the duo without Jesse, renaming it \"Marvin and Johnny\", and moved over to Modern Records, but he didn't stick with a single \"Johnny\". Instead \"Johnny\" would be whoever was around, sometimes Marvin himself double-tracked. He had several minor hit singles as \"Marvin and Johnny\", including \"Cherry Pie\", on which the role of \"Johnny\" was played by Emory Perry:\n\n[Excerpt: Marvin and Johnny, \"Cherry Pie\"]\n\n\"Cherry Pie\" was a massive hit, but none of Marvin and Johnny's other records matched its success. However, on some of the follow-ups, Jesse Belvin returned as one of the Johnnies, notably on a cover version of \"Ko Ko Mo\", which didn't manage to outsell either the original or Perry Como's version:\n\n[Excerpt: Marvin and Johnny, \"Ko Ko Mo\"]\n\nMeanwhile, his time in the armed forces had set Belvin's career back, and when he came out he started recording for every label, and under every band name, he could. Most of the time, he would also be writing the songs, but he didn't get label credit on most of them, because he would just sell all his rights to the songs for a hundred dollars. Why not? There was always another song.\n\nAs well as recording as Marvin and Johnny for Modern Records, he also sang with the Californians on Federal:\n\n[Excerpt: The Californians, \"My Angel\"]\n\nThe Sheiks, also on Federal :\n\n[Excerpt: The Sheiks, \"So Fine\"]\n\nThe Gassers, on Cash:\n\n[Excerpt: The Gassers, \"Hum De Dum\"]\n\nAs well as recording under his own name on both Specialty and on John Dolphin's Hollywood Records. But his big project at the time was the Cliques, a duo he formed with Eugene Church, who recorded for Modern. Their track, \"The Girl in My Dreams\" was the closest thing he'd had to a big success since the similarly-named \"Dream Girl\" several years earlier:\n\n[Excerpt: The Cliques, \"The Girl in my Dreams\"]\n\nThat went to number forty-five on the pop chart -- not a massive hit, but a clear commercial success.\n\nAnd so, of course, at this point Belvin ditched the Cliques name, rather than follow up on the minor hit, and started making records as a solo artist instead. He signed to Modern Records as a solo artist, and went into the studio to record a new song.\n\nNow, I am going to be careful how I phrase this, because John Marascalco, who is credited as the co-writer of \"Goodnight My Love\", is still alive. And I want to stress that Marascalco is, by all accounts, an actual songwriter who has written songs for people like Little Richard and Harry Nilsson.\n\nBut there have also been accusations that at least some of his songwriting credits were not deserved -- in particular the song \"Bertha Lou\" by Johnny Faire:\n\n[Excerpt: Johnny Faire, \"Bertha Lou\"]\n\nJohnny Faire, whose real name was Donnie Brooks, recorded that with the Burnette brothers, and always said that the song was written, not by Marascalco, but by Johnny Burnette, who sold his rights to the song to Marascalco for fifty dollars -- Burnette's son Rocky backs up the claim.\n\nNow, in the case of \"Goodnight My Love\", the credited writers are George Motola and Marascalco, but the story as it's normally told goes as follows -- Motola had written the bulk of the song several years earlier, but had never completed it. He brought it into the studio, and Jesse Belvin came up with the bridge -- but he said that rather than take credit, he just wanted Motola to give him four hundred dollars. Motola didn't have four hundred dollars on him, but Marascalco, who was also at the session and is the credited producer, said he could get it for Belvin, and took the credit himself.\n\nThat's the story, and it would fit with both the rumour that Marascalco had bought an entire song from Johnny Burnette and with Belvin's cavalier attitude towards credit. On the other hand, Marascalco was also apparently particularly good at rewriting and finishing other people's half-finished songs, and so it's entirely plausible that he could have done the finishing-up job himself.\n\nEither way, the finished song became one of the most well-known songs of the fifties:\n\n[Excerpt: Jesse Belvin, \"Goodnight My Love\"]\n\nBelvin's version of the song went to number seven in the R&B charts, but its impact went beyond its immediate chart success. Alan Freed started to use the song as the outro music for his radio show, making it familiar to an entire generation of American music lovers. The result was that the song became a standard, recorded by everyone from James Brown to Gloria Estefan, the Four Seasons to Harry Connick Jr. If John Marascalco *did* buy Jesse Belvin's share of the songwriting, that was about the best four hundred dollars he could possibly have spent.\n\nOver the next year, Belvin recorded a host of other singles as a solo artist, none of which matched the level of success he'd seen with \"Goodnight My Love”, but which are the artistic foundation on which his reputation now rests. The stylistic range of these records is quite astonishing, from Latin pop like \"Senorita\", to doo-wop novelty songs like \"My Satellite\", a song whose melody owes something to \"Hound Dog\", credited to Jesse Belvin and the Space Riders, and released to cash in on the space craze that had started with the launch of the Russian satellite Sputnik:\n\n[Excerpt: Jesse Belvin and the Space Riders, \"My Satellite\"]\n\nThat featured Alex Hodge of the Platters on backing vocals. Hodge's brother Gaynel Hodge, who like Belvin would form groups at the drop of a hat, joined Jesse in yet another of the many groups he formed. The Saxons consisted of Belvin, Gaynel Hodge, Eugene Church (who had been in the Cliques with Belvin) and another former Jefferson High student, Belvin's friend Johnny \"Guitar\" Watson.\n\nWatson would later become well known for his seventies \"gangster of love\" persona and funk records, but at this point he was mostly making hard electric blues records like \"Three Hours Past Midnight\":\n\n[Excerpt: \"Three Hours Past Midnight\", Johnny \"Guitar\" Watson]\n\nBut when he worked with Belvin in the Saxons and other groups, he recorded much more straightforward doo-wop and rock and roll, like this example, \"Is It True\":\n\n[Excerpt: The Saxons, \"Is It True\"]\n\nThe Saxons also recorded as the Capris (though with Alex Hodge rather than Gaynel in that lineup of the group) and, just to annoy everyone who cares about this stuff and drive us all into nervous breakdowns, there was another group, also called the Saxons, who also recorded as the Capris, on the same label -- at least one single actually came out with one of the groups on one side and the other on the other. Indeed, the side featuring our Saxons had previously been released as a Jesse Belvin solo record.\n\nAnyway, I hope in this first half of the story I've given some idea of just how many different groups Jesse Belvin recorded with, and under how many different names, though I haven't listed even half of them. This is someone who seemed to form a new group every time he crossed the street, and make records with most of them, and a surprising number of them had become hits -- and \"Goodnight My Love\" and \"Earth Angel\" had become the kind of monster perennial standard that most musicians dream of ever writing.\n\nAnd, of course, Belvin had become the kind of musician that most record companies and publishers dream of finding -- the kind who will happily make hit records and sell the rights for a handful of dollars.\n\nThat was soon to change. Belvin was married; I haven't been able to find out exactly when he married, but his wife also became his songwriting partner and his manager, and in 1958 she seemed to finally take control of his career for him.\n\nBut before she did, there was one last pickup group hit to make.\n\nFrankie Ervin had been Charles Brown's replacement in Johnny Moore's Three Blazers, and had also sung briefly with Johnny Otis and Preston Love. While with Brown's group, he'd developed a reputation for being able to perform novelty cash-in records -- he'd made \"Dragnet Blues\", which had resulted in a lawsuit from the makers of the TV show Dragnet, and he'd also done his Johnny Ace impression on \"Johnny Ace's Last Letter\", a single that had been rush-released by the Blazers after Johnny Ace's death:\n\n[Excerpt: Johnny Moore's Three Blazers, \"Johnny Ace's Last Letter\"]\n\nErvin was looking for a solo career after leaving the Blazers, and he was put in touch with George Motola, who had a suggestion for him. A white group from Texas called The Slades had recorded a track called \"You Cheated\", which looked like it could possibly be a big hit -- except that the label it was on wasn't willing to come to terms with some of the big distributors over how much they were charging per record:\n\n[The Slades, \"You Cheated\"]\n\nMotola wanted to record a soundalike version of the song with Jesse Belvin as the lead singer, but Belvin had just signed a record contract with RCA, and didn't want to put out lead vocals on another label. Would Ervin like to put out the song as a solo record?\n\nErvin hated the song -- he didn't like doo-wop generally, and he thought the song was a particularly bad example of the genre -- but a gig was a gig, and it'd be a solo record under his own name. Ervin agreed to do it, and Motola got Jesse Belvin to put together a scratch vocal group for the session. Belvin found Johnny \"Guitar\" Watson and Tommy \"Buster\" Williams at a local ballroom and got them to come along, and on the way to the session they ran into \"Handsome\" Mel Williams and pulled him in.\n\nThey were just going to be the uncredited backing vocalists on a Frankie Ervin record, and didn't spend much time thinking about what was clearly a soundalike cash-in. But when it came out it was credited as \"The Shields\" rather than Frankie Ervin:\n\n[Excerpt: The Shields, \"You Cheated\"]\n\nThat's Belvin singing that wonderful falsetto part.\n\nFrankie Ervin was naturally annoyed that he wasn't given the label credit for the record. The recording was made as an independent production but leased to Dot Records, and somewhere along the line someone decided that it was better to have a generic group name rather than promote it as by a solo singer who might get ideas about wanting money.\n\nIn a nice bit of irony, the Shields managed to reverse the normal course of the music industry -- this time a soundalike record by a black group managed to outsell the original by a white group. \"You Cheated\" ended up making number twelve on the pop charts -- a massive hit for an unknown doo-wop group at the time.\n\nErvin started touring and making TV appearances as the Shields, backed by some random singers the record label had pulled together -- the rest of the vocalists on the record had been people who were under contract to other labels, and so couldn't make TV appearances.\n\nBut the original Shields members reunited for the followup single, \"Nature Boy\", where they were joined by the members of the Turks, who were yet another group that Belvin was recording with, and who included both Hodge brothers:\n\n[Excerpt: \"Nature Boy\", the Shields]\n\nThat, according to Ervin, also sold a million copies, but it was nothing like as successful as \"You Cheated\". The record label were getting sick of Ervin wanting credit and royalties and other things they didn't like singers, especially black ones, asking for. So the third Shields record only featured Belvin out of the original lineup, and subsequent recordings didn't even feature him.\n\nBut while Belvin had accidentally put together yet another million-selling group, he had also moved on to bigger things. His wife had now firmly taken control of his career, and they had a plan. Belvin had signed to a major label -- RCA, the same label that Elvis Presley was on -- and he was going to make a play for the big time.\n\nHe could still keep making doo-wop records with Johnny \"Guitar\" Watson and Eugene Church and the Hodge brothers and whoever else, if he felt like it, but his solo career was going to be something else. He was going to go for the same market as Nat \"King\" Cole, and become a smooth ballad singer.\n\nHe was going to be a huge star, and he actually got to record an album, Just Jesse Belvin. The first single off that album was \"Guess Who?\", a song written by his wife Jo Anne, based on a love letter she had written to him:\n\n[Excerpt: Jesse Belvin, \"Guess Who?\"]\n\nThat song made the top forty -- hitting number thirty-three on the pop chart and managed to reach number seven on the R&B charts. More importantly, it gained Grammy nominations for both best R&B performance and best male vocal performance. He lost to Dinah Washington and Frank Sinatra, and it's not as if losing to Dinah Washington or Frank Sinatra would have been an embarrassment.\n\nBut by the time he lost those Grammies, Jesse was already dead, and so was Jo Anne.\n\nAnd here we get into the murkiest part of the story. There are a lot of rumours floating around about Jesse Belvin's death, and a lot of misinformation is out there, and frankly I've not been able to get to the bottom of exactly what happened. When someone you love dies young, especially if that someone is a public figure, there's a tendency to look for complex explanations, and there's also a tendency to exaggerate stories in the telling. That's just human nature. And in some cases, that tendency is exploited by people out to make money.\n\nAnd Jesse and Jo Anne Belvin were both black people who died in the deep South, and so no real investigation was ever carried out. That means that by now, with almost everyone who was involved dead, it's impossible to tell what really happened.\n\nAlmost every single sentence of what follows may be false. It's my best guess as to the order of events and what happened, based on the limited information out there.\n\nOn February the sixth, 1960, there was a concert in Little Rock Arkansas, at the Robinson Auditorium. Billed as \"the first rock and roll show of 1960\", the headliner was Jackie Wilson, a friend of Belvin's. Jesse had just recorded his second album, \"Mr Easy\", which would be coming out soon, and while he was still relatively low on the bill, he was a rising star.\n\nThat album was the one that was going to consolidate Belvin's turn towards pop balladry in the Nat \"King\" Cole style, but it would end up being a posthumous release:\n\n[Excerpt: Jesse Belvin with the Marty Paich Orchestra, \"Blues in the Night\"]\n\nIt was an all-black lineup on stage, but according to some reports it was an integrated audience. In fact some reports go so far as to say it was the first integrated audience ever in Little Rock.\n\nLittle Rock was not a place where the white people were fans of integration -- in fact they were so against it that the National Guard had had to be called in only two years earlier to protect black children when the first school in Little Rock had been integrated. And so apparently there was some racial abuse shouted by members of the audience. But it was nothing that the musicians hadn't dealt with before.\n\nAfter the show they all drove on towards Dallas. Jackie Wilson had some car problems on the way, and got to their stop in Dallas later than he was expecting to. The Belvins hadn't arrived yet, and so Wilson called Jesse's mother in LA, asking if she'd heard from them.\n\nShe hadn't. Shortly after setting off, the car with Jesse and Jo Anne in had been in a crash. Jesse and the drivers of both cars had been killed instantly. Kirk Davis, Belvin's guitarist on that tour, who had apparently been asleep in the back seat, was seriously injured but eventually came out of his coma. And Jesse had apparently reacted fast enough to shield his wife from the worst of the accident. But she was still unconscious, and seriously injured.\n\nThe survivors were rushed to the hospital, where, according to Etta James, who heard the story from Jackie Wilson, they refused to treat Jo Anne Belvin until they knew that they would get money. She remained untreated until someone got in touch with Wilson, who drove down from Dallas Texas to Hope, Arkansas, where the hospital was, with the cash. But she died of her injuries a few days later.\n\nNow, here's the thing -- within a fortnight of the accident, there were rumours circulating widely enough to have been picked up by the newspapers that Belvin's car had had its tyres slashed. There were also stories, never confirmed, that Belvin had received death threats before the show. And Jackie Wilson had also had car trouble that night -- and according to some sources so had at least one other musician on the bill. So it's possible that the car was sabotaged.\n\nOn the other hand, Belvin's driver, Charles Shackleford, had got the job with Belvin after being fired by Ray Charles. He was fired, according to Charles, because he kept staying awake watching the late-night shows, not getting enough sleep, and driving dangerously enough to scare Ray Charles -- who was fearless enough that he used to ride motorbikes despite being totally blind.\n\nSo when Jesse and Jo Anne Belvin died, they could have been the victims of a racist murder, or they could just have been horribly unlucky. But we'll never know for sure, because the institutional racism at the time meant that there was no investigation.\n\nWhen they died, they left behind two children under the age of five, who were brought up by Jesse's mother. The oldest, Jesse Belvin Jr, became a singer himself, often performing material written or made famous by his father:\n\n[Excerpt: Jesse Belvin Jr, \"Goodnight My Love\"]\n\nJesse Jr. devoted his life to finding out what actually happened to his parents, but never found any answers.",
  "itunes:subtitle": "Welcome to episode forty-seven of A History of Rock Music in Five Hundred Songs. This one looks at Goodnight My Love by Jesse Belvin, and at the many groups he performed with, and his untimely death. . Click the full post to read liner notes, links to mo",
  "itunes:keywords": "Big Jay McNeely,Etta James,Federal Records,Gaynel Hodge,George Mottola,Jackie Wilson,Jefferson High School,Jesse and Marvin,Jesse Belvin,John Marascalco,Johnny Burnette,Johnny Guitar Watson,Johnny Otis,Marvin and Johnny,Modern Records,racism,RCA Records,The Penguins",
  "content:encoded": "Welcome to episode forty-seven of <em>A History of Rock Music in Five Hundred Songs</em>. This one looks at \"Goodnight My Love\" by Jesse Belvin, and at the many groups he performed with, and his untimely death. . Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus podcast, on <a href=\"https://www.patreon.com/posts/500-songs-bonus-29451213\">\"In the Still of the Night\" by the Five Satins</a>\n\n\n\nBefore getting to the resources, I wanted to preserve a comment left on the site's old host, the single most touching thing anyone has said about this podcast:\n\"​Jesse Belvin is my Beloved Uncle, my mother's brother. I've been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 💯correct!Joann and Jesse practically raised me. Can't express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother's living room. I think I'm his last living closest relative, that knows everything in this podcast is true. THANK YOU. Debra A. Frazier#I was there\"\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-47-goodnight-my-love/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nMy principal source for this episode was<a href=\"https://amzn.to/2Zr1Xwc\"> this CD</a>, whose liner notes provided the framework to which I added all the other information from a myriad other books and websites, including but not limited to <a href=\"https://jackiewilsonlover.wordpress.com/\">Jackie Wilson Lovers</a>, <a href=\"http://uncamarvy.com/\">Marv Goldberg's website</a>, and <a href=\"https://amzn.to/2KVUcGI\">Etta James' autobiography</a>. But as I discuss in this episode this is one of those where I've pulled together information from so many sources, a full list would probably be longer than the episode itself.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"https://www.patreon.com/join/AndrewHickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nBefore we begin, a quick content warning. This episode contains material dealing with the immediate aftermath of a death in a car crash. While I am not explicit, this might be upsetting for some.\n\nJesse Belvin is a name that not many people recognise these days -- he's a footnote in the biographies of people like Sam Cooke or the Penguins, someone whose contribution to music history is usually summed up in a line or two in a book about someone else.\n\nThe problem is that Jesse Belvin was simply too good, and too prolific, to have a normal career. He put out a truly astonishing number of records as a songwriter, performer, and group leader, under so many different names that it's impossible to figure out the true extent of his career. And people like that don't end up having scholarly books written about them.\n\nAnd when you do find something that actually talks about Belvin himself, you find wild inaccuracies. For example, in researching this episode, I found over and over again that people claimed that Barry White played piano on the song we're looking at today, \"Goodnight My Love\". Now, White lived in the same neigbourhood as Belvin, and they attended the same school, so on the face of it that seems plausible. It seems plausible, at least, until you realise that Barry White was eleven when \"Goodnight My Love\" came out.\n\nEven so, on the offchance, I tracked down an interview with White where he confirmed that no, he was not playing piano on doo-wop classics before he hit puberty. But that kind of misinformation is all over everything to do with Jesse Belvin.\n\nThe end result of this is that Jesse Belvin is someone who exists in the gaps of other people's histories, and this episode is an attempt to create a picture out of what you find when looking at the stories of other musicians. As a result, it will almost certainly be less accurate than some other episodes. There's so little information about Belvin that if you didn't know anything about him, you'd assume he was some unimportant, minor, figure.\n\nBut in 1950s R&B -- among musicians, especially those on the West Coast -- there was no bigger name than Jesse Belvin. He had the potential to be bigger than anyone, and he would have been, had he lived. He was Stevie Wonder's favourite singer of all time, and Etta James argued to her dying day that it was a travesty that she was in the rock and roll hall of fame while he wasn't. Sam Cooke explicitly tried to model his career after Belvin, to the extent that after Cooke's death, his widow kept all of Cooke's records separate from her other albums -- except Belvin's, which she kept with Cooke's.\n\nMarv Goldberg, who is by far the pre-eminent expert on forties and fifties black vocal group music, refers to Belvin as the genre's \"most revered stylist\". And at the time he died, he was on the verge of finally becoming as well known as he deserved to be. So let's talk about the life -- and the tragic death -- of Mr Easy himself:\n\n[Excerpt: Jesse Belvin, \"Goodnight My Love\"]\n\nLike so many greats of R&B and jazz, Belvin had attended Jefferson High School and studied music under the great teacher Samuel Browne, who is one of the great unsung heroes of rock and roll music. One of the other people that Browne had taught was the great rhythm and blues saxophone player Big Jay McNeely.\n\nMcNeely was one of the all-time great saxophone honkers, inspired mostly by Illinois Jacquet, and he had become the lead tenor saxophone player with Johnny Otis' band at the Barrelhouse Club, and played on records like Otis' \"Barrel House Stomp\":\n\n[Excerpt: Johnny Otis, \"Barrel House Stomp\"]\n\nAs with many of the musicians Otis worked with, McNeely soon went on to a solo career of his own, and he formed a vocal group, \"Three Dots and a Dash\".\n\nThree Dots and a Dash backed McNeely's saxophone on a number of records, and McNeely invited Belvin to join them as lead singer. Belvin's first recording with the group was on \"All That Wine is Gone\", an answer record to \"Drinking Wine Spo-De-O-Dee\".\n\n[Excerpt: Big Jay McNeely with Three Dots and a Dash, \"All That Wine is Gone\"]\n\nAfter recording two singles with McNeely, Belvin went off to make his own records, signing to Specialty Records. His first solo single, \"Baby Don't Go\", was not especially successful, so he teamed up with the songwriter Marvin Phillips in a duo called Jesse and Marvin. The two of them had a hit with the song \"Dream Girl\":\n\n[Excerpt: Jesse and Marvin, \"Dream Girl\"]\n\n\"Dream Girl\" went to number two on the R&B charts, and it looked like Jesse and Marvin were about to have a massive career. But shortly afterwards, Belvin was drafted.\n\nIt was while he was in the armed forces that “Earth Angel” became a hit -- a song he co-wrote, and which we discussed in a previous episode, which I'll link in the show notes. Like many of the songs Belvin wrote, he ended up not getting credit for that one -- but unlike most of the others, he went to court over it and got some royalties in the end.\n\nMarvin decided to continue the duo without Jesse, renaming it \"Marvin and Johnny\", and moved over to Modern Records, but he didn't stick with a single \"Johnny\". Instead \"Johnny\" would be whoever was around, sometimes Marvin himself double-tracked. He had several minor hit singles as \"Marvin and Johnny\", including \"Cherry Pie\", on which the role of \"Johnny\" was played by Emory Perry:\n\n[Excerpt: Marvin and Johnny, \"Cherry Pie\"]\n\n\"Cherry Pie\" was a massive hit, but none of Marvin and Johnny's other records matched its success. However, on some of the follow-ups, Jesse Belvin returned as one of the Johnnies, notably on a cover version of \"Ko Ko Mo\", which didn't manage to outsell either the original or Perry Como's version:\n\n[Excerpt: Marvin and Johnny, \"Ko Ko Mo\"]\n\nMeanwhile, his time in the armed forces had set Belvin's career back, and when he came out he started recording for every label, and under every band name, he could. Most of the time, he would also be writing the songs, but he didn't get label credit on most of them, because he would just sell all his rights to the songs for a hundred dollars. Why not? There was always another song.\n\nAs well as recording as Marvin and Johnny for Modern Records, he also sang with the Californians on Federal:\n\n[Excerpt: The Californians, \"My Angel\"]\n\nThe Sheiks, also on Federal :\n\n[Excerpt: The Sheiks, \"So Fine\"]\n\nThe Gassers, on Cash:\n\n[Excerpt: The Gassers, \"Hum De Dum\"]\n\nAs well as recording under his own name on both Specialty and on John Dolphin's Hollywood Records. But his big project at the time was the Cliques, a duo he formed with Eugene Church, who recorded for Modern. Their track, \"The Girl in My Dreams\" was the closest thing he'd had to a big success since the similarly-named \"Dream Girl\" several years earlier:\n\n[Excerpt: The Cliques, \"The Girl in my Dreams\"]\n\nThat went to number forty-five on the pop chart -- not a massive hit, but a clear commercial success.\n\nAnd so, of course, at this point Belvin ditched the Cliques name, rather than follow up on the minor hit, and started making records as a solo artist instead. He signed to Modern Records as a solo artist, and went into the studio to record a new song.\n\nNow, I am going to be careful how I phrase this, because John Marascalco, who is credited as the co-writer of \"Goodnight My Love\", is still alive. And I want to stress that Marascalco is, by all accounts, an actual songwriter who has written songs for people like Little Richard and Harry Nilsson.\n\nBut there have also been accusations that at least some of his songwriting credits were not deserved -- in particular the song \"Bertha Lou\" by Johnny Faire:\n\n[Excerpt: Johnny Faire, \"Bertha Lou\"]\n\nJohnny Faire, whose real name was Donnie Brooks, recorded that with the Burnette brothers, and always said that the song was written, not by Marascalco, but by Johnny Burnette, who sold his rights to the song to Marascalco for fifty dollars -- Burnette's son Rocky backs up the claim.\n\nNow, in the case of \"Goodnight My Love\", the credited writers are George Motola and Marascalco, but the story as it's normally told goes as follows -- Motola had written the bulk of the song several years earlier, but had never completed it. He brought it into the studio, and Jesse Belvin came up with the bridge -- but he said that rather than take credit, he just wanted Motola to give him four hundred dollars. Motola didn't have four hundred dollars on him, but Marascalco, who was also at the session and is the credited producer, said he could get it for Belvin, and took the credit himself.\n\nThat's the story, and it would fit with both the rumour that Marascalco had bought an entire song from Johnny Burnette and with Belvin's cavalier attitude towards credit. On the other hand, Marascalco was also apparently particularly good at rewriting and finishing other people's half-finished songs, and so it's entirely plausible that he could have done the finishing-up job himself.\n\nEither way, the finished song became one of the most well-known songs of the fifties:\n\n[Excerpt: Jesse Belvin, \"Goodnight My Love\"]\n\nBelvin's version of the song went to number seven in the R&B charts, but its impact went beyond its immediate chart success. Alan Freed started to use the song as the outro music for his radio show, making it familiar to an entire generation of American music lovers. The result was that the song became a standard, recorded by everyone from James Brown to Gloria Estefan, the Four Seasons to Harry Connick Jr. If John Marascalco *did* buy Jesse Belvin's share of the songwriting, that was about the best four hundred dollars he could possibly have spent.\n\nOver the next year, Belvin recorded a host of other singles as a solo artist, none of which matched the level of success he'd seen with \"Goodnight My Love”, but which are the artistic foundation on which his reputation now rests. The stylistic range of these records is quite astonishing, from Latin pop like \"Senorita\", to doo-wop novelty songs like \"My Satellite\", a song whose melody owes something to \"Hound Dog\", credited to Jesse Belvin and the Space Riders, and released to cash in on the space craze that had started with the launch of the Russian satellite Sputnik:\n\n[Excerpt: Jesse Belvin and the Space Riders, \"My Satellite\"]\n\nThat featured Alex Hodge of the Platters on backing vocals. Hodge's brother Gaynel Hodge, who like Belvin would form groups at the drop of a hat, joined Jesse in yet another of the many groups he formed. The Saxons consisted of Belvin, Gaynel Hodge, Eugene Church (who had been in the Cliques with Belvin) and another former Jefferson High student, Belvin's friend Johnny \"Guitar\" Watson.\n\nWatson would later become well known for his seventies \"gangster of love\" persona and funk records, but at this point he was mostly making hard electric blues records like \"Three Hours Past Midnight\":\n\n[Excerpt: \"Three Hours Past Midnight\", Johnny \"Guitar\" Watson]\n\nBut when he worked with Belvin in the Saxons and other groups, he recorded much more straightforward doo-wop and rock and roll, like this example, \"Is It True\":\n\n[Excerpt: The Saxons, \"Is It True\"]\n\nThe Saxons also recorded as the Capris (though with Alex Hodge rather than Gaynel in that lineup of the group) and, just to annoy everyone who cares about this stuff and drive us all into nervous breakdowns, there was another group, also called the Saxons, who also recorded as the Capris, on the same label -- at least one single actually came out with one of the groups on one side and the other on the other. Indeed, the side featuring our Saxons had previously been released as a Jesse Belvin solo record.\n\nAnyway, I hope in this first half of the story I've given some idea of just how many different groups Jesse Belvin recorded with, and under how many different names, though I haven't listed even half of them. This is someone who seemed to form a new group every time he crossed the street, and make records with most of them, and a surprising number of them had become hits -- and \"Goodnight My Love\" and \"Earth Angel\" had become the kind of monster perennial standard that most musicians dream of ever writing.\n\nAnd, of course, Belvin had become the kind of musician that most record companies and publishers dream of finding -- the kind who will happily make hit records and sell the rights for a handful of dollars.\n\nThat was soon to change. Belvin was married; I haven't been able to find out exactly when he married, but his wife also became his songwriting partner and his manager, and in 1958 she seemed to finally take control of his career for him.\n\nBut before she did, there was one last pickup group hit to make.\n\nFrankie Ervin had been Charles Brown's replacement in Johnny Moore's Three Blazers, and had also sung briefly with Johnny Otis and Preston Love. While with Brown's group, he'd developed a reputation for being able to perform novelty cash-in records -- he'd made \"Dragnet Blues\", which had resulted in a lawsuit from the makers of the TV show Dragnet, and he'd also done his Johnny Ace impression on \"Johnny Ace's Last Letter\", a single that had been rush-released by the Blazers after Johnny Ace's death:\n\n[Excerpt: Johnny Moore's Three Blazers, \"Johnny Ace's Last Letter\"]\n\nErvin was looking for a solo career after leaving the Blazers, and he was put in touch with George Motola, who had a suggestion for him. A white group from Texas called The Slades had recorded a track called \"You Cheated\", which looked like it could possibly be a big hit -- except that the label it was on wasn't willing to come to terms with some of the big distributors over how much they were charging per record:\n\n[The Slades, \"You Cheated\"]\n\nMotola wanted to record a soundalike version of the song with Jesse Belvin as the lead singer, but Belvin had just signed a record contract with RCA, and didn't want to put out lead vocals on another label. Would Ervin like to put out the song as a solo record?\n\nErvin hated the song -- he didn't like doo-wop generally, and he thought the song was a particularly bad example of the genre -- but a gig was a gig, and it'd be a solo record under his own name. Ervin agreed to do it, and Motola got Jesse Belvin to put together a scratch vocal group for the session. Belvin found Johnny \"Guitar\" Watson and Tommy \"Buster\" Williams at a local ballroom and got them to come along, and on the way to the session they ran into \"Handsome\" Mel Williams and pulled him in.\n\nThey were just going to be the uncredited backing vocalists on a Frankie Ervin record, and didn't spend much time thinking about what was clearly a soundalike cash-in. But when it came out it was credited as \"The Shields\" rather than Frankie Ervin:\n\n[Excerpt: The Shields, \"You Cheated\"]\n\nThat's Belvin singing that wonderful falsetto part.\n\nFrankie Ervin was naturally annoyed that he wasn't given the label credit for the record. The recording was made as an independent production but leased to Dot Records, and somewhere along the line someone decided that it was better to have a generic group name rather than promote it as by a solo singer who might get ideas about wanting money.\n\nIn a nice bit of irony, the Shields managed to reverse the normal course of the music industry -- this time a soundalike record by a black group managed to outsell the original by a white group. \"You Cheated\" ended up making number twelve on the pop charts -- a massive hit for an unknown doo-wop group at the time.\n\nErvin started touring and making TV appearances as the Shields, backed by some random singers the record label had pulled together -- the rest of the vocalists on the record had been people who were under contract to other labels, and so couldn't make TV appearances.\n\nBut the original Shields members reunited for the followup single, \"Nature Boy\", where they were joined by the members of the Turks, who were yet another group that Belvin was recording with, and who included both Hodge brothers:\n\n[Excerpt: \"Nature Boy\", the Shields]\n\nThat, according to Ervin, also sold a million copies, but it was nothing like as successful as \"You Cheated\". The record label were getting sick of Ervin wanting credit and royalties and other things they didn't like singers, especially black ones, asking for. So the third Shields record only featured Belvin out of the original lineup, and subsequent recordings didn't even feature him.\n\nBut while Belvin had accidentally put together yet another million-selling group, he had also moved on to bigger things. His wife had now firmly taken control of his career, and they had a plan. Belvin had signed to a major label -- RCA, the same label that Elvis Presley was on -- and he was going to make a play for the big time.\n\nHe could still keep making doo-wop records with Johnny \"Guitar\" Watson and Eugene Church and the Hodge brothers and whoever else, if he felt like it, but his solo career was going to be something else. He was going to go for the same market as Nat \"King\" Cole, and become a smooth ballad singer.\n\nHe was going to be a huge star, and he actually got to record an album, Just Jesse Belvin. The first single off that album was \"Guess Who?\", a song written by his wife Jo Anne, based on a love letter she had written to him:\n\n[Excerpt: Jesse Belvin, \"Guess Who?\"]\n\nThat song made the top forty -- hitting number thirty-three on the pop chart and managed to reach number seven on the R&B charts. More importantly, it gained Grammy nominations for both best R&B performance and best male vocal performance. He lost to Dinah Washington and Frank Sinatra, and it's not as if losing to Dinah Washington or Frank Sinatra would have been an embarrassment.\n\nBut by the time he lost those Grammies, Jesse was already dead, and so was Jo Anne.\n\nAnd here we get into the murkiest part of the story. There are a lot of rumours floating around about Jesse Belvin's death, and a lot of misinformation is out there, and frankly I've not been able to get to the bottom of exactly what happened. When someone you love dies young, especially if that someone is a public figure, there's a tendency to look for complex explanations, and there's also a tendency to exaggerate stories in the telling. That's just human nature. And in some cases, that tendency is exploited by people out to make money.\n\nAnd Jesse and Jo Anne Belvin were both black people who died in the deep South, and so no real investigation was ever carried out. That means that by now, with almost everyone who was involved dead, it's impossible to tell what really happened.\n\nAlmost every single sentence of what follows may be false. It's my best guess as to the order of events and what happened, based on the limited information out there.\n\nOn February the sixth, 1960, there was a concert in Little Rock Arkansas, at the Robinson Auditorium. Billed as \"the first rock and roll show of 1960\", the headliner was Jackie Wilson, a friend of Belvin's. Jesse had just recorded his second album, \"Mr Easy\", which would be coming out soon, and while he was still relatively low on the bill, he was a rising star.\n\nThat album was the one that was going to consolidate Belvin's turn towards pop balladry in the Nat \"King\" Cole style, but it would end up being a posthumous release:\n\n[Excerpt: Jesse Belvin with the Marty Paich Orchestra, \"Blues in the Night\"]\n\nIt was an all-black lineup on stage, but according to some reports it was an integrated audience. In fact some reports go so far as to say it was the first integrated audience ever in Little Rock.\n\nLittle Rock was not a place where the white people were fans of integration -- in fact they were so against it that the National Guard had had to be called in only two years earlier to protect black children when the first school in Little Rock had been integrated. And so apparently there was some racial abuse shouted by members of the audience. But it was nothing that the musicians hadn't dealt with before.\n\nAfter the show they all drove on towards Dallas. Jackie Wilson had some car problems on the way, and got to their stop in Dallas later than he was expecting to. The Belvins hadn't arrived yet, and so Wilson called Jesse's mother in LA, asking if she'd heard from them.\n\nShe hadn't. Shortly after setting off, the car with Jesse and Jo Anne in had been in a crash. Jesse and the drivers of both cars had been killed instantly. Kirk Davis, Belvin's guitarist on that tour, who had apparently been asleep in the back seat, was seriously injured but eventually came out of his coma. And Jesse had apparently reacted fast enough to shield his wife from the worst of the accident. But she was still unconscious, and seriously injured.\n\nThe survivors were rushed to the hospital, where, according to Etta James, who heard the story from Jackie Wilson, they refused to treat Jo Anne Belvin until they knew that they would get money. She remained untreated until someone got in touch with Wilson, who drove down from Dallas Texas to Hope, Arkansas, where the hospital was, with the cash. But she died of her injuries a few days later.\n\nNow, here's the thing -- within a fortnight of the accident, there were rumours circulating widely enough to have been picked up by the newspapers that Belvin's car had had its tyres slashed. There were also stories, never confirmed, that Belvin had received death threats before the show. And Jackie Wilson had also had car trouble that night -- and according to some sources so had at least one other musician on the bill. So it's possible that the car was sabotaged.\n\nOn the other hand, Belvin's driver, Charles Shackleford, had got the job with Belvin after being fired by Ray Charles. He was fired, according to Charles, because he kept staying awake watching the late-night shows, not getting enough sleep, and driving dangerously enough to scare Ray Charles -- who was fearless enough that he used to ride motorbikes despite being totally blind.\n\nSo when Jesse and Jo Anne Belvin died, they could have been the victims of a racist murder, or they could just have been horribly unlucky. But we'll never know for sure, because the institutional racism at the time meant that there was no investigation.\n\nWhen they died, they left behind two children under the age of five, who were brought up by Jesse's mother. The oldest, Jesse Belvin Jr, became a singer himself, often performing material written or made famous by his father:\n\n[Excerpt: Jesse Belvin Jr, \"Goodnight My Love\"]\n\nJesse Jr. devoted his life to finding out what actually happened to his parents, but never found any answers.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode forty-seven of A History of Rock Music in Five Hundred Songs. This one looks at \"Goodnight My Love\" by Jesse Belvin, and at the many groups he performed with, and his untimely death. . Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus podcast, on \"In the Still of the Night\" by the Five Satins\n\n\n\nBefore getting to the resources, I wanted to preserve a comment left on the site's old host, the single most touching thing anyone has said about this podcast:\n\"​Jesse Belvin is my Beloved Uncle, my mother's brother. I've been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 💯correct!Joann and Jesse practically raised me. Can't express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there in my grandmother's living room. I think I'm his last living closest relative, that knows everything in this podcast is true. THANK YOU. Debra A. Frazier#I was there\"\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nMy principal source for this episode was this CD, whose liner notes provided the framework to which I added all the other information from a myriad other books and websites, including but not limited to Jackie Wilson Lovers, Marv Goldberg's website, and Etta James' autobiography. But as I discuss in this episode this is one of those where I've pulled together information from so many sources, a full list would probably be longer than the episode itself.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore we begin, a quick content warning. This episode contains material dealing with the immediate aftermath of a death in a car crash. While I am not explicit, this might be upsetting for some.\n\nJesse Belvin is a name that not many people recognise these days -- he's a footnote in the biographies of people like Sam Cooke or the Penguins, someone whose contribution to music history is usually summed up in a line or two in a book about someone else.\n\nThe problem is that Jesse Belvin was simply too good, and too prolific, to have a normal career. He put out a truly astonishing number of records as a songwriter, performer, and group leader, under so many different names that it's impossible to figure out the true extent of his career. And people like that don't end up having scholarly books written about them.\n\nAnd when you do find something that actually talks about Belvin himself, you find wild inaccuracies. For example, in researching this episode, I found over and over again that people claimed that Barry White played piano on the song we're looking at today, \"Goodnight My Love\". Now, White lived in the same neigbourhood as Belvin, and they attended the same school, so on the face of it that seems plausible. It seems plausible, at least, until you realise that Barry White was eleven when \"Goodnight My Love\" came out.\n\nEven so, on the offchance, I tracked down an interview with White where he confirmed that no, he was not playing piano on doo-wop classics before he hit puberty. But that kind of misinformation is all over everything to do with Jesse Belvin.\n\nThe end result of this is that Jesse Belvin is someone who exists in the gaps of other people's histories, and this episode is an attempt to create a picture out of what you find when looking at the stories of other musicians. As a result, it will almost certainly be less accurate than some other episodes. There's so little information about Belvin that if you didn't know anything about him, you'd assume he was some unimportant, minor, figure.\n\nBut in 1950s R&B -- among musicians, especially those on the West Coast -- there was no bigger name ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode forty-seven of A History of Rock Music in Five Hundred Songs. This one looks at \"Goodnight My Love\" by Jesse Belvin, and at the many groups he performed with, and his untimely death. . Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus podcast, on \"In the Still of the Night\" by the Five Satins\n\n\n\nBefore getting to the resources, I wanted to preserve a comment left on the site's old host, the single most touching thing anyone has said about this podcast:\n\"​Jesse Belvin is my Beloved Uncle, my mother's brother. I've been waiting all my life for him to be recognized in this manner. I must say the content in this podcast is 💯correct!Joann and Jesse practically raised me. Can't express how grateful I am. Just so glad someone got it right. I still miss them dearly to this day. My world was forever changed Feb. 6th 1960. I can remember him writing most of those songs right there",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}