{
  "title": "Episode 125: False Memories - How Can Your Memory Be So Bad?",
  "pubDate": "Mon, 07 Jun 2010 02:05:43 +0000",
  "guid": "episode-125-false-memories-how-can-your-memory",
  "link": "http://www.thepsychfiles.com/2010/06/episode-125-false-memories-how-can-your-memory-be-so-bad/",
  "itunes:image": "",
  "description": "For some reason we believe that our memories are accurate.  They are far from it.  What we remember is a hodge-podge, a patchwork of images, stories, and bits and pieces from our past.  In this episode I describe some of the very interesting research showing how our memories can be manipulated in surprising ways.  Learn why you loved asparagus as a kid (really you did, really).",
  "content:encoded": "For some reason we believe that our memories are accurate.  They are far from it.  What we remember is a hodge-podge, a patchwork of images, stories, and bits and pieces from our past.  In this episode I describe some of the very interesting research showing how our memories can be manipulated in surprising ways.  Learn why you loved asparagus as a kid (really you did, really).",
  "enclosure": "",
  "itunes:duration": "33:33",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,memory,false,memories,loftus",
  "itunes:subtitle": "For some reason we believe that our memories are accurate.  They are far from it.  What we remember is a hodge-podge, a patchwork of images, stories, and bits and pieces from our past.  Our memories can be manipulated in surprising ways.  ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "For some reason we believe that our memories are accurate. They are far from it. What we remember is a hodge-podge, a patchwork of images, stories, and bits and pieces from our past. In this episode I describe some of the very interesting research showing how our memories can be manipulated in surprising ways. Learn why you loved asparagus as a kid (really you did, really)."
}