{
  "title": "Chiral Dirac-like fermion in spin-orbit-free antiferromagnetic semimetals. (arXiv:2107.09984v3 [cond-mat.mtrl-sci] UPDATED)",
  "link": "http://arxiv.org/abs/2107.09984",
  "description": "<p>Dirac semimetal is a phase of matter, whose elementary excitation is\ndescribed by the relativistic Dirac equation. In the limit of zero mass, its\nparity-time symmetry enforces the Dirac fermion in the momentum space, which is\ncomposed of two Weyl fermions with opposite chirality, to be non-chiral.\nInspired by the flavor symmetry in particle physics, we theoretically propose a\nmassless Dirac-like equation yet linking two Weyl fields with the identical\nchirality by assuming SU(2) isospin symmetry, independent of the space-time\nrotation exchanging the two fields. Dramatically, such symmetry is hidden in\ncertain solid-state spin-1/2 systems with negligible spin-orbit coupling, where\nthe spin degree of freedom is decoupled with the lattice. Therefore, the\nexistence of the corresponding quasiparticle, dubbed as flavor Weyl fermion,\ncannot be explained by the conventional (magnetic) space group framework. The\nfour-fold degenerate flavor Weyl fermion manifests linear dispersion and a\nChern number of 2, leading to a robust network of topologically protected Fermi\narcs throughout the Brillouin zone. For material realization, we show that the\ntransition-metal chalcogenide CoNb3S6 with experimentally confirmed collinear\nantiferromagnetic order is ideal for flavor Weyl semimetal under the\napproximation of vanishing spin-orbit coupling. Our work reveals a counterpart\nof the flavor symmetry in magnetic electronic systems, leading to further\npossibilities of emergent phenomena in quantum materials.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Liu_P/0/1/0/all/0/1\">Pengfei Liu</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Zhang_A/0/1/0/all/0/1\">Ao Zhang</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Han_J/0/1/0/all/0/1\">Jingzhi Han</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Liu_Q/0/1/0/all/0/1\">Qihang Liu</a>"
}