{
  "title": "Two Americas",
  "link": "https://danielmiessler.com/blog/two-americas/",
  "dc:creator": "Daniel Miessler",
  "pubDate": "Mon, 04 Jul 2022 22:02:20 +0000",
  "category": "Culture",
  "guid": "https://danielmiessler.com/?p=137972",
  "description": "The US&#8217;s terminal conflict will be an internal one, fought between people who only see America&#8217;s flaws and those who pretend they don&#8217;t exist. And of course, both are wrong. The US has done some horrific shit in its history, and we still have many problems. But we&#8217;re still one of the best places in the world for&#8230;",
  "content:encoded": "<p><img decoding=\"async\" loading=\"lazy\" src=\"https://danielmiessler.com/images/two-americas-miessler.png\" alt=\"two-americas-miessler\" width=\"1000\" height=\"984\" class=\"aligncenter size-full wp-image-137973\" /></p>\n\n<p>The US&#8217;s terminal conflict will be an internal one, fought between people who only see America&#8217;s flaws and those who pretend they don&#8217;t exist. And of course, both are wrong.</p>\n\n<p>The US has done some horrific shit in its history, and we still have many problems. But we&#8217;re still one of the best places in the world for an oppressed person to move in search of freedom.</p>\n\n<p>If you&#8217;re Black, or non-CIS in any way, or follow a non-dominant religion, the US and some parts of Western Europe are your absolute best places to move, which is why immigration flows so heavily into those areas. If America were 1/10th as bad as the extreme left thinks it is, it wouldn&#8217;t be <a href=\"https://news.gallup.com/poll/161435/100-million-worldwide-dream-life.aspx\">the top desired destination</a> (Gallup) for immigrants. Which it is.</p><div data-inline-related-post data-inline-related-post-index=0></div>\n\n<p>Yet at the same time, we just overturned Roe. We run prisons as an industrial complex. And we are failing to educate most of our children. So, as usual, both of the extremes fail to understand <a href=\"https://danielmiessler.com/blog/the-difference-between-both-sidesing-all-lives-matter-and-acknowledging-complexity/\">the principle of Multiple Truths</a>. America is simultaneously a mess and one of the best countries in the world.</p>\n\n<p>Sadly that&#8217;s only because most of the rest of the world is truly horrific when it comes to human rights for Black people, women, the queer community, and those who have unorthodox beliefs. So it&#8217;s a low bar, but we&#8217;re absolutely still at the top. If you doubt this, the cure for your ailment is spending more time traveling outside the US and Europe where we talk incessantly about how horrible we are.</p>\n\n<p>We need to both hate and worship ourselves less&#8212;and find ways to pursue the mentality once captured by Bill Clinton:</p>\n\n<blockquote>\n  <p>There isn’t anything that’s wrong with America that can’t be fixed with what’s right with America.</p><div data-inline-related-post data-inline-related-post-index=1></div>\n</blockquote>\n\n<p>I like that a lot. I&#8217;m not sure I believe it, but I want to.</p>\n</p>"
}