{
  "id": "yt:video:_H2rYcqyNqU",
  "yt:videoId": "_H2rYcqyNqU",
  "yt:channelId": "UCbu2SsF-Or3Rsn3NxqODImw",
  "title": "God of War Ragnarok Everything To Know",
  "link": "",
  "author": {
    "name": "GameSpot",
    "uri": "https://www.youtube.com/channel/UCbu2SsF-Or3Rsn3NxqODImw"
  },
  "published": "2022-11-02T14:00:21+00:00",
  "updated": "2022-11-04T18:10:23+00:00",
  "media:group": {
    "media:title": "God of War Ragnarok Everything To Know",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Kratos and Atreus are back! And they’re ready to face the end of the world together, or at least I hope they are. Here’s everything you need to know about God of War Ragnarok.\n#Gaming #GodofWarRagnarok #GameSpot\n\nGod of War Ragnarok takes place a few years after the events of God of War 2018. According to Sony, Atreus is desperately curious and “like most young people, he wants to understand who he is more than anything. In this case, he wants to understand who he could be. The mystery of Loki's role in the upcoming conflict is something that Atreus cannot let go of.”\n\nThat conflict is the looming threat of Ragnarok, a prophesied battle that will end the world and Sony continued by saying “Atreus also doesn't want to stand by and do nothing while conflict consumes the Nine Realms.\n\ns for Kratos, Sony says he is intent on helping to spare Atreus from the \"bloody lessons he learned from his conflict with gods.\"\n\nIf you’ve never played the games that came before 2018’s release then let me just say, this man’s hands get VERY dirty. We have a complete God of War timeline video available to watch if you need a refresher. For now, back to Ragnarok. \n\nIn order to find the answers they seek, Kratos and Atreus will journey to each of the Nine Realms facing off against a variety of Norse gods and monsters while exploring stunning mythical landscapes. \n\nRagnarok will wrap up this Norse chapter of the franchise, as Sony Santa Monica wanted to avoid having this portion of the story from getting too unwieldy.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}