{
  "title": "Is AI Good for Health Care?",
  "link": "https://spectrum.ieee.org/ai-in-health-care",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/illustration-of-microphone-in-shaped-within-a-stethoscope.jpg?id=31175887&width=2000&height=1500&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>\n\tWith the rush toward using tools such as artificial intelligence, machine learning, and deep learning technologies to analyze health data for insights, questions are being raised about how good a job the technologies are doing to improve outcomes.\n</p><p>\n\tTechnologists, clinicians, researchers, scientists, ethicists, policy stewards, and other experts offer their thoughts during the third season of the <a href=\"https://standards.ieee.org/practices/healthcare-life-sciences/rethink-health/season-3/?utm_source=ieeeorg&utm_medium=the-institute&utm_campaign=re-think-health-podcast-s3\" rel=\"noopener noreferrer\" target=\"_blank\">Re-Think Health Podcast, AI for Good Medicine</a>. The series is part of the <a href=\"https://standards.ieee.org/practices/healthcare-life-sciences/?utm_source=ieeeorg&utm_medium=the-institute&utm_campaign=re-think-health-podcast-s3\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association’s Healthcare and Life Sciences</a> practice.\n</p><hr/><p>\n\tSeason 3 features these episodes:\n</p><p>\n<strong>The Balance—AI’s Healthcare Goodness for Marginalized Patients.</strong> IEEE Senior Member <a href=\"https://spectrum.ieee.org/an-autism-screening-tool-led-sampathkumar-veeraraghavan-to-devote-himself-to-humanitarian-work\" target=\"_self\">Sampathkumar Veeraraghavan</a>, chair of the <a href=\"https://hac.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Humanitarian Activities Committee</a>, covers whether AI and machine learning can support fairness, personalization, and inclusiveness or if they create even more inequity.\n</p><p>\n<strong>Riding the Third Wave of AI for Precision Oncology. </strong>This episode features <a href=\"https://www.linkedin.com/in/nathanhayes/\" rel=\"noopener noreferrer\" target=\"_blank\">Nathan Hayes</a>, founder and CEO of <a href=\"http://modal.net\" rel=\"noopener noreferrer\" target=\"_blank\">Modal Technology Corp.</a>, and scientist <a href=\"https://www.linkedin.com/in/anthoula-lazaris-6b5b4615/?originalSubdomain=ca\" rel=\"noopener noreferrer\" target=\"_blank\">Anthoula Lazaris</a>, director of the <a href=\"https://rimuhc.ca/biobank\" rel=\"noopener noreferrer\" target=\"_blank\">biobank at the McGill University Health Center Research Institute</a>. They discuss how AI can improve patient outcomes. The experts also cover whether the full potential for precision oncology will be realized by using the “third wave of AI” with real-world data and practice. In the so-called third wave, AI systems are imagined to have humanlike communication and reasoning capabilities and be able to recognize, classify, and adapt to new situations autonomously.\n</p><p>\n<strong>Advanced AI and Sensors—Reaching the Hardest to Reach Patients at Home. </strong><a href=\"https://www.himss.org/resource-bio/sumit-kumar-nagpal#:~:text=Cherish%20Health%2C%20Inc.%2C&text=Sumit%20Kumar%20Nagpal%20is%20a,healthcare%20experience%2C%20cost%20and%20access.\" rel=\"noopener noreferrer\" target=\"_blank\">Sumit Kumar Nagpal</a>, cofounder and CEO of <a href=\"https://www.cherishhealth.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Cherish Health</a>—which develops sensors and artificial intelligence—discusses how the technologies can efficiently support the wellness needs of an aging population with dignity and integrity.\n</p><p>\n<strong>AI—The New Pipeline for Targeted Drug Discovery.</strong> <a href=\"https://www.linkedin.com/in/marialpineda/\" rel=\"noopener noreferrer\" target=\"_blank\">Maria Luisa Pineda</a>, cofounder and CEO of <a href=\"https://www.envisagenics.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Envisagenics</a>, covers how splicing RNA using AI and high-performance computing could create a path to targeted drug discovery. RNA splicing is at the forefront of providing insights into diseases that are linked back to RNA errors. Using AI, high-performance computing, and the exponential amount of genetic data, researchers can develop the insights needed for targeted drug discovery in oncology and other genetic conditions faster and more accurately, Pineda says.\n</p><p>\n<strong>Reducing the Healthcare Gap With Explainable AI.</strong> <a href=\"https://www.closedloop.ai/team/dave-decaprio\" rel=\"noopener noreferrer\" target=\"_blank\">Dave DeCaprio</a>, cofounder and CTO of <a href=\"https://www.closedloop.ai/\" rel=\"noopener noreferrer\" target=\"_blank\">ClosedLoop.ai,</a> discusses health care disparities around the globe. Identifying and leveraging the social determinants of health can close the gap, DeCaprio says. Off-the-shelf AI programs present a new perspective on transparency and the reduction of bias, and they could build trust about the applications among health stakeholders.\n</p><p>\n<strong>Getting Real About Healthcare Data and the Patient’s Journey.</strong> The time has come to unleash the value of unstructured data, says <a href=\"https://www.linkedin.com/in/alexandracarolinaehrlich/\" rel=\"noopener noreferrer\" target=\"_blank\">Alexandra Ehrlich</a>, principal health innovation scientist at <a href=\"http://oracle.com\" rel=\"noopener noreferrer\" target=\"_blank\">Oracle</a>. AI and machine learning offer opportunities, but first the technologies must be demystified, Ehrlich says, adding that natural language processing can help. Ehrilich explores NLP applications as well as challenges with navigating bias throughout accessible health care data.\n</p><p>\n<strong>Mind Your Data—The First Rule of Predictive Analytics in Clinical Research.</strong> <a href=\"https://www.linkedin.com/in/aaronmann/\" rel=\"noopener noreferrer\" target=\"_blank\">Aaron Mann</a>, senior vice president of data science at the <a href=\"https://crdsalliance.org/\" rel=\"noopener noreferrer\" target=\"_blank\">Clinical Research Data Sharing Alliance</a>, an <a href=\"https://ieee-isto.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE–Industry Standards and Technology Organization</a> alliance, discusses how open data sharing is paving the way for access to better quality, real-world, inclusive data. The sharing of data will enable predictive analytics to be more accurate, resourceful, and utilitarian in clinical research, Mann says.\n</p><p>\n<strong>Can the Health System Benefit From AI as It Stands Today?</strong> While focusing on accuracy, ethics, and bias in AI algorithms, we cannot lose sight of the need for more validated data, says <a href=\"https://www.linkedin.com/in/dimitrios-kalogeropoulos-phd-95966b1a1/?originalSubdomain=uk\" rel=\"noopener noreferrer\" target=\"_blank\">Dimitrios Kalogeropoulos</a>. He is a health care expert with the <a href=\"https://ec.europa.eu/info/index_en\" rel=\"noopener noreferrer\" target=\"_blank\">European Commission</a>, <a href=\"https://www.unicef.org/\" rel=\"noopener noreferrer\" target=\"_blank\">UNICEF</a>, the <a href=\"https://www.worldbank.org/en/home\" rel=\"noopener noreferrer\" target=\"_blank\">World Bank</a>, and the <a href=\"https://www.who.int/\" rel=\"noopener noreferrer\" target=\"_blank\">World Health Organization</a>. Kalogeropoulos explores whether AI is good for medicine and whether medicine is good for AI.\n</p><h3>​Here are the top 10 insights from the experts:</h3><br/><ol>\n<li>Data is a depreciating asset. The longer it sits the less value it has.</li>\n<li>Data is an abyss. If you want AI to make an impact on the health system, then make data reliable by design.</li>\n<li>Fairness is not a math problem. Equity in health care is not about the technology but rather the approaches taken to make health care accessible to all.</li>\n<li>Social determinants of health have significant, if not equal, value to diagnostic health data in closing the health care gap with AI.</li>\n<li>Make explainable AI transparent and off the shelf so that clinicians understand how the algorithms are addressing the questions in the data to help them arrive at the insights needed.</li>\n<li>Going to the same well of data provides the same results. Secondary use of real-world data available in an open, trusted, and validated means can enable predictive analytics to have a material impact on clinical research.</li>\n<li>RNA splicing holds many insights to fighting diseases caused by RNA errors for the development of targeted therapeutics in oncology.</li>\n<li>The trillions of bytes of data in genomes and pathology are no match for AI, which could generate much-needed insights in months, compared with the years it takes oncology researchers using former approaches.</li>\n<li>AI can close the health care gap if it is deployed properly.</li>\n<li>There is a strong disconnect between clinicians and hospital IT system administrators when it comes to implementing, utilizing, and integrating technologies.</li>\n</ol>",
  "pubDate": "Tue, 23 Aug 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ai-in-health-care",
  "category": [
    "Ieee products services",
    "Ai",
    "Artificial intelligence",
    "Health care",
    "Ieee standards association",
    "Ieee–industry standards and technology organization",
    "Ieee products and services",
    "Type:ti"
  ],
  "dc:creator": "IEEE Standards Association",
  "media:content": ""
}