{
  "title": "Companies Vie to Build NASA’s Next Communications Network",
  "link": "https://spectrum.ieee.org/nasa-new-network-tdrs",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-satellite-with-a-extended-circular-piece-flies-over-earth-s-horizon.jpg?id=29800832&width=1500&height=2000&coordinates=785%2C0%2C785%2C0\"/><br/><br/><p>It was a great idea for its time—a network of <a href=\"https://spectrum.ieee.org/search/?q=nasa\" target=\"_self\">NASA</a> communications satellites high in geostationary orbit, providing nearly continuous radio contact between controllers on the ground and some of the agency’s highest-profile missions: the <a href=\"https://spectrum.ieee.org/launch-new-spaceship-spacex-nasa-news-history\" target=\"_self\">space shuttles</a>, the <a href=\"https://spectrum.ieee.org/private-space-stations\" target=\"_self\">International Space Station</a>, the <a href=\"https://spectrum.ieee.org/the-hubble-telescope-25-years\" target=\"_self\">Hubble Space Telescope</a>, and dozens of others.</p><p>The satellites were called <a href=\"https://www.nasa.gov/directorates/heo/scan/services/networks/tdrs_main\" rel=\"noopener noreferrer\" target=\"_blank\">TDRS</a>—short for Tracking and Data Relay Satellite—and the first was launched in 1983 on the maiden voyage of the space shuttle Challenger. Twelve more would follow, quietly providing a backbone for NASA’s orbital operations. But they’ve gotten old, they’re expensive, and in the 40 years since they began, they’ve been outpaced by commercial satellite networks.</p><p>So what comes next? That’s the 278-million-dollar question—but, importantly, it’s not a multibillion-dollar question.</p><p class=\"pull-quote\">“Now it’ll be just plug and play. They can concentrate on the mission, and they don’t have to worry about comms, because we provide that for them.”<br/>—Craig Miller, Viasat</p><p>NASA, following its mantra to get out of the business of routine space operations, has now awarded US $278.5 million in contracts to six companies: Amazon’s <a href=\"https://www.aboutamazon.com/news/tag/project-kuiper\" target=\"_blank\">Project Kuiper</a>, <a href=\"https://www.inmarsatgov.com/\" target=\"_blank\">Inmarsat Government</a>, <a href=\"https://ses-gs.com/\" target=\"_blank\">SES Government Solutions</a>, <a href=\"https://www.spacex.com/\" target=\"_blank\">SpaceX</a>, <a href=\"https://www.telesat.com/\" target=\"_blank\">Telesat</a>, and <a href=\"https://www.viasat.com/\" target=\"_blank\">Viasat</a>. The agency is asking them to offer services that are reliable, adaptable for all sorts of missions, easy for NASA to use, and—ideally—orders of magnitude less expensive than TDRS.</p><p>“It’s an ambitious wish list,” says <a href=\"https://www1.grc.nasa.gov/wp-content/uploads/Ka-Band-Conference_-Commercial-Communication-Services-for-NASA-Space-Missions.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">Eli Naffah</a>, communications services project manager at NASA’s Glenn Research Center, in Cleveland. “We’re looking to have industry tell us, based on their capabilities and their business interests, what they would like to provide to us as a service that they would provide to others broadly.”</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"A satellite  and Earth.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"b5ddda11009e558ccc17cd5aa7afa4de\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"d14fc\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/a-satellite-and-earth.jpg?id=29800909&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Inmarsat now operates a number of geostationary satellites in their GX fleet. The <a href=\"https://space.skyrocket.de/doc_sdat/inmarsat-7.htm\" target=\"_blank\">projected GX7 satellite</a> [left] is expected to launch in 2023.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">Inmarsat Government</small></p><p>Satellite communication is one area that has taken off as a business proposition, independent of NASA’s space efforts. Internet and television transmission, GPS, phone service—all of these have become giant enterprises, ubiquitous in people’s lives. Economy of scale and competition have brought prices down dramatically. (That’s very different from, say, <a href=\"https://spectrum.ieee.org/musk-vs-bezos-the-battle-of-the-space-billionaires-heats-up\" target=\"_self\">space tourism</a>, which attracts a lot of attention but for now is still something that only the very wealthy can afford.)</p><p>NASA benefits, in the case of communications, from being a relatively small player, especially if it can get out from under the costs of running something like the TDRS system. The commercial satellite companies take over those costs—which, they say, is fine, since they were spending the money anyway.</p><p>“We love having customers like NASA,” says <a href=\"https://www.viasat.com/about/who-we-are/Craig-Miller/\" rel=\"noopener noreferrer\" target=\"_blank\">Craig Miller</a>, president for government systems at Viasat. “They’re a joy to work with, their mission is in alignment with a lot of our core values, but we make billions of dollars a year selling Internet to other sources.”</p><p>Each of the six companies under the new NASA contract takes a different approach. Inmarsat, SES, and Viasat, for instance, would use large relay satellites, like TDRS, each seeming to hover over a fixed spot on Earth’s equator because, at an altitude of 35,786 kilometers,  one orbit takes precisely 24 hours. Amazon and SpaceX, by contrast, would use swarms of smaller satellites in low Earth orbit, only 3,700 km in altitude. (SpaceX, at last count, had launched more than <a href=\"https://planet4589.org/space/stats/star/starstats.html\" target=\"_blank\">2,200 of its Starlink satellites</a>.) SES and Telesat would offer two-for-one packages, with service both from high and lower orbits. As for radio frequencies, the companies might use <a href=\"https://en.wikipedia.org/wiki/C_band_(IEEE)\" target=\"_blank\">C band</a>, <a href=\"https://en.wikipedia.org/wiki/Ka_band\" target=\"_blank\">K<sub>a </sub>band</a>, <a href=\"https://en.wikipedia.org/wiki/L_band\" target=\"_blank\">L band</a>, optical—whatever their existing clients have needed. And so on.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Two rows of stacked objects seen over the background of Earth.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"4ed4f8de6413908bff16ca14cd552a75\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"5bd00\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/two-rows-of-stacked-objects-seen-over-the-background-of-earth.jpg?id=29800895&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">Sixty SpaceX Starlink satellites wait for deployment from their launch rocket in low Earth orbit, in this photograph from 2019.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">SpaceX</small></p><p>It may sound like an alphabet soup of ways to solve one basic need—being in contact with its satellites—but engineers say that’s a minor trade-off for NASA if it can piggyback on others’ communications networks. “This allows NASA and our other government users to achieve their missions without the upfront capital expenditure and the full life-cycle cost” of running the TDRS system, said <a href=\"https://www.inmarsatgov.com/leadership-member/britt-lewis/\" target=\"_blank\">Britt Lewis</a>, a senior vice president of Inmarsat Government, in an email to <em>IEEE Spectrum</em>.<br/></p><p>One major advantage to the space agency would be the sheer volume of service available to it. In years past, the TDRS system could handle only so many transmissions at a time; if a particular mission needed to send a large volume of data, it had to book time in advance.</p><p>“Now it’ll be just plug and play,” says Miller at Viasat. “They can concentrate on the mission, and they don’t have to worry about comms, because we provide that for them.”</p><p>NASA says it expects each company will complete technology development and in-space demonstrations by 2025, with the most successful starting to take over operations for the agency by 2030. There will probably be no single winner: “We’re not really looking to have any one particular company be able to provide all the services on our list,” says NASA’s Naffah.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image rm-resized-container rm-resized-container-25 rm-float-left\" data-rm-resized-container=\"25%\" style=\"float: left;\">\n<img alt=\"picture of a satellite in earth orbit\" class=\"rm-shortcode rm-resized-image\" data-rm-shortcode-id=\"c0d355dde26f8c365ff886d9b5e6364a\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"caf09\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/picture-of-a-satellite-in-earth-orbit.jpg?id=29800903&width=980\" style=\"max-width: 100%\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">NASA's <a href=\"https://www.nasa.gov/feature/tdrs-m-to-continue-vital-communications-link-to-space\" target=\"_blank\">TDRS-M</a> communications satellite launched in 2017. </small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">NASA</small></p><p>The TDRS satellites have proved durable; TDRS-3, launched by the space shuttle Discovery in 1988, is still usable as a spare if newer satellites break down. NASA says it will probably continue to use the system into the 2030s, but it planned no more launches after the last (of TDRS-13 a.k.a. TDRS-M) in 2017.</p><p>If everything works out, says Amazon in an email, “This model would allow organizations like NASA to rely on commercial operators for near-Earth communications while shifting their focus to more ambitious operations, like solving technical challenges for deep space exploration and science missions.”</p><p>At which point the sky's the limit. NASA focuses on the moon, Mars, and other exploration, while it buys routine services from the private sector.</p><p>“We can provide the same kind of broadband capabilities that you’re used to having on Earth,” says Viasat’s Miller. He smiles at this thought. “We can provide Netflix to the ISS.”</p>",
  "pubDate": "Fri, 13 May 2022 15:28:16 +0000",
  "guid": "https://spectrum.ieee.org/nasa-new-network-tdrs",
  "category": [
    "Nasa",
    "Spacex",
    "Amazon",
    "Space communications"
  ],
  "dc:creator": "Ned Potter",
  "media:content": ""
}