{
  "id": "yt:video:AryAnhc2SwU",
  "yt:videoId": "AryAnhc2SwU",
  "yt:channelId": "UCRRr_xrOm66qaigIbwFLvbQ",
  "title": "How to invest your money (and not wreck the climate)",
  "link": "",
  "author": {
    "name": "Simon Clark",
    "uri": "https://www.youtube.com/channel/UCRRr_xrOm66qaigIbwFLvbQ"
  },
  "published": "2022-09-30T17:00:41+00:00",
  "updated": "2022-10-05T21:05:36+00:00",
  "media:group": {
    "media:title": "How to invest your money (and not wreck the climate)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Watch my companion video about crypto as a green investment over on Nebula, available in partnership with CuriosityStream: https://www.curiositystream.com/simonclark\n\nAfter a very expensive year, I wanted to learn how to invest my finally-free savings in a way that would achieve two objectives:\n1) Not make the climate crisis worse\n2) Help contribute to solutions to the climate crisis\nThis video is the outcome of my personal research, in which I introduce you to various investment options and how to make climate-friendly decisions in each case. This isn't comprehensive or the opinion of an expert! Just a concerned citizen trying to use their savings to help fix the mess we find ourselves in.\n\nAlong the way I was ably assisted by my friend and money guru Ali Abdaal, check out his channel: https://youtube.com/aliabdaal\n\nReferences:\n1. https://shareaction.org/news/net-zero-banks-continue-to-finance-oil-gas-expansion-ignoring-climate-science\n2. https://friendsoftheearth.uk/climate/dirty-pensions-ps10-billion-still-invested-fossil-fuels-local-government-pension-funds\n3. https://bank.green/sustainable-ethical-banks\n4. https://circa5000.com/pension\n5. https://www.bcg.com/ja-jp/publications/2022/combating-climate-crisis-with-alternative-protein\n6. https://greenportfolio.com/\n7. https://www.ishares.com/\n8. https://clim8.com/\n9. https://www.betterment.com/resources/socially-responsible-investing-portfolio-methodology#climateimpact\n10. https://www.betterment.com/socially-responsible-climate-impact-portfolio\n11. https://www.carboncollective.co/\n\nYou can support the channel by becoming a patron at http://www.patreon.com/simonoxfphys\n\nCheck out my website! https://www.simonoxfphys.com/\n\n---------- II ----------\n\nMy twitter - http://www.twitter.com/simonoxfphys\nMy facebook - http://www.facebook.com/youtubesimon\nMy insta - http://www.instagram.com/simonoxfphys\nMy goodreads - http://www.goodreads.com/simonoxfphys\n\n---------- II ----------\n\nMusic by Epidemic Sound: http://epidemicsound.com\nSome stock footage courtesy of Getty.\nEdited by Luke Negus.\n\nVideo about how to invest your money in a way that doesn't cause climate change or contribute to the climate crisis, which stocks to pick which shares to pick to minimise climate impact, which ETFs are best for climate change, should I use a robo-investor like Betterment or Wealthify and can they help with the climate crisis. In this video essay I tell you what I learned about low carbon investment options and how to make your savings help the climate crisis.\n\nHuge thanks to my supporters on Patreon: Mark Injerd, Mirik Gogri, dryfrog, Justin Warren, Jack Grimm, Angela Flierman, Alipasha Sadri, Calum Storey, Mattophobia, Riz, Jan Krüger, The Confusled, Wessel van der Heijden, Conor Safbom, William Pettersson, Paul H and Linda L, Simon Stelling, Gabriele Siino, Ieuan Williams, Candace H, Tom Malcolm, Marcus Bosshard, Leonard Neamtu, Shab Kumar, Brady Johnston, Liat Khitman, Kent & Krista Halloran, Rapssack, Kevin O'Connor, Timo Kerremans, Ashley Wilkins, Michael Parmenter, Samuel Baumgartner, Dan Sherman, ST0RMW1NG 1, Adrian Sand, Morten Engsvang, Cio Cio San, Farsight101, K.L, fourthdwarf, Daan Sneep, Felix Freiberger, Chris Field, ChemMentat, Kolbrandr, , Sebastain Graf, Dan Nelson, Shane O'Brien, Alex, Fujia Li, Will Tolley, Cody VanZandt, Jesper Koed, Jonathan Craske, Albrecht Striffler, Igor Francetic, Jack Troup, HandsomeCaveman, Sean Richards, Kedar , Omar Miranda, Alastair Fortune, bitreign33 , Mat Allen, Rafaela Corrêa Pereira, Colin J. Brown, Princess Andromeda, Mach_D, Thusto , Andy Hartley, Lachlan Woods, Dan Hanvey, Simon Donkers, Kodzo , James Bridges, Liam , Andrea De Mezzo, Wendover Productions, Kendra Johnson.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}