{
  "title": "YUNG GRAVY IS COMING FOR ADDISON RAE'S MOM — BFFs EP. 91",
  "description": "<p>We start the show with the latest on the Lil Huddy vs Charli D'Amelio and Landon Barker beef including Bri going to Huddy's launch part with Jaden, Landon going after Huddy's mom, and Landon DMing BFFs about Dave going after him. \n\nWe then get into Olivia Wilde and Florence Pugh feuding over Harry Styles, OIivia Rodrigo and Joshua Bassett reuniting, Sydney Sweeney saying she isn't paid enough, Taylor Swift and other celebrities being shamed for their private jet emissions, the Jake Paul fight getting canceled, Will Smith apologizing to Chris Rock, Celebrities playing the lottery, Instagram trying (and failing) to become Tik Tok, and we end headlines with BFFs corner talking about Ethan Klein and H3 coming for us over a copyright strike.\n\nWe are then joined by Yung Gravy to talk about his love for MILFs, especially for Addison Rae's mom, his recent viral leaked tape, his music career, taking fan's moms out for dates, and we finish with a MILF edition of FMK in which we put Gravy to the test with some of the all time MILFs.\n\nSupport our sponsors:\n\nGametime: Download the Gametime app at https://barstool.link/GametimeApp and redeem code BFF for $20 off your first purchase (terms apply).\n\nTakis: Find Takis on Amazon Today and \"Face the Intensity\"\n\nWhatnot: Download the Whatnot App today. Go to https://barstool.link/WhatnotBSS to get $10 off your first purchase on Whatnot.</p><br /><p>You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit <a href=\"https://barstool.link/bffspod\">barstool.link/bffspod</a></p>",
  "guid": "a42ff563-5c76-4e4f-b067-aa92be774105",
  "pubDate": "Thu, 4 Aug 2022 00:00:00 +0000",
  "link": "https://www.barstoolsports.com/shows/134/Bffs",
  "itunes:explicit": "yes",
  "itunes:duration": "01:11:16",
  "dc:creator": "Barstool Sports",
  "itunes:image": "",
  "enclosure": ""
}