{
  "title": "S14 Ep19: Journey Into The Mind Of Evil",
  "link": "https://audioboom.com/posts/8098611",
  "itunes:episode": 19,
  "itunes:title": "Journey Into The Mind Of Evil",
  "itunes:season": 14,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 5951,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "BEYOND the Darkness celebrates it's 100th episode of True Crime Tuesday by airing some of it's best episodes for you this weekend!!<br>\n<br>\nOn Saturday's episode...<br>\n<br>\nTrue Crime Tuesday takes a Journey Into The Mind Of Evil with The Shawcross Letters and guest John Paul Fay.<br>\n<br>\nWhat happens when one of the most evil men in the history of America meets a man he trusts to share his darkest secrets with? How does it affect someone already on the edge of society when he is taken under the wing of a serial killer? Partly told through the letters of Arthur Shawcross, THE SHAWCROSS LETTERS is the tale of one of America's most notorious serial killers and his relationship with his would-be biographer, John Paul Fay.<br>\n<br>\nGet the book here: <a href=\"https://www.amazon.com/SHAWCROSS-LETTERS-Journey-Into-Mind-ebook/dp/B078T6NVGK/ref=sr_1_3?ie=UTF8&qid=1545327932&sr=8-3&keywords=john+fay\">https://www.amazon.com/SHAWCROSS-LETTERS-Journey-Into-Mind-ebook/dp/B078T6NVGK/ref=sr_1_3?ie=UTF8&qid=1545327932&sr=8-3&keywords=john+fay</a><br>\n<br>\nPLUS:  Dumb Crimes and Stupid Criminals!!  <br>\n<br>\nSupport our sponsors for great deals!<br>\n<br>\nTRUE CASH from TRUECAR is something you need to check out for yourself. It has never been easier or faster to get a TRUE VALUE on your car and you can do it from the comfort of home at <a href=\"http://www.TrueCar.com\">www.TrueCar.com</a><br>\n<br>\n 2 out of 3 guys will experience hair loss by the time they’re 35. Introducing Keeps – the easiest and most affordable way to keep the hair you have.  To receive your first month of treatment for free, go to <a href=\"http://Keeps.com/DARKNESS\">Keeps.com/DARKNESS</a><br>\n<br>\nDigestive troubles? \tWeight gain?\tLow energy?\tAchy Joints?<br>\nIf you’ve been struggling with any of these, Dr. Steven Gundry says you’re not alone<br>\nAnd he knows the real cause! Watch the free video at <a href=\"http://totalrestore2.com\">totalrestore2.com</a> to find out more! <br>\n<br>\nHas life piled on the anxiety to an overwhelming crescendo? Sunday Scaries can give you relief! Sunday Scaries are CBD Gummies custom formulated with a 10mg of blend of broad spectrum and isolate CBD as well as vitamins B12 and D3 for mood boosters. They are made with natural ingredients and are free of gluten, dairy, yeast, egg, soy and peanuts. Get 10 percent off and free shipping  at <a href=\"http://sundayscaries.com\">sundayscaries.com</a> and use the code word DARKNESS .",
  "itunes:summary": "BEYOND the Darkness celebrates it's 100th episode of True Crime Tuesday by airing some of it's best episodes for you this weekend!!\n\nOn Saturday's episode...\n\nTrue Crime Tuesday takes a Journey Into The Mind Of Evil with The...",
  "pubDate": "Sat, 09 Mar 2019 10:00:00 +0000",
  "guid": "495ae1f1-3706-4443-b534-eade686d68bf",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}