{
  "title": "First Lunar Occultation Results with the TIRCAM2 Near-Infrared Imager at the Devasthal 3.6-m Telescope. (arXiv:2211.01682v1 [astro-ph.SR])",
  "link": "http://arxiv.org/abs/2211.01682",
  "description": "<p>TIRCAM2 is the facility near-infrared Imager at the Devasthal 3.6-m telescope\nin northern India, equipped with an Aladdin III InSb array detector. We have\npioneered the use of TIRCAM2 for very fast photometry, with the aim of\nrecording Lunar Occultations (LO). This mode is now operational and publicly\noffered. In this paper we describe the relevant instrumental details, we\nprovide references to the LO method and the underlying data analysis\nprocedures, and we list the LO events recorded so far. Among the results, we\nhighlight a few which have led to the measurement of one small-separation\nbinary star and of two stellar angular diameters. We conclude with a brief\noutlook on further possible instrumental developments and an estimate of the\nscientific return. In particular, we find that the LO technique can detect\nsources down to K~ 9 mag with SNR=1 on the DOT telescope. Angular diameters\nlarger than ~ 1 milliarcsecond (mas) could be measured with SNR above 10, or\nK~6 mag. These numbers are only an indication and will depend strongly on\nobserving conditions such as lunar phase and rate of lunar limb motion. Based\non statistics alone, there are several thousands LO events observable in\nprinciple with the given telescope and instrument every year.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Sharma_S/0/1/0/all/0/1\">Saurabh Sharma</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Richichi_A/0/1/0/all/0/1\">Andrea Richichi</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Ojha_D/0/1/0/all/0/1\">Devendra K. Ojha</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kumar_B/0/1/0/all/0/1\">Brajesh Kumar</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Naik_M/0/1/0/all/0/1\">Milind Naik</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Rawat_J/0/1/0/all/0/1\">Jeewan Rawat</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bora_D/0/1/0/all/0/1\">Darshan S. Bora</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Belwal_K/0/1/0/all/0/1\">Kuldeep Belwal</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dhami_P/0/1/0/all/0/1\">Prakash Dhami</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Bisht_M/0/1/0/all/0/1\">Mohit Bisht</a>"
}