{
  "title": "Episode 96 (video): Mnemonics Advanced: The Pegword System Part 2",
  "pubDate": "Wed, 27 May 2009 18:56:17 +0000",
  "guid": "episode-96-video-mnemonics-advanced-the-pegwor",
  "link": "http://www.thepsychfiles.com/2009/05/episode-96-video-mnemonics-advanced-the-pegword-system-part-2/",
  "itunes:image": "",
  "description": "In the last episode you saw me memorize - almost perfectly - a list of 20 top sci-fi movies.  How did I do it?  In this video learn exactly how the advanced pegword system works.   I'll show you how each number becomes a letter, each letter becomes a word and each word becomes an image that will help you memorize just about any size list.  Skeptical?  You won't be after seeing exactly how it's done.",
  "content:encoded": "In the last episode you saw me memorize - almost perfectly - a list of 20 top sci-fi movies.  How did I do it?  In this video learn exactly how the advanced pegword system works.   I'll show you how each number becomes a letter, each letter becomes a word and each word becomes an image that will help you memorize just about any size list.  Skeptical?  You won't be after seeing exactly how it's done.",
  "enclosure": "",
  "itunes:duration": "26:36",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,memory,mnemonics",
  "itunes:subtitle": "In the last episode you saw me memorize - almost perfectly - a list of 20 top sci-fi movies.  In this video learn exactly how the advanced pegword system works. ",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "In the last episode you saw me memorize - almost perfectly - a list of 20 top sci-fi movies. How did I do it? In this video learn exactly how the advanced pegword system works. I'll show you how each number becomes a letter, each letter becomes a word and each word becomes an image that will help you memorize just about any size list. Skeptical? You won't be after seeing exactly how it's done."
}