{
  "title": "OkCupid Data Shows That Women Are Owning Their Dating Lives More Than Ever",
  "link": "https://theblog.okcupid.com/okcupid-data-shows-that-women-are-owning-their-dating-lives-more-than-ever-adce4690a203?source=rss----2cd59e7d4ed1--data",
  "guid": "https://medium.com/p/adce4690a203",
  "category": [
    "international-womens-day",
    "data",
    "relationships",
    "dating",
    "love"
  ],
  "dc:creator": "OkCupid",
  "pubDate": "Tue, 08 Mar 2022 13:03:07 GMT",
  "atom:updated": "2022-03-08T13:03:03.091Z",
  "content:encoded": "<h4>In honor of International Women’s Day, we explored how women around the world are being more assertive in dating and beyond</h4><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*A0pfi6jU98MAex8mO5Hevg.png\" /></figure><p>Over the past two years, we’ve seen daters become increasingly assertive. Now more than ever, daters are being clear about what they want and what’s truly important to them. Singles aren’t waiting for a message anymore — they’re making the first move when they see a match they want to meet — and the focus is shifting from “who can support me financially” to “who will support my values?” While we’ve seen this change happen among daters of all genders and orientations around the world, women are leading the charge.</p><h4><strong>Women are taking control of their dating lives</strong></h4><p>Throughout the pandemic, women have been increasingly more likely to send likes and first messages — and this has remained true in 2022. <strong>Women sent 10% more likes this January than they did in December</strong>, and they’ve proven that taking the initiative pays off: <strong>Contact exchanges for women in January 2022 were at their highest in over a year </strong>(increasing 13% since December).</p><p>Women have expressed feeling more confident in finding matches and making the first move because they’re being more open and upfront about what they want. In the past five years, <strong>there’s been a 600% increase in women’s profiles stating “looking for a feminist” or “feminists only”</strong> and a <strong>5% increase in women responding “no” to the OkCupid matching question “Would you date someone who isn’t a feminist?”</strong></p><h4><strong>Women are not relying on a match to support them (financially)</strong></h4><p>While women around the world are increasingly likely to be looking for a match to support their values, female daters have become increasingly<em> less</em> likely to expect (or want) a match to support them financially. In fact, <strong>only 10% of women on OkCupid say that money is very important when it comes to a match</strong>. Here’s how it stacks up for women by country:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*UlWMvsdaSc7bH_YdyH1Ucg.jpeg\" /></figure><p>Looking at the two extremes, women in Indonesia are 9x more likely than women in Germany to say that a match’s money is extremely important; but even so, it’s just over one-third of Indonesian women who feel that way.</p><p>Instead, <strong>women are focused on fighting to close the gender wage gap, with 84% of female daters on OkCupid saying more needs to be done to do so (70% of men agree)</strong>. See how it breaks down by country:</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*kDsF3OofCJyBn1bBaoAjrw.jpeg\" /></figure><p>Women are also keeping track of their own finances so they can depend solely on themselves. In fact, very few women on OkCupid say they do not keep track of their own finances; unlike with the responses to other OkCupid matching questions on money, Indonesian women take the lead here, with only 5% saying they do not keep their budget.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*bhnQHhgzPkbksbzId0Tiqg.jpeg\" /></figure><p>Yet despite female daters’ desire to be financially independent, what’s most important to them — across the globe — is being independent full-stop.<strong> Sixty-five percent of women on OkCupid who responded to the matching question “Would you rather have more money or more freedom?” said “freedom” (slightly ahead of 64% of men).</strong></p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*iT0aVnnDPSeUFSepp8nJkg.jpeg\" /></figure><h4><strong>Women are more focused than ever on what’s truly important to them in a match</strong></h4><p>So what does freedom mean? Well, it’s the right to choose what <em>you</em> want — and that comes to who you date, too. After all, <strong>over the past two years there’s been a 55% increase in women saying a relationship is more important to them than advancing their career</strong>. As a result, women are prioritizing what’s<em> really</em> important to them in a match and what they’re <em>really </em>looking for beyond the surface.</p><p>In the past five years <strong>there’s been a 5% increase in women responding “extremely honest” to the matching question “Would you rather date someone extremely hot or extremely honest?” For men, on the other hand, there’s been a 3% decrease. </strong>Single women are also focused on finding someone they connect with emotionally, with <strong>88% today saying it’s important to establish an emotional connection before a physical one (compared to 78% of men)</strong>. And in just this past month, <strong>there’s been a 5% increase in women seeking a relationship to last for the rest of their lives</strong>.</p><p>So on this International Women’s Day (and every day!), we at OkCupid are celebrating the women who are taking their dating lives into their own hands. No matter what they’re looking for, women are being more direct, open, and assertive about what they want and how they’re going to get it — and we think that’s pretty amazing.</p><p><a href=\"https://okcupid.onelink.me/godV/44c7b6b0\"><em>Download OkCupid</em></a><em> & find someone great today!</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=adce4690a203\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://theblog.okcupid.com/okcupid-data-shows-that-women-are-owning-their-dating-lives-more-than-ever-adce4690a203\">OkCupid Data Shows That Women Are Owning Their Dating Lives More Than Ever</a> was originally published in <a href=\"https://theblog.okcupid.com\">OkCupid Dating Blog</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}