{
  "title": "Pyongyang continues shelling and missile tests – Seoul",
  "link": "https://www.rt.com/news/565810-north-korea-more-missiles/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565810-north-korea-more-missiles/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362788f203027657549ac55.jpg\" /> North Korea has fired around 100 artillery shells and six more missiles during its barrage on Wednesday, South Korea says <br/><a href=\"https://www.rt.com/news/565810-north-korea-more-missiles/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>North Korea continued its show of force, launching a ballistic missile across the maritime border, Seoul says</strong></p>\n            \n                        \n            <p>North Korea fired around 100 artillery shells and six more missiles into the Yellow Sea and the Sea of Japan, known to Koreans as the East Sea, on Wednesday, Seoul&rsquo;s military has said.</p>\n<p>The statement came hours after South Korea&rsquo;s Joint Chiefs of Staff (JCS) reported that the North had launched at least 17 ballistic and other missiles, one of which crossed the so-called Northern Limit Line (NLL), the de facto maritime border, for the first time since the end of the Korean War in 1953. The JCS described the move as <em>&ldquo;very rare and intolerable.&rdquo;</em>&nbsp;</p>\n<p>According to the JCS, the shells were&nbsp;fired from the North&rsquo;s Kangwon Province, which borders South Korea. The JCS said that Pyongyang&nbsp;began its missile barrage at around 6:50am local time by launching four short-range ballistic missiles into the Yellow Sea from the northeastern Pyongan Province, and two hours later fired three more from the vicinity of the eastern city of Wonsan.</p>\n<p>In response to the launches, South Korean F-15K and KF-16 fighter jets fired three air-to-surface missiles into the sea across the NLL.</p>\n<p><em>&ldquo;Our military&rsquo;s response reaffirms our resolve to sternly respond to any provocations and shows that we are capable of accurately striking our enemy,&rdquo;</em> the JCS said, adding that the South&rsquo;s missiles had flown an equivalent distance as the ones fired by the North.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6360a36f2030274d80227d7d.jpg\" alt=\"FILE PHOTO: North Korean flags are carried during a celebration of the nation&#039;s 73rd founding anniversary in Pyongyang, North Korea, September 9, 2021.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565703-north-korea-nuclear-plans/\">North Korea claims US has put ‘nuclear script’ into ‘final Stage’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>South Korean President Yoon Suk-yeol said the launch beyond the NLL is <em>&ldquo;an actual invasion&rdquo;</em> of the country&rsquo;s territory and that the North&rsquo;s actions will not damage Seoul&rsquo;s alliance with the US, according to his office.</p>\n<p>Japanese Defense Minister Yasukazu Hamada told reporters that Pyongyang fired at least two ballistic missiles, but that they fell outside of Japan&rsquo;s exclusive economic zone. Prime Minister Fumio Kishida condemned the launches as <em>&ldquo;absolutely unacceptable.&rdquo;</em>&nbsp;</p>\n<p>The apparent show of force came as the US and South Korea are conducting the week-long annual &lsquo;Vigilant Storm&rsquo; exercise, during which around 240 warplanes are performing roughly 1,600 sorties, the largest number in the drill&rsquo;s history, according to the US Pacific Air Forces.</p>\n<p>A spokesperson for the North Korean Foreign Ministry on Tuesday denounced the drill as escalatory and warned of <em>&ldquo;more powerful follow-up measures.&rdquo; </em></p>\n<p>Pyongyang has said previously that it considers joint US-South Korean exercises a threat to its security. Pak Jong-chon, a senior official at the ruling Workers&rsquo; Party of Korea, stated that Washington and Seoul will <em>&ldquo;pay the most horrible price in history&rdquo;</em> if they use force against the North.</p>",
  "enclosure": "",
  "pubDate": "Wed, 02 Nov 2022 14:32:53 +0000",
  "dc:creator": "RT"
}