{
  "title": "US cyber agency keeps the work of the ‘Ministry of Truth’ alive, leak shows",
  "link": "https://www.rt.com/news/565829-us-cybersecurity-agency-censorship/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565829-us-cybersecurity-agency-censorship/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63629b3485f54002e72ce9a1.jpg\" /> Leaked papers from a US cybersecurity agency reveal censorship efforts in the vein of the defunct Disinformation Governance Board <br/><a href=\"https://www.rt.com/news/565829-us-cybersecurity-agency-censorship/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>A little-known agency inside the US Department of Homeland Security is on a mighty slippery censorship slope</strong></p>\n            \n                        \n            <p>Partially-censored meeting minutes of the Cybersecurity Advisory Committee advising the director of the Cybersecurity and Infrastructure Security Agency (CISA), an agency of the US Department of Homeland Security, have been obtained by <a href=\"https://theintercept.com/2022/10/31/social-media-disinformation-dhs/\" target=\"_blank\" rel=\"noopener noreferrer\">The Intercept</a>.</p>\n<p>The documents reveal attempts to conflate the need to protect American &ldquo;<em>critical infrastructure&rdquo;</em> from what the committee repeatedly describes as threats of <em>&ldquo;disinformation&rdquo;</em> &ndash; or rather, <em>&ldquo;mis-, dis-, and mal-information (MDM).&rdquo;</em> The meeting notes describe telecommunications infrastructure (which would include the internet) and public healthcare infrastructure as in need of protection from wrong-speak.&nbsp;In essence, it keeps up the work of the short-lived and controversial Disinformation Governance Board, which earned the unenviable nickname of the &lsquo;Ministry of Truth&rsquo;.</p>\n<p>The papers focus on countering non-establishment narratives related to Covid-19 origins and vaccines, racial justice, the withdrawal of US troops from Afghanistan, and the US&rsquo; involvement in the Ukraine conflict. It also reveals the existence of a back channel for Homeland Security to communicate its desire to boost or censor certain messages on Facebook and Instagram.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/636009cb2030273e791f89e9.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565690-social-media-censorship-usa/\">US government worked with Big Tech to censor social media – Intercept</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The nature of these online narratives being targeted for government protection from <em>&ldquo;disinformation&rdquo;</em> just happen to coincide with those that evoke a ton of legitimate criticism. When the government gets directly involved in narrative policing under the guise of &ldquo;<em>infrastructure protection,&rdquo;</em> it&rsquo;s a dodgy pretext that should raise serious concerns about government overreach to the detriment of free expression and flow of information.&nbsp;</p>\n<p>No one&rsquo;s blowing up the internet with mere words. No one&rsquo;s causing the public health system to fail by debating Covid-related science propagated by the government, even if it later does indeed turn out to be misinformed or questionable. Remember, for example, when Western officials, including US President Joe Biden, were saying that the jab would prevent infection and transmission &ndash; and that anyone saying otherwise was full of it? Or when the US government spent the better part of two decades repeating that the US was winning in Afghanistan &ndash; right up until the US withdrawal and the Taliban retaking the country? Or how about the claim that the US wasn&rsquo;t directly involved in the conflict with Russia in Ukraine &ndash; right up until the Pentagon <a href=\"https://www.wsws.org/en/articles/2022/11/02/ukra-n02.html\" target=\"_blank\" rel=\"noopener noreferrer\">confirmed</a> the deployment of US troops to Ukraine, albeit not in frontline combat operations. <em>&ldquo;We&rsquo;ve been very clear there are no combat forces in Ukraine, no US forces conducting combat operations in Ukraine, these are personnel that are assigned to conduct security cooperation and assistance as part of the defense attach&eacute; office,&rdquo;</em> Pentagon Press Secretary Force Brig. Gen. Pat Ryder said.&nbsp;</p>\n<p>But based on the rules laid out by this online disinformation policing agency, anyone who dared to reveal evidence, information, or observations that run contrary to what the US government was willing to admit as part of the official narrative could feasibly be considered a peddler of fake info. History has shown, however, that they&rsquo;re often proved correct.&nbsp;</p>\n<p>Across the pond, French President Emmanuel Macron was asked recently in an interview with French state media about Russian media outlets remaining accessible in France through online platforms despite state censorship. In evoking the bans, Macron <a href=\"https://www.politico.eu/article/emmanuel-macron-france-russia-hands-are-tied-as-rt-still-live/\" target=\"_blank\" rel=\"noopener noreferrer\">said</a>, <em>&ldquo;We&rsquo;re using the informational weapon.&rdquo;</em>&nbsp;Like in the US, it sounds like Macron is admitting that the state is using censorship as a weapon against narratives and information that runs counter to their own. Apparently, the public&rsquo;s right to be fully informed and make up their own minds about what&rsquo;s going on in the world can just be shrugged off as collateral damage.</p>\n<p>It&rsquo;s now becoming commonplace for Western <em>&ldquo;democracy&rdquo;</em> to use the law enforcement apparatus of the state to ensure that its propaganda goes unchallenged online and offline.&nbsp;</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.05/thumbnail/62851d9885f540722f372112.jpg\" alt=\"FILE PHOTO: Protesters against internet censorship. © Alexander Koerner / Getty Images\" />\n            <figcaption><a href=\"https://www.rt.com/news/555705-dhs-disinfo-board-jankowicz/\">US puts ‘disinformation board’ on hold</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>It will be interesting to see how well that goes down with new Twitter CEO Elon Musk, who has been waging a war on censorship on various fronts. Musk was asked back in March to block Russian news sources on his Starlink satellite network. <em>&ldquo;We will not do so unless at gunpoint. Sorry to be a free speech absolutist,&rdquo;</em> he <a href=\"https://twitter.com/elonmusk/status/1499976967105433600\" target=\"_blank\" rel=\"noopener noreferrer\">replied</a>.&nbsp;Musk has also been openly <a href=\"https://www.politico.eu/article/eu-commissioner-to-musk-twitter-will-play-by-our-rules/\" target=\"_blank\" rel=\"noopener noreferrer\">reminded</a> by European Union Internal Market Commissioner Thierry Breton, in the wake of his recent talk of restoring free speech, that the platform would be forced to abide by the bloc&rsquo;s rules governing public expression. And clearly those aren&rsquo;t very free.</p>\n<p>Democratic Senator Chris Murphy is now demanding a US government <a href=\"https://worldnewsera.com/news/entrepreneurs/u-s-exploring-whether-it-has-authority-to-review-musks-twitter-deal/\" target=\"_blank\" rel=\"noopener noreferrer\">investigation</a>&nbsp;into the financial participation of Saudi Arabia, Musk-owned Twitter&rsquo;s second largest investor, in the platform. Interesting that no one seemed to care that the Saudis had invested in Twitter long before Musk came along. Or that governments Murphy calls <em>&ldquo;repressive&rdquo;</em> have cash flowing into Hollywood and American media outlets as advertisers. And that cash conveniently didn&rsquo;t have any particular color or citizenship until Musk took over vowing to claw back free speech. Now suddenly this US official is dragging out the old foreign interference hammer to use against Musk.&nbsp;</p>\n<p>If Musk was standing up against censorship perpetrated by a regime the West didn&rsquo;t like, he&rsquo;d be invited to sit next to First Lady Jill at Biden&rsquo;s next State of the Union address. Instead, US government agencies are increasingly guilty of the same sort of repression for which they&rsquo;re so quick to criticize others.</p>",
  "enclosure": "",
  "pubDate": "Thu, 03 Nov 2022 14:09:30 +0000",
  "dc:creator": "RT"
}