{
  "title": "118: Natalie Wood: American Murder Mystery",
  "link": "https://audioboom.com/posts/7489045",
  "itunes:episode": 118,
  "itunes:title": "Natalie Wood: American Murder Mystery",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 2966,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>At 43 years old, actress Natalie Wood had it all. She was an adored icon who'd been acting since before she could remember. She'd married the love of her life and had a thriving career and a loving family. But on Thanksgiving weekend in 1981, she disappeared from the yacht she was sharing with her husband Robert Wagner and actor CHRISTOPHER FREAKING WALKEN. Hours later, her body was recovered in a nearby cove. Was it an accidental drowning or was it murder? DID I MENTION THAT CHRISTOPHER WALKEN IS WRAPPED UP IN THIS?<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 100 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! You can also get ad-free versions of our regular episodes! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a><br>\n<br>\n<strong>COME SEE US LIVE ON TOUR!</strong> We're coming to a city near you! <a href=\"https://www.truecrimeobsessed.com/see-us-live\">CHECK OUT ALL THE DETAILS AND GET TICKETS HERE!</a>\n</div>\n",
  "pubDate": "Tue, 28 Jan 2020 05:00:00 +0000",
  "guid": "tag:audioboom.com,2020-01-28:/posts/7489045",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}