{
  "title": "Off-the-shelf Models and AutoML",
  "link": "https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/",
  "comments": "https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/#comments",
  "dc:creator": "Gianmario",
  "pubDate": "Mon, 16 Dec 2019 09:00:00 +0000",
  "category": [
    "Agile",
    "Cloud",
    "Google Cloud Platform",
    "Machine Learning",
    "AI services",
    "automl",
    "natural language processing",
    "pre-trained models",
    "speech recognition"
  ],
  "guid": "https://datasciencevademecum.wordpress.com/?p=2339",
  "description": "<p>This piece is part of a series on 2019 trends in the AI and Machine Learning industry. You can read my full thoughts on the past year in this summary I wrote for the Helixa blog, which also includes links to the other in-depth pieces in this series. &#8212;&#8212;&#8212;- There is no doubt that the &#8230; <a href=\"https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Off-the-shelf Models and AutoML</span></a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/\">Off-the-shelf Models and AutoML</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencevademecum.com\">Vademecum of Practical Data Science</a>.</p>\n",
  "content:encoded": "\n<p><em>This piece is part of a series on 2019 trends in the AI and Machine Learning industry. You can read my full thoughts on the past year in </em><a href=\"https://www.helixa.ai/blog/ai-trends-2019\"><em>this summary I wrote for the Helixa blog</em></a><em>, which also includes links to the other in-depth pieces in this series.</em></p>\n\n\n\n<p><em>&#8212;&#8212;&#8212;-</em></p>\n\n\n\n<p>There is no doubt that the biggest advancements in AI technologies have involved solving generic cognitive tasks with a level of accuracy able to beat humans.</p>\n\n\n\n<p>Every cloud provider has a comparable offering for those main cognitive services:</p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><br></td><td>Amazon Web Services</td><td>Google Cloud Platform</td><td>Microsoft Azure</td><td>IBM Watson</td></tr><tr><td>Computer Vision</td><td>Rekognition</td><td>Vision</td><td>Computer Vision API</td><td>Watson Visual Recognition</td></tr><tr><td>Natural Language</td><td>Comprehend</td><td>Natural Language</td><td>Text Analytics</td><td>Watson NLU</td></tr><tr><td>Speech</td><td>Polly</td><td>Conversation</td><td>Bling Text-to-Speech</td><td>Watson Text-to-Speech</td></tr></tbody></table></figure>\n\n\n\n<p>Common applications of cognitive services:</p>\n\n\n\n<ul><li>Computer Vision (image and video object recognition and tagging)</li><li>Natural Language, English-focused (text analytics, entity recognition, sentiment analysis, language translation)</li><li>Voice, English-focused (speech and conversation)</li></ul>\n\n\n\n<p>Although Google is not the biggest player in terms of cloud infrastructures, I think Google Cloud Platform might outperform the competition in&nbsp; ML service offerings. What makes Google stand out is the accuracy, robustness, and richness of the different services in its portfolio.</p>\n\n\n\n<p>One use case that particularly caught my attention was the <a href=\"https://cloud.google.com/vision\">Google Vision services</a> for emotion detection and entity recognition:<br></p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://i0.wp.com/datasciencevademecum.com/wp-content/uploads/2020/04/img_5dfcb70b305e8.png?w=660&#038;ssl=1\" alt=\"\" data-recalc-dims=\"1\"/><figcaption>Original image of Giuseppe Conte, Prime Minister of Italy in 2019 from <a href=\"https://en.wikipedia.org/wiki/Giuseppe_Conte#/media/File:Giuseppe_Conte_Official.jpg\" rel=\"noreferrer noopener\" target=\"_blank\">Wikipedia</a>. The annotated Image was generated via <a href=\"https://cloud.google.com/vision\" rel=\"noreferrer noopener\" target=\"_blank\">Google Vision API</a>.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https://i0.wp.com/datasciencevademecum.com/wp-content/uploads/2020/04/img_5dfcb711802c6.png?w=660&#038;ssl=1\" alt=\"\" data-recalc-dims=\"1\"/><figcaption>Original image of Giuseppe Conte, Prime Minister of Italy in 2019 from <a href=\"https://en.wikipedia.org/wiki/Giuseppe_Conte#/media/File:Giuseppe_Conte_Official.jpg\" rel=\"noreferrer noopener\" target=\"_blank\">Wikipedia</a>. The annotated Image was generated via <a href=\"https://cloud.google.com/vision\" rel=\"noreferrer noopener\" target=\"_blank\">Google Vision API</a>.</figcaption></figure>\n\n\n\n<p>The Web Entities offering makes Google shine. In fact, the entity recognition service, either via images or text corpus, provides a unique entity identifier and a link to the corresponding Wikipedia. We can benefit from the combination of both AI technology and the massive knowledge base they have built crawling the WWW.</p>\n\n\n\n<p><a href=\"https://medium.com/kontikilabs/comparing-machine-learning-ml-services-from-various-cloud-ml-service-providers-63c8a2626cb6\">This post</a> makes a nice comparison of the different cloud ML service providers.</p>\n\n\n\n<p>By analyzing the pricing of those services, we can easily realize many applications and use cases are not worth trying to implement in-house. In those cases, it is more convenient, and probably more accurate, to use off-the-shelf models and ready-to-use services. Moreover, those services don’t require any training data.</p>\n\n\n\n<p>For use cases that are specific to the business domain, you cannot use a pre-built model or service. AutoML services can be used to automate the modeling, feature selection, hyper-parameters tuning, frequent data processing, and deployment. In AutoML, developers can simply specify the training data and labels, in case of supervised learning, and the system automatically creates the final training model and all of the evaluation metrics for you.</p>\n\n\n\n<p>The tasks that follow in the AutoML offering are typically traditional tasks such as:</p>\n\n\n\n<ul><li>Classification</li><li>Regression</li><li>Time-series forecasting</li><li>Recommender Systems</li><li>Anomaly Detection</li><li>Clustering</li></ul>\n\n\n\n<p>Moreover, the pre-built models for generic cognitive tasks can be fine-tuned for the specific domain using custom training data.<br></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"624\" height=\"224\" src=\"https://i0.wp.com/datasciencevademecum.com/wp-content/uploads/2020/04/sCHSYCZxqV5RZHlirsou7Og.png?resize=624%2C224&#038;ssl=1\" alt=\"\" class=\"wp-image-2379\" srcset=\"https://i0.wp.com/datasciencevademecum.com/wp-content/uploads/2020/04/sCHSYCZxqV5RZHlirsou7Og.png?w=624&ssl=1 624w, https://i0.wp.com/datasciencevademecum.com/wp-content/uploads/2020/04/sCHSYCZxqV5RZHlirsou7Og.png?resize=300%2C108&ssl=1 300w\" sizes=\"(max-width: 624px) 100vw, 624px\" data-recalc-dims=\"1\" /></figure>\n\n\n\n<p>Although it may sound as easy as with the off-the-shelf AI services, AutoML requires serious considerations.<br></p>\n\n\n\n<p>Domain-specific tasks require a rigorous scientific process during the feature engineering, modeling, and testing phases. In order to avoid data leakages, we need to carefully analyze the data features and making sure to correctly split the training and testing folds.&nbsp;</p>\n\n\n\n<p>Randomly dividing a data set into train and test data points without considering the time and causality effects is a common mistake. Another hard-to-debug data leakage involves using features that would not be available at inference time or that, if observed, would make the prediction irrelevant (e.g. using “if the user has submitted a delete subscription request” as a feature, in order to predict the churn measured as the non-renewal of the service.)</p>\n\n\n\n<p>The framing of the problem is not always as straightforward as you might think. A binary classifier could be further used for ranking most likely users to buy a product and prioritize them for sales calls. The evaluation of this model should be constrained by operational limitations such as the number of calls each day, regulations preventing it from contacting the same users again before a certain period, and the minimum lapse required for the sale-likelihood prediction, in order to know in advance before the user purchases from a competitor.&nbsp;</p>\n\n\n\n<p>The objective function optimized by an AutoML is not likely to encapsulate those business-specific logics. You can read more about this issue here: <a href=\"https://towardsdatascience.com/automl-is-overhyped-1b5511ded65f\">AutoML is Overhyped</a>.</p>\n\n\n\n<p>Data Scientists will still play an important role in scoping and framing the problem in the machine language and adapting to the offered APIs. However, AutoML will definitely be a helpful tool for automating and optimizing the exploration of the solutions space within the given boundaries.&nbsp;</p>\n\n\n\n<p>&#8212;&#8212;&#8212;-</p>\n\n\n\n<p><em>For curious, AI-focused professionals who want to innovate responsibly, Helixa derives complex human insights through ethical and intentional machine learning. We do this more effectively than anyone else by aggregating multiple data sources, prioritizing consumer privacy, and returning results in seconds. Visit </em><a href=\"http://www.helixa.ai\"><em>www.helixa.ai</em></a><em> to learn more.</em></p>\n<p>The post <a rel=\"nofollow\" href=\"https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/\">Off-the-shelf Models and AutoML</a> appeared first on <a rel=\"nofollow\" href=\"https://datasciencevademecum.com\">Vademecum of Practical Data Science</a>.</p>\n",
  "wfw:commentRss": "https://datasciencevademecum.com/2019/12/16/off-the-shelf-models-and-automl/feed/",
  "slash:comments": 1,
  "post-id": 2340
}