{
  "id": "https://bibleinoneyear.org/en/youth/221",
  "title": "Day 221: Only Holiness Leads to Happiness",
  "description": "Psalm 93:5, 1 Chronicles 28:9a,10–11a,12b,20, 29:6,8a,9,17,19, 1 Corinthians 5:1, 6-13.  Seek to live out a holy life in grateful response to God’s gift, through the imitation of Jesus in the power of the Holy Spirit  Ultimately, only holiness leads to happiness",
  "pubDate": "Tue, 09 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/221/",
  "itunes:duration": "14:19",
  "guid": "enyouth09082022-221",
  "length": 859.9,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 221: Only Holiness Leads to Happiness",
  "itunes:subtitle": "Psalm 93:5, 1 Chronicles 28:9a,10–11a,12b,20, 29:6,8a,9,17,19, 1 Corinthians 5:1, 6-13.  Seek to live out a holy life in grateful response to God’s gift, through the imitation of Jesus in the power of the Holy Spirit  Ultimately, only holiness leads to happiness",
  "itunes:summary": "The media is filled with stories of the rich, the beautiful and the strong. Our culture places these things on a pedestal and many of us aspire to achieve them. There is nothing wrong with these things – but they certainly don’t always lead to happiness.\nThe French philosopher, Blaise Pascal, spoke of three orders of greatness. Riches, beauty and strength fall into his first category of superficial ‘physical greatness’.\nAbove this is a higher, second level of greatness. It is the greatness of genius, science and art. The greatness of the art of Michelangelo or the music of Bach or the brilliance of Albert Einstein – these stand way above superficial physical greatness.\nHowever, according to Pascal there is a third kind of greatness – the order of holiness. (And there is an almost infinite qualitative difference between the second and the third categories.) The fact that a holy person is strong or weak, rich or poor, highly intelligent or illiterate, does not add or subtract anything because that person’s greatness is on a different and almost infinitely superior plane. It is open to every one of us to achieve true greatness in the order of holiness.\nThe word ‘holy’ (hallowed, holiest, holiness) appears over 500 times in the Bible. God is holy. He gives you his Holy Spirit to sanctify you, and you are called to share in his holiness.\nThe word ‘saints’ means ‘holy ones’. In the New Testament it is applied to all Christians. You are ‘called to be holy’ (1 Corinthians 1:2). Holiness is a gift you receive when you put your trust in Jesus, receive his righteousness and the gift of the Holy Spirit. Seek to live out a holy life in grateful response to God’s gift, through the imitation of Jesus in the power of the Holy Spirit. Ultimately, only holiness leads to happiness.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 586
}