{
  "title": "Region Proposal Rectification Towards Robust Instance Segmentation of Biological Images. (arXiv:2203.02846v4 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2203.02846",
  "description": "<p>Top-down instance segmentation framework has shown its superiority in object\ndetection compared to the bottom-up framework. While it is efficient in\naddressing over-segmentation, top-down instance segmentation suffers from\nover-crop problem. However, a complete segmentation mask is crucial for\nbiological image analysis as it delivers important morphological properties\nsuch as shapes and volumes. In this paper, we propose a region proposal\nrectification (RPR) module to address this challenging incomplete segmentation\nproblem. In particular, we offer a progressive ROIAlign module to introduce\nneighbor information into a series of ROIs gradually. The ROI features are fed\ninto an attentive feed-forward network (FFN) for proposal box regression. With\nadditional neighbor information, the proposed RPR module shows significant\nimprovement in correction of region proposal locations and thereby exhibits\nfavorable instance segmentation performances on three biological image datasets\ncompared to state-of-the-art baseline methods. Experimental results demonstrate\nthat the proposed RPR module is effective in both anchor-based and anchor-free\ntop-down instance segmentation approaches, suggesting the proposed method can\nbe applied to general top-down instance segmentation of biological images.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Zhangli_Q/0/1/0/all/0/1\">Qilong Zhangli</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yi_J/0/1/0/all/0/1\">Jingru Yi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Liu_D/0/1/0/all/0/1\">Di Liu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+He_X/0/1/0/all/0/1\">Xiaoxiao He</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xia_Z/0/1/0/all/0/1\">Zhaoyang Xia</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Chang_Q/0/1/0/all/0/1\">Qi Chang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Han_L/0/1/0/all/0/1\">Ligong Han</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gao_Y/0/1/0/all/0/1\">Yunhe Gao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wen_S/0/1/0/all/0/1\">Song Wen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tang_H/0/1/0/all/0/1\">Haiming Tang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_H/0/1/0/all/0/1\">He Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Zhou_M/0/1/0/all/0/1\">Mu Zhou</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Metaxas_D/0/1/0/all/0/1\">Dimitris Metaxas</a>"
}