{
  "title": "The Blockchain Anti-Trust Paradox with Thibault Schrepel",
  "pubDate": "Sat, 23 Jun 2018 18:04:46 +0000",
  "guid": "7b0728b2985c4695baab0307ee782614",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP98Schrepel_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href=\"https://thibaultschrepel.com/en/\" target=\"_blank\" rel=\"noopener\">Thibault Schrepel</a> of the University of Utrecht. We discuss his work on the relationship between blockchain technology, which allows for the decentralization of firms and organizations, and anti-trust law. Here's a quote from <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3193576\" target=\"_blank\" rel=\"noopener\">his article on the topic</a>:</p> <blockquote>But in the end, one question arises as follows: is blockchain the death of antitrust law? Should it be? Answering them today is not easy as blockchain is still prone to drastic evolution, but some initial answers are to be provided nonetheless. In order to do so, this paper proceeds in three parts. The first details how unilateral practices can be implemented on blockchain and further establish a risk map. The second part focuses on the challenges for enforcers and presents a new theory entitled “regulatory infiltration.\" The last part questions the legitimacy of competition law in the face of this technology - the \"blockchain antitrust paradox\" - and the need to decentralize competition authorities.</blockquote> <hr /> <p> </p>",
  "content:encoded": "<p>Today's guest is <a href=\"https://thibaultschrepel.com/en/\" target=\"_blank\" rel=\"noopener\">Thibault Schrepel</a> of the University of Utrecht. We discuss his work on the relationship between blockchain technology, which allows for the decentralization of firms and organizations, and anti-trust law. Here's a quote from <a href= \"https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3193576\" target=\"_blank\" rel=\"noopener\">his article on the topic</a>:</p> But in the end, one question arises as follows: is blockchain the death of antitrust law? Should it be? Answering them today is not easy as blockchain is still prone to drastic evolution, but some initial answers are to be provided nonetheless. In order to do so, this paper proceeds in three parts. The first details how unilateral practices can be implemented on blockchain and further establish a risk map. The second part focuses on the challenges for enforcers and presents a new theory entitled “regulatory infiltration.\" The last part questions the legitimacy of competition law in the face of this technology - the \"blockchain antitrust paradox\" - and the need to decentralize competition authorities.  <p> </p>",
  "enclosure": "",
  "itunes:duration": "42:28",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of the University of Utrecht. We discuss his work on the relationship between blockchain technology, which allows for the decentralization of firms and organizations, and anti-trust law. Here's a quote from : But in the end, one...",
  "itunes:episode": 98,
  "itunes:episodeType": "full"
}