{
  "id": "yt:video:EvknN89JoWo",
  "yt:videoId": "EvknN89JoWo",
  "yt:channelId": "UCHnyfMqiRRG1u-2MsSQLbXA",
  "title": "The Man Who Killed Millions and Saved Billions",
  "link": "",
  "author": {
    "name": "Veritasium",
    "uri": "https://www.youtube.com/channel/UCHnyfMqiRRG1u-2MsSQLbXA"
  },
  "published": "2022-07-22T17:03:09+00:00",
  "updated": "2022-09-08T20:14:32+00:00",
  "media:group": {
    "media:title": "The Man Who Killed Millions and Saved Billions",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Fritz Haber is the scientist who arguably most transformed the world. Part of this video is sponsored by Wren. Offset your carbon footprint on Wren: ​https://www.wren.co/start/veritasium1. For the first 100 people who sign up, I will personally pay for the first month of your subscription!\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nA huge thanks to Dan Charles for writing a fantastic biography of Fritz Haber, for taking the time to talk to us about it, and providing valuable feedback. This video would not be what it is without his contributions. http://site.danielcharles.us https://ve42.co/Charles\n\nThanks to Tom de Prinse from Explosions and Fire for helping us with the chemistry of explosives. If you like explosions and/or fire, you will love his channel. https://www.youtube.com/c/ExplosionsFire2\n\nThanks to Michael Kuiper of CSIRO for the animation of the composition of air - https://www.youtube.com/watch?v=j9JvX58aRfg\n\nSpecial thanks to Sonya Pemberton, Karl Kruszelnicki, Mary Dobbie, Olivia McRae, and the patreon supporters for giving us feedback on the earlier version of this video.\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nReferences:\n\nThe primary reference used is Vaclav Smil’s excellent book, Enriching The Earth – \nSmil, V. (2004). Enriching the earth: Fritz Haber, Carl Bosch, and the transformation of world food production. MIT press. – https://ve42.co/Smil\n\nMastermind: The Rise and Fall of Fritz Haber, the Nobel Laureate Who Launched the Age of Chemical Warfare, by Dan Charles – https://ve42.co/Charles\n\nStoltzenberg, D. (2004). Fritz Haber: Chemist, Nobel Laureate, German, Jew. Chemical Heritage Foundation. – https://ve42.co/Stoltzenberg\n\nPostgate, J. R. (1982). The fundamentals of nitrogen fixation. CUP Archive. – https://ve42.co/postgate\n\nMiles, A. G. (1992). Biological nitrogen fixation. – https://ve42.co/Miles\n\nFriedrich, B., & Hoffmann, D. (2017). Clara Immerwahr: A life in the shadow of Fritz Haber. In One Hundred Years of Chemical Warfare: Research, Deployment, Consequences(pp. 45-67). Springer, Cham. – https://ve42.co/Friedrich2017\n\nDa Silva, G. (2020). What is ammonium nitrate, the chemical that exploded in Beirut. Sci Am, 5. – https://ve42.co/Silva\n\nRodrigues, P., & Micael, J. (2021). The importance of guano birds to the Inca Empire and the first conservation measures implemented by humans. – https://ve42.co/rodrigues\n\nAllison, F. E. (1957). Nitrogen and soil fertility. Soil, the, 85-94. – https://ve42.co/Allison\n\nCrookes, W. (1898). Address of the President before the British Association for the Advancement of Science, Bristol, 1898. Science, 8(200), 561-575. – https://ve42.co/Crookes\n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nSpecial thanks to Patreon supporters: RayJ Johnson, Brian Busbee, Jerome Barakos M.D., Amadeo Bee, Julian Lee, Inconcision, TTST, Balkrishna Heroor, Chris LaClair, Avi Yashchin, John H. Austin, Jr., OnlineBookClub.org, Matthew Gonzalez, Eric Sexton, john kiehl, Diffbot, Gnare, Dave Kircher, Burt Humburg, Blake Byers, Dumky, Evgeny Skvortsov, Meekay, Bill Linder, Paul Peijzel, Josh Hibschman, Timothy O’Brien, Mac Malkawi, Michael Schneider, jim buckmaster, Juan Benet, Ruslan Khroma, Robert Blum, Richard Sundvall, Lee Redden, Vincent, Stephen Wilcox, Marinus Kuivenhoven, Michael Krugman, Cy 'kkm' K'Nelson, Sam Lutfi, Ron Neal \n\n▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀\nWritten by Petr Lebedev, Derek Muller, Felicity Nelson and Kovi Rose\nEdited by Trenton Oliver\nAnimation by Jakub Mistek, Fabio Albertelli, Ivy Tello, Alex Drakoulis, Nils Ramses Kullack, and Charlie Davies\nSFX by Shaun Clifford\nFilmed by Petr Lebedev, Derek Muller and Raquel Nuno\nPhoto of nitrogen deficiency in rice from https://ve42.co/rice\nAdditional video/photos supplied by Getty Images\nMusic from Epidemic Sound: https://ve42.co/music",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}