{
  "guid": "https://podcasts.nationalreview.com/?p=2769",
  "title": "Episode 29: Terry Teachout / The Band",
  "description": "<p>Scot and Jeff talk to Terry Teachout about The Band.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Terry Teachout, drama critic for the <i>Wall Street Journal</i>, author of the plays “Satchmo At The Waldorf” and “Billy And Me,” and author of, among others, <i>The Skeptic: A Life of H.L. Mencken</i> and <i>Duke: A Life of Duke Ellington</i>. Follow Terry on Twitter at <a href=\"https://twitter.com/terryteachout\">@TerryTeachout</a>, check out his excellent books of cultural and musical criticism <a href=\"https://www.amazon.com/Terry-Teachout/e/B001HMWT5E\">here</a>, and read his most recent work for the <i>WSJ</i> <a href=\"https://www.wsj.com/news/author/7840\">here</a>.</p>\n<p><span><b>Terry’s Music Pick: The Band<br />\n</b></span>This week the gang hops on board the mystery train and takes a journey deep into the unknowable heart of America as they discuss The Band, one of the true sui generis phenomena of the rock era. The Band is a rock group that, despite their relatively short (and variable) major-label career, has called forth more profound verbiage from music and cultural critics than most other North American artists save Bob Dylan, so the gang understands that they are walking paths already trodden solidly into shape by others (hello, Greil Marcus!). Nevertheless, attention must be paid: Terry, a child of the ’50s growing up in southeast Missouri, tells the story of growing up in a non-‘rock’ household and suddenly becoming cognizant of the great cultural ferment playing out on the radio and on vinyl. An early ’70s purchase of the original edition of the <i>Rolling Stone Record Guide</i> having piqued his interest, he mail-ordered The Band’s first two albums and nothing was the same after that.</p>\n<p>Terry talks about how, as he went on to become a gigging jazz bassist in his college days and afterwards, he returned to much of the rock he had absorbed earlier to find it trite and ephemeral….but what had not aged for him was The Band’s deeply authentic take on the American tradition. Jeff comes from a much later generation (born in 1980, a tail-end Gen X’er) but feels exactly the same way despite telling a different story, one about being exposed to The Band (simultaneously with Dylan) by his father, who was a Sixties folkie at heart. All agree about how preternaturally uncanny The Band’s skill was at creating music and lyrics that evoked the true, beating heart of the American historical experience — music both current and modern, yet inexplicably timeless — despite the legendary irony that 4/5ths of the group were actually Canadians.</p>\n<p><span><b>From the Hawks to The Basement Tapes: The Pre-History<br />\n</b></span>Jeff argues that few artists have an actual <i>history</i> more compelling than The Band’s <i>pre-history</i>, and Terry agrees. Their story begins as a group that came together piece-by-piece in the early Sixties as the backing ensemble for Ronnie Hawkins (a rockabilly musician from Arkansas who made his name playing in Ontario, Canada, bringing people an authentic sound otherwise unavailable in the Great North). Rick Danko (bass), Richard Manuel (piano), Garth Hudson (organ/keyboards), and Robbie Robertson (guitar) were all from the Toronto area; only Levon Helm (drums) was an American born-and-raised — and, tellingly, a Razorback just like Hawkins. After they struck out on their own as Levon & The Hawks, they recorded a series of singles that made no impression on the charts but came to the attention of one Bob Dylan, who had just decided to shake off the shackles of folk-protest music and was looking for a touring band.</p>\n<p>What happened next is truly the stuff of music legend, and yet the legend is actual history: working as Dylan’s backing band during the moment of his most transcendent cultural importance, they participated in the recordings of the <i>Blonde On Blonde</i> (1966) era, and then went on tour with him as he visited the United Kingdom and played one of the most infamously confrontational series of concerts in the history of modern music. The protest-music lovers and Trotskyists roundly booed Dylan and The Band on a nightly basis for “selling out” to electrified music — “JUDAS!” — even as they were churning out a miasma of sound that still sounds to this day like (to quote Dylan himself) “thin white mercury music.” Levon Helm actually bowed out of the tour, tired of the brickbats he’d received on Dylan’s American gigs and unwilling to play music being denounced as the second coming of the man who sold out Christ. (Adding to the legend of the group, he ducked out of the music business entirely and went to work on an oil rig in Louisiana.)</p>\n<p>The true story of The Band as an independent entity (outside of Levon & The Hawks) really begins after this point, when Dylan crashed out of the music scene in 1967 (nominally in a motorcycle accident, but more accurately in a bid to escape from the pressure of the unanswerable expectations placed upon him) and began recording demos with The Band in the basement of a curiously-colored house in Woodstock, NY. These of course became <i>The Basement Tapes </i>(perhaps the most famous bootleg recording of all time, before they saw an adulterated release in 1975 and a full and proper one in 2015). Jeff talks about how Robbie Robertson must have been influenced by watching Dylan come in, day after day, with traditional ballads, obscure covers, and then finally with new lyrics that were entirely out-of-step with the prevailing psychedelic trends of the time. (The way he set Richard Manuel’s “Tears Of Rage” to a lyrical theme of parents heartbroken by the callousness of an ungrateful daughter is the quintessence of this.)</p>\n<p><span><b>We Can Talk About It Now<br />\n</b></span>At this point the show notes will become briefer and less narrative, simply because The Band’s main-label career begins and all agree that this is music that speaks so eloquently for itself that, outside of our discussion on the podcast, too much further commentary feels pointless. <i>Music From Big Pink</i> (1968) is that rare musical earthquake that still retains its power to shock a half-century later: it felt so natural, so fundamentally <i>real</i> — as Scot says, “people conversing with each other about things that matter” — that it shook the entire pop/rock firmament out of its bloated psychedelic complacency and hastened the dissolution of several major bands (most notably Cream and The Beatles). Jeff singles out “Tears Of Rage” and “We Can Talk,” Scot singles out “The Weight” and “Lonesome Suzie,” and Terry still thrills to “Chest Fever,” but these citations are as beside the point as those for the next few albums will be; you quite simply need to hear and absorb <i>Music From Big Pink</i>, and you are not musically literate unless you have. There are only handful of pop/rock albums that actually ALTERED the shape of the music scene and sent many of its top talents off on a different course. This is one of them.</p>\n<p><span><b>History As Mystery<br />\n</b></span>As great as <i>Music From Big Pink</i> was (and as much of a cultural landmark it was), <i>The Band</i> (1969) is *still* incomprehensible as a follow-up: one of the most perfect albums in the history of popular music. Jeff, Scot, and Terry really want to make clear that this is not casual hyperbole. This is not fannish enthusiasm (Scot in fact thinks that <i>The Band</i> is TOO good, because it overshadows everything else they subsequently did). What the gang discusses during this segment is one of the finest albums ever recorded, a magical document of the reality and myth and mystery of the American experience, effortlessly running north to south, east to west, from post-bellum Virginia to the midwestern Grange to storm-battered Cleveland to Lake Charles, LA. Listen to Terry, Scot and Jeff discuss the individual songs — “Rockin’ Chair,” “The Night They Drove Old Dixie Down,” “When You Awake,” “King Harvest,” etc. — but most of all please listen to this album. It is as if magical spell is being worked upon you.</p>\n<p>N.B. Jeff and Terry both agree that Joan Baez’s (more well-known, hit single) version of “The Night They Drove Old Dixie Down” is on the shortlist of the Most Benightedly Awful Covers Of All Time.</p>\n<p><span><b>See The Band with the Stage Fright<br />\n</b></span><b></b><i>Stage Fright</i> (1970) is the moment where most people commonly signal the downfall of The Band after their alchemical glory of 1966-1969), but Terry insists that this is one of his favorites. John Simon is missed as producer, yes, but Terry especially singles out “Daniel And The Sacred Harp” as a powerful allegory. Jeff agrees that the darkness of <i>Stage Fright</i> is immediately obvious (drug problems, Richard Manuel’s psychological recession from the core of the band, particularly as a songwriter), and frankly dislikes the entire first half of the record. Robbie Robertson (then asserting himself as the group’s sole songwriter, filling the gap left by Manuel and Danko) even wrote a song about Manuel’s state of mind: “The Shape I’m In.” But Jeff emphasizes that the album’s title track is among their greatest songs, and that “The Rumor” is the beautiful sound of the curtain falling on The Band’s era greatness.</p>\n<p><span><b>The Wilderness<br />\n</b></span><b></b>The Band’s fourth album <i>Cahoots</i> (1971) is almost universally panned by critics, but Jeff ruefully admits that he doesn’t it dislike as much as he’s supposed to. And Scot and Terry agree, at least insofar as “Life Is A Carnival” (with its horn arrangements) and “4% Pantomime” (with its prime-era Van Morrison) is concerned. Furthermore, “When I Paint My Masterpiece” (with Levon on lead vox) may actually be their best Bob Dylan cover. That said, it cannot be denied that the rest of this album is almost appallingly generic…not bad, per se, but generic. Scot speaks up in favor of “Smoke Signal” and Terry wants to single out “The River Hymn” as well but, as Terry says, this is the undeniable point where The Band (in his words) “goes out of focus.”</p>\n<p>This was clearly evident than in their next release, <i>Moondog Matinee</i> (1973), an album of “classic covers.” It has long been Jeff’s personal thesis than unless your name is Bryan Ferry, the recording of a “covers album” is an admission of creative exhaustion (see: Bowie, Costello, etc.), but what is most depressing about <i>Moondog Matinee</i> is the fact that The Band should have actually nailed this kind of foray: who better to delve into the deep taproot of American rock culture than a group seemingly to the manor born? And yet so many of these covers are merely passable. The one exception, as Terry is at great pains to stipulate, is their version of “Mystery Train,” the classic ’50s rocker about the inarticulable loss of death (first made famous by Elvis, with a hundred subsequent takes to follow). Terry argues that, at least on this one song, The Band <i>knew</i> they had come up with something special, not only in terms of arrangement but in terms of performance and singing. And Terry is right.</p>\n<p>At a loss for inspiration during this period, The Band fell back upon something comforting and familiar: working with Bob Dylan and supporting him as his backing band. A proper discussion of Dylan’s <i>Planet Wave</i> (1973) and the subsequent tour album <i>Before The Flood</i> (1974) will have to wait until Political Beats’ inevitable Dylan episode, but for the present moment the gang agrees that Robbie, Rick, Richard, Garth and Levon provide stunningly sympathetic accompaniment to Bob on the record, no more obviously so than on its most famous song “Forever Young.”</p>\n<p><span><b>Northern Lights/Last Waltz<br />\n</b></span><b></b>The story of The Band would look like an obvious tale of a long apprenticeship followed by an early transcendent peak and a quick flameout were it not for <i>Northern Lights — Southern Cross</i> (1975), their late-period comeback record which is arguably as good as anything they did after <i>The Band.</i> Jeff isn’t quite willing to go that far, but he does note that it’s not just the critically-acclaimed songs on here (“It Makes No Difference,” “Ophelia”) that are worthwhile, it’s also less heralded moments like the vaguely progressive “Jupiter Hollow.” Terry, drama critic that he is, compares <i>Northern Lights</i> to late period Edward Albee: he seemed dried-up after <i>Who’s Afraid Of Virginia Woolf?</i> and then, after years of deplorable playwriting, returned to form with <i>Three Tall Women. </i>So too did The Band here, and Scot agrees, saying that even on nominal trifles like “Ring Your Bell” they sound like they’re returning to the headspace of the early records.</p>\n<p>The gang dispenses quickly with <i>Islands</i> (1976) a contractually-required record which feels likes the odds-‘n’-sods outtakes release that it is, but inevitably must spend time on <i>The Last Waltz, </i>the 1977 biopic/soundtrack that nominally was meant to herald The Band’s end as a touring act, but (rather obviously, if you’ve seen the film) also ended up heralding the end of The Band. The gang gives it a surprisingly mixed review given its critical reputation — the sort of ambivalent review that could only come from serious fans of The Band’s music and lyrics, as opposed to their reified ‘Hollywood’ myth — but all happily admit that some of these Last-Concert-Ever performances really are among the finest of their career…in particular, Levon drumming and singing his heart out on “The Night They Drove Old Dixie Down.”<b></b></p>\n<p><span><b>Finale<br />\n</b></span><b></b>Terry, Scot and Jeff each name their two key albums and five key songs by The Band.</p>\n",
  "pubDate": "Mon, 2 Apr 2018 13:02:36 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Terry Teachout about The Band.</p>\n<p><span><b>Introducing the Band<br />\n</b></span>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Terry Teachout, drama critic for the <i>Wall Street Journal</i>, author of the plays “Satchmo At The Waldorf” and “Billy And Me,” and author of, among others, <i>The Skeptic: A Life of H.L. Mencken</i> and <i>Duke: A Life of Duke Ellington</i>. Follow Terry on Twitter at <a href=\"https://twitter.com/terryteachout\">@TerryTeachout</a>, check out his excellent books of cultural and musical criticism <a href=\"https://www.amazon.com/Terry-Teachout/e/B001HMWT5E\">here</a>, and read his most recent work for the <i>WSJ</i> <a href=\"https://www.wsj.com/news/author/7840\">here</a>.</p>\n<p><span><b>Terry’s Music Pick: The Band<br />\n</b></span>This week the gang hops on board the mystery train and takes a journey deep into the unknowable heart of America as they discuss The Band, one of the true sui generis phenomena of the rock era. The Band is a rock group that, despite their relatively short (and variable) major-label career, has called forth more profound verbiage from music and cultural critics than most other North American artists save Bob Dylan, so the gang understands that they are walking paths already trodden solidly into shape by others (hello, Greil Marcus!). Nevertheless, attention must be paid: Terry, a child of the ’50s growing up in southeast Missouri, tells the story of growing up in a non-‘rock’ household and suddenly becoming cognizant of the great cultural ferment playing out on the radio and on vinyl. An early ’70s purchase of the original edition of the <i>Rolling Stone Record Guide</i> having piqued his interest, he mail-ordered The Band’s first two albums and nothing was the same after that.</p>\n<p>Terry talks about how, as he went on to become a gigging jazz bassist in his college days and afterwards, he returned to much of the rock he had absorbed earlier to find it trite and ephemeral….but what had not aged for him was The Band’s deeply authentic take on the American tradition. Jeff comes from a much later generation (born in 1980, a tail-end Gen X’er) but feels exactly the same way despite telling a different story, one about being exposed to The Band (simultaneously with Dylan) by his father, who was a Sixties folkie at heart. All agree about how preternaturally uncanny The Band’s skill was at creating music and lyrics that evoked the true, beating heart of the American historical experience — music both current and modern, yet inexplicably timeless — despite the legendary irony that 4/5ths of the group were actually Canadians.</p>\n<p><span><b>From the Hawks to The Basement Tapes: The Pre-History<br />\n</b></span>Jeff argues that few artists have an actual <i>history</i> more compelling than The Band’s <i>pre-history</i>, and Terry agrees. Their story begins as a group that came together piece-by-piece in the early Sixties as the backing ensemble for Ronnie Hawkins (a rockabilly musician from Arkansas who made his name playing in Ontario, Canada, bringing people an authentic sound otherwise unavailable in the Great North). Rick Danko (bass), Richard Manuel (piano), Garth Hudson (organ/keyboards), and Robbie Robertson (guitar) were all from the Toronto area; only Levon Helm (drums) was an American born-and-raised — and, tellingly, a Razorback just like Hawkins. After they struck out on their own as Levon & The Hawks, they recorded a series of singles that made no impression on the charts but came to the attention of one Bob Dylan, who had just decided to shake off the shackles of folk-protest music and was looking for a touring band.</p>\n<p>What happened next is truly the stuff of music legend, and yet the legend is actual history: working as Dylan’s backing band during the moment of his most transcendent cultural importance, they participated in the recordings of the <i>Blonde On Blonde</i> (1966) era, and then went on tour with him as he visited the United Kingdom and played one of the most infamously confrontational series of concerts in the history of modern music. The protest-music lovers and Trotskyists roundly booed Dylan and The Band on a nightly basis for “selling out” to electrified music — “JUDAS!” — even as they were churning out a miasma of sound that still sounds to this day like (to quote Dylan himself) “thin white mercury music.” Levon Helm actually bowed out of the tour, tired of the brickbats he’d received on Dylan’s American gigs and unwilling to play music being denounced as the second coming of the man who sold out Christ. (Adding to the legend of the group, he ducked out of the music business entirely and went to work on an oil rig in Louisiana.)</p>\n<p>The true story of The Band as an independent entity (outside of Levon & The Hawks) really begins after this point, when Dylan crashed out of the music scene in 1967 (nominally in a motorcycle accident, but more accurately in a bid to escape from the pressure of the unanswerable expectations placed upon him) and began recording demos with The Band in the basement of a curiously-colored house in Woodstock, NY. These of course became <i>The Basement Tapes </i>(perhaps the most famous bootleg recording of all time, before they saw an adulterated release in 1975 and a full and proper one in 2015). Jeff talks about how Robbie Robertson must have been influenced by watching Dylan come in, day after day, with traditional ballads, obscure covers, and then finally with new lyrics that were entirely out-of-step with the prevailing psychedelic trends of the time. (The way he set Richard Manuel’s “Tears Of Rage” to a lyrical theme of parents heartbroken by the callousness of an ungrateful daughter is the quintessence of this.)</p>\n<p><span><b>We Can Talk About It Now<br />\n</b></span>At this point the show notes will become briefer and less narrative, simply because The Band’s main-label career begins and all agree that this is music that speaks so eloquently for itself that, outside of our discussion on the podcast, too much further commentary feels pointless. <i>Music From Big Pink</i> (1968) is that rare musical earthquake that still retains its power to shock a half-century later: it felt so natural, so fundamentally <i>real</i> — as Scot says, “people conversing with each other about things that matter” — that it shook the entire pop/rock firmament out of its bloated psychedelic complacency and hastened the dissolution of several major bands (most notably Cream and The Beatles). Jeff singles out “Tears Of Rage” and “We Can Talk,” Scot singles out “The Weight” and “Lonesome Suzie,” and Terry still thrills to “Chest Fever,” but these citations are as beside the point as those for the next few albums will be; you quite simply need to hear and absorb <i>Music From Big Pink</i>, and you are not musically literate unless you have. There are only handful of pop/rock albums that actually ALTERED the shape of the music scene and sent many of its top talents off on a different course. This is one of them.</p>\n<p><span><b>History As Mystery<br />\n</b></span>As great as <i>Music From Big Pink</i> was (and as much of a cultural landmark it was), <i>The Band</i> (1969) is *still* incomprehensible as a follow-up: one of the most perfect albums in the history of popular music. Jeff, Scot, and Terry really want to make clear that this is not casual hyperbole. This is not fannish enthusiasm (Scot in fact thinks that <i>The Band</i> is TOO good, because it overshadows everything else they subsequently did). What the gang discusses during this segment is one of the finest albums ever recorded, a magical document of the reality and myth and mystery of the American experience, effortlessly running north to south, east to west, from post-bellum Virginia to the midwestern Grange to storm-battered Cleveland to Lake Charles, LA. Listen to Terry, Scot and Jeff discuss the individual songs — “Rockin’ Chair,” “The Night They Drove Old Dixie Down,” “When You Awake,” “King Harvest,” etc. — but most of all please listen to this album. It is as if magical spell is being worked upon you.</p>\n<p>N.B. Jeff and Terry both agree that Joan Baez’s (more well-known, hit single) version of “The Night They Drove Old Dixie Down” is on the shortlist of the Most Benightedly Awful Covers Of All Time.</p>\n<p><span><b>See The Band with the Stage Fright<br />\n</b></span><b></b><i>Stage Fright</i> (1970) is the moment where most people commonly signal the downfall of The Band after their alchemical glory of 1966-1969), but Terry insists that this is one of his favorites. John Simon is missed as producer, yes, but Terry especially singles out “Daniel And The Sacred Harp” as a powerful allegory. Jeff agrees that the darkness of <i>Stage Fright</i> is immediately obvious (drug problems, Richard Manuel’s psychological recession from the core of the band, particularly as a songwriter), and frankly dislikes the entire first half of the record. Robbie Robertson (then asserting himself as the group’s sole songwriter, filling the gap left by Manuel and Danko) even wrote a song about Manuel’s state of mind: “The Shape I’m In.” But Jeff emphasizes that the album’s title track is among their greatest songs, and that “The Rumor” is the beautiful sound of the curtain falling on The Band’s era greatness.</p>\n<p><span><b>The Wilderness<br />\n</b></span><b></b>The Band’s fourth album <i>Cahoots</i> (1971) is almost universally panned by critics, but Jeff ruefully admits that he doesn’t it dislike as much as he’s supposed to. And Scot and Terry agree, at least insofar as “Life Is A Carnival” (with its horn arrangements) and “4% Pantomime” (with its prime-era Van Morrison) is concerned. Furthermore, “When I Paint My Masterpiece” (with Levon on lead vox) may actually be their best Bob Dylan cover. That said, it cannot be denied that the rest of this album is almost appallingly generic…not bad, per se, but generic. Scot speaks up in favor of “Smoke Signal” and Terry wants to single out “The River Hymn” as well but, as Terry says, this is the undeniable point where The Band (in his words) “goes out of focus.”</p>\n<p>This was clearly evident than in their next release, <i>Moondog Matinee</i> (1973), an album of “classic covers.” It has long been Jeff’s personal thesis than unless your name is Bryan Ferry, the recording of a “covers album” is an admission of creative exhaustion (see: Bowie, Costello, etc.), but what is most depressing about <i>Moondog Matinee</i> is the fact that The Band should have actually nailed this kind of foray: who better to delve into the deep taproot of American rock culture than a group seemingly to the manor born? And yet so many of these covers are merely passable. The one exception, as Terry is at great pains to stipulate, is their version of “Mystery Train,” the classic ’50s rocker about the inarticulable loss of death (first made famous by Elvis, with a hundred subsequent takes to follow). Terry argues that, at least on this one song, The Band <i>knew</i> they had come up with something special, not only in terms of arrangement but in terms of performance and singing. And Terry is right.</p>\n<p>At a loss for inspiration during this period, The Band fell back upon something comforting and familiar: working with Bob Dylan and supporting him as his backing band. A proper discussion of Dylan’s <i>Planet Wave</i> (1973) and the subsequent tour album <i>Before The Flood</i> (1974) will have to wait until Political Beats’ inevitable Dylan episode, but for the present moment the gang agrees that Robbie, Rick, Richard, Garth and Levon provide stunningly sympathetic accompaniment to Bob on the record, no more obviously so than on its most famous song “Forever Young.”</p>\n<p><span><b>Northern Lights/Last Waltz<br />\n</b></span><b></b>The story of The Band would look like an obvious tale of a long apprenticeship followed by an early transcendent peak and a quick flameout were it not for <i>Northern Lights — Southern Cross</i> (1975), their late-period comeback record which is arguably as good as anything they did after <i>The Band.</i> Jeff isn’t quite willing to go that far, but he does note that it’s not just the critically-acclaimed songs on here (“It Makes No Difference,” “Ophelia”) that are worthwhile, it’s also less heralded moments like the vaguely progressive “Jupiter Hollow.” Terry, drama critic that he is, compares <i>Northern Lights</i> to late period Edward Albee: he seemed dried-up after <i>Who’s Afraid Of Virginia Woolf?</i> and then, after years of deplorable playwriting, returned to form with <i>Three Tall Women. </i>So too did The Band here, and Scot agrees, saying that even on nominal trifles like “Ring Your Bell” they sound like they’re returning to the headspace of the early records.</p>\n<p>The gang dispenses quickly with <i>Islands</i> (1976) a contractually-required record which feels likes the odds-‘n’-sods outtakes release that it is, but inevitably must spend time on <i>The Last Waltz, </i>the 1977 biopic/soundtrack that nominally was meant to herald The Band’s end as a touring act, but (rather obviously, if you’ve seen the film) also ended up heralding the end of The Band. The gang gives it a surprisingly mixed review given its critical reputation — the sort of ambivalent review that could only come from serious fans of The Band’s music and lyrics, as opposed to their reified ‘Hollywood’ myth — but all happily admit that some of these Last-Concert-Ever performances really are among the finest of their career…in particular, Levon drumming and singing his heart out on “The Night They Drove Old Dixie Down.”<b></b></p>\n<p><span><b>Finale<br />\n</b></span><b></b>Terry, Scot and Jeff each name their two key albums and five key songs by The Band.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 29: Terry Teachout / The Band",
  "itunes:author": "National Review",
  "itunes:duration": "02:37:55",
  "itunes:summary": "Scot and Jeff talk to Terry Teachout about The Band.",
  "itunes:subtitle": "Scot and Jeff talk to Terry Teachout about The Band.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 29
}