{
  "id": "https://bibleinoneyear.org/en/youth/128",
  "title": "Day 128: How to Live in High Definition",
  "description": "Proverbs 11:19,25,28, Judges 7:15,23,28, John 5:39–40, 44.  The other word ‘zoe’ means the full, abundant, spacious, open-hearted, richness of life that Jesus speaks about – a life of fulfilment and purpose  This is life in high definition",
  "pubDate": "Sun, 08 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/128/",
  "itunes:duration": "12:46",
  "guid": "enyouth08052022-128",
  "length": 766.04,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 128: How to Live in High Definition",
  "itunes:subtitle": "Proverbs 11:19,25,28, Judges 7:15,23,28, John 5:39–40, 44.  The other word ‘zoe’ means the full, abundant, spacious, open-hearted, richness of life that Jesus speaks about – a life of fulfilment and purpose  This is life in high definition",
  "itunes:summary": "It was back in 1966 when England last won the football World Cup, yet I can still remember the moment. As children, we were watching the match on a black and white television set. We could never get a very good picture; it was always fuzzy and going into lines. We were quite happy with it since we did not know anything different. One day, we discovered all it needed was an aerial! Suddenly, we found that we could get clear and distinct pictures. Our enjoyment was transformed.\nNow, not only do we have colour television, we can get high definition (HD). There are no fuzzy lines or distortions, and it produces a richer, bolder and more vibrant picture than ever before.\nRather than black and white, or even colour, Jesus offers you high-definition life. There are two Greek words for ‘life’. The word ‘bios’, from which we get the word ‘biological’ means the condition of being alive rather than dead – mere existence. The other word ‘zoe’ means the full, abundant, spacious, open-hearted, richness of life that Jesus speaks about – a life of fulfilment and purpose. This is life in high definition.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 493
}