{
  "title": "Computing with Infinite Objects: the Gray Code Case. (arXiv:2105.14261v2 [cs.LO] UPDATED)",
  "link": "http://arxiv.org/abs/2105.14261",
  "description": "<p>Infinite Gray code has been introduced by Tsuiki as a redundancy-free\nrepresentation of the reals. In applications the signed digit representation is\nmostly used which has maximal redundancy. Tsuiki presented a functional program\nconverting signed digit code into infinite Gray code. Moreover, he showed that\ninfinite Gray code can effectively be converted into signed digit code, but the\nprogram needs to have some non-deterministic features (see also H. Tsuiki, K.\nSugihara, \"Streams with a bottom in functional languages\"). Berger and Tsuiki\nreproved the result in a system of formal first-order intuitionistic logic\nextended by inductive and co-inductive definitions, as well as some new logical\nconnectives capturing concurrent behaviour. The programs extracted from the\nproofs are exactly the ones given by Tsuiki. In order to do so, co-inductive\npredicates $\\bS$ and $\\bG$ are defined and the inclusion $\\bS \\subseteq \\bG$ is\nderived. For the converse inclusion the new logical connectives are used to\nintroduce a concurrent version $\\S_{2}$ of $S$ and $\\bG \\subseteq \\bS_{2}$ is\nshown. What one is looking for, however, is an equivalence proof of the\ninvolved concepts. One of the main aims of the present paper is to close the\ngap. A concurrent version $\\bG^{*}$ of $\\bG$ and a modification $\\bS^{*}$ of\n$\\bS_{2}$ are presented such that $\\bS^{*} = \\bG^{*}$. A crucial tool in U.\nBerger, H. Tsuiki, \"Intuitionistic fixed point logic\" is a formulation of the\nArchimedean property of the real numbers as an induction principle. We\nintroduce a concurrent version of this principle which allows us to prove that\n$\\bS^{*}$ and $\\bG^{*}$ coincide. A further central contribution is the\nextension of the above results to the hyperspace of non-empty compact subsets\nof the reals.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Spreen_D/0/1/0/all/0/1\">Dieter Spreen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Berger_U/0/1/0/all/0/1\">Ulrich Berger</a>"
}