{
  "title": "An update to storage policies across your Google Account",
  "link": "https://blog.google/products/photos/storage-policy-update/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Over the past decade, Gmail, Google Drive and Google Photos have helped billions of people securely store and manage their emails, documents, photos, videos and more. Today, people are uploading more content than ever before—in fact, more than 4.3 million GB are added across Gmail, Drive and Photos every day. </p><p>To continue providing everyone with a great storage experience and to keep pace with the growing demand, we're announcing important upcoming storage changes to your <a href=\"https://myaccount.google.com/\">Google Account</a>. These changes will apply to Photos and Drive (specifically Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files) and will enable us to continue investing in these products for the future. We're also introducing new policies for consumer Google Accounts that are either inactive or over their storage limit across Gmail, Drive (including Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files) and Photos, to bring our policies more in line with industry standards. </p><p>These storage policy changes won’t take effect until June 1, 2021. However, we wanted to let you know well in advance and give you the resources to navigate these changes. Google Workspace subscribers, and G Suite for Education and G Suite for Nonprofits customers should refer to our <a href=\"http://workspaceupdates.googleblog.com/2020/11/changes-to-google-workspace-storage.html\">Google Workspace Updates post</a> to understand how these changes may affect them.</p><p>As always, every Google Account will continue to come with 15 GB of free storage across Gmail, Drive and Photos, which we estimate should last the majority of our users several years.  Because the content you store with these apps is primarily personal, it’s <a href=\"https://blog.google/technology/safety-security/keeping-private-information-private/\">not used</a> for advertising purposes. We’ll also continue to give you visibility and <a href=\"https://one.google.com/storage/management?utm_source=blog&amp;utm_medium=web&amp;utm_campaign=NME&amp;utm_content=storage_manager\">control over your storage</a>, and <a href=\"https://one.google.com/storage/management?utm_source=blog&amp;utm_medium=web&amp;utm_campaign=iop\">provide tools</a> to help you easily manage it. </p><p><br/></p><h3>New content that will count toward your Google Account storage</h3>Beginning June 1, any <b>new</b> photo or video uploaded in <a href=\"https://support.google.com/photos/answer/6220791\">High quality</a> in Google Photos will count toward your free 15 GB storage quota or any additional storage you’ve purchased as a <a href=\"http://one.google.com\">Google One</a> member. To make this transition easier, we’ll exempt all High quality photos and videos you back up before June 1. This includes all of the High quality photos and videos you currently store with Google Photos. Most people who back up in High quality should have years before they need to take action—in fact, we estimate that 80 percent of you should have at least three years before you reach 15 GB. You can learn more about this change in our <a href=\"https://blog.google/products/photos/storage-changes/\">Google Photos post</a>.</div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image__is-caption h-c-grid__col-l--4 h-c-grid__col--6 h-c-grid__col-l--offset-4 h-c-grid__col--offset-3\"><a class=\"article-image--link\"><img alt=\"All existing High quality photos and videos won't count towards your storage\" class=\"article-image--medium\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/ExemptContent_1_n5L7q1T.gif \" tabindex=\"0\"/></a></div><figcaption class=\"article-image__caption article-image__is-caption-image h-c-grid__col--8 h-c-grid__col--offset-2 h-c-grid__col-l--6 h-c-grid__col-l--offset-3\"><div class=\"rich-text\"><p><br/></p></div></figcaption></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Also starting June 1, any <b>new</b> Docs, Sheets, Slides, Drawings, Forms or Jamboard file will begin counting toward your free 15 GB of allotted storage or any additional storage provided through <a href=\"https://one.google.com/?utm_source=g1&amp;utm_medium=blog&amp;utm_campaign=iop\">Google One</a>. Existing files within these products will not count toward storage, unless they’re modified on or after June 1. You can learn more in our <a href=\"https://support.google.com/googleone/answer/9312312\">Help Center</a>.</p><br/><h3>A new policy for accounts that are inactive or over storage limit</h3><p>We’re introducing new policies for consumer accounts that are either inactive or over their storage limit across Gmail, Drive (including Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files) and/or Photos to better align with common practices across the industry. After June 1: </p><p></p><ul><li>If you're inactive in one or more of these services for two years (24 months), Google may delete the content in the product(s) in which you're inactive. </li><li>Similarly, if you're over your storage limit for two years, Google may delete your content across Gmail, Drive and Photos.</li></ul><p></p><p>We will notify you multiple times before we attempt to remove any content so you have ample opportunities to take action. The simplest way to keep your account active is to periodically visit Gmail, Drive or Photos on the web or mobile, while signed in and connected to the internet. </p><p>The <a href=\"https://support.google.com/accounts/answer/3036546?hl=en\">Inactive Account Manager</a> can help you manage specific content and notify a trusted contact if you stop using your Google Account for a certain period of time (between 3-18 months). Note that the new two year inactive policy will apply regardless of your Inactive Account Manager settings. </p><p>You can learn more about these changes in our <a href=\"https://support.google.com/googleone/answer/9312312#activity\">Help Center</a>. </p><br/><h3>How to manage your storage</h3>To help you manage your Google Account storage, anyone can use the free storage manager in the <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.subscriptions.red&amp;referrer=utm_source%3Dblog%26utm_medium%3Dweb%26utm_campaign%3Diop\">Google One app</a> and <a href=\"https://one.google.com/storage/management?utm_source=blog&amp;utm_medium=web&amp;utm_campaign=iop\">on the web</a>, which gives you an easy way to see how you’re using your storage across Gmail, Drive and Photos. You can keep the files you want, delete the ones you no longer need and make room for more—all in one place.</div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col-l--2 h-c-grid__col--4 h-c-grid__col-l--offset-5 h-c-grid__col--offset-4\"><a class=\"article-image--link\"><img alt=\"Manage Google Account Storage with free Google One tool\" class=\"article-image--small\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/G1_Storage_Blog_20fps.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>If you need more than your free 15 GB of storage, you can upgrade to a larger storage plan with <a href=\"https://one.google.com/?utm_source=g1&amp;utm_medium=blog&amp;utm_campaign=iop\">Google One</a>. You can choose from plans starting at 100 GB of space that also include additional member features like access to Google experts, shared family plans and more.</p><p>In addition to helping us meet the growing demand for storage, these changes align our storage policies across products. As always, we remain committed to providing you a great experience and hope to continue to serve you in the future. You can learn more about this change in our <a href=\"https://support.google.com/googleone/answer/9312312\">Help Center</a>. </p></div></div></body></html>",
  "pubDate": "Wed, 11 Nov 2020 18:00:00 +0000",
  "guid": "https://blog.google/products/photos/storage-policy-update/",
  "category": [
    "Drive",
    "Photos",
    "Gmail"
  ],
  "og": {
    "type": "article",
    "title": "An update to storage policies across your Google Account",
    "description": "",
    "site_name": "Google",
    "url": "https://blog.google/products/photos/storage-policy-update/"
  },
  "author": [
    {
      "name": "Jose Pastor",
      "title": "Vice President, Google Workspace",
      "department": "",
      "company": ""
    },
    {
      "name": "Shimrit Ben-Yair",
      "title": "Vice President, Google Photos",
      "department": "",
      "company": ""
    }
  ]
}