{
  "title": "New Research Shows the Importance of Family Environment on Upward Mobility",
  "link": "https://www.aei.org/poverty-studies/new-research-shows-the-importance-of-family-environment-on-upward-mobility/",
  "dc:creator": "George Pierson",
  "pubDate": "Thu, 03 Nov 2022 19:47:22 +0000",
  "category": [
    "Poverty Studies",
    "child poverty",
    "low-income",
    "Poverty"
  ],
  "guid": "https://www.aei.org/?p=1008664708",
  "description": "<p>In the midst of a robust debate on child poverty, policymakers should focus on improving the family environment instead of expensive income transfer programs that likely have limited effects on long-term upward mobility.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/poverty-studies/new-research-shows-the-importance-of-family-environment-on-upward-mobility/\">New Research Shows the Importance of Family Environment on Upward Mobility</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>Over the past several years, there has been a robust debate over the best way to reduce child poverty in the US. One <a href=\"https://www.washingtonpost.com/opinions/2022/01/29/giving-up-expanding-child-tax-credit-would-be-disaster-poor-people/\" target=\"_blank\" rel=\"noreferrer noopener\">point of view</a> believes that poverty is fundamentally a problem of limited income; therefore, the <a href=\"https://www.washingtonpost.com/us-policy/2022/02/17/child-tax-credit-poverty/\" target=\"_blank\" rel=\"noreferrer noopener\">best way</a> to reduce poverty is to redistribute income through government programs. The other point of view suggests that, while limited income is certainly a defining feature, poverty is the product of other problems, such as inadequate education, family structure, and detachment from the labor force.</p>\n\n\n\n<p>The first view—that poverty merely reflects limited income—was the argument behind the <a href=\"https://www.whitehouse.gov/build-back-better/\" target=\"_blank\" rel=\"noreferrer noopener\">plan</a> from President Joe Biden and congressional Democrats to expand the child tax credit, first as temporary pandemic relief in 2021 (which they successfully passed) and then permanently (which they did not pass). Under the Democrats’ plan, most families no matter their income tax liability would have received up to $300 per month for each child in the household under 18—meaning that a nonworking family with two young children would have received $7,200 from the federal government each year.</p>\n\n\n\n<p>As policies go, the idea of sending poor families money from the federal government is relatively simple. And at least on paper, it would reduce poverty rates in the short term. But because this approach assumes poverty is solely a shortage of income, it also absolves policymakers of the responsibility to create policies that allow American households to thrive. If they can “solve” poverty by redistributing just enough money to push those at the bottom above the poverty line, then policymakers can focus less on the problems that cause poverty in the first place.</p>\n\n\n\n<p>An alternative view believes that families have a better chance to escape poverty over the long term when government policies address the underlying factors linked to poverty. In this view, the focus is not only on the short term—fewer people below the poverty line today—but also on the long term—more families and children equipped with the skills and resources necessary to flourish.</p>\n\n\n\n<p>A new NBER <a href=\"https://www.nber.org/papers/w30610\" target=\"_blank\" rel=\"noreferrer noopener\">working paper</a> by Jorge Luis García and James Heckman expands on this point of view and offers policymakers who are interested in supporting upward mobility a useful framework. Relying on their research of the Perry Preschool and <a href=\"https://abc.fpg.unc.edu/\" target=\"_blank\" rel=\"noreferrer noopener\">The Carolina Abecedarian Project</a>, they showed that the quality of the family environment (specifically, parent-child interactions) during childhood was among the most important drivers of long-term positive outcomes for children, including higher incomes, more marriage, and increased stability over the life cycle.</p>\n\n\n\n<p>While this contribution is important on its own, they also offered skepticism of policies that focus on income alone. They wrote:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Income has many competing uses. Enhancing it likely has smaller impacts on child development than equally expensive interventions that target specific aspects of child development (Del Boca et al., 2014).</p></blockquote>\n\n\n\n<p>Moreover, they criticized the current policymaking approach, which they described as promoting “off the shelf” programs at the expense of understanding the precise mechanisms that lead to success.</p>\n\n\n\n<p>Because their research found that improved family environment was crucial to explaining the long-term success of the Perry Preschool and Abecedarian Project, they appeared unconvinced that preschool programs (without a focus on parent-child interactions) would achieve desired results. Instead, they argued that policies should help to create enriching home environments for disadvantaged children:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The traditional literature focuses on credentials of program staff and curricula and overlooks the role of the family in bolstering child development. Previous research links the impacts of Perry and ABC on skills to its impacts on long-term outcomes (e.g., education, labor income, and crime; Heckman et al., 2013). Our evidence on the impact of these programs on parenting and parental investment gives a better understanding of the mechanisms underlying program success. It provides evidence of the connection between home environments and skill formation.</p></blockquote>\n\n\n\n<p>García and Heckman further showed that programs that similarly enhanced the parent-child relationship had equally impressive outcomes at much less cost. Aspects of these programs involved trained professionals teaching parents about child development and showing them positive ways to interact with their child. García and Heckman argued that focusing on the home environment could substantially improve upward mobility for low-income children—something that few <a href=\"https://www.nber.org/system/files/working_papers/w30373/w30373.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">government programs</a> and policies have been able to show. For example, García, Heckman, and Ronda (2021) <a href=\"https://www.nber.org/system/files/working_papers/w29057/w29057.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">found</a> that Perry Preschool participants earned almost $10,000 more <em>per year</em> as adults than control group members, substantially more than the long-term gains from <a href=\"https://www.nber.org/system/files/working_papers/w30373/w30373.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">receiving the EITC</a> as a child.</p>\n\n\n\n<p>The insights from García and Heckman offer a framework that should be useful to policymakers. Instead of expensive income transfer programs that likely have limited effects on long-term upward mobility, policymakers should focus on improving the family environment.</p>\n\n\n\n<div class=\"related-items shortcode \"><p><strong>Learn more: </strong><a href=\"https://www.aei.org/poverty-studies/brett-favre-welfare-fraud-and-the-tanf-block-grant/\">Brett Favre, Welfare Fraud, and the TANF Block Grant</a> | <a href=\"https://www.aei.org/poverty-studies/conservative-policies-have-driven-child-poverty-declines/\">Conservative Policies Have Driven Child Poverty Declines</a> | <a href=\"https://www.aei.org/op-eds/will-the-white-house-take-the-diet-crisis-seriously/\">Will the White House Take the Diet Crisis Seriously?</a> | <a href=\"https://www.aei.org/poverty-studies/does-more-federal-assistance-lead-to-less-food-insecurity/\">Does More Federal Assistance Lead to Less Food Insecurity?</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/poverty-studies/new-research-shows-the-importance-of-family-environment-on-upward-mobility/\">New Research Shows the Importance of Family Environment on Upward Mobility</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}