{
  "title": "This Car Charger Bot Will Also Hold Your Spot",
  "link": "https://spectrum.ieee.org/mobile-ev-charging-robot",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-mobile-wheeled-robot-plugged-into-a-car-in-a-parking-garage.jpg?id=30178517&width=1245&height=700&coordinates=0%2C0%2C0%2C0\"/><br/><br/><p>The vision of Ziggy, a mobile EV charger designed to tool around parking lots like a plug-wielding valet, raises an important question: Do robots take tips?</p><p>EV owners may be happy to toss Ziggy a fiver if it can hold an open parking spot and deliver electrons to fill up the car’s battery, with no worries over fixed chargers being occupied by other cars. As importantly, site operators could lease turnkey robo-chargers without the pricey hassles of charger installation, or setting aside precious real estate for chargers that are often underutilized.</p><p>The flexible, scalable robots are the brainchild of Ziggy’s inventor, Caradoc Ehrenhalt; he’s a big <a href=\"https://en.wikipedia.org/wiki/The_Rise_and_Fall_of_Ziggy_Stardust_and_the_Spiders_from_Mars\" target=\"_blank\">David Bowie</a> fan and founder and CEO of EV Safe Charge. The Los Angeles company plans to bring its four-wheeled robots to parking facilities, hotels, shopping and entertainment centers, fleet operators, and residential properties. Early adopters, slated for late 2023 or early 2024, include <a href=\"https://www.thewilliamvale.com/\" target=\"_blank\">The William Vale hotel</a> in Williamsburg, Brooklyn; <a href=\"https://www.operaplaza.com/\" target=\"_blank\">Opera Plaza</a> in San Francisco; and a Holiday Inn Express in Redwood City, Calif.</p><p>Ehrenhalt says Ziggy can help quell consumer worries over charger availability that <a href=\"https://www.jdpower.com/business/automotive/electric-vehicle-experience-evx-public-charging-study#:~:text=According%20to%20J.D.%20Power%20research,consumer%20interest%20in%20electric%20vehicles.\" rel=\"noopener noreferrer\" target=\"_blank\">some surveys show</a> to be the leading barrier to EV adoption. The black-and-white robot is built around a beefy lithium-ion battery, with GPS, camera vision, sensors, speakers and microphone. From its home base, Ziggy slurps up a 50-kilowatt-hour charge from the grid, batteries, or solar power. Users summon the robot via a mobile app or in-vehicle infotainment system. Ziggy then motors over to hold a reserved parking space where owners plug in and charge at up to a 19.2-kWh pace, roughly the peak of current Level 2 onboard capabilities. (The company plans to develop DC fast-charging capability at roughly 50 kilowatts, well below the 150-to-350-kWh peaks of the most powerful ultrafast chargers, but still a useful jolt).</p><p>The first Ziggys will be remotely piloted by humans, using a camera feed and wireless communications. Brakes and redundant ultrasonic and lidar sensors ensure Ziggy doesn’t ding cars or bump into pedestrians, and the robot can announce its presence with audible or visual warnings. Like a superpowered Roomba, the roughly 450-kilogram robot can turn on a dime or squeeze through tricky spots. And Ziggy could solve a vexing issue for EV owners who don’t plan to drive away after a battery fill-up: The need to move their car within minutes after charging is completed, to avoid additional fees and the burning anger of waiting users.</p><p>“It’s a huge advantage to just unplug your car and leave it where it is, or the car could be unplugged by a valet or other person on site,” Ehrenhalt says.</p><p>The system directly addresses struggles of would-be site operators, including the chicken-and-egg question of installing chargers for EV drivers that may or may not come. Siting, permitting and building fixed chargers can be prohibitively expensive for smaller business owners especially, or in older buildings or parking structures that lack easy grid access.</p><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"1bd62bd6bb0b2038a2bf43daa63b8e39\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/lvyQwPzUNp0?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">ZiGGY. The EV charger that comes to you.</small>\n</p><p>“For the site owner, robots become an operating expense versus a fixed expense,” Ehrenhalt says.</p><p>In cities around the world, property developers and renovators are being required to set aside a fixed percentage of spaces for EVs, and chargers to serve them. Employers get questions from employees, Erhenhalt says, wondering when they’re going to get with the EV program.</p><p>“They’ll say, can’t you just put more chargers in?” Ehrenhalt says. “But they don’t know how complicated it can be.”</p><p>Robotic service could eliminate the need to set aside and signpost reserved spaces for EVs—a notorious annoyance to certain drivers of internal-combustion cars, which leads them to spitefully “ICE” EVs by taking the spots.</p><p>EV Safe Charge got its start by providing mobile charging to Jaguar in 2018, as the automaker sent its i-Pace electric SUV on an inaugural tour for company employees and ride-and-drive events for the press and prospects. The company’s mobile-charging clients now include Audi, Mercedes-Benz, Nissan, Porsche, Stellantis, and the Los Angeles Department of Water and Power.</p><p>Industrial design outfit <a href=\"https://www.bxclvr.com/\" target=\"_blank\">Box Clever </a>created Ziggy’s sleek black-and-white exterior, which incorporates a pair of display screens, including a 50-incher for informational kiosks or advertising, the latter a potential revenue stream for operators. Customers interface with a smaller seven-inch touch screen.</p><p>In 2020, Volkswagen floated the idea of a <a href=\"https://spectrum.ieee.org/volkswagens-concept-robot-would-bring-mobile-ev-charging-to-any-garage\" target=\"_self\">fully automated charge robot</a> that might communicate with cars via vehicle-to-everything communication (<a href=\"https://en.wikipedia.org/wiki/Vehicle-to-everything\" target=\"_blank\">V2X</a>) and perform plugging-and-unplugging chores. But the idea faced major technical and practical hurdles—including the difficulties of fully autonomous operation, as well as systems integration with EVs from a panoply of makers that jealously guard technical secrets and studiously avoid standardization.</p><p>Whirring through parking lots like a <a href=\"https://www.ea.com/games/starwars/battlefront/star-wars-battlefront-2/heroes/bb-8\" rel=\"noopener noreferrer\" target=\"_blank\">less-cute BB-8</a> (sorry, Ziggy), the robot could perform another valuable service, as a rolling ambassador for EV Tech: How many hotel guests, diners, or mall shoppers would tell their friends about the amazing charge robot they just saw, or post Instagram shots of Ziggy cavorting with an exotic Porsche Taycan Turbo?</p><p>David Lemmond, general manager of The William Vale, agrees.</p><p>“We delight in finding opportunities to introduce our guests and neighbors to next-level amenities and technology,” Lemmond says. “Ziggy is perfect for the growing demand for easier charging solutions.”</p>",
  "pubDate": "Wed, 20 Jul 2022 21:05:41 +0000",
  "guid": "https://spectrum.ieee.org/mobile-ev-charging-robot",
  "category": [
    "Mobile robots",
    "Ev charging",
    "Electric vehicles"
  ],
  "dc:creator": "Lawrence Ulrich",
  "media:content": ""
}