{
  "title": "Who’s Gerry and Why Is He So Bad at Drawing Maps?",
  "link": "http://www.wnycstudios.org/story/whos-gerry-and-why-he-so-bad-drawing-maps/",
  "description": "<p>“It is an invidious, undemocratic, and unconstitutional practice,” Justice John Paul Stevens said of gerrymandering in <em>Vieth v. Jubelirer</em> (2004). Politicians have been manipulating district lines to favor one party over another since the founding of our nation. But with a case starting today, <em>Gill v. Whitford</em>, the Supreme Court may be in a position to crack this historical nut once and for all.</p>\n<p>Up until this point, the court didn’t have a standard measure or test for how much one side had unfairly drawn district lines. But “the efficiency gap” could be it. The mathematical formula measures how many votes Democrats and Republicans waste in elections — if either side is way outside the norm, there may be some foul play at hand. According to Loyola law professor Justin Levitt, both the case and the formula arrive at a critical time: “After the census in 2020, all sorts of different bodies will redraw all sorts of different lines and this case will help decide how and where.”</p>\n<p>The key voices:</p>\n<ul>\n<li><a href=\"http://mduchin.math.tufts.edu/\">Moon Duchin</a>, Associate Professor at Tufts University</li>\n<li><a href=\"http://www.lls.edu/faculty/facultylistl-r/levittjustin/\">Justin Levitt</a>, Professor of Law at Loyola Law School, Los Angeles</li>\n</ul>\n<p>The key cases:</p>\n<ul>\n<li>2004: <a href=\"https://www.oyez.org/cases/2003/02-1580\"><em>Vieth v. Jubelirer</em></a></li>\n<li>2017: <em><a href=\"https://www.oyez.org/cases/2017/16-1161\">Gill v. Whitford</a></em></li>\n</ul>\n<p>The key links:</p>\n<ul>\n<li>“<a href=\"https://tinyurl.com/ybb8afqu\">A Formula Goes to Court</a>” by Mira Bernstein and Moon Duchin</li>\n<li>“<a href=\"http://chicagounbound.uchicago.edu/cgi/viewcontent.cgi?article=1946&amp;context=public_law_and_legal_theory\">Partisan Gerrymandering and the Efficiency Gap</a>” by Nicholas Stephanopoulos and Eric McGhee </li>\n</ul>\n<p><em>Special thanks to David Herman.</em></p>\n<p><em>Leadership support for More Perfect is provided by The Joyce Foundation. Additional funding is provided by The Charles Evans Hughes Memorial Foundation.</em></p>\n<p><em>Supreme Court archival audio comes from </em><a href=\"https://www.oyez.org/\"><em>Oyez®</em></a><em>, a free law project in collaboration with the Legal Information Institute at Cornell.</em><em> </em></p>",
  "pubDate": "Tue, 03 Oct 2017 12:00:00 -0400",
  "guid": "http://www.wnyc.org/story/whos-gerry-and-why-he-so-bad-drawing-maps/",
  "enclosure": "",
  "category": [
    "gerrymander",
    "gerrymandering",
    "moreperfect_season2",
    "national_news",
    "supreme_court"
  ],
  "media:content": "",
  "media:description": "Who’s Gerry and Why Is He So Bad at Drawing Maps?",
  "media:thumbnail": "",
  "itunes:duration": "21:12",
  "content:encoded": "<p>“It is an invidious, undemocratic, and unconstitutional practice,” Justice John Paul Stevens said of gerrymandering in <em>Vieth v. Jubelirer</em> (2004). Politicians have been manipulating district lines to favor one party over another since the founding of our nation. But with a case starting today, <em>Gill v. Whitford</em>, the Supreme Court may be in a position to crack this historical nut once and for all.</p>\n<p>Up until this point, the court didn’t have a standard measure or test of how much one side had unfairly drawn district lines. But “the efficiency gap” could be it. The mathematical formula measures how many votes Democrats and Republicans waste in elections; if either side is way outside the norm, there may be some foul play at hand. According to Loyola law professor Justin Levitt, both the case and the formula arrive at a critical time. “After the census in 2020, all sorts of different bodies will redraw all sorts of different lines and this case will help decide how and where.”</p>",
  "itunes:title": "Who’s Gerry and Why Is He So Bad at Drawing Maps?",
  "itunes:summary": "<p>“It is an invidious, undemocratic, and unconstitutional practice,” Justice John Paul Stevens said of gerrymandering in <em>Vieth v. Jubelirer</em> (2004). Politicians have been manipulating district lines to favor one party over another since the founding of our nation. But with a case starting today, <em>Gill v. Whitford</em>, the Supreme Court may be in a position to crack this historical nut once and for all.</p>\n<p>Up until this point, the court didn’t have a standard measure or test of how much one side had unfairly drawn district lines. But “the efficiency gap” could be it. The mathematical formula measures how many votes Democrats and Republicans waste in elections; if either side is way outside the norm, there may be some foul play at hand. According to Loyola law professor Justin Levitt, both the case and the formula arrive at a critical time. “After the census in 2020, all sorts of different bodies will redraw all sorts of different lines and this case will help decide how and where.”</p>",
  "itunes:episodeType": "full",
  "itunes:season": 2,
  "itunes:episode": 3,
  "author": "wnycdigital@gmail.com (WNYC Studios)",
  "itunes:explicit": "no",
  "itunes:subtitle": "“It is an invidious, undemocratic, and unconstitutional practice,” Justice John Paul Stevens said of gerrymandering in Vieth v. Jubelirer (2004). Politicians have been manipulating district lines to favor one party over another since the founding of our nation. But with a case starting today, Gill v. Whitford, the Supreme Court may be in a position to crack this historical nut once and for all. Up until this point, the court didn’t have a standard measure or test for how much one side had unfairly drawn district lines. But “the efficiency gap” could be it. The mathematical formula measures how many votes Democrats and Republicans waste in elections — if either side is way outside the norm, there may be some foul play at hand. According to Loyola law professor Justin Levitt, both the case and the formula arrive at a critical time: “After the census in 2020, all sorts of different bodies will redraw all sorts of different lines and this case will help decide how and where.” The key voices: Moon Duchin, Associate Professor at Tufts University Justin Levitt, Professor of Law at Loyola Law School, Los Angeles The key cases: 2004: Vieth v. Jubelirer 2017: Gill v. Whitford The key links: “A Formula Goes to Court” by Mira Bernstein and Moon Duchin “Partisan Gerrymandering and the Efficiency Gap” by Nicholas Stephanopoulos and Eric McGhee  Special thanks to David Herman. Leadership support for More Perfect is provided by The Joyce Foundation. Additional funding is provided by The Charles Evans Hughes Memorial Foundation. Supreme Court archival audio comes from Oyez®, a free law project in collaboration with the Legal Information Institute at Cornell.",
  "itunes:author": "WNYC Studios",
  "itunes:keywords": "wnyc,more,perfect,supreme,court,scotus"
}