{
  "title": "How the The Wire helped me understand the 2023 BMW 760i xDrive",
  "link": "https://arstechnica.com/?p=1895247",
  "dc:creator": "Jonathan M. Gitlin",
  "pubDate": "Sat, 05 Nov 2022 22:01:23 +0000",
  "category": [
    "Cars",
    "BMW",
    "BMW 7 Series",
    "BMW 760i xDrive",
    "Joshua Tree",
    "The Wire"
  ],
  "guid": "https://arstechnica.com/?p=1895247",
  "description": "A long drive to nowhere remains a good use for an outmoded powertrain.",
  "content:encoded": "<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\">\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/2023-BMW-760i-1-800x1067.jpg\" alt=\"A white BMW 760i in Joshua Tree\">\n      <p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/11/2023-BMW-760i-1-scaled.jpg\" class=\"enlarge-link\" data-height=\"2560\" data-width=\"1920\">Enlarge</a> <span class=\"sep\">/</span> The launch of the new i7 and 7 Series was a two-day affair, and we couldn't drive only the electric version. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside class=\"pullbox sidebar fullwidth\">BMW provided a flight from LA to DC plus three nights in a hotel so we could drive the i7 and 760i. Ars does not accept paid editorial content.</aside>\n<p>PALM SPRINGS, Calif.—\"You want it to be one way... But it's the other way.\" I thought of Marlo Stanfield's words from <em>The Wire</em> that morning. Much as I might like, I couldn't just come to Palm Springs and drive the new BMW i7 without at least acknowledging that, for many, its time has not yet come. As much as I—or you—might want everyone to go electric, <em>now</em>, that isn't happening, and won't; not straight away.</p>\n<p>Elsewhere on Ars, <a href=\"https://arstechnica.com/cars/2022/11/testing-bmws-biggest-and-best-sedan-now-fully-electric-the-2023-i7/\">you can read our first take on that electric i7</a>. Spoiler alert: pretty darn great. But most new 7 Series won't be i7s; plenty will still be ICE sevens. And recognizing the world as it is, and not the world as I might want it to be, meant going for a drive in one of the gas burners.</p>\n<p>Since the chief attraction of internal combustion in 2023 is going for very long drives that don't involve charging stops, I decided to go for a long drive in a $113,600 760i xDrive. As luck would have it, BMW secured permits to film and take photographs within Joshua Tree National Park. Chances to do that don't come along that often, and I hadn't yet visited that park, so the plan seemed clear.</p></div><p><a href=\"https://arstechnica.com/?p=1895247#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1895247&comments=1\">Comments</a></p>"
}