{
  "title": "Sarawak seeks a sovereign wealth fund",
  "link": "https://www.eastasiaforum.org/2022/11/04/sarawak-seeks-a-sovereign-wealth-fund/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=sarawak-seeks-a-sovereign-wealth-fund",
  "comments": "https://www.eastasiaforum.org/2022/11/04/sarawak-seeks-a-sovereign-wealth-fund/#respond",
  "dc:creator": "Mark van Loon",
  "pubDate": "Thu, 03 Nov 2022 23:00:58 +0000",
  "category": [
    "Economy",
    "Energy",
    "Governance",
    "Law",
    "Malaysia",
    "Politics",
    "resources",
    "1MBD",
    "abang johari",
    "Khazanah Nasional Berhad",
    "Mahathir Mohamed",
    "Malaysia sovereign wealth fund",
    "Orang Asli",
    "Sarawak",
    "Sarawak sovereign wealth fund",
    "sarawakians",
    "taib mahmud",
    "Terengganu Investment Authority",
    "The Malaysia Agreement"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1315883",
  "description": "<p>Author: Mark van Loon, Seoul Sarawak’s autonomy has been controversial from the start. One of the four founding states of Malaysia, Sarawak was granted freedom to self-govern by the British Crown in July 1963 and joined the Malaysian Federation later that year with Sabah, Malaya and Singapore. London thought that, during the Cold War, dealing [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/04/sarawak-seeks-a-sovereign-wealth-fund/\">Sarawak seeks a sovereign wealth fund</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Author: Mark van Loon, Seoul</p>\n<p>Sarawak’s autonomy has been controversial from the start. One of the four founding states of Malaysia, Sarawak was granted freedom to self-govern by the British Crown in July 1963 and joined the Malaysian Federation later that year with Sabah, Malaya and Singapore. London thought that, during the Cold War, dealing with one federation was more manageable than with four small independent nations.</p>\n<p><span id=\"more-1315883\"></span></p>\n<p><img class=\"aligncenter wp-image-1315892 size-medium\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-400x267.jpg\" alt=\"A palm oil refinery located in the heart of the Punan territory in Sarawak, Malaysia. The Punan community is deeply affected by landgrabbing as their Native Customary Right is being flouted by companies which exploit their land for palm oil and precious woods. (Photo: Reuters)\" width=\"400\" height=\"267\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-400x267.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-600x400.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-150x100.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-768x512.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-1536x1024.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-300x200.jpg 300w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-100x67.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2015-03-07T051243Z_209090365_MT1HNSLCS000SW0LV1_RTRMADP_3_HANS-LUCAS-500x333.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>The Malaysia Agreement signed in 1963 resulted in the formation of Malaysia, with on-paper autonomy for the states (Singapore left in 1965). But former prime minister Mahathir Mohamed pursued a policy of power centralisation at the expense of the states from 1980–2003.</p>\n<p>Many people in Sarawak and Sabah are disappointed with the broken promises made by leaders in Kuala Lumpur. To appease the situation, the central government amended the Constitution to promote the status of Sarawak and Sabah in late 2021. They are now two of the three entities that make up the federation of Malaysia, rather than just two of the country’s thirteen states.</p>\n<p>But these changes are largely symbolic. Sarawak would like more decentralisation, particularly more control over tax collection and a fairer share of oil and gas proceeds. The Borneo states represent 50 per cent of oil and gas production in Malaysia — mainly controlled by government-owned Petronas that have a monopoly on oil reserves — but only receive 5 per cent of the royalties.</p>\n<p>Sarawak is trying to negotiate the 20 per cent pledged in 2018, but there is little appetite for reform among the Malay political class. From 1976–2017, Sarawak received an estimated <a href=\"https://www.freemalaysiatoday.com/category/nation/2021/11/29/5-oil-royalty-is-the-agreement-not-wang-ehsan-says-ku-li/\" target=\"_blank\" rel=\"noopener noreferrer\">US$7 billion</a> from a total of US$141 billion in revenue from oil — a 20 per cent redistribution would have given them US$28 billion over that period.</p>\n<p>Some academics draw a comparison between Sarawak and Scotland’s oil wealth in the United Kingdom, in which the oil is owned by the Scottish people but a federal political system means it is collected and redistributed by London. Sarawak had a higher GDP per capita than <a href=\"https://www.eastasiaforum.org/2021/07/28/fiscal-distress-exacerbates-malaysias-growing-covid-19-crisis/\" target=\"_blank\" rel=\"noopener noreferrer\">Malaysia</a> in 2021 and wants a better deal. But decisions about revenue sharing are made in Putrajaya. Sarawak’s bargain depends on its political leverage, which it does not have.</p>\n<p>Even if a fairer division was agreed upon, it might not benefit all Sarawakians. Its powerful state elite have enriched themselves immensely in recent decades. Chief Minister Abang Johari and Governor (and former chief minister) Taib Mahmud have been accused of widespread corruption and nepotism. Development policies have brought prosperity, but the benefits are spread unevenly between urban and rural groups, with the indigenous Orang Asli still living in dire poverty.</p>\n<p>Federal elections <a href=\"https://www.eastasiaforum.org/2022/05/15/malaysian-politics-now-a-three-legged-race/\" target=\"_blank\" rel=\"noopener noreferrer\">are due</a> in November 2022. If the peninsular parties are weakly positioned, the government’s reliance on East Malaysia MPs could favour Sarawak. But the central government tends to give ministerial appointments and projects to individuals from different states to stop any consolidation of East Malaysian political pressure.</p>\n<p>With or without more autonomy over its natural resources, Sarawak plans to use surplus oil and gas revenues in a more productive way. It wants to invest the proceeds in a Sarawak sovereign wealth fund. A decision will be taken in November 2022 at the State Legislative Assembly, with US$10–$15 billion in seed money potentially available for the fund.</p>\n<p>Malaysia is not exactly a beacon of good sovereign wealth governance. Terengganu Investment Authority started in 2008 to secure the economic development of Terengganu, another big oil and gas-producing state. A year later, it changed its name to 1MBD.</p>\n<p>Khazanah Nasional Berhad, Malaysia’s sovereign wealth fund with US$30 billion of assets, is nationalised and not necessarily a good template for governance either. Khazanah has a development mandate, with 60–70 per cent exposure to the local market. It also props up local companies and often follows the instructions of the government, reducing returns.</p>\n<p>To give the concept credibility, the government of Sarawak brought in the Norwegian sovereign wealth fund, with US$1.2 trillion in assets, to advise on the model. Given its reputation and high ESG standards, Oslo’s input could give the Sarawak fund a good starting point. The Norwegians will likely stress an independent investment mandate and minimal government interference.</p>\n<p>In an environment fraught with controversy and their reputation at stake, Oslo may want a say in rainforest management to halt deforestation. The activist fund has small stakes in many Malaysian companies but cannot yet exert influence on a government level.</p>\n<p>Whether these aims are realistic remains to be seen — especially given the amount of money involved and Malaysia’s history of corruption. After the recent 1MBD mishap, Sarawakians don’t need reminding that governance should be front of mind.</p>\n<p><em>Mark van Loon is a freelance writer based in Seoul.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/04/sarawak-seeks-a-sovereign-wealth-fund/\">Sarawak seeks a sovereign wealth fund</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/04/sarawak-seeks-a-sovereign-wealth-fund/feed/",
  "slash:comments": 0,
  "post-id": 1315883
}