{
  "title": "Coordinating climate and air-quality policies to improve public health",
  "link": "https://news.mit.edu/2022/coordinating-climate-air-quality-policies-to-improve-public-health-1026",
  "description": "New MIT tool pinpoints policy combinations that maximize health benefits.",
  "pubDate": "Wed, 26 Oct 2022 14:50:00 -0400",
  "guid": "https://news.mit.edu/2022/coordinating-climate-air-quality-policies-to-improve-public-health-1026",
  "dc:creator": "Mark Dwortzan | MIT Joint Program on the Science and Policy of Global Change",
  "content:encoded": "<p>As America’s largest investment to fight climate change, the <a href=\"https://www.nytimes.com/2022/08/16/business/biden-climate-tax-inflation-reduction.html\">Inflation Reduction Act</a> positions the country to reduce its greenhouse gas emissions by&nbsp;<a href=\"https://www.nytimes.com/interactive/2022/08/02/climate/manchin-deal-emissions-cuts.html\">an estimated 40 percent</a>&nbsp;below 2005 levels by 2030. But as it edges the United States closer to achieving its <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/22/fact-sheet-president-biden-sets-2030-greenhouse-gas-pollution-reduction-target-aimed-at-creating-good-paying-union-jobs-and-securing-u-s-leadership-on-clean-energy-technologies/\">international climate commitment</a>, the legislation is also expected to yield significant — and more immediate — improvements in the nation’s health. If successful in accelerating the transition from fossil fuels to clean energy alternatives, the IRA will <a href=\"https://www.nytimes.com/2022/08/12/climate/climate-air-pollution-health.html\">sharply</a> reduce atmospheric concentrations of fine particulates known to exacerbate respiratory and cardiovascular disease and cause premature deaths, along with other air pollutants that degrade human health. One recent <a href=\"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2022GH000603\">study</a> shows that eliminating air pollution from fossil fuels in the contiguous United States would prevent more than 50,000 premature deaths and avoid more than $600 billion in health costs each year.</p>\n\n<p>While national climate policies such as those advanced by the IRA can simultaneously help mitigate climate change and improve air quality, their results may vary widely when it comes to improving public health. That’s because the potential health benefits associated with air quality improvements are much greater in some regions and economic sectors than in others. Those benefits can be maximized, however, through a prudent combination of climate and air-quality policies.</p>\n\n<p>Several past studies have evaluated the likely health impacts of various policy combinations, but their usefulness has been limited due to a reliance on a small set of standard policy scenarios. More versatile tools are needed to model a wide range of climate and air-quality policy combinations and assess their collective effects on air quality and human health. Now researchers at the <a href=\"https://globalchange.mit.edu/\">MIT Joint Program on the Science and Policy of Global Change</a> and <a href=\"https://idss.mit.edu/\">MIT Institute for Data, Systems and Society</a> (IDSS) have developed a publicly available, flexible scenario tool that does just that.</p>\n\n<p>In a&nbsp;<a href=\"https://gmd.copernicus.org/articles/15/7767/2022/\" target=\"_blank\">study</a>&nbsp;published in the journal&nbsp;<em>Geoscientific Model Development,&nbsp;</em>the MIT team introduces its Tool for Air Pollution Scenarios (TAPS), which can be used to estimate the likely air-quality and health outcomes of a wide range of climate and air-quality policies at the regional, sectoral, and fuel-based level.&nbsp;</p>\n\n<p>“This tool can help integrate the siloed sustainability issues of air pollution and climate action,” says the study’s lead author <a href=\"https://rmi.org/people/will-atkinson/\">William Atkinson</a>, who recently served as a Biogen Graduate Fellow and research assistant at the IDSS <a href=\"https://tpp.mit.edu/\">Technology and Policy Program</a>’s (TPP) Research to Policy Engagement Initiative. “Climate action does not guarantee a clean air future, and vice versa — but the issues have similar sources that imply shared solutions if done right.”</p>\n\n<p>The study’s initial application of TAPS shows that with current air-quality policies and near-term Paris Agreement climate pledges alone, short-term pollution reductions give way to long-term increases — given the expected growth of emissions-intensive industrial and agricultural processes in developing regions. More ambitious climate and air-quality policies could be complementary, each reducing different pollutants substantially to give tremendous near- and long-term health benefits worldwide.</p>\n\n<p>“The significance of this work is that we can more confidently identify the long-term emission reduction strategies that also support air quality improvements,” says MIT Joint Program Deputy Director <a href=\"https://globalchange.mit.edu/about-us/personnel/schlosser-c-adam\">C. Adam Schlosser</a>, a co-author of the study. “This is a win-win for setting climate targets that are also healthy targets.”</p>\n\n<p>TAPS projects air quality and health outcomes based on three integrated components: a recent global inventory of detailed emissions resulting from human activities (e.g., fossil fuel combustion, land-use change, industrial processes); multiple scenarios of emissions-generating human activities between now and the year 2100, produced by the MIT <a href=\"https://globalchange.mit.edu/research/research-tools/human-system-model\" target=\"_blank\">Economic Projection and Policy Analysis</a> model; and emissions intensity (emissions per unit of activity) scenarios based on recent data from the <a href=\"https://web.jrc.ec.europa.eu/policy-model-inventory/explore/models/model-gains\" target=\"_blank\">Greenhouse Gas and Air Pollution Interactions and Synergies</a> model.</p>\n\n<p>“We see the climate crisis as a health crisis, and believe that evidence-based approaches are key to making the most of this historic investment in the future, particularly for vulnerable communities,” says Johanna Jobin, global head of corporate reputation and responsibility at Biogen. “The scientific community has spoken with unanimity and alarm that not all climate-related actions deliver equal health benefits. We’re proud of our collaboration with the MIT Joint Program to develop this tool that can be used to bridge research-to-policy gaps, support policy decisions to promote health among vulnerable communities, and train the next generation of scientists and leaders for far-reaching impact.”</p>\n\n<p>The tool can inform decision-makers about a wide range of climate and air-quality policies. Policy scenarios can be applied to specific regions, sectors, or fuels to investigate policy combinations at a more granular level, or to target short-term actions with high-impact benefits.</p>\n\n<p>TAPS could be further developed to account for additional emissions sources and trends.</p>\n\n<p>“Our new tool could be used to examine a large range of both climate and air quality scenarios. As the framework is expanded, we can add detail for specific regions, as well as additional pollutants such as air toxics,” says study supervising co-author <a href=\"http://www.selingroup.org/noelle-eckley-selin\">Noelle Selin</a>, professor at IDSS and the MIT Department of Earth, Atmospheric and Planetary Sciences, and director of TPP.&nbsp;&nbsp; &nbsp;</p>\n\n<p>This research was supported by the U.S. Environmental Protection Agency and its Science to Achieve Results (STAR) program; Biogen; TPP’s Leading Technology and Policy Initiative; and TPP’s Research to Policy Engagement Initiative.</p>",
  "media:content": {
    "media:description": "A new tool developed by MIT researchers can be used to estimate the likely air-quality and health outcomes of a wide range of climate and air-quality policies at the regional, sectoral, and fuel-based level.",
    "media:credit": "Photo: V.T. Polywoda/Flickr"
  },
  "category": [
    "Research",
    "Climate change",
    "Emissions",
    "Sustainability",
    "Greenhouse gases",
    "Pollution",
    "Policy",
    "Government",
    "Health",
    "Environment",
    "Public health",
    "Technology and policy",
    "EAPS",
    "IDSS",
    "Joint Program on the Science and Policy of Global Change",
    "MIT Energy Initiative",
    "School of Science",
    "MIT Schwarzman College of Computing"
  ]
}