{
  "title": "AI, Artificial Birds and Aeroplanes",
  "link": "https://datamining.typepad.com/data_mining/2015/05/ai-artificial-birds-and-aeroplanes.html",
  "description": "The Turing Test for artificial intelligence is a reasonably well understood idea: if, through a written form of communication, a machine can convince a human that it too is a human, then it passes the test. The elegance of this...",
  "content:encoded": "<p>The Turing Test for artificial intelligence is a reasonably well understood idea: if, through a written form of communication, a machine can convince a human that it too is a human, then it passes the test. The elegance of this&#0160;approach (which I believe is its primary attraction) is that it avoids any troublesome definition of intelligence and appeals to an innate ability&#0160;in humans to detect entities which are not &#39;one of us&#39;.</p>\n<p>This form of AI is the one that is generally presented in <a href=\"http://datamining.typepad.com/data_mining/2015/05/how-hollywood-keeps-artificial-intelligence-at-a-distance.html\" target=\"_self\">entertainment</a> (films, novels, etc.).</p>\n<p>However, to an engineer, there are some problems with this as the accepted popular idea of artificial intelligence.</p>\n<p>I believe that software engineering can be evaluated in a simple measure of productivity. We either create things that make the impossible possible - going from 0 to 1, or we create things that amplify some value, generally a human&#39;s ability to do something, - going from X to nX. In other words, we enable a new thing, or we multiple our ability to do something.</p>\n<p>Turing AI, while clearly an interesting intellectual concept, is like building an artificial bird instead of building an aeroplane:</p>\n<ul>\n<li>A Turing AI can converse in natural language, but humans can&#39;t speak charts or holograms as a means to explain something.</li>\n<li>A Turing AI can read a book and appear to understand it, but it can&#39;t read a thousand research articles on cancer and find a connection between discoveries that results in a breakthrough.</li>\n<li>A Turing AI doesn&#39;t have to even be particularly intelligence&#0160;(though it probably ought to at least appear self aware, reflective, etc) and so would be potentially like making a very poor hire for your team.</li>\n</ul>\n<p>I believe that if we consider opportunities for applying &#39;AI methods&#39; to the vast corpus of data (both in natural language and in various structured forms) on the web, we will realize that there is an economic motivation (i.e. build value for users that can build a user base) that will require all the generally accepted facets of an AI (reasoning, perception, communication with humans, theory of mind, etc.) but will be nothing like a Turing AI.</p>\n<p>Rather than think of search engines - the fundamental agents that mediate the web corpus - as mechanisms to help humans find the &#39;right&#39; document - I believe it is time to change our intentions to:<em>optimize the value of the data on the internet for all mankind.</em></p>\n<p>When we achieve this, we will have built an AI, but it won&#39;t be a Turing AI and it may not even pass the Turing Test.</p>",
  "dc:subject": "AI",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2015-05-09T14:50:09-04:00"
}