{
  "title": "Episode 45: &#8220;Blueberry Hill&#8221;, by Fats Domino",
  "link": "https://500songs.com/podcast/episode-45-blueberry-hill-by-fats-domino/",
  "pubDate": "Sun, 11 Aug 2019 23:49:16 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-45-blueberry-hill-by-fats-domino/",
  "description": "Episode forty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blueberry Hill\" by Fats Domino, and at how the racial tensions of the fifties meant that a smiling, diffident, cheerful man playing happy music ended up starting riots all over the US.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/29094645\"> on \"Birmingham Bounce\" by Hardrock Gunter</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-45-blueberry-hill/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called <em><a href=\"https://amzn.to/2PT704t\">They Call Me The Fat Man: The Legendary Imperial Recordings.</a></em>\n\nThe biographical information here comes from Rick Coleman's <em><a href=\"https://amzn.to/2QhFZqP\">Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll.</a> </em>\n\nThe information about the \"Yancey Special\" bassline and its history comes from<a href=\"https://amzn.to/2OS4iaN\"><em> \"Before Elvis\"</em>, by Larry Birnbaum.</a>\n\nThere have been three previous episodes in which Domino and Bartholomew have featured, including two on Domino songs. See<a href=\"http://500songs.com/category/fats-domino/\"> the \"Fats Domino\" tag</a> for those episodes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong> Transcript</strong>\n\nThis is the third episode we're going to do on Fats Domino, and the last one, though he will be turning up in other episodes in various ways. He was the one star from the pre-rock days of R&B to last and thrive, and even become bigger, in the rock and roll era, and he was, other than Elvis Presley, by far the most successful of the first wave of rock and roll stars.\n\nAnd this points to something interesting -- something which we haven't really pointed out as much as you might expect.\n\nBecause of that first wave of rock and rollers, by late 1956 there were only Elvis and the black R&B stars left as rock and roll stars on the US charts. The wave of white rockabilly acts that had hits throughout 1955 and 56 had all fizzled -- Carl Perkins, Gene Vincent, and Bill Haley would between them never have another major hit in the US, though all of them would have success in other countries, and make important music over the next few years. Johnny Cash would have more hits, but he would increasingly be marketed as a country music star.\nIf we're talking about actual rock and roll hits rising to decent positions in the charts, by late 1956 you're looking at acts like Little Richard, Chuck Berry, and Fats Domino, with only Elvis left of the rockabillies.\n\nOf course, very shortly afterwards, there would come a second wave of white rock and rollers, who would permanently change the music, and by the time we get to mid-1957 we'll be in a period where white man with guitar is the default image for rock and roll star, but in late 1956, that default image was a black man with a piano, and the black man with a piano who was selling the most records, by far, was Fats Domino.\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nWhen we left Domino, he had just had his breakout rock and roll hit, with \"Ain't That A Shame\". He was so successful that Imperial Records actually put out an album by him, rather than just singles, for the first time in the six years he'd been recording for them. This was a bigger deal than it sounds -- rhythm and blues artists hardly ever put out albums in the fifties. The sales of their records weren't even normally directly to their audiences -- they were to jukebox manufacturers.\n\nSo when Imperial put out an album, that was a sign that something had changed with Domino's audience -- he was selling to white people with money. The black audience, for the most part, were still buying 78s, not even 45s -- they were generally relatively poor, and not the type of people to upgrade their record players while the old ones still worked.\n\n(This is obviously a huge generalisation, but it's true in so far as any generalisations are true.)\n\nMeanwhile, the young white rock and roll audience that had developed all of a sudden between 1954 and 1956 was mostly buying the new 45rpm singles, but at least some of them were also buying LPs -- enough of them that artists like Elvis were selling on the format.\n\nDomino's first album, Rock and Rollin' With Fats Domino, was made up almost entirely of previously released material -- mostly hit singles he'd had in the few years before the rock and roll boom took off, and including the songs we've looked at before. It was followed only three months later by a follow-up, imaginatively titled Fats Domino Rock and Rollin'. That one was largely made up of outtakes and unreleased tracks from 1953, but when it came out in April 1956 it sold twenty thousand copies in its first week on release.\n\nThat doesn't sound a lot now, but for an album aimed at a teenage audience, by a black artist, in 1956, and featuring only one hit single, that was quite an extraordinary achievement.\n\nBut Domino's commercial success in 1956 was very much overshadowed by other events, which had everything to do with the racial attitudes of the time. Because believe it or not, Fats Domino's shows were often disrupted by riots.\n\nWe've been talking about 1956 for a while, and dealing with black artists, without having really mentioned just what a crucial time this was in the history of the civil rights struggle. The murder of Emmett Till, supposedly for whistling at a white woman, had been in August 1955. Rosa Parks had refused to get to the back of the bus in December 1955, and in early 1956 a campaign of white supremacist terrorism against black people stepped up, with the firebombing of several churches and of the houses of civil rights leaders including Dr. Martin Luther King.\n\nThis, as much as anything musical, is the context you need to understand why rock and roll was seen as so revolutionary in 1956 in particular. White teenagers were listening to music by black musicians, and even imitating that music themselves, right at the point where people were having to start taking sides for or against racial justice and human decency. A large chunk of white America was more concerned about the \"inappropriate\" behaviour of people like Rosa Parks than about the legitimate concerns of the firebombers.\nAnd this attitude was also showing up in the reaction to music. In April 1956 Nat King Cole was injured on stage when a mob of white supremacists attacked him. Cole was one of the least politically vocal black entertainers, and he was appearing before an all-white audience, but he was a black man playing with a white backing band, and that was enough for him to be a target for attempted murder.\n\nAnd this is the background against which you have to look at the reports of violence at Fats Domino shows. The riots which broke out at his shows throughout that year were blamed in contemporary news reports on his \"pulsating jungle rhythms\" -- and there's not even an attempt made to hide the racism in statements like that -- but there was little shocking about Domino's actual music at the time.\n\nIn fact, in 1956, Domino seemed to be trying to cross over to the country and older pop audience, by performing old standards from decades earlier. His first attempt at doing so became a top twenty pop hit. \"My Blue Heaven\" had originally been a hit in 1927 for the crooner Gene Austin:\n\n[Excerpt: Gene Austin, \"My Blue Heaven\"]\n\nDomino's version gave it a mild R&B flavour, and it became a double-sided hit with \"I'm In Love Again\" on the other side:\n\n[Excerpt: Fats Domino, \"My Blue Heaven\"]\n\nAnd for the rest of the year, Domino would repeat this formula -- one side of each of his singles would be written by Domino or his producer Dave Bartholomew, while the other side would be a song from twenty to forty years earlier. His single releases for the next eighteen months or so would include on them such standards as \"I'm in the Mood for Love\", \"As Time Goes By\", and \"When My Dreamboat Comes Home\".\n\nAnd so, this is the music that was supposedly to blame for riots. And riots *did* follow Domino around everywhere he went. In Roanoake, Virginia, for example, in May, Domino was playing to a segregated crowd -- whites in the balcony, black people on the floor. The way segregation worked when it came to rock and roll or R&B concerts was simple -- whichever race the promoter thought would be more likely to come got the floor, the race which would have fewer audience members got the balcony.\n\nBut in this case, the promoters underestimated how many white people were now listening to this new music. The balcony filled up, and a lot of white teenagers went down and joined the black people on the ground floor. Towards the end of the show, someone in the balcony, incensed at the idea of black and white people dancing together, threw a whisky bottle at the crowd below. Soon whisky bottles were flying through the air, and the riot in the audience spread to the streets around.\n\nThe New York Times blamed the black audience members, even though it had been a white person who'd thrown the first bottle. The American Legion, which owned the concert venue, decided that the simplest solution was just to ban mixed audiences altogether -- they'd either have all-white or all-black audiences.\n\nAnother riot broke out in San Jose in July, when someone threw a string of lit firecrackers into the audience. In the ensuing riot, a thousand beer bottles were broken, twelve people were arrested, and another twelve needed medical treatment.\n\nIn Houston, Domino played another show where white people were in the balcony and black people were on the dancefloor below. Some of the white people decided to join the black dancers, at which point a black policeman -- trying to avoid another riot because of \"race mixing\" -- said that everyone had to sit down and no-one could dance. But then a white cop overruled him and said that only white people could dance. Domino refused to carry on playing if black people weren't allowed to dance, too, and while that show didn't turn violent, a dozen people were arrested for threatening the police.\n\nThis is the context in which Domino was performing, and this is the context in which he had his biggest hit.\nThe song that was meant to be the hit was \"Honey Chile\", a new original which Domino got to feature in an exploitation film called \"Shake, Rattle, and Rock\":\n\n[Excerpt: Fats Domino, \"Honey Chile\"]\n\nAt the same session where he recorded that, he tried to record another old standard, with disappointing results.\n\"Blueberry Hill\" was originally written in 1940 by Vincent Rose, Larry Stock, and Al Lewis. As with many songs of the time, it was recorded simultaneously by dozens of artists, but it was the Glenn Miller Orchestra who had the biggest hit with it:\n\n[Excerpt: The Glenn Miller Orchestra, \"Blueberry Hill\"]\n\nAfter Glenn Miller, Gene Autry had also had a hit with the song. We've talked before about Autry, and how he was the biggest Western music star of the late thirties and early forties, and influenced everyone from Les Paul to Bo Diddley. Given Domino's taste for country and western music, it's possible that Autry's version was the first version of the song he came to love:\n\n[Excerpt: Gene Autry, \"Blueberry Hill\"]\n\nBut Domino was inspired to cover the song by Louis Armstrong's recording. Armstrong was, of course, another legend of New Orleans music, and his version, from 1949, had come out after Domino had already started his own career:\n\n[Excerpt: Louis Armstrong: \"Blueberry Hill\"]\n\nDomino loved Armstrong's version, and had wanted to record it for a long time, but when they got into the studio the band couldn't get through a whole take of the song. Dave Bartholomew, who hadn't been keen on recording the song anyway, said at the end of the session, \"We got nuthin'\".\n\nBut Bunny Robyn, the engineer at the session, thought it was salvageable. He edited together a version from bits of half-finished takes, and thanks to the absolutely metronomic time sense of Earl Palmer, he managed to do it so well that after more than thirty years of listening to the record, I'm still not certain exactly where the join is. I *think* it's just before he starts the second middle eight -- there's a *slight* change of sonic ambience there -- but I wouldn't swear to it. Listen for yourself. The part where I think the join comes is just before he sings \"the wind in the willow\":\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nAfter Robyn edited that version together, Dave Bartholomew tried to stop it from being released, telling Lew Chudd, the owner of the record label, that releasing it would ruin Domino's career forever.\n\nHe couldn't have been more wrong. The song became Domino's biggest hit, rising to number two in the pop charts, and Bartholomew later admitted it had been a huge mistake for him to try to block it, saying that his horn arrangement for the song would be the thing he would be remembered for, and telling Domino's biographer Rick Coleman, \"When I'm dead and gone a million times, they'll still be playing 'da-da-da-da-dee-dah'\".\n\nNot only was Domino's version a hit, but it was big enough that Louis Armstrong's version of the song was reissued and became a hit as well, and Elvis recorded a soundalike cover, including the piano intro that Domino had come up with, for his film \"Loving You\":\n\n[Excerpt: Elvis Presley, \"Blueberry Hill\"]\n\nThe song was so big that it even revived the career of its co-lyricist, Al Lewis, whose career had been in the doldrums since a run of hits for people like Eddie Cantor in the 1930s. Lewis made a comeback as an R&B songwriter, co-writing songs for Domino himself:\n\n[Excerpt: Fats Domino, \"I'm Ready\"]\n\nAnd for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Tears on My Pillow\"]\n\nAs always with a Fats Domino record, we're going to talk about its points of rhythmic interest. The bass-line here is not one that was used on any of the previous versions, but it was common on New Orleans R&B records -- indeed it's very similar to the one Domino used on \"Ain't That a Shame\", which we looked at a few months ago.\n\nThis kind of bassline has some of that Jelly Roll Morton Spanish tinge we've talked about before, when we talked about the tresilo rhythms that Dave Bartholomew brought to the arrangements. But when it's used as a piano bassline, as it is here, it comes indirectly from the boogie woogie pianist Jimmy Yancey:\n\n[Excerpt: Jimmy Yancey, \"How Long Blues\"]\n\nYancey made a speciality of this kind of bassline, but the man who made every New Orleans piano player start playing like that was the great boogie player Meade \"Lux\" Lewis, with his song \"Yancey Special\":\n\n[Excerpt: Meade \"Lux\" Lewis, \"Yancey Special\"]\n\nLewis named that song after Yancey, which caused a problem for him when Sonny Thompson, an R&B bandleader from Chicago, recorded an instrumental with a similar bassline, \"Long Gone\":\n\n[Excerpt: Sonny Thompson, \"Long Gone\"]\n\nThat song went to number one on the R&B charts, and Lewis sued Thompson for copyright infringement, claiming it was too similar to \"Yancey Special\", because it shared the same bassline. The defendants brought out Jimmy Yancey, who said that he'd come up with that bassline long before Lewis had. Lewis didn't help himself in his testimony -- he claimed, at first, that he hadn't named the song after Jimmy Yancey, but later admitted on the stand that the song called \"Yancey Special\" which featured a bassline in the style of Jimmy Yancey had indeed been named after Jimmy Yancey.\n\nThe plagiarism case was thrown out for that reason, but also for two others. One was that the bassline was such a simple idea that it couldn't by itself be copyrightable -- which is something I would question, but I have spoken in great detail about the problems with copyright law as it comes to black American musical creation in the past, and I won't repeat myself here. The other was that by allowing the record of \"Yancey Special\" to come out before he'd registered the copyright, Lewis had dedicated the whole composition to the public domain, and so Thompson could do what he liked with the bassline.\n\nThat bassline became a staple of R&B music, and particularly of New Orleans R&B music. You can hear it, for example, on \"I Hear You Knockin'\", a 1955 hit for Smiley Lewis, arranged by Dave Bartholomew, featuring Huey \"Piano\" Smith playing a very Fats Domino style piano part:\n\n[Excerpt: Smiley Lewis, \"I Hear You Knockin'\"]\n\nDomino had used the bassline in \"Ain't That A Shame\", as well, and it seems to have been taken up by Bartholomew as a signature motif -- he also used it in \"Blue Monday\", another song which he'd written for Smiley Lewis:\n\n[Excerpt: Smiley Lewis, \"Blue Monday\"]\n\nDomino's remake of that song would become his next hit after \"Blueberry Hill\", and almost as big a success.\nWorldwide, \"Blueberry Hill\" was the biggest rock and roll hit of 1956, outdoing even Elvis' \"Hound Dog\" and \"Heartbreak Hotel\" in worldwide chart positions, though none of those songs could beat \"Que Sera Sera\" by Doris Day -- however much our popular image of the 1950s is based on ponytailed bobbysoxers, the fact remains that a sizeable proportion of the record-buying public were older and less inclined to rock than to gently sway, and for all that Domino's shows were inspiring riots wherever he went in 1956, his records were still also appealing to that older crowd.\n\nBut segregation applied here too. \"Blueberry Hill\" made Billboard's top thirty records of the year for country sales in its annual roundup, but it never appeared even on the top one hundred country charts during 1956 itself. We've talked before about how the recent \"Old Town Road\" debacle shows how musical genres are the product of rigid segregation, but nothing shows that more than this. That appearance by Domino in the top thirty sellers for the year was the only appearance by a black artist on any Billboard country charts in the fifties, and it shows that country audiences were buying Domino's records, just as his *lack* of appearance on all the other country charts that year shows that this wasn't being recognised by any of the musical gatekeepers, despite the evident country sensibility in his performance:\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nMeanwhile, of course, Elvis Presley and Carl Perkins were appearing on the R&B charts as well as the country and pop ones.\n\n1956 was the absolute peak of Domino's career in chart terms, and \"Blueberry Hill\" was his biggest hit of that year, but he would carry on having top twenty pop hits until 1962, by which point he had outlasted not only the first wave of rockabilly acts that came up in 1955 and 56, but almost all of the second wave that we're going to see coming up in 1957 as well. His is an immense body of work, and we've barely touched upon it in the three episodes this podcast has devoted to him. His top thirty R&B chart hits span from 1949 through to 1964, a career that covers multiple revolutions in music. When he started having hits, the biggest artists in pop music were Perry Como and the Andrews Sisters, and when he stopped, the Beatles were at the top of the charts.\nDomino was, other than Elvis, the biggest rock and roll star of the fifties by a massive margin. The whole of New Orleans music owes a debt to him, and \"Blueberry Hill\" in particular has been cited as an influence by everyone from Mick Jagger to Leonard Cohen.\n\nYet he is curiously unacknowledged in the popular consciousness, while much lesser stars loom larger. I suspect that part of the reason for that is racism, both in ignoring a black man because he was black, and in ignoring him because he didn't fit white prejudices about black people and the music they make.\n\nOther than drinking a bit too much, and sleeping around a little in the fifties, Domino led a remarkably non-rock-and-roll life. He was married to the same woman for sixty-one years, he rarely left his home in New Orleans, and other than a little friction between songwriting partners you'll struggle to find anyone who had a bad word to say about him. You build a legend as a rock star by shooting your bass player on stage or choking to death on your own vomit, not by not liking to travel because you don't like the food anywhere else, or by being shy but polite, and smiling a lot.\n\nThat's not how you build a reputation for rock and roll excess. But it *is* how you build a body of work that stands up to any artist from the mid-twentieth-century, and how you live a long and happy life. It's how you get the Medal of Arts awarded to you by two Presidents -- George W. Bush awarded Domino with a replacement after he lost his first medal, from Bill Clinton, during Hurricane Katrina. And it's how you become so universally beloved and admired that when your home is destroyed in a hurricane, everyone from Elton John to Doctor John, from Paul McCartney to Robert Plant, will come together to record a tribute album to help raise funds to rebuild it.\n\nFats Domino died in 2017, sixty-eight years after the start of his career, at the age of eighty-nine. His collaborator Dave Bartholomew died in June this year, aged one hundred. They both left behind one of the finest legacies in the histories of rock and roll, rhythm and blues, and New Orleans music.",
  "itunes:subtitle": "Episode forty-five of A History of Rock Music in Five Hundred Songs looks at Blueberry Hill by Fats Domino, and at how the racial tensions of the fifties meant that a smiling, diffident, cheerful man playing happy music ended up starting riots all over t",
  "itunes:keywords": "Al Lewis,civil rights,copyright law,country and western,Dave Bartholomew,Earl Palmer,Fats Domino,Gene Austin,Gene Autry,Imperial Records,Jimmy Yancey,lawsuits,Louis Armstrong,plagiarism,racism",
  "itunes:episodeType": "full",
  "itunes:episode": 45,
  "content:encoded": "Episode forty-five of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Blueberry Hill\" by Fats Domino, and at how the racial tensions of the fifties meant that a smiling, diffident, cheerful man playing happy music ended up starting riots all over the US.\n\nPatreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/29094645\"> on \"Birmingham Bounce\" by Hardrock Gunter</a>.\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-45-blueberry-hill/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called <em><a href=\"https://amzn.to/2PT704t\">They Call Me The Fat Man: The Legendary Imperial Recordings.</a></em>\n\nThe biographical information here comes from Rick Coleman's <em><a href=\"https://amzn.to/2QhFZqP\">Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll.</a> </em>\n\nThe information about the \"Yancey Special\" bassline and its history comes from<a href=\"https://amzn.to/2OS4iaN\"><em> \"Before Elvis\"</em>, by Larry Birnbaum.</a>\n\nThere have been three previous episodes in which Domino and Bartholomew have featured, including two on Domino songs. See<a href=\"http://500songs.com/category/fats-domino/\"> the \"Fats Domino\" tag</a> for those episodes.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"https://www.patreon.com/join/AndrewHickey\">Why not join them?</a>\n\n<strong> Transcript</strong>\n\nThis is the third episode we're going to do on Fats Domino, and the last one, though he will be turning up in other episodes in various ways. He was the one star from the pre-rock days of R&B to last and thrive, and even become bigger, in the rock and roll era, and he was, other than Elvis Presley, by far the most successful of the first wave of rock and roll stars.\n\nAnd this points to something interesting -- something which we haven't really pointed out as much as you might expect.\n\nBecause of that first wave of rock and rollers, by late 1956 there were only Elvis and the black R&B stars left as rock and roll stars on the US charts. The wave of white rockabilly acts that had hits throughout 1955 and 56 had all fizzled -- Carl Perkins, Gene Vincent, and Bill Haley would between them never have another major hit in the US, though all of them would have success in other countries, and make important music over the next few years. Johnny Cash would have more hits, but he would increasingly be marketed as a country music star.\nIf we're talking about actual rock and roll hits rising to decent positions in the charts, by late 1956 you're looking at acts like Little Richard, Chuck Berry, and Fats Domino, with only Elvis left of the rockabillies.\n\nOf course, very shortly afterwards, there would come a second wave of white rock and rollers, who would permanently change the music, and by the time we get to mid-1957 we'll be in a period where white man with guitar is the default image for rock and roll star, but in late 1956, that default image was a black man with a piano, and the black man with a piano who was selling the most records, by far, was Fats Domino.\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nWhen we left Domino, he had just had his breakout rock and roll hit, with \"Ain't That A Shame\". He was so successful that Imperial Records actually put out an album by him, rather than just singles, for the first time in the six years he'd been recording for them. This was a bigger deal than it sounds -- rhythm and blues artists hardly ever put out albums in the fifties. The sales of their records weren't even normally directly to their audiences -- they were to jukebox manufacturers.\n\nSo when Imperial put out an album, that was a sign that something had changed with Domino's audience -- he was selling to white people with money. The black audience, for the most part, were still buying 78s, not even 45s -- they were generally relatively poor, and not the type of people to upgrade their record players while the old ones still worked.\n\n(This is obviously a huge generalisation, but it's true in so far as any generalisations are true.)\n\nMeanwhile, the young white rock and roll audience that had developed all of a sudden between 1954 and 1956 was mostly buying the new 45rpm singles, but at least some of them were also buying LPs -- enough of them that artists like Elvis were selling on the format.\n\nDomino's first album, Rock and Rollin' With Fats Domino, was made up almost entirely of previously released material -- mostly hit singles he'd had in the few years before the rock and roll boom took off, and including the songs we've looked at before. It was followed only three months later by a follow-up, imaginatively titled Fats Domino Rock and Rollin'. That one was largely made up of outtakes and unreleased tracks from 1953, but when it came out in April 1956 it sold twenty thousand copies in its first week on release.\n\nThat doesn't sound a lot now, but for an album aimed at a teenage audience, by a black artist, in 1956, and featuring only one hit single, that was quite an extraordinary achievement.\n\nBut Domino's commercial success in 1956 was very much overshadowed by other events, which had everything to do with the racial attitudes of the time. Because believe it or not, Fats Domino's shows were often disrupted by riots.\n\nWe've been talking about 1956 for a while, and dealing with black artists, without having really mentioned just what a crucial time this was in the history of the civil rights struggle. The murder of Emmett Till, supposedly for whistling at a white woman, had been in August 1955. Rosa Parks had refused to get to the back of the bus in December 1955, and in early 1956 a campaign of white supremacist terrorism against black people stepped up, with the firebombing of several churches and of the houses of civil rights leaders including Dr. Martin Luther King.\n\nThis, as much as anything musical, is the context you need to understand why rock and roll was seen as so revolutionary in 1956 in particular. White teenagers were listening to music by black musicians, and even imitating that music themselves, right at the point where people were having to start taking sides for or against racial justice and human decency. A large chunk of white America was more concerned about the \"inappropriate\" behaviour of people like Rosa Parks than about the legitimate concerns of the firebombers.\nAnd this attitude was also showing up in the reaction to music. In April 1956 Nat King Cole was injured on stage when a mob of white supremacists attacked him. Cole was one of the least politically vocal black entertainers, and he was appearing before an all-white audience, but he was a black man playing with a white backing band, and that was enough for him to be a target for attempted murder.\n\nAnd this is the background against which you have to look at the reports of violence at Fats Domino shows. The riots which broke out at his shows throughout that year were blamed in contemporary news reports on his \"pulsating jungle rhythms\" -- and there's not even an attempt made to hide the racism in statements like that -- but there was little shocking about Domino's actual music at the time.\n\nIn fact, in 1956, Domino seemed to be trying to cross over to the country and older pop audience, by performing old standards from decades earlier. His first attempt at doing so became a top twenty pop hit. \"My Blue Heaven\" had originally been a hit in 1927 for the crooner Gene Austin:\n\n[Excerpt: Gene Austin, \"My Blue Heaven\"]\n\nDomino's version gave it a mild R&B flavour, and it became a double-sided hit with \"I'm In Love Again\" on the other side:\n\n[Excerpt: Fats Domino, \"My Blue Heaven\"]\n\nAnd for the rest of the year, Domino would repeat this formula -- one side of each of his singles would be written by Domino or his producer Dave Bartholomew, while the other side would be a song from twenty to forty years earlier. His single releases for the next eighteen months or so would include on them such standards as \"I'm in the Mood for Love\", \"As Time Goes By\", and \"When My Dreamboat Comes Home\".\n\nAnd so, this is the music that was supposedly to blame for riots. And riots *did* follow Domino around everywhere he went. In Roanoake, Virginia, for example, in May, Domino was playing to a segregated crowd -- whites in the balcony, black people on the floor. The way segregation worked when it came to rock and roll or R&B concerts was simple -- whichever race the promoter thought would be more likely to come got the floor, the race which would have fewer audience members got the balcony.\n\nBut in this case, the promoters underestimated how many white people were now listening to this new music. The balcony filled up, and a lot of white teenagers went down and joined the black people on the ground floor. Towards the end of the show, someone in the balcony, incensed at the idea of black and white people dancing together, threw a whisky bottle at the crowd below. Soon whisky bottles were flying through the air, and the riot in the audience spread to the streets around.\n\nThe New York Times blamed the black audience members, even though it had been a white person who'd thrown the first bottle. The American Legion, which owned the concert venue, decided that the simplest solution was just to ban mixed audiences altogether -- they'd either have all-white or all-black audiences.\n\nAnother riot broke out in San Jose in July, when someone threw a string of lit firecrackers into the audience. In the ensuing riot, a thousand beer bottles were broken, twelve people were arrested, and another twelve needed medical treatment.\n\nIn Houston, Domino played another show where white people were in the balcony and black people were on the dancefloor below. Some of the white people decided to join the black dancers, at which point a black policeman -- trying to avoid another riot because of \"race mixing\" -- said that everyone had to sit down and no-one could dance. But then a white cop overruled him and said that only white people could dance. Domino refused to carry on playing if black people weren't allowed to dance, too, and while that show didn't turn violent, a dozen people were arrested for threatening the police.\n\nThis is the context in which Domino was performing, and this is the context in which he had his biggest hit.\nThe song that was meant to be the hit was \"Honey Chile\", a new original which Domino got to feature in an exploitation film called \"Shake, Rattle, and Rock\":\n\n[Excerpt: Fats Domino, \"Honey Chile\"]\n\nAt the same session where he recorded that, he tried to record another old standard, with disappointing results.\n\"Blueberry Hill\" was originally written in 1940 by Vincent Rose, Larry Stock, and Al Lewis. As with many songs of the time, it was recorded simultaneously by dozens of artists, but it was the Glenn Miller Orchestra who had the biggest hit with it:\n\n[Excerpt: The Glenn Miller Orchestra, \"Blueberry Hill\"]\n\nAfter Glenn Miller, Gene Autry had also had a hit with the song. We've talked before about Autry, and how he was the biggest Western music star of the late thirties and early forties, and influenced everyone from Les Paul to Bo Diddley. Given Domino's taste for country and western music, it's possible that Autry's version was the first version of the song he came to love:\n\n[Excerpt: Gene Autry, \"Blueberry Hill\"]\n\nBut Domino was inspired to cover the song by Louis Armstrong's recording. Armstrong was, of course, another legend of New Orleans music, and his version, from 1949, had come out after Domino had already started his own career:\n\n[Excerpt: Louis Armstrong: \"Blueberry Hill\"]\n\nDomino loved Armstrong's version, and had wanted to record it for a long time, but when they got into the studio the band couldn't get through a whole take of the song. Dave Bartholomew, who hadn't been keen on recording the song anyway, said at the end of the session, \"We got nuthin'\".\n\nBut Bunny Robyn, the engineer at the session, thought it was salvageable. He edited together a version from bits of half-finished takes, and thanks to the absolutely metronomic time sense of Earl Palmer, he managed to do it so well that after more than thirty years of listening to the record, I'm still not certain exactly where the join is. I *think* it's just before he starts the second middle eight -- there's a *slight* change of sonic ambience there -- but I wouldn't swear to it. Listen for yourself. The part where I think the join comes is just before he sings \"the wind in the willow\":\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nAfter Robyn edited that version together, Dave Bartholomew tried to stop it from being released, telling Lew Chudd, the owner of the record label, that releasing it would ruin Domino's career forever.\n\nHe couldn't have been more wrong. The song became Domino's biggest hit, rising to number two in the pop charts, and Bartholomew later admitted it had been a huge mistake for him to try to block it, saying that his horn arrangement for the song would be the thing he would be remembered for, and telling Domino's biographer Rick Coleman, \"When I'm dead and gone a million times, they'll still be playing 'da-da-da-da-dee-dah'\".\n\nNot only was Domino's version a hit, but it was big enough that Louis Armstrong's version of the song was reissued and became a hit as well, and Elvis recorded a soundalike cover, including the piano intro that Domino had come up with, for his film \"Loving You\":\n\n[Excerpt: Elvis Presley, \"Blueberry Hill\"]\n\nThe song was so big that it even revived the career of its co-lyricist, Al Lewis, whose career had been in the doldrums since a run of hits for people like Eddie Cantor in the 1930s. Lewis made a comeback as an R&B songwriter, co-writing songs for Domino himself:\n\n[Excerpt: Fats Domino, \"I'm Ready\"]\n\nAnd for Little Anthony and the Imperials:\n\n[Excerpt: Little Anthony and the Imperials, \"Tears on My Pillow\"]\n\nAs always with a Fats Domino record, we're going to talk about its points of rhythmic interest. The bass-line here is not one that was used on any of the previous versions, but it was common on New Orleans R&B records -- indeed it's very similar to the one Domino used on \"Ain't That a Shame\", which we looked at a few months ago.\n\nThis kind of bassline has some of that Jelly Roll Morton Spanish tinge we've talked about before, when we talked about the tresilo rhythms that Dave Bartholomew brought to the arrangements. But when it's used as a piano bassline, as it is here, it comes indirectly from the boogie woogie pianist Jimmy Yancey:\n\n[Excerpt: Jimmy Yancey, \"How Long Blues\"]\n\nYancey made a speciality of this kind of bassline, but the man who made every New Orleans piano player start playing like that was the great boogie player Meade \"Lux\" Lewis, with his song \"Yancey Special\":\n\n[Excerpt: Meade \"Lux\" Lewis, \"Yancey Special\"]\n\nLewis named that song after Yancey, which caused a problem for him when Sonny Thompson, an R&B bandleader from Chicago, recorded an instrumental with a similar bassline, \"Long Gone\":\n\n[Excerpt: Sonny Thompson, \"Long Gone\"]\n\nThat song went to number one on the R&B charts, and Lewis sued Thompson for copyright infringement, claiming it was too similar to \"Yancey Special\", because it shared the same bassline. The defendants brought out Jimmy Yancey, who said that he'd come up with that bassline long before Lewis had. Lewis didn't help himself in his testimony -- he claimed, at first, that he hadn't named the song after Jimmy Yancey, but later admitted on the stand that the song called \"Yancey Special\" which featured a bassline in the style of Jimmy Yancey had indeed been named after Jimmy Yancey.\n\nThe plagiarism case was thrown out for that reason, but also for two others. One was that the bassline was such a simple idea that it couldn't by itself be copyrightable -- which is something I would question, but I have spoken in great detail about the problems with copyright law as it comes to black American musical creation in the past, and I won't repeat myself here. The other was that by allowing the record of \"Yancey Special\" to come out before he'd registered the copyright, Lewis had dedicated the whole composition to the public domain, and so Thompson could do what he liked with the bassline.\n\nThat bassline became a staple of R&B music, and particularly of New Orleans R&B music. You can hear it, for example, on \"I Hear You Knockin'\", a 1955 hit for Smiley Lewis, arranged by Dave Bartholomew, featuring Huey \"Piano\" Smith playing a very Fats Domino style piano part:\n\n[Excerpt: Smiley Lewis, \"I Hear You Knockin'\"]\n\nDomino had used the bassline in \"Ain't That A Shame\", as well, and it seems to have been taken up by Bartholomew as a signature motif -- he also used it in \"Blue Monday\", another song which he'd written for Smiley Lewis:\n\n[Excerpt: Smiley Lewis, \"Blue Monday\"]\n\nDomino's remake of that song would become his next hit after \"Blueberry Hill\", and almost as big a success.\nWorldwide, \"Blueberry Hill\" was the biggest rock and roll hit of 1956, outdoing even Elvis' \"Hound Dog\" and \"Heartbreak Hotel\" in worldwide chart positions, though none of those songs could beat \"Que Sera Sera\" by Doris Day -- however much our popular image of the 1950s is based on ponytailed bobbysoxers, the fact remains that a sizeable proportion of the record-buying public were older and less inclined to rock than to gently sway, and for all that Domino's shows were inspiring riots wherever he went in 1956, his records were still also appealing to that older crowd.\n\nBut segregation applied here too. \"Blueberry Hill\" made Billboard's top thirty records of the year for country sales in its annual roundup, but it never appeared even on the top one hundred country charts during 1956 itself. We've talked before about how the recent \"Old Town Road\" debacle shows how musical genres are the product of rigid segregation, but nothing shows that more than this. That appearance by Domino in the top thirty sellers for the year was the only appearance by a black artist on any Billboard country charts in the fifties, and it shows that country audiences were buying Domino's records, just as his *lack* of appearance on all the other country charts that year shows that this wasn't being recognised by any of the musical gatekeepers, despite the evident country sensibility in his performance:\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nMeanwhile, of course, Elvis Presley and Carl Perkins were appearing on the R&B charts as well as the country and pop ones.\n\n1956 was the absolute peak of Domino's career in chart terms, and \"Blueberry Hill\" was his biggest hit of that year, but he would carry on having top twenty pop hits until 1962, by which point he had outlasted not only the first wave of rockabilly acts that came up in 1955 and 56, but almost all of the second wave that we're going to see coming up in 1957 as well. His is an immense body of work, and we've barely touched upon it in the three episodes this podcast has devoted to him. His top thirty R&B chart hits span from 1949 through to 1964, a career that covers multiple revolutions in music. When he started having hits, the biggest artists in pop music were Perry Como and the Andrews Sisters, and when he stopped, the Beatles were at the top of the charts.\nDomino was, other than Elvis, the biggest rock and roll star of the fifties by a massive margin. The whole of New Orleans music owes a debt to him, and \"Blueberry Hill\" in particular has been cited as an influence by everyone from Mick Jagger to Leonard Cohen.\n\nYet he is curiously unacknowledged in the popular consciousness, while much lesser stars loom larger. I suspect that part of the reason for that is racism, both in ignoring a black man because he was black, and in ignoring him because he didn't fit white prejudices about black people and the music they make.\n\nOther than drinking a bit too much, and sleeping around a little in the fifties, Domino led a remarkably non-rock-and-roll life. He was married to the same woman for sixty-one years, he rarely left his home in New Orleans, and other than a little friction between songwriting partners you'll struggle to find anyone who had a bad word to say about him. You build a legend as a rock star by shooting your bass player on stage or choking to death on your own vomit, not by not liking to travel because you don't like the food anywhere else, or by being shy but polite, and smiling a lot.\n\nThat's not how you build a reputation for rock and roll excess. But it *is* how you build a body of work that stands up to any artist from the mid-twentieth-century, and how you live a long and happy life. It's how you get the Medal of Arts awarded to you by two Presidents -- George W. Bush awarded Domino with a replacement after he lost his first medal, from Bill Clinton, during Hurricane Katrina. And it's how you become so universally beloved and admired that when your home is destroyed in a hurricane, everyone from Elton John to Doctor John, from Paul McCartney to Robert Plant, will come together to record a tribute album to help raise funds to rebuild it.\n\nFats Domino died in 2017, sixty-eight years after the start of his career, at the age of eighty-nine. His collaborator Dave Bartholomew died in June this year, aged one hundred. They both left behind one of the finest legacies in the histories of rock and roll, rhythm and blues, and New Orleans music.",
  "enclosure": "",
  "itunes:summary": "Episode forty-five of A History of Rock Music in Five Hundred Songs looks at \"Blueberry Hill\" by Fats Domino, and at how the racial tensions of the fifties meant that a smiling, diffident, cheerful man playing happy music ended up starting riots all over the US.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Birmingham Bounce\" by Hardrock Gunter.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called They Call Me The Fat Man: The Legendary Imperial Recordings.\n\nThe biographical information here comes from Rick Coleman's Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll. \n\nThe information about the \"Yancey Special\" bassline and its history comes from \"Before Elvis\", by Larry Birnbaum.\n\nThere have been three previous episodes in which Domino and Bartholomew have featured, including two on Domino songs. See the \"Fats Domino\" tag for those episodes.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\n Transcript\n\nThis is the third episode we're going to do on Fats Domino, and the last one, though he will be turning up in other episodes in various ways. He was the one star from the pre-rock days of R&B to last and thrive, and even become bigger, in the rock and roll era, and he was, other than Elvis Presley, by far the most successful of the first wave of rock and roll stars.\n\nAnd this points to something interesting -- something which we haven't really pointed out as much as you might expect.\n\nBecause of that first wave of rock and rollers, by late 1956 there were only Elvis and the black R&B stars left as rock and roll stars on the US charts. The wave of white rockabilly acts that had hits throughout 1955 and 56 had all fizzled -- Carl Perkins, Gene Vincent, and Bill Haley would between them never have another major hit in the US, though all of them would have success in other countries, and make important music over the next few years. Johnny Cash would have more hits, but he would increasingly be marketed as a country music star.\nIf we're talking about actual rock and roll hits rising to decent positions in the charts, by late 1956 you're looking at acts like Little Richard, Chuck Berry, and Fats Domino, with only Elvis left of the rockabillies.\n\nOf course, very shortly afterwards, there would come a second wave of white rock and rollers, who would permanently change the music, and by the time we get to mid-1957 we'll be in a period where white man with guitar is the default image for rock and roll star, but in late 1956, that default image was a black man with a piano, and the black man with a piano who was selling the most records, by far, was Fats Domino.\n\n[Excerpt: Fats Domino, \"Blueberry Hill\"]\n\nWhen we left Domino, he had just had his breakout rock and roll hit, with \"Ain't That A Shame\". He was so successful that Imperial Records actually put out an album by him, rather than just singles, for the first time in the six years he'd been recording for them. This was a bigger deal than it sounds -- rhythm and blues artists hardly ever put out albums in the fifties. The sales of their records weren't even normally directly to their audiences -- they were to jukebox manufacturers.\n\nSo when Imperial put out an album, that was a sign that something had changed with Domino's audience -- he was selling to white people with money. The black audience, for the most part, were still buying 78s, not even 45s -- they were generally relatively poor, and not the type of people to upgrade their record players while the old ones still worked.\n\n(This is obviously a huge generalisation, but it's true in so far as any generalisations are true.)\n\nMeanwhile, the young white rock and roll audience that had developed all of a sudden between 1954 and 1956 was mostly buying the new 45rpm singles, but at least some of them ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode forty-five of A History of Rock Music in Five Hundred Songs looks at \"Blueberry Hill\" by Fats Domino, and at how the racial tensions of the fifties meant that a smiling, diffident, cheerful man playing happy music ended up starting riots all over the US.\n\nPatreon backers also have a ten-minute bonus episode available, on \"Birmingham Bounce\" by Hardrock Gunter.\n\n\n\nResources\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThe best compilation of Fats Domino's music is a four-CD box set called They Call Me The Fat Man: The Legendary Imperial Recordings.\n\nThe biographical information here comes from Rick Coleman's Blue Monday: Fats Domino and the Lost Dawn of Rock 'n' Roll. \n\nThe information about the \"Yancey Special\" bassline and its history comes from \"Before Elvis\", by Larry Birnbaum.\n\nThere have been three previous episodes in which Domino and Bartholomew have featured, including two on Domino songs. See the \"Fats Dom",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}