{
  "title": "Speculating about assigning probabilities to speculative theories:  Lots of problems here.",
  "link": "https://statmodeling.stat.columbia.edu/2022/10/26/speculating-about-assigning-probabilities-to-speculative-theories-lots-of-problems-here/",
  "comments": "https://statmodeling.stat.columbia.edu/2022/10/26/speculating-about-assigning-probabilities-to-speculative-theories-lots-of-problems-here/#comments",
  "dc:creator": "Andrew",
  "pubDate": "Wed, 26 Oct 2022 13:43:58 +0000",
  "category": "Bayesian Statistics",
  "guid": "https://statmodeling.stat.columbia.edu/?p=47781",
  "description": "Asher Meir writes: Whenever I see theories about ancient stuff I always feel it is very speculative. &#8220;This artifact is a stone ax from a hominid from c. 800,000 BP&#8221;. &#8220;The Samson story in the book of Judges is based &#8230; <a href=\"https://statmodeling.stat.columbia.edu/2022/10/26/speculating-about-assigning-probabilities-to-speculative-theories-lots-of-problems-here/\">Continue reading <span class=\"meta-nav\">&#8594;</span></a>",
  "content:encoded": "<p>Asher Meir writes:</p>\n<blockquote><p>Whenever I see theories about ancient stuff I always feel it is very speculative. &#8220;This artifact is a stone ax from a hominid from c. 800,000 BP&#8221;. &#8220;The Samson story in the book of Judges is based on folk legends about a Hercules-like half-man, half-god figure, but edited to make it conform to a monotheistic worldview&#8221;. To the extent that these conclusions really represent the best understanding of experts, they sound to me like a maximum likelihood estimator when the likelihood function is very flat. In such a case, the most likely of all possible explanations is quite unlikely to be the right one.</p>\n<p>I&#8217;m not really an expert in anthropology or in philology, but when I do look at the professional discussions &#8211; and not only at the conclusions &#8211; I still have the feeling that scholars are trying to weigh one explanation against others and agree which is the most likely of all explanations considered. I don&#8217;t really doubt that they are very good at this, but I&#8217;m not sure they realize how far &#8220;the most likely&#8221; can be from &#8220;likely&#8221;.</p>\n<p>When you have a continuous variable, you can give some kind of confidence interval. You can draw it into your graph with interval bars or whatever. I think it&#8217;s worth thinking about how we could generalize this idea to disjoint theories. It&#8217;s either the humerus of a huge dinosaur or the femur of a smaller one. It&#8217;s either a stone ax or a sharpening tool. Either this ancient narrative took a legend about a superhuman figure and cut him down to human size, or perhaps it took stories about an actual historical hero and talked up his feats. Etc.</p>\n<p>Instead of arguing over which explanation is the correct one &#8211; which as far as I can tell means arguing over which explanation is most likely to be correct &#8211; experts could argue over what probabilities to attach to each explanation. I often feel that when I read something like &#8220;experts agree that this is a dinosaur bone&#8221; it really means something like: &#8220;There is a 40% chance that this is a dinosaur bone, but also a 20% chance it belonged to a hippopotamus and a 10% chance for each of four other, comparatively improbable possibilities, including that it is not ancient at all.&#8221; Which is much more informative.</p></blockquote>\n<p>My reply:  I think it&#8217;s fine to assign such probabilities.  We should just be aware of some difficulties that always seem to arise when we try to do so.</p>\n<p>First, there&#8217;s the political or religious angle.  How can we say that there&#8217;s an essentially zero probability that Moses crossed the Red Sea or that that Mormon dude found gold tablets underground or that God said to Abraham, &#8220;Kill me a son&#8221; or whatever?  For politeness we&#8217;re supposed to either give these sorts of things meaningful probabilities or just somehow avoid talking about them.</p>\n<p>Second, there are all the things that stop people from freely betting on these probabilities:  thin markets, the vig, betting limits that make it difficult to arbitrage, uncertainty in collection, etc.  All of that arises even in bets with outcomes that can be measured (recall some of the implausibly high probabilities implicitly assigned to some outlandish events during the 2020 presidential election). With the dinosaur bone thing it&#8217;s even more difficult because sometimes you can never be sure about the answer.</p>\n<p>The other challenge is how to think about the &#8220;all other possibilities&#8221; option.  Once you include &#8220;all other possibilities&#8221; in the probability tree, you can&#8217;t do any sort of serious Bayesian inference because there&#8217;s no reasonable way to set up a probability model for the data conditional on reality being something not yet considered in the model.</p>\n<p>My usual answer to this last point is to emphasize that all our models are conditional on some assumptions, which is fine, but it&#8217;s counter to the scientific goal of evaluating imperfect hypotheses about the world.  That&#8217;s one reason, perhaps that key reason, that I consider Bayesian inference to be a valuable <em>tool</em> of science but not a good <em>framework</em> for scientific learning</p>\n<p>I use Bayesian inference to learn within models, to evaluate models, and to make decisions, but when I&#8217;m doing science or engineering I don&#8217;t have a sense of working with an overall Bayesian structure.</p>\n<p><strong>P.S.</strong>  Unrelatedly, Meir writes:</p>\n<blockquote><p>I sent my &#8220;Gibbs sampling&#8221; thing to a few people, and it turns out almost none of them understood it. Sampling is a very common technique in rap music where you include a clip from a song, usually an old one, and you overlay it with new vocals, instrumentals etc.  (Go to 1:45 <a href=\"https://www.youtube.com/watch?v=KPV1InMNUf4\">here</a>.) The Bee Gees are the Gibb brothers. (Brothers Gibb.) So a rap song that includes a clip from a Bee Gees song (there are many) is &#8220;Gibbs sampling&#8221;. I thought it was very funny but evidently the Venn diagram of the people who are into the various pieces of this riddle intersects only on me.</p></blockquote>\n",
  "wfw:commentRss": "https://statmodeling.stat.columbia.edu/2022/10/26/speculating-about-assigning-probabilities-to-speculative-theories-lots-of-problems-here/feed/",
  "slash:comments": 54
}