{
  "id": "yt:video:f0gN1x6sVTc",
  "yt:videoId": "f0gN1x6sVTc",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "Who's really using up the water in the American West?",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-09-26T12:00:34+00:00",
  "updated": "2022-10-02T16:14:42+00:00",
  "media:group": {
    "media:title": "Who's really using up the water in the American West?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Hint: water scarcity in the Western US has more to do with our diets than our lawns.\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nThe Western United States is currently battling the most severe drought in thousands of years. A mix of bad water management policies and manmade climate change has created a situation where water supplies in Western reservoirs are so low, states are being forced to cut their water use. \n\nIt’s not hard to find media coverage that focuses on the excesses of residential water use: long showers, swimming pools, lawn watering, at-home car washes. Or in the business sector, like irrigating golf courses or pumping water into hotel fountains in Las Vegas. \n\nBut when a team of researchers looked at water use in the West, they uncovered a very different story about where most Western water goes. Their findings may hold the solution to dwindling water supplies in the West. \n\nCheck out the video above to learn more, and take a look at the study that this story is centered on: https://core.ac.uk/download/pdf/323061602.pdf\n\nLead study author Brian Richter wrote this post on common misconceptions about water scarcity: \nhttps://www.sustainablewaters.org/hey-reporters-lets-get-this-story-straight/\n\nFor Vox coverage on water management policies on the Colorado River, which we weren’t able to cover in this story: \nhttps://www.vox.com/2022/9/23/23357093/colorado-river-drought-cuts\n\nFor coverage on just how bad the current drought is: https://www.nytimes.com/2022/02/14/climate/western-drought-megadrought.html\n\nFor more coverage of the rotational fallowing program in the Palo Verde district in California: https://www.latimes.com/environment/story/2021-10-10/colorado-river-california-farmers-dry-fields-fallow-drought\n\nCheck out Our World in Data for data on meat and dairy production and consumption across the world:  https://ourworldindata.org/meat-production\n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}