{
  "id": "tag:blogger.com,1999:blog-37798047.post-7766669610303791684",
  "published": "2021-07-05T17:15:00.003-04:00",
  "updated": "2021-07-05T17:15:28.711-04:00",
  "title": "Some quick notes on SDR",
  "content": "<p>I'm trying to create perfect screen captures of SDR to explain the world of radio around us. In this blogpost, I'm going to discuss some of the imperfect captures I'm getting, specifically, some notes about WiFi and Bluetooth.</p><p>An SDR is a \"software defined radio\" which digitally samples radio waves and uses number crunching to decode the signal into data. Among the simplest thing an SDR can do is look at a chunk of spectrum and see signal strength. This is shown below, where I'm monitoring part of the famous 2.4 GHz pectrum used by WiFi/Bluetooth/microwave-ovens:</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-LH3C_C2ZCXE/YONmfKoF2bI/AAAAAAAAGpg/Nh-5JRpRWUUjdM1G2ahqpPZ1dUaDOesEwCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"1075\" data-original-width=\"2048\" height=\"168\" src=\"https://lh3.googleusercontent.com/-LH3C_C2ZCXE/YONmfKoF2bI/AAAAAAAAGpg/Nh-5JRpRWUUjdM1G2ahqpPZ1dUaDOesEwCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><p></p><span><a name='more'></a></span><p><br />There are two panes. The top shows the current signal strength as graph. The bottom pane is the \"waterfall\" graph showing signal strength over time, display strength as colors: black means almost no signal, blue means some, and yellow means a strong signal.</p><p>The signal strength graph is a bowl shape, because we are actually sampling at a specific frequency of 2.42 GHz, and the further away from this \"center\", the less accurate the analysis. Thus, the algorithms think there is more signal the further away from the center we are.</p><p>What we do see here is two peaks, at 2.402 GHz toward the left and 2.426 GHz toward the right (which I've marked with the red line). These are the \"Bluetooth beacon\" channels. I was able to capture the screen at the moment some packets were sent, showing signal at this point. Below in the waterfall chart, we see packets constantly being sent at these frequencies.</p><p>We are surrounded by devices giving off packets here: our phones, our watches, \"tags\" attached to devices, televisions, remote controls, speakers, computers, and so on. This is a picture from my home, showing only my devices and perhaps my neighbors. In a crowded area, these two bands are saturated with traffic.</p><p>The 2.4 GHz region also includes WiFi. So I connected to a WiFi access-point to watch the signal.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-SIZAwu6LetQ/YONqQUrIYpI/AAAAAAAAGpo/uEPKG6oplDIB9ui1kLZVmL61CmwwlApVQCLcBGAsYHQ/s2048/Screen%2BShot%2B2021-07-05%2Bat%2B4.21.31%2BPM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1104\" data-original-width=\"2048\" src=\"https://1.bp.blogspot.com/-SIZAwu6LetQ/YONqQUrIYpI/AAAAAAAAGpo/uEPKG6oplDIB9ui1kLZVmL61CmwwlApVQCLcBGAsYHQ/s320/Screen%2BShot%2B2021-07-05%2Bat%2B4.21.31%2BPM.png\" width=\"320\" /></a></div>WiFi uses more bandwidth than Bluetooth. The term \"bandwidth\" is used today to mean \"faster speeds\", but it comes from the world of radio where it quite literally means the width of the band. The width of the Bluetooth transmissions seen above is 2 MHz, the width of the WiFi band shown here is 20 MHz.<div><br /></div><div>It took about 50 screenshots before getting these two. I had to hit the \"capture\" button right at the moment things were being transmitted. And easier way is a setting that graphs the current signal strength compared to the maximum recently seen as a separate line. That's shown below: the instant it was taken, there was no signal, but it shows the maximum of recent signals as a separate line:</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-TH4wwWE-36E/YONrthJKh5I/AAAAAAAAGpw/xo53Z_R9mWoBJ8HZuoXjlkD05BINssGGgCLcBGAsYHQ/s2048/Screen%2BShot%2B2021-07-05%2Bat%2B4.27.54%2BPM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1104\" data-original-width=\"2048\" src=\"https://1.bp.blogspot.com/-TH4wwWE-36E/YONrthJKh5I/AAAAAAAAGpw/xo53Z_R9mWoBJ8HZuoXjlkD05BINssGGgCLcBGAsYHQ/s320/Screen%2BShot%2B2021-07-05%2Bat%2B4.27.54%2BPM.png\" width=\"320\" /></a></div><br /><div>You can see there is WiFi traffic on multiple channels. My traffic is on channel #1 at 2.412 GHz. My neighbor has traffic on channel #6 at 2.437 GHz. Another neighbor has traffic on channel #8 at 2.447 GHz. WiFi splits the spectrum assigned to it into 11 overlapping channels set 5 MHz apart.</div><div><br /></div><div>Now the reason I wanted to take these pictures was to highlight the difference between old WiFi (802.11b) and new WiFi (802.11n). The newer standard uses the spectrum more efficiently. Notice in the picture above how signal strength for a WiFi channel is strongest in the center but gets weaker toward the edges. That means it's not fully using all the band.</div><div><br /></div><div>Newer WiFi uses a different scheme to encode data into radio waves, using all the band given to it. We can see the difference in shape below, when I change from 802.11b to 802.11n:</div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-YEMhJLUBEHc/YONt0BF3BFI/AAAAAAAAGp4/7Mb3Vx7UUWwNIAAEoB7Tzqmo1SEou9ZtgCLcBGAsYHQ/s2048/Screen%2BShot%2B2021-07-05%2Bat%2B4.35.38%2BPM.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1104\" data-original-width=\"2048\" src=\"https://1.bp.blogspot.com/-YEMhJLUBEHc/YONt0BF3BFI/AAAAAAAAGp4/7Mb3Vx7UUWwNIAAEoB7Tzqmo1SEou9ZtgCLcBGAsYHQ/s320/Screen%2BShot%2B2021-07-05%2Bat%2B4.35.38%2BPM.png\" width=\"320\" /></a></div><br /><div>Instead of a curve it's more of a square block. It fills its entire 20 MHz bandwidth instead of only using the center.</div><div><br /></div><div>What we see here is the limits of math and physics, known as the <i>Shannon Limit</i>, that governs the maximum possible speed for something like WiFi (or mobile phone radios like LTE). It's simply the size of that box: its width times its height. The width is measured in frequency, 20 MHz wide. It's height is signal strength measure above the noise floor (which should be straight line across the bottom of our graph, but as I mentioned before, is shown in this SDR by a curved line increasingly inaccurate near the edges).</div><div><br /></div><div>As we move toward faster and faster speeds, we cannot exceed this theoretical limit.</div><div><br /></div><div>One solution is directional antennas, such as the yagi antennas you see on top of houses or satellite dishes. A directional antenna or dish means getting a stronger signal with less noise -- thus, increasing the \"height\" of the box.</div><div><br /></div><div>The same effect can be achieved with something called \"phased arrays\", using multiple antennas that transmit/receive at (very) slightly different times, such that waves they produce reinforce each other in one direction but cancel each other out in other directions. This is how SpaceX \"Starlink\" space-based Internet works. The low Earth orbit satellites whizzing by overhead travel too fast to keep an antenna pointed at them, so their antenna is a phases array instead. The antennas are fixed, but the timing is slightly altered to aim the beam toward the satellite.</div><div><br /></div><div>What's even more interesting is MIMO: receiving different signals on different antennas. With fancy circuits and math, doubling the number of antennas doubles the effective bandwidth.</div><div><br /></div><div>The latest mobile phones and WiFi use MIMO and phases arrays to increase bandwidth.</div><div><br /></div><div>But mostly, higher frequencies give more bandwidth. That's why WiFi at 5 GHz is better -- bands are a minimum of 40 MHz (instead of 20 MHz as in 2.4 GHz WiFi), are more commonly 80 MHz, and can go up to 160 MHz.</div><div><br /></div><div>Anyway, these are more imperfect picture I'm creating to explain WiFi and Bluetooth. At some point in the time, I'll be generating more perfect ones.</div><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 2
}