{
  "title": "Why Is Death All Around Us? | Best of RGSO",
  "link": "https://audioboom.com/posts/8077180",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1939,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Was something else at play, when a series of deaths seemed to follow a single soul.<br>\nHere is a preview of the story.<br>\n“Following his death, we had 3 other family members die that year. It felt like death was all around us in 2004. In fact, every leap year does this to us, but that’s another story for another day. However, it seems the entire world experienced our leap year curse last year. One day in September, we were tired of mourning and needed something to celebrate. What better than my brother and my dad whose birthdays were one day apart. This was going to be the first event that my uncle’s family was going to join us for, and my grandma wanted everything to be perfect. I was enlisted to make this happen as I was my grandma’s best and most loyal helper. I loved my grandma to death, and I should have felt lucky that I was the only person she trusted to get her house in order, and I would give anything to spend that time with her again, but at the time it felt like a burden. I was probably out of gas, or my mom had to come by to wake me up or something, I can’t remember, but my mom drove me to my grandma’s house.”<br>\n<br>\n\n</div>\n<div>Watch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\n\n</div>\n<div>If you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Thu, 12 May 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-05-03:/posts/8077180",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}