{
  "title": "What Story Will This Election Tell Us?",
  "description": "With less than 36 hours to go until the final voting deadline for the midterm elections, it's important to know what's at stake. Amy Walter, a host on The Takeaway and National Editor of the Cook Political Report, knows that each election tells us a story and this one is no different. She joined us today to talk about what signals and trends she's looking out for and what that means for our future as a country and how we understand ourselves.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "pubDate": "Mon, 05 Nov 2018 23:25:00 -0000",
  "itunes:episodeType": "full",
  "itunes:author": "Slate Podcasts",
  "itunes:subtitle": "What signals and trends should you be on the look out for and what will that tell us about how we understand ourselves as a country?",
  "itunes:summary": "With less than 36 hours to go until the final voting deadline for the midterm elections, it's important to know what's at stake. Amy Walter, a host on The Takeaway and National Editor of the Cook Political Report, knows that each election tells us a story and this one is no different. She joined us today to talk about what signals and trends she's looking out for and what that means for our future as a country and how we understand ourselves.\nLearn more about your ad choices. Visit megaphone.fm/adchoices",
  "content:encoded": "<p>With less than 36 hours to go until the final voting deadline for the midterm elections, it's important to know what's at stake. Amy Walter, a host on <a href=\"https://www.wnycstudios.org/shows/takeaway/amy_walter\"><em>The Takeaway</em></a> and National Editor of the Cook Political Report, knows that each election tells us a story and this one is no different. She joined us today to talk about what signals and trends she's looking out for and what that means for our future as a country and how we understand ourselves.</p><p> </p><p>Learn more about your ad choices. Visit <a href=\"https://megaphone.fm/adchoices\">megaphone.fm/adchoices</a></p>",
  "itunes:duration": 1072,
  "guid": "c80b8170-c8c8-11e8-9534-07e0ffcfa648",
  "enclosure": ""
}