{
  "title": "PointSee: Image Enhances Point Cloud. (arXiv:2211.01664v1 [cs.CV])",
  "link": "http://arxiv.org/abs/2211.01664",
  "description": "<p>There is a trend to fuse multi-modal information for 3D object detection\n(3OD). However, the challenging problems of low lightweightness, poor\nflexibility of plug-and-play, and inaccurate alignment of features are still\nnot well-solved, when designing multi-modal fusion newtorks. We propose\nPointSee, a lightweight, flexible and effective multi-modal fusion solution to\nfacilitate various 3OD networks by semantic feature enhancement of LiDAR point\nclouds assembled with scene images. Beyond the existing wisdom of 3OD, PointSee\nconsists of a hidden module (HM) and a seen module (SM): HM decorates LiDAR\npoint clouds using 2D image information in an offline fusion manner, leading to\nminimal or even no adaptations of existing 3OD networks; SM further enriches\nthe LiDAR point clouds by acquiring point-wise representative semantic\nfeatures, leading to enhanced performance of existing 3OD networks. Besides the\nnew architecture of PointSee, we propose a simple yet efficient training\nstrategy, to ease the potential inaccurate regressions of 2D object detection\nnetworks. Extensive experiments on the popular outdoor/indoor benchmarks show\nnumerical improvements of our PointSee over twenty-two state-of-the-arts.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Gu_L/0/1/0/all/0/1\">Lipeng Gu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Yan_X/0/1/0/all/0/1\">Xuefeng Yan</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cui_P/0/1/0/all/0/1\">Peng Cui</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gong_L/0/1/0/all/0/1\">Lina Gong</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Xie_H/0/1/0/all/0/1\">Haoran Xie</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wang_F/0/1/0/all/0/1\">Fu Lee Wang</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Qin_J/0/1/0/all/0/1\">Jin Qin</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Wei_M/0/1/0/all/0/1\">Mingqiang Wei</a>"
}