{
  "title": "The outcome of NYC polls to affect the future of New Yorkers",
  "link": "https://www.vosa.tv/archives/27344",
  "comments": "https://www.vosa.tv/archives/27344#respond",
  "dc:creator": "World News",
  "pubDate": "Wed, 02 Nov 2022 16:30:20 +0000",
  "category": [
    "New York",
    "Opinion",
    "US",
    "World"
  ],
  "guid": "https://www.vosa.tv/?p=27344",
  "description": "<p>New York: New York City Election is going to take place on Tuesday, November 8th. This election is dubbed as ‘critical’ and the ‘last’ chance to join millions of New Yorkers in making their voices heard and cast their ballots. The outcome of these elections will affect the future of New Yorkers, their economy, education, &#8230;</p>\n<p>The post <a href=\"https://www.vosa.tv/archives/27344\">The outcome of NYC polls to affect the future of New Yorkers</a> first appeared on <a href=\"https://www.vosa.tv\">VOSA</a>.</p>",
  "content:encoded": "<p><strong>New York: New York City Election is going to take place on Tuesday, November 8<sup>th</sup>. This election is dubbed as ‘critical’ and the ‘last’ chance to join millions of New Yorkers in making their voices heard and cast their ballots. The outcome of these elections will affect the future of New Yorkers, their economy, education, healthcare, and more.</strong></p>\n<p>The polls will be open from 6:00 am to9:00 pm. People who can’t vote on Tuesday can also vote early in person! Early voting polls will be open through Sunday, November 6<sup>th</sup>, as per the NYC government. Your poll site may have changed, so it’s important to check your poll site location and its hours before you vote at <a href=\"http://nycvotes.org/\">nycvotes.org</a>.</p>\n<p>This year, voting is more important than ever. In every single race, your vote matters – from the Governor and Attorney General to your Congress people and state representatives. We’re deciding who will lead the state into the future, and what kind of future New Yorkers want for our state. Also, four ballot proposals are on the back of your ballot, so remember to flip yours over. All U.S. citizens aged 18 and older who have registered are eligible to vote. Millions of New Yorkers in going to the polls and getting the change they want to see done. Those who are not currently registered to vote can register for next year’s election on that website as well. All New Yorkers have the right to vote in their language. You may bring an interpreter to the voting booth—it can be a friend, a family member or a poll worker, but it can&#8217;t be your employer or union representative.</p>\n<p>The Civic Engagement Commission has said that it will be providing interpretation services in select languages and poll sites on Saturday, November 5th, and Sunday, November 6<sup>th</sup>, and on Election Day, Tuesday, November 8th. Our democracy relies on individuals with different opinions coming together to find solutions. Voting is one crucial way we do this, and having discussions with each other is another. Recently, the Administration held a summit on criminal justice. It brought experienced defense lawyers, judges, district attorneys, advocates, and law enforcement officials together in search of solutions to a goal we all share: keeping New Yorkers safe and ensuring justice for all. There is a lot that this group disagrees on, and each individual groups will keep pursuing their individual goals.</p>\n<p>But there is also much we agree on. Both public safety and justice are prerequisites to prosperity, and we need to do a better job on both. No one should be afraid of crime on the subway, and no one accused of committing a crime should have to wait for months to get a hearing. The discussion helped participants find common ground on important improvements to the system, and over the coming weeks and months, more conversations and turning are expected for actionable solutions that will make New York a safer city. Working toward a more perfect city and country is never easy. It takes all of us engaging in good faith conversation, expressing our views, and casting our ballots. See you at the polls on Tuesday.</p><p>The post <a href=\"https://www.vosa.tv/archives/27344\">The outcome of NYC polls to affect the future of New Yorkers</a> first appeared on <a href=\"https://www.vosa.tv\">VOSA</a>.</p>",
  "wfw:commentRss": "https://www.vosa.tv/archives/27344/feed",
  "slash:comments": 0,
  "post-id": 27344
}