{
  "title": "A study linking patient EHR data to external death data at Stanford Medicine. (arXiv:2211.01488v1 [cs.DB])",
  "link": "http://arxiv.org/abs/2211.01488",
  "description": "<p>This manuscript explores linking real-world patient data with external death\ndata in the context of research Clinical Data Warehouses (r-CDWs). We\nspecifically present the linking of Electronic Health Records (EHR) data for\nStanford Health Care (SHC) patients and data from the Social Security\nAdministration (SSA) Limited Access Death Master File (LADMF) made available by\nthe US Department of Commerce's National Technical Information Service (NTIS).\n</p>\n<p>The data analysis framework presented in this manuscript extends prior\napproaches and is generalizable to linking any two cross-organizational\nreal-world patient data sources. Electronic Health Record (EHR) data and NTIS\nLADMF are heavily used resources at other medical centers and we expect that\nthe methods and learnings presented here will be valuable to others. Our\nfindings suggest that strong linkages are incomplete and weak linkages are\nnoisy i.e., there is no good linkage rule that provides coverage and accuracy.\nFurthermore, the best linkage rule for any two datasets is different from the\nbest linkage rule for two other datasets i.e., there is no generalization of\nlinkage rules. Finally, LADMF, a commonly used external death data resource for\nr-CDWs, has a significant gap in death data making it necessary for r-CDWs to\nseek out more than one external death data source. We anticipate that\npresentation of multiple linkages will make it hard to present the linkage\noutcome to the end user.\n</p>\n<p>This manuscript is a resource in support of Stanford Medicine STARR (STAnford\nmedicine Research data Repository) r-CDWs. The data are stored and analyzed as\nPHI in our HIPAA-compliant data center and are used under research and\ndevelopment (R&amp;D) activities of STARR IRB.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Peralta_A/0/1/0/all/0/1\">Alvaro Andres Alvarez Peralta</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Desai_P/0/1/0/all/0/1\">Priya Desai</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Datta_S/0/1/0/all/0/1\">Somalee Datta</a>"
}