{
  "title": "Bullard Discusses Policy Rate Increases and U.S. Inflation",
  "link": "https://fedinprint.org/item/fedlps/94874",
  "description": "St. Louis Fed President Jim Bullard discussed the pace of increases in the Fed’s policy rate and the impact on inflation. He made the comments during a virtual discussion at an HSBC Global Emerging Markets Forum.\n\nBullard said the U.S. inflation rate was way above the Federal Open Market Committee’s 2% target, which is why the FOMC has moved aggressively to raise its policy rate. He also pointed to forecasts made by FOMC members in September’s Summary of Economic Projections that suggest additional moves in the policy rate this year.\n\n“We’re hopeful that by acting sooner and with transparency and with clear communication that we’ll be able to get inflation down now, as opposed to the 1970s where inflation at these levels lingered for 15 years or so,” he said.\n\nMarkets and policymakers are coming around to the view that inflation will take a while to go back to 2%, Bullard said, adding that inflation probably won’t fall in a straight line. These factors seem to indicate higher policy rates for longer than markets might have thought even a year ago, he said. Since labor markets remain strong, this is a good time to try to get inflation under control, he noted.\n\nBullard was asked whether the Fed’s 2% inflation target should be adjusted higher. The notion of changing the target when the Fed is challenged by high inflation sounds like a replay of the 1970s, he said, adding that “this is just a totally bad idea.”\n\n“I know people are talking about that, but we'll maintain credibility of the inflation target, we will push inflation to 2%, and we'll do it in a reasonably compact time frame,” he said.\n\nBullard noted the steady reduction in the Fed’s balance sheet, which started in the second quarter, is hitting full stride in September. He said his preference is to wait and see on the balance sheet runoff to determine how things were developing.\n\nBullard emphasized that other central banks around the world are reducing their balance sheets as well and that he’ll be keeping an eye on how this global quantitative tightening affects global financial conditions.\n\nIn addition, Bullard said he believes that the rise in interest rates alone isn’t enough to cause a recession in the U.S., and that a recession instead would be caused by a shock. “I think we're at higher recession risk, but I don't think that's the base case at this point,” he said.",
  "guid": "https://fedinprint.org/item/fedlps/94874",
  "dc:creator": "Bullard, James B.",
  "dc:date": "2022-09-29",
  "dc:subject": "policy rate; inflation",
  "bibo:series": "Speech"
}