{
  "title": "Episode #345: Soon To Be Unemployed?",
  "link": "https://www.krpoliticaljunkie.com/episode-345/",
  "pubDate": "Thu, 10 Sep 2020 09:55:32 +0000",
  "guid": "https://www.krpoliticaljunkie.com/?p=17671",
  "description": "<p>Ron Elving analyzes the state of the presidential race with less than eight weeks to go. Plus, could Minnesota, which hasn&#039;t voted for a Republican presidential candidate since 1972, flip to Donald Trump this year? And we break down the battle for control of the Senate.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com/episode-345/\">Episode #345: Soon To Be Unemployed?</a> appeared first on <a rel=\"nofollow\" href=\"https://www.krpoliticaljunkie.com\">Ken Rudin&#039;s Political Junkie</a>.</p>",
  "enclosure": "",
  "itunes:subtitle": "Ron Elving analyzes the state of the presidential race with less than eight weeks to go. Plus, could Minnesota, which hasn&#039;t voted for a Republican presidential candidate since 1972, flip to Donald Trump this year?",
  "itunes:summary": "And they&#8217;re off!  With less than eight weeks to go, and early voting starting even sooner, President Trump and challenger Joe Biden have begun their battle in earnest for the White House.  NPR&#8217;s Ron Elving talks about what&#8217;s at stake, both for the candidates and the nation.<br />\nOne state that has rarely gotten a second look in November is Minnesota, which hasn&#8217;t voted for a Republican since Richard Nixon in 1972.  But David Schultz of Hamline University says that with strong pockets of conservative strength in the state added to a backlash in the aftermath of the George Floyd demonstrations and looting, Donald Trump has a chance to end the GOP losing streak.<br />\nAnd just as the presidential race is tightening, so is the battle for control of the Senate.  Jessica Taylor of the Cook Report says Democrats have a shot at winning enough seats to attain the majority, but only if everything falls into place.  And there&#8217;s no guarantee of that.<br />\nMusic used in the podcast:<br />\nGenerals and Majors by XTC<br />\nNot to Touch the Earth by The Doors<br />\nStrange by R.E.M.<br />\nMy Old Kentucky Home, Goodnight by John Prine<br />\nFire Down Below by Bob Seger<br />",
  "itunes:author": "Ken Rudin",
  "itunes:image": "",
  "itunes:episode": 345,
  "itunes:title": "Soon To Be Unemployed?",
  "itunes:duration": "59:45"
}