{
  "title": "Processing and processing.js tips and tricks in WordPress",
  "link": "",
  "published": "2015-01-05T00:12:00-08:00",
  "updated": "2015-01-05T00:12:00-08:00",
  "author": {
    "name": "Dustin McIntosh"
  },
  "id": "tag:efavdb.com,2015-01-05:/processing-and-processing-js-tips-and-tricks",
  "summary": "<p>We recently developed our <a href=\"http://efavdb.github.io/nba-dash\"><span class=\"caps\">NBA</span> dashboard</a> in the programming language Processing. In addition, we have Processing apps in our post on <a href=\"http://efavdb.github.io/methods-regression-without-negative-examples\">classification without negative examples</a> as well as our <a href=\"http://efavdb.github.io/weekly-nba-predictions\">weekly <span class=\"caps\">NBA</span> predictions</a>. Here, we will briefly describe (and recommend) Processing and discuss some tips and tricks we have discovered in …</p>",
  "content": "<p>We recently developed our <a href=\"http://efavdb.github.io/nba-dash\"><span class=\"caps\">NBA</span> dashboard</a> in the programming language Processing. In addition, we have Processing apps in our post on <a href=\"http://efavdb.github.io/methods-regression-without-negative-examples\">classification without negative examples</a> as well as our <a href=\"http://efavdb.github.io/weekly-nba-predictions\">weekly <span class=\"caps\">NBA</span> predictions</a>. Here, we will briefly describe (and recommend) Processing and discuss some tips and tricks we have discovered in developing and deploying our above-mentioned apps to our WordPress&nbsp;blog.</p>\n<p><a href=\"http://twitter.com/efavdb\">Follow&nbsp;@efavdb</a></p>\n<p>Follow us on twitter for new submission&nbsp;alerts!</p>\n<p><strong>Processing&nbsp;Intro</strong></p>\n<p>Your browser does not support the canvas&nbsp;tag.</p>\n<p>JavaScript is required to view the contents of this&nbsp;page.</p>\n<p>Processing is a high-level language built on top of java designed for producing neat interactive visualizations of ideas, data, and art.  A major benefit of Processing is that it is extremely accessible (see for example, <a href=\"http://it-ebooks.info/book/244/\">this ebook</a> by <a href=\"http://reas.com/\">Reas</a>and <a href=\"http://benfry.com/\">Fry</a>): while it can now be used to produce considerably sophisticated visualizations, it was originally developed as a tool for teaching programming to people with little to no experience with computers (e.g., visual arts students). The little guy above is an example of a processing app. You can find the (remarkably simple) code for it <a href=\"https://efavdb.com/wp-content/uploads/sketches/testSketch2/testSketch2.pde\">here</a> (we found this example in <a href=\"http://processingjs.org/articles/p5QuickStart.html\">this tutorial</a>).</p>\n<p>For people with technical backgrounds, you can be up and developing basic programs in a matter of hours (or perhaps even minutes). Here, our programming language of choice is typically Python and, fortunately, the people at Processing recently implemented <a href=\"http://py.processing.org\">Python-mode</a> which made our transition all the more smooth (see Quirks below before you get too excited about this, however).  In just a couple of days we were able to build a quick prototype of our tool. Porting it to the web, however, we found to be a bit more&nbsp;difficult.</p>\n<p><strong>Processing in WordPress&nbsp;Tutorial</strong></p>\n<p>We spent some time trying to figure out how to get everything working in WordPress. We thought it would be useful to outline the steps below for others interested in getting some Processing-based dynamic content on their own blog. In the end it is very straight forward, but getting some more advanced features of Processing (e.g., importing external images or data files) to work on the web requires some tricks which we will tackle in the next&nbsp;section.</p>\n<p>1.  <a href=\"http://processingjs.org/download/\">Download</a> the processing.js script and put it on your server.  This script defines a &#8220;canvas&#8221; element where your Processing code is executed on your&nbsp;webpage.</p>\n<p>​2. In your theme&#8217;s header file (header.php), add the following line of code to the body of the file (after <body> and before </body>), changing the url to point to the script from step&nbsp;1:</p>\n<div class=\"highlight\"><pre><span></span><span class=\"x\">&lt;script src=&quot;url_to_processing.js&quot; type=&quot;text/javascript&quot;&gt;&lt;/script&gt;</span>\n</pre></div>\n\n\n<p>You can change this file using your dashboard in the Appearance - Editor menu, selecting &#8220;Header (header.php)&#8221; for the Template (see this screenshot - the first line is a comment).\n<a href=\"https://efavdb.com/wp-content/uploads/2014/12/WordPressHeader.png\"><img alt=\"\" src=\"https://efavdb.com/wp-content/uploads/2014/12/WordPressHeader.png\"></a></p>\n<p>​3. Upload your pde script(s) to your server and they can be referenced using code like the following (replace the urls to point to your pde&nbsp;scripts):</p>\n<div class=\"highlight\"><pre><span></span><span class=\"x\">&lt;canvas id=&quot;testsketch&quot; class=&quot;alignright&quot; data-processing-sources=</span>\n<span class=\"x\">&quot;{static}/wp-content/uploads/sketches/testSketch2/testSketch2.pde</span>\n<span class=\"x\">additional_url.pde  yet_another_url.pde&quot;&gt;</span>\n<span class=\"x\">Your browser does not support the canvas tag.&lt;/canvas&gt;</span>\n<span class=\"x\">&lt;noscript&gt;JavaScript is required to view the contents of this page.</span>\n<span class=\"x\">&lt;/noscript&gt;</span>\n</pre></div>\n\n\n<p>You simply place this code in the &#8220;text&#8221; view of any post or page in WordPress. Note that you don&#8217;t need to have multiple pde scripts, in most simple cases you will only have one.  However, sometimes it is useful to call on multiple (see below quirk #3). To include multiple, simply place multiple urls (separated by spaces) between the quotes in the canvas&nbsp;tag.</p>\n<p>​4. Enjoy! Wasn&#8217;t that simple? Now you can mess around and create all sorts of cool, dynamic apps for your&nbsp;blog.</p>\n<p><strong>Running list of processing quirks and&nbsp;tips\n</strong></p>\n<p>​1) It took us a while to come to the conclusion that there is, currently, no easy way to get Python-mode Processing code on the web (please let us know if we are wrong about that&#8230;).  We ended up translating our Processing code from Python syntax to Javascript syntax and using <a href=\"http://processingjs.org/\">processing.js</a> (as implied in our tutorial&nbsp;above).</p>\n<p>​2) In order to load images for display in your app (if applicable), you will have to use the <a href=\"http://processingjs.org/reference/preload/\">preload directive</a> in your pde script.  This comes in the form a of a comment at the top of the script: <em>/</em> @pjs preload=&#8221;url_to_myimage.jpg&#8221;; <em>/</em>. The &#8220;@pjs&#8221; tags this comment for processing.js to read and execute before the rest of the script runs.  It forces the browser to complete downloading and caching of the image before attempting to use&nbsp;it.</p>\n<p>​3) We could not figure out a clean way of importing data from an external file (e.g., in csv or txt format).  Instead, we found that saving the external data in Javascript format in a separate pde file and running that file in addition to your main script (see step 3 from the tutorial above) worked well. As an example, <a href=\"http://efavdb.com/wp-content/uploads/nba/completed.pde\">here</a> is a pde file that we use to feed in the results of <span class=\"caps\">NBA</span> games that have already been played this season into our <span class=\"caps\">NBA</span> dashboard. We scrape this data off the web and run a preprocessing python script to get the data in this format and save the completed.pde&nbsp;file.</p>\n<p>​4) As a security precaution, many browsers (e.g., Chrome) won’t run a sketch that links to images or data stored on a separate server. As a consequence, when developing a sketch on your computer that links to data on your server, it may appear to not be working, even if coded properly. It&#8217;s easy to misinterpret this issue as a bug, so keep it in mind. One way to avoid this is to try running your sketch in other browsers. Regardless, once a sketch is uploaded to your server, the sketch should work fine on any&nbsp;browser.</p>\n<p><a href=\"https://efavdb.com/wp-content/uploads/2014/12/mouseDisplacement.png\"><img alt=\"\" src=\"https://efavdb.com/wp-content/uploads/2014/12/mouseDisplacement.png\"></a> 5) Interestingly, when logged in to WordPress, we have found that the Processing apps work, but function as if the mouse were several pixels lower than it actually is. This symptom is only apparent when logged in to WordPress and viewing the page (see example screenshot at&nbsp;right).</p>\n<p>​6) Processing has two rendering modes, <a href=\"https://www.processing.org/reference/smooth_.html\">smooth</a> and not smooth. I believe the latter requires less memory to implement, and that this is why it exists. We prefer smooth drawing, and tried to implement this from the start. However, we recently discovered that if you apply coordinate transformations in your processing sketch (translations or rotations), the program forces back to the not smooth mode. This came as a surprise to us, since it&#8217;s not mentioned in any of the basic documentation. Our original <a href=\"http://efavdb.github.io/nba-dash\"><span class=\"caps\">NBA</span> wheel sketch</a> made use of a translation; we&#8217;ve reimplemented that without it, and see a marked aesthetic&nbsp;improvement.</p>\n<p>​7) We noticed that running our first <a href=\"http://efavdb.github.io/nba-dash\"><span class=\"caps\">NBA</span> wheel sketch</a> would often cause a laptop to quickly heat up. This was due to the fact that we were having the sketch refresh with a frame rate of about 30 hz, which is totally unnecessary for this particular application. Changing the draw program so that the image refreshes only when some new information is requested totally fixed our heating&nbsp;issues.</p>",
  "category": [
    "",
    "",
    ""
  ]
}