{
  "title": "U.N. Kills Any Plans to Use Mercury as a Rocket Propellant",
  "link": "https://spectrum.ieee.org/mercury-ion-thruster-banned",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/variously-sized-drops-of-a-silver-liquid-metal-beading-up-on-a-red-background.jpg?id=29686005&width=1500&height=2000&coordinates=546%2C0%2C547%2C0\"/><br/><br/><p>A recent United Nations provision has banned the use of mercury in spacecraft propellant. Although no private company has actually used mercury propellant in a launched spacecraft, the possibility was alarming enough—and the dangers extreme enough—that the ban was enacted just a few years after one U.S.-based startup began toying with the idea. Had the company gone through with its intention to sell mercury propellant thrusters to some of the companies building massive satellite constellations over the coming decade, it would have resulted in Earth’s upper atmosphere being laced with mercury.</p><p>Mercury is a neurotoxin. It’s also bio-accumulative, which means it’s absorbed by the body at a faster rate than the body can remove it. The most common way to get mercury poisoning is through eating contaminated seafood. “It’s pretty nasty,” says Michael Bender, the international coordinator of the <a href=\"https://www.linkedin.com/in/michael-t-bender-45ab8a1a\" target=\"_blank\">Zero Mercury Working Group</a> (ZMWG). “Which is why this is one of the very few instances where the governments of the world came together pretty much unanimously and ratified a treaty.”</p><p>Bender is referring to the 2013 <a href=\"https://www.mercuryconvention.org/en\" rel=\"noopener noreferrer\" target=\"_blank\">Minamata Convention on Mercury</a>, a U.N. treaty named for a city in Japan <a href=\"https://news.un.org/en/story/2021/10/1103842\" rel=\"noopener noreferrer\" target=\"_blank\">whose residents suffered from mercury poisoning</a> from a nearby chemical factory for decades. Because mercury pollutants easily find their way into the oceans and the atmosphere, it’s virtually impossible for one country to prevent mercury poisoning within its borders. “Mercury—it’s an intercontinental pollutant,” Bender says. “So it required a global treaty.”</p><p>Today, the only remaining permitted uses for mercury are in fluorescent lighting and dental amalgams, and even those are being phased out. Mercury is otherwise found as a by-product of other processes, such as the burning of coal. But then a company hit on the idea to use it as a spacecraft propellant.</p><p>In 2018, an employee at Apollo Fusion approached the Public Employees for Environmental Responsibility (PEER), a nonprofit that investigates environmental misconduct in the United States. The employee—who has remained anonymous—alleged that the Mountain View, Calif.–based space startup was planning to build and sell thrusters that used mercury propellant to multiple companies building low Earth orbit (LEO) satellite constellations.</p><p><a href=\"https://www.bloomberg.com/news/articles/2018-11-19/this-space-startup-could-lace-the-atmosphere-with-toxic-mercury\" rel=\"noopener noreferrer\" target=\"_blank\">Four industry insiders ultimately confirmed</a> that Apollo Fusion was building thrusters that utilized mercury propellant. Apollo Fusion, which <a href=\"https://astra.com/news/astra-acquires-apollo-fusion-to-reach-new-orbits/\" rel=\"noopener noreferrer\" target=\"_blank\">was acquired by rocket manufacturing startup Astra in June 2021</a>, insisted that the composition of its propellant mixture should be considered <a href=\"https://fcc.report/ELS/Astro-Digital-US-Inc/0330-EX-CN-2019/228069\" rel=\"noopener noreferrer\" target=\"_blank\">confidential information</a>. The company withdrew its plans for a mercury propellant in April 2021. Astra declined to respond to a request for comment for this story.</p><p>Apollo Fusion wasn’t the first to consider using mercury as a propellant. NASA originally tested it in the 1960s and 1970s with two <a href=\"https://www.nasa.gov/centers/glenn/about/history/sert.html\" target=\"_blank\">Space Electric Propulsion Tests</a> (SERT), one of which was <a href=\"https://arc.aiaa.org/doi/abs/10.2514/3.25512?journalCode=jsr\" target=\"_blank\">sent into orbit in 1970</a>. Although the tests demonstrated mercury’s effectiveness as a propellant, the same concerns over the element’s toxicity that have seen it banned in many other industries halted its use by the space agency as well.</p><p>“I think it just sort of fell off a lot of folks’ radars,” says <a href=\"https://peer.org/author/kevin-bell/\" target=\"_blank\">Kevin Bell</a>, the staff counsel for PEER. “And then somebody just resurrected the research on it and said, ‘Hey, other than the environmental impact, this was a pretty good idea.’ It would give you a competitive advantage in what I imagine is a pretty tight, competitive market.”</p><p>That’s presumably why Apollo Fusion was keen on using it in their thrusters. Apollo Fusion as a startup emerged more or less simultaneously with the rise of <a href=\"https://spectrum.ieee.org/amazons-project-kuiper-is-more-than-the-companys-response-to-spacex\" target=\"_self\">massive LEO constellations</a> that use hundreds or thousands of satellites in orbits below 2,000 kilometers to provide continual low-latency coverage. Finding a slightly cheaper, more efficient propellant for one large geostationary satellite doesn’t move the needle much. But doing the same for thousands of satellites that <a href=\"https://arstechnica.com/information-technology/2017/10/spacex-and-oneweb-broadband-satellites-raise-fears-about-space-debris/\" rel=\"noopener noreferrer\" target=\"_blank\">need to be replaced every several years</a>? That’s a much more noticeable discount.</p><p>Were it not for mercury’s extreme toxicity, it would actually make an extremely attractive propellant. Apollo Fusion wanted to use a type of ion thruster called a Hall-effect thruster. Ion thrusters strip electrons from the atoms that make up a liquid or gaseous propellant, and then an electric field pushes the resultant ions away from the spacecraft, generating a modest thrust in the opposite direction. The physics of rocket engines means that the performance of these engines increases with the mass of the ion that you can accelerate.</p><p>Mercury is heavier than either xenon or krypton, the most commonly used propellants, meaning more thrust per expelled ion. It’s also liquid at room temperature, making it efficient to store and use. And it’s cheap—there’s not a lot of competition with anyone looking to buy mercury.</p><p>Bender says that ZMWG, alongside PEER, caught wind of Apollo Fusion marketing its mercury-based thrusters to at least three companies deploying LEO constellations—One Web, Planet Labs, and SpaceX. Planet Labs, an Earth-imaging company, has <a href=\"https://www.planet.com/pulse/planets-first-launch-of-2020-26-superdoves-on-a-vega/\" rel=\"noopener noreferrer\" target=\"_blank\">at least 200 CubeSats</a> in low Earth orbit. One Web and SpaceX, both wireless-communication providers, have many more. One Web plans to have <a href=\"https://oneweb.net/resources/oneweb-secures-investment-softbank-and-hughes-network-systems\" rel=\"noopener noreferrer\" target=\"_blank\">nearly 650 satellites</a> in orbit by the end of 2022. SpaceX already has nearly 1,500 active satellites aloft in its Starlink constellation, with an eye toward <a href=\"https://fortune.com/2022/02/10/spacex-starlink-satellites-solar-storm-lost-elon-musk-internet/\" rel=\"noopener noreferrer\" target=\"_blank\">deploying as many as <em>30,000</em> satellites</a> before its constellation is complete. Other constellations, like Amazon’s Kuiper constellation, are also planning to deploy thousands of satellites.</p><p>In 2019, a group of researchers in Italy and the United States <a href=\"https://iopscience.iop.org/article/10.1088/1748-9326/ab4b75\" rel=\"noopener noreferrer\" target=\"_blank\">estimated how much of the mercury used in spacecraft propellant</a> might find its way back into Earth’s atmosphere. They figured that a hypothetical LEO constellation of 2,000 satellites, each carrying 100 kilograms of propellant, would emit 20 tonnes of mercury every year over the course of a 10-year life span. Three quarters of that mercury, the researchers suggested, would eventually wind up in the oceans.</p><p>That amounts to 1 percent of global mercury emissions from a constellation only a fraction of the size of the one planned by SpaceX alone. And if multiple constellations adopted the technology, they would represent a significant percentage of global mercury emissions—especially, the researchers warned, as other uses of mercury are phased out as planned in the years ahead.</p><p>Fortunately, it’s unlikely that any mercury propellant thrusters will even get off the ground. Prior to the fourth meeting of the Minamata Convention, Canada, the European Union, and Norway highlighted the dangers of mercury propellant, alongside ZMWG. The provision to ban mercury usage in satellites <a href=\"https://peer.org/un-bans-mercury-satellite-propellants-under-new-minamata-treaty-provisions/\" rel=\"noopener noreferrer\" target=\"_blank\">was passed on 26 March 2022</a>.</p><p>The question now is enforcement. “Obviously, there aren’t any U.N. peacekeepers going into space to shoot down” mercury-based satellites, says Bell. But the 137 countries, including the United States, who are party to the convention have pledged to adhere to its provisions—including the propellant ban.</p><p>The United States is notable in that list because as Bender explains, it did not ratify the Minamata Convention via the U.S. Senate but instead deposited with the U.N. an instrument of acceptance. In a <a href=\"https://www.unep.org/news-and-stories/press-release/global-treaty-mercury-pollution-gets-boost-united-states\" rel=\"noopener noreferrer\" target=\"_blank\">7 November 2013 statement</a> (about one month after the original Minamata Convention was adopted), the U.S. State Department said the country would be able to fulfill its obligations “under existing legislative and regulatory authority.”</p><p>Bender says the difference is “weedy” but that this appears to mean that the U.S. government has agreed to adhere to the Minamata Convention’s provisions because it already has similar laws on the books. Except there is still no existing U.S. law or regulation banning mercury propellant. For Bender, that creates some uncertainty around compliance when the provision goes into force in 2025.</p><p>Still, with a U.S. company being the first startup to toy with mercury propellant, it might be ideal to have a stronger U.S. ratification of the Minamata Convention before another company hits on the same idea. “There will always be market incentives to cut corners and do something more dangerously,” Bell says.</p><p><em>Update 19 April 2022: </em>In an email, a spokesperson for Astra stated that the company's propulsion system, the <a href=\"https://astra.com/space-products/astra-spacecraft-engine/\" target=\"_blank\">Astra Spacecraft Engine</a>, does not use mercury. The spokesperson also stated that Astra has no plans to use mercury propellant and that the company does not have anything in orbit that uses mercury.<br/></p><p><em>Updated 20 April 2022 to clarify that Apollo Fusion was building thrusters that used mercury, not that they had actually used them. </em></p>",
  "pubDate": "Tue, 19 Apr 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/mercury-ion-thruster-banned",
  "category": [
    "Spacecraft",
    "Thruster",
    "Mercury",
    "Ion thruster",
    "Space"
  ],
  "dc:creator": "Michael Koziol",
  "media:content": ""
}