{
  "id": "tag:blogger.com,1999:blog-17171206.post-3136808605245545779",
  "published": "2012-09-17T10:47:00.000-07:00",
  "updated": "2012-09-17T16:41:14.500-07:00",
  "title": "Recsys 2012: A long (and likely biased) summary",
  "content": "After a great week in beautiful and sunny Dublin (yes, sunny), it is time to look back and recap on the most interesting things that happened in the 2012 Recsys Conference. I have been attending the conference since its first edition in Minnesota. And, it has been great to see the conference mature to become the premiere event for recommendation technologies. I can't hide that this is my favorite conference for several reasons: perfect size, great community, good involvement from industry, and good side program of tutorials, workshops, and demos.<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"http://2.bp.blogspot.com/-xcXMf1FHay8/UFdh0nz61mI/AAAAAAAAAU8/2T15Z0RslTA/s1600/RecsysPhoto.JPG\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" height=\"320\" src=\"http://2.bp.blogspot.com/-xcXMf1FHay8/UFdh0nz61mI/AAAAAAAAAU8/2T15Z0RslTA/s320/RecsysPhoto.JPG\" width=\"239\" /></a></div><br />This year I arrived a bit late and missed the first day of tutorials, and first day of the conference. But, was able to catch up after jumping right in with my 90 minute tutorial on \"Building Industrial-scale Real-world Recommender Systems\"<br /><br />In my tutorial (<a href=\"http://www.slideshare.net/xamat/building-largescale-realworld-recommender-systems-recsys2012-tutorial\">see slides here</a>), I talked about the importance of four different issues in real-world recommender systems:<br /><ul><li>Paying attention to user interaction models that support things like explanations, diversity, or novelty.</li><li>Coming up with algorithms that, beyond rating prediction, focus on other aspects of recommendation such as similarity, or, in particular, ranking.</li><li>Using results of online A/B tests, and coming up with offline model metrics that correlate with the former.</li><li>Understanding the software architectures where your recommender system will be deployed.</li></ul>I was happy to see that some of these issues not only were mentioned, but almost became conducting threads throughout the conference. Of course, this might be in the eye of the beholder, and others might have come back with the impression that the main topics were others (I recommend you read these two other Recsys 2012 summaries by <a href=\"http://thenoisychannel.com/2012/09/14/recsys-2012-beyond-five-stars/\">Daniel Tunkelang</a> and <a href=\"http://www.syslog.cl.cam.ac.uk/2012/09/14/recsys-2012-few-things-i-remember/\">Daniele Quercia</a>). In any case, grouping in topics will help me summarize the many things I found interesting.<br /><h3>Online A/B Testing and offline metrics</h3>I am glad to see that this has become a relevant topic for the conference, because many of us believe this is one of the most important topics that need to be addressed by both industry and academia. One of these people is Ron Kohavi, who delivered a great keynote on \"<a href=\"http://www.exp-platform.com/Pages/2012RecSys.aspx\">Online Controlled Experiments: Introduction, Learnings, and Humbling Statistics</a>\", where he described his learnings of many years of AB Testing in Amazon and Microsoft. It is funny that I cited his KDD 2012 paper in two slides in my tutorial, not knowing that he was in the audience. I recommend you go through his slides, it was one of the best talks of the conference for sure.<br /><br />The importance of finding relevant metrics was, as a matter of fact, the focus of a workshop we organized with Harald Steck (Netflix), Pablo Castells (UAM), Arjen de Vries, and Christian Posse (LikedIn). The title of the workshop was \"Recommendation Utility Evaluation: Beyond RMSE\". Unfortunately, I was not able to attend. But, I do know the keynote by Carlos Gomez-Uribe, also from Netflix, was very well received. And, the workshop as a whole went very well with several interesting papers and even more interesting discussions. You can access the papers on the <a href=\"http://ir.ii.uam.es/rue2012/\">website</a>.<br /><br />A couple of papers in the main track of the conference also touched upon the importance of optimizing several objectives at the same time. In \"<a href=\"http://www.slideshare.net/mechanistician/recsys-2012-slides?ref=http://thenoisychannel.com/\">Multiple Objective Optimization in Recommender Systems</a>\", Mario Rodriguez and others explain how they design LinkedIn recommendations by optimizing to several objectives at once (e.g. candidate that is good for the job + who is open to new opportunities). They report results from an AB Test run on LinkedIn. In \"<a href=\"http://www.slideshare.net/marcotulioribeiro54/presentation-recsys12\">Pareto-Efficient Hybridization for Multi-Objective Recommender Systems</a>\", Marco Tulio Ribeiro and others from Universidade Federal de Minas Gerais &amp; Zunnit Technologies take the multi-objective a step further. In their case, they optimize the system to not only be accurate, but also present novel or diverse items.<br /><br />Some other papers went beyond the academic experimental procedure and implemented real systems that were tested with users. A good example is \"Finding a Needle in a Haystack of Reviews: Cold Start Context-Based Hotel Recommender System\" by researchers from the Tel Aviv Yaffo College and Technicolor.<br /><h3>Learning to Rank</h3>Another hot topic in this year's recsys was ranking (or Top-n Recommendations as some prefer to call it). It is good to see that after some time publicly speaking about the importance of ranking approaches, the community seems now to be much more focused on ranking than on rating prediction. Not only there was a whole session devoted to ranking, but actually many other papers in the conference dealt with the topic in some way or another.<br /><br />I will start by mentioning the very good work by my former colleagues from Telefonica. Their paper \"CLiMF: Learning to Maximize Reciprocal Rank with Collaborative Less-is-More Filtering\" won the best-paper award. And, I think most of us thought that it was very well-deserved. It is a very good piece of work. Well motivated, evaluated, and, it addresses a very practical issue. It is great to see the Recsys team at Telefonica that I started be acknowledged with this award. You can access the paper <a href=\"http://baltrunas.info/papers/Shi12-climf.pdf\">here</a> and the slides <a href=\"http://www.slideshare.net/kerveros99/climf-collaborative-lessismore-filtering\">here</a>.<br /><br />In that same session, researchers from the Université Paris 6 presented \"Ranking with Non-Random Missing Ratings: Influence of Popularity and Positivity on Evaluation Metrics\", an interesting study on the very important issue of negative sampling, and popularity bias in learning to rank. The paper discusses these effects on the AUC (Area Under the Curve) measure, a measure that is not very well-behaved, nor very much used in evaluating ranking algorithms. Still, it is a valuable first step in a very interesting line of work. It is interesting to point out that the CLiMF paper addressed the issue of negative sampling in a radically different way: only considering positive samples. Yet another interesting paper in that session was \"<a href=\"http://www-users.cs.umn.edu/%7Exning/papers/Ning2012.pdf\">Sparse Linear Methods with Side Information for Top-N Recommendations</a>\", a model for multidimensional context-aware learning to rank.<br /><br />Another ranking paper, \"Alternating Least Squares for Personalized Ranking\" by Gábor Takács from Széchenyi István University and Domonkos Tikk from Gravity R&amp;D, received an honorable mention. The main author coined an (un)popular sentence during his presentation when he invited anyone not interested in Mathematics to leave the room. An unnecessary invitation in a conference that prides itself for being inclusively multidisciplinary. In Recsys, psychologists are seating through systems presentations as much as mathematicians are seating through user-centric sessions, and that is what makes the conference appealing. In any case, the paper presents an interesting way to combines a ranking-based objective function introduced in last year's kdd and the use of ALS instead of SGD to come up with another approach to learning to rank.<br /><br />Two papers dealing with recommendations in Social Networks also focused on ranking. \"<a href=\"http://eeweb.poly.edu/faculty/yongliu/docs/topk_tr.pdf\">On Top-k Recommendation Using Social Networks</a>\" by researchers from NYU and Bell Labs, and \"<a href=\"http://www.l3s.de/web/upload/documents/1/diaz_recsys2012.pdf\">Real-Time Top-N Recommendation in Social Streams</a>\" by Ernesto Diaz-Aviles and other researchers from the University of Hannover. The same first author had an interesting short paper in the poster session: \"<a href=\"http://www.l3s.de/web/upload/documents/1/sp197-diaz.pdf\">Swarming to Rank for Recommender System</a>\". In that poster he proposes the use of a Particle Swarm Optimization algorithm to directly optimize ranking metrics such as MAP. The method proposes an interesting alternative to the use of Genetic Algorithms or Simulated Annealing for this purpose.<br /><br />Finally, the industry keynote by Ralf Herbrich from Facebook, also introduced the world of Bayesian Factor Models for large-scale distributed ranking. This method, introduced by the same author and others from MSR as \"<a href=\"http://www2009.eprints.org/12/1/p111.pdf\">Matchbox</a>\" is now used in different settings. For example, the poster \"<a href=\"http://www.eng.tau.ac.il/%7Enoamk/papers/KNPS12.pdf\">The Xbox Recommendation System</a>\" presented its applicability for recommending movies and games for the Xbox. And, in \"<a href=\"http://research.microsoft.com/pubs/166623/RecSys-2012.pd\">Collaborative Learning of Preference Rankings</a>\" the authors apply it to... sushi recommendation!<br /><h3>User-centric, interfaces &amp; explanations</h3>This was probably the third big area of focus of the conference, with many contributions in papers, tutorials, and workshops. The first day, there were actually two tutorials that would fall into this category. In \"Personality-based Recommender Systems: An Overview\", the authors presented the idea of using personality traits for modeling user profiles. Among other things, they introduced their proposal to use PersonalityML, an XML-based language for personality description. Interestingly, in the industry session, we saw that this is actually a quite practical thing to do. Thore Graepel from Microsoft explained their experiments in using The Big Five personality traits for personalization. In the other tutorial, \"<a href=\"http://www.slideshare.net/usabart/tutorial-on-conducting-user-experiments-in-recommender-systems\">Conducting User Experiments in Recommender Systems</a>\", Bart Knijnenburg gave a thorough overview of how to conduct user studies for recommender systems. He also introduced his model for using structural equations to model the effects to evaluate. Again, I missed this tutorial, but I was fortunate to hear a very similar presentation by him in Netflix.<br /><br />In \"<a href=\"http://bostandjiev.com/Content/publications/SocialRecStudy.pdf\">Inspectability and Control in Social Recommenders</a>\", Bart himself (and researchers from UCSB) analyze the effect of giving more information and control to users in the context of social recommendations. A similar idea is explored in the short paper \"The Influence of Knowledgeable Explanations on Users' Perception of a Recommender System\" by Markus Zanker.<br /><br />Two papers addressed the issue of how much information we should require from users. In \"User Effort vs. Accuracy in Rating-Bbased Elicitation\" Paolo Cremonesi and others analyze how many ratings \"are enough\" for producing satisfying recommendations in a cold-start setting. And, in \"How Many Bits Per Rating?\", the Movielens crew try to quantify the amount of information and noise in user ratings from an information-theoretical perspecive. An interesting continuation to <a href=\"http://technocalifornia.blogspot.com/2009/04/i-like-it-i-like-it-not-or-how-miss.html\">my work on user ratings noise</a>. However, as the first author himself admited, this is just initial work.<br /><br />Other highlights of user-centric work that fell more on the UI side were the paper \"TasteWeights: A Visual Interactive Hybrid Recommender System\" by my friends at UCSB, as well as the many papers presented in the <a href=\"https://homepages.abdn.ac.uk/csc284/pages/InterfaceRS/\">Workshop on Interfaces for Recommender System</a>. <br /><h3>Data &amp; Machine Learning Challenges</h3>If somebody thought that data and machine learning challenges would fade away after the Netflix Prize, this year's Recys was a clear example that this is far from being the case. Many challenges have taken over after that: the yearly KDD Cups, Kagel, Overstock, last year's MoviePilot challenge, the Mendeley Challenge... Recsys had this year a <a href=\"http://recsys.acm.org/2012/tutorials.html#best\">Tutorial/Panel</a> and a <a href=\"http://2012.recsyschallenge.com/\">Workshop</a> on Recommender Systems Challenges, both organized by Alan Said, Domonkos Tikk, and others. I could not attend the Tutorial since it was happening at the same time than mine. But, I was able to catch some interesting presentations in the Workshop. Domonkos Tikk from Gravity R&amp;D gave <a href=\"http://www.slideshare.net/domonkostikk/from-a-toolkit-of-recommendation-algorithms-into-a-real-business-the-gravity-rd-experience\">a very interesting presentation</a> on how they evolved from being a team in the Netflix Prize to a real-world company with very interesting projects. Kris Jack from Mendeley also gave two interesting talks on the Mendeley recommender systems. In <a href=\"http://www.slideshare.net/KrisJack/mendeley-suggest-engineering-a-personalised-article-recommender-system\">one of them</a>, he explained how they make use of AWS and Mahout in a system that can generate personalized recommendations for about $60 a month. In <a href=\"http://www.slideshare.net/KrisJack/rec-sys12mendeleydatachallenges\">the other</a>, he talked about their perspective on data challenges.<br /><h3>Context-aware and location-based recommendations</h3>This has become a traditional area of interest in Recsys. It has now matured to a point that it has it own session, and two workshops: \"<a href=\"http://loca.mobilelifecentre.org/\">Personalizing the Local Mobile Experience</a>\", and the \"<a href=\"http://cars-workshop.org/\">Workshop on Context-Aware Recommender Systems</a>\". But, besides having its own session in the conference, several other papers in others also deal with context-aware recommendations. I have already mentioned \"Sparse Linear Methods with Side Information for Top-N Recommendations\", for example. Other interesting papers in this area were \"Context-Aware Music Recommendation Based on Latent Topic Sequential Patterns\", on the issue of playlist generation, and \"<a href=\"http://www.cl.cam.ac.uk/%7Edq209/publications/trumper12ads.pdf\">Ads and the City: Considering Geographic Distance Goes a Long Way</a>\" for location-aware recommendations.<br /><h3>Social</h3>A similar area that has already matured over several Recsys is Social. It has its own session, and Workshop, \"<a href=\"http://ls13-www.cs.uni-dortmund.de/homepage/rsweb2012/index.shtml\">Workshop on Recommender Systems and the Social Web</a>\" , and trancends over many other papers. In this area, the paper that I have not mentioned in other categories and found interesting was \"<a href=\"http://www.slideshare.net/daniele.quercia/recsys-14297597\">Spotting Trends: The Wisdom of the Few</a>\". One of the reasons I found the paper interesting is because it builds on our idea of using a reduced set of experts for recommendations, what we called \"<a href=\"http://technocalifornia.blogspot.com/2009/05/wisdom-of-few.html\">The Wisdom of the Few</a>\". <br /><h3>Others</h3>And yes, I still have some interesting stuff from the poster session that I could not fit into any of the above categories.<br /><br />First, the short paper \"<a href=\"http://ir.ii.uam.es/%7Ealejandro/2012/recsys.pdf\">Using Graph Partitioning Techniques for Neighbour Selection in User-Based Collaborative Filtering</a>\" by Alejandro Bellogin. Alejandro won the Best Short Paper Award, for a great piece of work and presentation. He described an approach to use the Normalized Cut graph clustering approach for grouping similar users, and improve neighborhood formation in standard kNN Collaborative Filtering.<br /><br />I also liked the poster \"<a href=\"http://cse.iitkgp.ac.in/%7Epabitra/paper/recsys12.pdf\">Local Learning of Item Dissimilarity Using Content and Link Structure</a>\", another graph-based approach, in this case to learn a similarity function.<br /><br />Finally, in \"When Recommenders Fail: Predicting Recommender Failure for Algorithm Selection and Combination\", Michael Ekstrand starts to tap into an extremely important question: when and why do some recommendation algorithms fail? This question has been informally discussed in the context of hybrid recommenders and ensembles. But, there is clearly much more work to do, and many things to understand.<br /><br /><br />----------------------<br /><br /><br />Well, if you made it all the way to here, it means that you are really interested in Recommender Systems. So, chances are that I will be seeing you in next year's Recsys. Hope to see you in Hong Kong!<br /><br />",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Xavier Amatriain",
    "uri": "http://www.blogger.com/profile/14166119485952054870",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 1
}