{
  "title": "New AI-Powered Platform Aids Telecom Product Designers",
  "link": "https://spectrum.ieee.org/ieee-discoverypoint-launches",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-man-and-woman-in-a-data-center-he-holds-a-laptop-while-they-confer.jpg?id=30007453&width=1200&height=800&coordinates=0%2C0%2C0%2C360\"/><br/><br/><p>Engineers designing communications products need access to information—the latest research, lists of parts and components, and technical standards to help ensure that their design will work seamlessly with others. But tracking down resources across multiple websites can be time-consuming, and the material might not be relevant or the sources could be questionable. </p>\n<p>The new <a href=\"https://discoverypoint.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE DiscoveryPoint for Communications</a> platform aims to solve those problems by providing one-stop access to searchable, curated content from trusted sources on just about any telecommunications topic. Its library contains more than 1 million full-text research documents; 10,000 technical standards; 8,000 online courses; 400 ebook titles; 18 million parts and various solutions from manufacturers and distributors; and 1,100 industry and product news bulletins, blogs, and white papers. </p><hr/>\n<p>The documents come from reputable organizations including <a href=\"https://www.att.com/\" rel=\"noopener noreferrer\" target=\"_blank\">AT&T</a>, <a href=\"https://ieeexplore.ieee.org/Xplore/home.jsp\" rel=\"noopener noreferrer\" target=\"_blank\">the IEEE Xplore Digital Library</a>, <a href=\"https://www.f5.com/\" rel=\"noopener noreferrer\" target=\"_blank\">F5 Networks</a>, <a href=\"https://www.itu.int/en/ITU-T/Pages/default.aspx\" rel=\"noopener noreferrer\" target=\"_blank\">the International Telecommunication Union</a>, <a href=\"https://www.riverpublishers.com/\" rel=\"noopener noreferrer\" target=\"_blank\">River Publishers</a>, <a href=\"http://qualcomm.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Qualcomm</a>, <a href=\"https://www.verizon.com/about\" rel=\"noopener noreferrer\" target=\"_blank\">Verizon</a>, and <a href=\"https://www.smpte.org/?hsLang=en\" rel=\"noopener noreferrer\" target=\"_blank\">SMPTE</a>.</p>\n<p>“There’s nothing on the market right now that fully supports the workflow of the design engineer and that delivers all the information needed in one place,” says <a href=\"https://www.linkedin.com/in/markbarragry/\" rel=\"noopener noreferrer\" target=\"_blank\">Mark Barragry</a>, senior product manager for corporate markets at IEEE Global Products and Marketing.</p>\n<p>In designing IEEE DiscoveryPoint, Barragry says, “We reconstructed the work process of a product design engineer and put together a set of resources that meet all the information needs they would have during a standard product-development cycle.”</p>\n<p><strong>Significant Resources</strong></p><p>IEEE has a wealth of content for telecom designers, Barragry says. IEEE publishes nine of the 10 most-cited journals in telecommunications. More than 40 percent of U.S. patents related to telecommunications cite an IEEE publication. The organization also sponsors more than 7,000 conferences that focus on communications, networking, and broadcast technologies. And the <a href=\"http://standards.ieee.org/\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE Standards Association</a> has developed more than 900 standards related to communications, including the popular <a href=\"https://standards.ieee.org/search/?q=IEEE%20802.11\" rel=\"noopener noreferrer\" target=\"_blank\">IEEE 802.11</a> WiFi standard.</p>\n<p>Barragry adds that design engineers who tested the platform before launch said they liked that it came from IEEE, a trusted source.</p>\n<p><strong>Search Algorithm</strong></p><p>The subscription-based product’s intuitive search engine saves users time because it zeroes in on key concepts related to the topic they’re searching for. To get started, the user types a word, phrase, concept, the name of an author or company, or another term into the search bar. The search engine’s ranking algorithm analyzes the full text and the metadata of the documents to find relevant material. </p>\n<p>The results are organized into channels and categorized by type of material, such as research papers, standards, books, or industry news. For each search result, a machine-learning feature examines the document and generates a short summary of key points, which get highlighted in the document.</p>\n<p>Search results can be sorted by relevance or by time period, starting with the previous 90 days and going as far back as 10 years for journals and five years for conferences. The results also can be grouped, for example, by a publication’s name. Searches can be saved, and users can bookmark documents.</p>\n<p>IEEE DiscoveryPoint also recommends content based on an automated analysis of the user’s reading activity during the previous 30 days. Users can set up email alerts for new content that fits their search criteria.  </p>\n<p>In one testimonial about IEEE DiscoveryPoint, a director of technology development said, “I really appreciated the thought that went into this product. It’s an unmet need for people like me.”</p>\n<p>The subscription price is based on the size of the organization and how many engineers and technical professionals will be using it. To request a demo, complete <a href=\"https://discoverypoint.ieee.org/request-a-demo/?LT=LG_ENL_2022_RFD_IDPC_IEEE_Institute\" rel=\"noopener noreferrer\" target=\"_blank\">this form</a>. </p>",
  "pubDate": "Tue, 21 Jun 2022 18:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ieee-discoverypoint-launches",
  "category": [
    "Ieee xplore digital library",
    "Education",
    "Ieee discoverypoint",
    "Ieee products services",
    "Publications",
    "Research",
    "Standards",
    "Telecommunications",
    "Type:ti"
  ],
  "dc:creator": "Kathy Pretz",
  "media:content": ""
}