{
  "title": "Exploring psychology’s colorful past, with Dr. Cathy Faye, PhD",
  "itunes:title": "Exploring psychology’s colorful past, with Dr. Cathy Faye, PhD",
  "pubDate": "Wed, 02 Dec 2020 11:30:00 +0000",
  "guid": "5ba3fe09-5915-426e-b19e-b1741f340e91",
  "link": "http://sopapa.libsyn.com/the-psychology-museum-with-cathy-faye-phd-0",
  "itunes:image": "",
  "description": "<p>The simulated shock generator for Stanley Milgram’s famed studies on obedience, artifacts from the Stanford Prison Experiment, and a curious machine called a psychograph that promised to read your personality by measuring the bumps on your head--all of these items are on display at the Cummings Center for the History of Psychology at the University of Akron in Akron, Ohio. The center’s mission is to preserve and interpret psychology’s historical record. Director Cathy Faye, PhD, talks about the center’s collection and how she and her staff work to preserve psychology’s past as well as document its present.<br /> <br /> Links</p> <p><a href= \"https://centerhistorypsychology.wordpress.com/2020/06/06/meet-the-centers-new-executive-director-dr-cathy-faye/\"> Cathy Faye, PhD</a><br /> <a href=\"https://www.uakron.edu/chp/\">Cummings Center for the History of Psychology</a><br />  <br /> Music<br /> <br /> Expressions of the Mind by <a href= \"https://freesound.org/people/ShadyDave/\">ShadyDave</a> via freesound.org<br /> <br /> Sponsor<br /> <br /> <a href=\"https://convention.apa.org/podcast\">APA Virtual 2020</a></p>",
  "content:encoded": "<p>The simulated shock generator for Stanley Milgram’s famed studies on obedience, artifacts from the Stanford Prison Experiment, and a curious machine called a psychograph that promised to read your personality by measuring the bumps on your head--all of these items are on display at the Cummings Center for the History of Psychology at the University of Akron in Akron, Ohio. The center’s mission is to preserve and interpret psychology’s historical record. Director Cathy Faye, PhD, talks about the center’s collection and how she and her staff work to preserve psychology’s past as well as document its present.  Links</p> <p><a href= \"https://centerhistorypsychology.wordpress.com/2020/06/06/meet-the-centers-new-executive-director-dr-cathy-faye/\"> Cathy Faye, PhD</a> <a href=\"https://www.uakron.edu/chp/\">Cummings Center for the History of Psychology</a>   Music  Expressions of the Mind by <a href= \"https://freesound.org/people/ShadyDave/\">ShadyDave</a> via freesound.org  Sponsor  <a href=\"https://convention.apa.org/podcast\">APA Virtual 2020</a></p>",
  "enclosure": "",
  "itunes:duration": "32:54",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The simulated shock generator for Stanley Milgram’s famed studies on obedience, artifacts from the Stanford Prison Experiment, and a curious machine called a psychograph that promised to read your personality by measuring the bumps on your head--all...",
  "itunes:episode": 121,
  "itunes:episodeType": "full"
}