{
  "id": "tag:blogger.com,1999:blog-4371296950668142214.post-5277154787787506817",
  "published": "2020-12-03T13:09:00.002+11:00",
  "updated": "2020-12-03T13:09:58.642+11:00",
  "title": "Powering innovation and efficiency in Australia’s public sector",
  "content": "Across the board, Australia’s public sector is progressing digital transformation to innovate, drive efficiency, and ultimately deliver more value to the communities it serves. While many public sector bodies historically relied on legacy IT systems at the beginning of the pandemic, spikes in demand meant they needed to quickly scale up capabilities. <br /><br /><br />Earlier this year we shared how we were working to support organisations in Australia and around the world by providing services like <a href=\"https://cloud.google.com/blog/products/g-suite/helping-businesses-and-schools-stay-connected-in-response-to-coronavirus\">expanded capacity</a>, <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/how-google-cloud-is-helping-during-covid-19\">powerful remote working tools</a>, <a href=\"https://cloud.google.com/blog/products/data-analytics/free-public-datasets-for-covid19\">shared datasets</a> and <a href=\"https://cloud.google.com/blog/topics/inside-google-cloud/how-google-cloud-is-supporting-healthcare-and-life-sciences-organizations\">healthcare APIs</a> to support research.<br /><br /><br />We’re proud to continue to play a key role in powering the pandemic response, partnering with a number of government agencies to empower scientific breakthroughs, enable more effective joint critical responses, and facilitate high-impact constituent engagement.  <br /><br /><br />Here’s a look at how government agencies in Australia are transforming services for constituents and how Google Cloud is supporting.<br /><br /><b><br />Improving customer service and experience</b><br /><br />As citizens and businesses grapple with widespread uncertainty, it is critical that government service delivery is seamless, dynamic, and in line with citizen needs, with data analytics playing a key role in this.<br /><br /><br />For example, the <b>Digital Transformation Agency&nbsp;&nbsp;</b>(DTA), which helps government agencies improve services to make them simple, clear and fast, is working with Google Cloud on its gov.au Observatory. The Observatory’s goal is to measure how people interact with government services, empowering and supporting teams to provide better services and outcomes for everyone. With Google Cloud, the DTA is using data from <a href=\"https://analytics.google.com/analytics/web/provision/#/provision\">Google Analytics</a>, <a href=\"https://search.google.com/search-console/about\">Google Search Console</a>, and the whole-of-government web crawl to quantify and visualise government websites, and show how users move through online services. This data is then analysed via BigQuery, which handles over 1.2 billion data points per month.<br /><br /><br /><b>Service NSW</b>, which provides access to government services in New South Wales, is using Google Cloud’s API management platform Apigee to improve business agility. With <a href=\"https://cloud.google.com/apigee\">Apigee</a>, the agency is able to continuously innovate, launching new features every single day. Performance and availability are key criteria for the agency as it runs digital services across the entire state and downtime isn’t an option. In addition, the ability for Service NSW to meet governance and security standards is central to its use of Apigee, as Google Cloud acts as the first line of defence against cyber-threats.<br /><br /><br />The importance of innovation during this time is greater than ever and at <b>CSIRO</b>, Australia’s national science agency, who are making a difference in everyday lives by empowering scientific breakthroughs. Their innovative approach to analytics, machine learning and containers is a key advantage in helping researchers to spin up resources on major cloud providers, such as Google Cloud, and gain faster access to compute for their projects. Our cloud solutions also enable CSIRO to define security requirements for the cloud, including authentication and authorisation, to ensure that research run or stored in the cloud is protected.<br /><br /><br /><b>Looking ahead as Australia emerges from COVID-19</b><br /><br />There’s no denying 2020 has been a challenging year but it’s inspiring to see that Australia is taking tentative steps to get its economy back on track and determine what the new normal for citizens’ personal and working lives looks like. Our government agencies are central to this effort.<br /><br /><br />Google Cloud is committed to driving the digital transformation of our public sector forward. We’re continuing to expand our capabilities locally, including the <a href=\"https://australia.googleblog.com/2020/03/investing-in-aussie-cloud-with-launch.html\">launch of our Melbourne region in 2021</a>. Our aim is to work with our government partners at a state and federal level to power a platform of innovation, digitisation and efficiency to ultimately improve the lives of all Australians. <br /><br /><br />Tune into the Google Cloud Public Sector Summit on Dec 8-9. <a href=\"https://cloudonair.withgoogle.com/events/public-sector-summit\">Registration </a>is free so don’t delay! <br /><br /><br /><img src=\"https://lh3.googleusercontent.com/d3x8hPKLOMqk7-019RjZi5tOG3_umzt_hhn8yJQ3UHOv2MVWlUwz-Ium3Q9FhOpBlj9FqpJEyU7-4JLTbCoEpcLEvsUbMAaKFWOQZoqAbEukbDrq8Bg9pD5XCp6XP4WUMgGnFc6w\" /><br /><i><span style=\"font-size: x-small;\">by Mark Innes, Vice President, ANZ at Google Cloud</span></i><span data-about-syndication=\"\" style=\"display: none; font-size: 0px; line-height: 0; max-height: 0px; overflow: hidden;\"> <!--INSTRUCTIONS   In order to support google.com/about site blog syndication, fill in the info below (after the example). Leave elements empty if there is no valid data.    Example:   <span class=\"post-image\">http://1.bp.blogspot.com/-mX0dxJxp8dg/Vo8MSdxypWI/AAAAAAAARsI/EjaFhvgAEgc/s1600/Beutler_Google_Giftwrap_-v2TW.png</span>  <span class=\"post-author-name\">Abbi Tatton</span>  <span class=\"post-author-title\">Editorial Elf</span>  <span class=\"post-author-team\">Google</span>--> <span class=\"post-image\"></span><span class=\"post-author-name\"></span><span class=\"post-author-title\"></span><span class=\"post-author-team\"></span></span>",
  "link": [
    "",
    "",
    ""
  ],
  "author": {
    "name": "anzprteam",
    "uri": "http://www.blogger.com/profile/06099752084931732403",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": ""
}