{
  "title": "TU 87: Treating Complex Trauma and Attachment with Guest Dr. Daniel Brown",
  "link": "https://therapistuncensored.com/episodes/tu-87-treating-complex-trauma-and-attachment-with-guest-dr-daniel-brown/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu-87-treating-complex-trauma-and-attachment-with-guest-dr-daniel-brown",
  "pubDate": "Thu, 10 Jan 2019 12:40:00 +0000",
  "guid": "https://www.therapistuncensored.com/?p=6719",
  "description": "This episode is packed with cool content! Learn about complex trauma, debunk myths of false memories from an expert witness for the prosecutors of child sexual abuse, and revisit the 3 Pillars Model of effective treatment for attachment disturbances, Dr. Daniel Brown! Also see the SPECIAL OFFER for his newly launched training below.\n\nEarly attachment disruption is often the primary contributor to many adult mental health issues. Treating symptoms without addressing the underlying root cause can set up both the therapist and the client, so it’s important we all understand what is happening below the surface.\n\nIn this Therapist Uncensored episode, Dr. Daniel Brown joins co-host Sue Marriott to discuss the 3 essential ingredients of effective and efficient treatment for many clinical issues such as anxiety, depression, addiction, PTSD and personality disorders.\n\nWe also get to hear take away’s from the 200 child sexual abuse cases he has testified for as an expert witness for the prosecutors and his work at the International War Crimes Tribunal helping them establish a standard of evidence for victims of war atrocities.\n\nFrom his wealth of knowledge regarding complex trauma and his extensive training in mindfulness and forensic psychology, Dr. Brown brings us deep insight into how treatment from an attachment perspective can lead to significant and lasting healing.\n\nIn this episode, TU87, we discuss:\n\nWhat is the complex trauma profile and what does it actually mean? What is its etiology? You’ll learn how re-constructing complex trauma as a branch off of disorganized attachment can allow for faster and more powerful treatment.\n\nWe also discuss:\n\n \tResearch findings that suggest that complex trauma is really disorganized attachment aggravated by later childhood abuse\n \tWhat Dr. Brown has learned through his experience as an expert witness in over 200 cases\n \tHis research on sexual abuse through forensic testing, and how ideas behind the false memory claim and dissociative amnesia permeate\n \tThe three pillars of treatment for attachment disorders (find out more about the three pillars in TU34 with David Elliott here!)\n \tTreatment on the anxious preoccupied side of the attachment spectrum (red side of the spectrum) and rectifying impaired self-development, chronic levels of anxiety, and chronic compulsive caretaking\n\nSPECIAL OFFER!\n\nDr. Daniel Brown has just launched one of the most comprehensive online training programs available! You may want to take a deeper dive in your understanding of attachment or, if you are a clinician, you may want to earn 8 hours of CEU training. This will also help you be more prepared to help your clients heal trauma and attachment issues in your practice.\nJust click on link attachmentproject.com and put “UNCENSORED” in the code box to receive 10% off the cost of the courses Dr. Brown has to offer.\n \n\nDaniel Brown’s Biography:\n\nDaniel Brown, Ph.D. is Associate Clinical Professor of Psychology at Harvard Medical School and has served on the faculty for over 38 years. As a senior meditation master, he’s trained and taught with top Indo-Tibetan Bon & Buddhist lamas for over 48 years, including lineage holders of some of the great schools of Buddhism.\n\nHe is an author of 24 books, and winner of the several awards from the American Psychiatric Association and the American Academy of Psychiatry & Law for outstanding contribution to forensic psychiatry.\n\nAs a legal expert witness, Dr Brown has testified in over 200 child abuse cases and served as an expert witness for the prosecutors at the International War Crimes Tribunal helping them establish a standard of evidence for victims of war atrocities.\n\nDr. Brown co-developed The Attachment Project based on the foundations of his and Dr. Elliott’s award-winning book Attachment Disturbances in Adults: Treatment for Comprehensive Repair. Together they developed the Three Pillars treatment method that has garnered praise across...",
  "enclosure": "",
  "itunes:subtitle": "This episode is packed with cool content! Learn about complex trauma, debunk myths of false memories from an expert witness for the prosecutors of child sexual abuse, and revisit the 3 Pillars Model of effective treatment for attachment disturbances,",
  "itunes:summary": "This episode is packed! Learn about complex trauma, debunk myths of false memories from an expert witness of child sexual abuse, and revisit the 3 Pillars Model of effective treatment for attachment disturbances! Also special offer included.",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW",
  "itunes:image": "",
  "itunes:duration": "54:29"
}