{
  "title": "COVID-19 Origins: Investigating a “Complex and Grave Situation” Inside a Wuhan Lab",
  "link": "https://www.propublica.org/article/senate-report-covid-19-origin-wuhan-lab",
  "pubDate": "Fri, 28 Oct 2022 12:45:00 -0400",
  "guid": "https://www.propublica.org/article/senate-report-covid-19-origin-wuhan-lab",
  "description": "\n                <p class=\"byline\">\n                by <span class=\"name\">Katherine Eban</span>,  <a href=\"https://www.vanityfair.com/\">Vanity Fair</a>, and <a class=\"name\" href=\"https://www.propublica.org/people/jeff-kao\">Jeff Kao</a>, ProPublica                </p>\n                                             \n\n                                                                    \n            \n                <p>ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive <a href=\"https://www.propublica.org/newsletters/the-big-story?source=54G&placement=top-note&region=national\">our biggest stories</a> as soon as they’re published.</p>\n\n            \n\n                \n\n\n\n        \n                        <p>This article was produced in partnership with <a href=\"https://www.vanityfair.com/news/2022/10/covid-origins-investigation-wuhan-lab\">Vanity Fair</a>.</p>\n\n        \n\n    \n      \n  \n\n\n\n                        \n    \n        “A Secret Language of Chinese Officialdom”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.0\">Toy Reid has always had a gift for languages — one that would carry him far from what he calls his “very blue-collar” roots in Greenville, South Carolina. In high school, Spanish came easily. At nearby Furman University, where he became the first person in his family to attend college, he studied Japanese. Then, “clueless but curious,” as he puts it, he channeled his fascination with the Dalai Lama into a master’s degree in East Asian philosophy and religion at Harvard. Along the way, he picked up Khmer, the national language of Cambodia, and achieved fluency in Chinese. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.1\">But it was his career as a China specialist for the Rand Corporation and as a political officer in East Asia for the U.S. State Department that taught him how to interpret a notoriously opaque language: the “party speak” practiced by Chinese Communist officials. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.2\">Party speak is “its own lexicon,” explains Reid, now 44 years old. Even a native Mandarin speaker “can’t really follow it,” he says. “It’s not meant to be easily understood. It’s almost like a secret language of Chinese officialdom. When they’re talking about anything potentially embarrassing, they speak of it in innuendo and hushed tones, and there’s a certain acceptable way to allude to something.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.3\">For 15 months, Reid loaned this unusual skill to a nine-person team dedicated to investigating the mystery of COVID-19’s origins. Commissioned by <a href=\"https://projects.propublica.org/represent/members/B001135-richard-m-burr\">Sen. Richard Burr, R-N.C.</a>, the team examined voluminous evidence, most of it open source but some classified, and weighed the major credible theories for how the novel coronavirus first made the leap to humans. An interim report, released on Thursday by the minority oversight staff of the U.S. Senate Committee on Health, Education, Labor & Pensions (HELP), <a href=\"https://www.help.senate.gov/imo/media/doc/report_an_analysis_of_the_origins_of_covid-19_102722.pdf\">concludes that the COVID-19 pandemic was “more likely than not, the result of a research-related incident.”</a> </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"2.4\">As part of his investigation, Reid took an approach that was artful in its simplicity. Working out of the Hart Senate Office Building in Washington and a family home in Florida, he used a virtual private network, or VPN, to access dispatches archived on the website of the Wuhan Institute of Virology (WIV). These dispatches remain on the internet, but their meaning can’t be unlocked by just anyone. Using his hard-earned expertise, Reid believes he unearthed secrets that were hiding in plain sight.</p>\n        \n    \n                    \n\n    \n        <p>On Nov. 12, 2019, a dispatch by party branch members at the BSL-4 laboratory appeared to reference a biosecurity breach: \"These viruses come without a shadow and leave without a trace.\"</p>\n\n    \n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.0\">Ever since the Chinese city of Wuhan was identified as ground zero for the COVID-19 pandemic, a contingent of scientists have suspected that the virus could have leaked from one of the WIV’s complex of laboratories. The WIV is, after all, the venue for some of China’s riskiest coronavirus research. Scientists there have mixed components of different coronaviruses and created new strains, in an effort to predict the risks of human infection and to develop vaccines and treatments. Critics argue that creating viruses that don’t exist in nature runs the risk of unleashing them.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.1\">The WIV has two campuses and performed coronavirus research on both. Its older Xiaohongshan campus is just 8 miles from the crowded seafood market where COVID-19 first burst into public view. Its newer Zhengdian campus, about 18 miles to the south, is home to the institute’s most prestigious laboratory, a biosafety level 4 (BSL-4) facility, designed to enable safe research on the world’s most lethal pathogens. The WIV triumphantly announced its completion in February 2015, and it was cleared to begin full research by early 2018.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.2\">Like many scientific institutes in China, the WIV is state-run and funded. The research carried out there must advance the goals of the Chinese Communist Party (CCP). As one way to ensure compliance, the CCP operates 16 party branches inside of the WIV, where members including scientists meet regularly and demonstrate their loyalty.   </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.3\">Week after week, scientists from those branches chronicled their party-building exploits in reports uploaded to the WIV’s website. These dispatches, intended for watchful higher-ups, generally consist of upbeat recitations of recruitment efforts and meeting summaries that emphasize the fulfillment of Beijing’s political goals. “The headlines and initial paragraphs seem completely innocuous,” Reid says. “If you didn’t take a close look, you’d probably think there’s nothing in here.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.4\">But much like imperfect propaganda, the dispatches hold glimmers of real life: tension among colleagues, abuse from bosses, reprimands from party superiors. The grievances are often couched in a narrative of heroism — a focus on problems overcome and challenges met, against daunting odds.      </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.5\">As Reid burrowed into the party branch dispatches, he became riveted by the unfolding picture. They described intense pressure to produce scientific breakthroughs that would elevate China’s standing on the world stage, despite a dire lack of essential resources. Even at the BSL-4 lab, they <a href=\"https://www.documentcloud.org/documents/23169464-xiang-shui-lun-kao-he-wu-yi-bing-du-suo-hong-qi-dang-zhi-bu-chuang-jian-gong-zuo-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p2/a2164591\">repeatedly</a> lamented the problem of “<a href=\"https://www.documentcloud.org/documents/23169138-zuo-wo-guo-gao-deng-ji-sheng-wu-an-quan-ling-yu-de-kai-tuo-zhe-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p3/a2164592\">the three ‘nos’</a>: no equipment and technology standards, no design and construction teams, and no experience operating or maintaining [a lab of this caliber].”   </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.6\">And then, in the fall of 2019, the dispatches took a darker turn. They referenced inhumane working conditions and “hidden safety dangers.” On Nov. 12 of that year, a dispatch by party branch members at the BSL-4 laboratory appeared to <a href=\"https://www.documentcloud.org/documents/23169138-zuo-wo-guo-gao-deng-ji-sheng-wu-an-quan-ling-yu-de-kai-tuo-zhe-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p2/a2164263\">reference</a> a biosecurity breach.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.7\">once you have opened the stored test tubes, it is just as if having opened Pandora’s Box. These viruses come without a shadow and leave without a trace. Although [we have] various preventive and protective measures, it is nevertheless necessary for lab personnel to operate very cautiously to avoid operational errors that give rise to dangers. Every time this has happened, the members of the Zhengdian Lab [BSL4] Party Branch have always run to the frontline, and they have taken real action to mobilize and motivate other research personnel.</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.8\">Reid studied the words intently. Was this a reference to past accidents? An admission of an ongoing crisis? A general recognition of hazardous practices? Or all of the above? Reading between the lines, Reid concluded, “They are almost saying they know Beijing is about to come down and scream at them.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.9\">And that, in fact, is exactly what happened next, according to a meeting summary uploaded nine days later.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"4.10\">The dozens of pages of WIV dispatches that Reid unearthed, particularly those from November 2019, helped shape the conclusion of the interim report. Working out of a small, windowless room in the Hart building that they nicknamed “the Bat Cave,” the researchers cross-referenced Reid’s analysis with myriad clues, from procurement notices and patent filings to records of ongoing scientific experiments at the WIV. As their investigation grew, so did a timeline that unfolded across the walls like a giant checkerboard.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            A sign on the door of the Senate team’s office, nicknamed “the Bat Cave.”\n    \n            (Mark Peterson/Redux for Vanity Fair)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.0\">Given advance access to hundreds of pages of the Senate researchers’ findings and analysis, Vanity Fair<em>,</em> in partnership with ProPublica, spent five months investigating their underlying evidence. We analyzed WIV documents, consulted with experts in CCP communications, asked biocontainment experts to help analyze documents and reviewed with independent scientists the possible evidence that certain vaccine research may have begun far earlier than acknowledged. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.1\">We also traced the hazards that arose as the WIV built a lab to research the world’s most dangerous pathogens. Taken together, our reporting provides critical context that is not included in the pared-down 35-page interim report. It offers the most detailed picture to date of the months leading up to the COVID-19 outbreak, including new details on the intense pressure the lab faced to produce breakthrough research, its struggles to grapple with mounting safety issues and a previously unreported series of references to a mysterious incident shortly before the virus began infecting its first victims.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.2\">The Senate HELP minority committee did not release a detailed 236-page analysis that Reid drafted as a companion report. Nor did the interim report provide context for the documents he unearthed. These omissions came as hundreds of pages were whittled down to 35 in the days before the report was released. Though some members of the Senate team reviewed a small number of classified documents, the interim report relied only on publicly available material. A spokesperson for the Senate HELP minority committee told Vanity Fair and ProPublica: “What has been included in the interim report are the facts the Committee has determined are ready for, and worthy of, publication at this time. The Committee’s bipartisan oversight investigation is still ongoing, and what is worthy of inclusion will find its way into the final report.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.3\">Vanity Fair and ProPublica downloaded more than 500 documents from the WIV website, including party branch dispatches from 2017 to the present. To assess Reid’s interpretation, we sent key documents to experts on CCP communications. They told us that the WIV dispatches did indeed signal that the institute faced an acute safety emergency in November 2019; that officials at the highest levels of the Chinese government weighed in; and that urgent action was taken in an effort to address ongoing safety issues. The documents do not make clear who was responsible for the crisis, which laboratory it affected specifically or what the exact nature of the biosafety emergency was. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.4\">The interim report also raises questions about how quickly vaccines were developed in China by some teams, including one led by a military virologist named Zhou Yusen. The report called it “unusual” that two military COVID-19 vaccine development teams were able to reach early milestones even faster than the major drug companies who were part of the U.S. government’s Operation Warp Speed program. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.5\">Vanity Fair and ProPublica spoke to experts who said that the timeline of Zhou’s vaccine development seemed unrealistic, if not impossible. Two of the three experts said it strongly suggested that his team must have had access to the genomic sequence of the virus no later than in November 2019, weeks before China’s official recognition that the virus was circulating.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.6\">The authors of the interim report do not claim to have definitively solved the mystery of COVID-19’s origin. “The lack of transparency from government and public health officials in the [People’s Republic of China] with respect to the origins of SARS-CoV-2 prevents reaching a more definitive conclusion,” the report says, adding that its conclusion could change if more independently verifiable information becomes available.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.7\">Throughout the pandemic, the WIV has largely remained a black box, owing to the Chinese government’s refusal to cooperate with international probes. By mining the WIV’s own records, Toy Reid and Senate researchers unearthed new clues that support the interim report’s assessment that a lab accident was “most likely” responsible for the pandemic.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"6.8\">In response to detailed questions, a Chinese Embassy spokesperson, Liu Pengyu, dismissed allegations of a lab leak and said that an international team convened by the World Health Organization concluded that “the allegation of lab leaking is extremely unlikely. The conclusion should be respected. … From the very beginning, China has taken a scientific, professional, serious and responsible attitude in origins tracing.” Some American politicians and journalists “distort facts and truth,” he said, adding that the U.S. should “stop using the epidemic for political manipulation and blame games.”</p>\n        \n    \n                        \n    \n        “Open the Aperture of Your Mind”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.0\">More than two years after the COVID-19 pandemic’s onset, the question of its origin has remained a scientific whodunit for the ages. Did the virus come from a caged infected animal, languishing in the warren of stalls at a Wuhan wholesale market? Or did it come from the nearby Wuhan Institute of Virology, where China’s top coronavirus researchers, some partly funded by the U.S. government, were splicing together coronavirus strains to gauge how they might become most infectious to humans?</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.1\">A bitter battle has ensued between a group of virologists who assert their research points to a market origin and an alternate group of academics and online sleuths who argue there’s been an attempted cover-up of a more likely lab origin. Four months ago, the World Health Organization’s Scientific Advisory Group for the Origins of Novel Pathogens revised an earlier conclusion and said that both scenarios remain on the table, due to insufficient evidence, and require further investigation. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.2\">In June 2021, with efforts to learn the truth at a virtual standstill, Burr drafted Dr. Robert Kadlec, the former Health and Human Services assistant secretary for preparedness and response under President Donald Trump, to assemble a team to examine the leading hypotheses. Burr, the ranking member of the Senate HELP committee, is retiring at year’s end. A spokesperson for Burr declined to make him available for an interview.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.3\">In the foreword of the interim report, Burr wrote, “My ultimate goal with this report is to provide a clearer picture of what we know, so far, about the origins of SARS-CoV-2 so that we can continue to work together to be better prepared to respond to future public health threats.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.4\">Burr has served in the U.S. Congress for 28 years, first as a congressman and then, since 2005, as a senator. By today’s standards, he is a moderate Republican, having voted to convict Trump in the Jan. 6 impeachment. Long known for his work on biodefense issues, he helped lead passage of the Pandemic and All-Hazards Preparedness Act in 2006 and also worked to speed up the FDA’s approval of drugs for rare diseases.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"8.5\">The pandemic also immersed him in scandal, as ProPublica has previously reported. In February 2020, after receiving Senate intelligence committee briefings on the health threat of COVID-19, he <a href=\"https://www.propublica.org/article/senator-dumped-up-to-1-7-million-of-stock-after-reassuring-public-about-coronavirus-preparedness\">sold up to $1.7 million in stock holdings</a> before the market tanked, sparking a Justice Department investigation into insider trading. <a href=\"https://twitter.com/SenatorBurr/status/1241008837479542786\">Burr said he relied on public news reports</a> to guide his decision to sell stocks. He stepped aside as chairman of the Senate Intelligence Committee after the FBI seized his cellphone. In January 2021, the DOJ closed its investigation without charging him.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Dr. Robert Kadlec examines evidence assembled by the Senate researchers.\n    \n            (Mark Peterson/Redux for Vanity Fair)\n    \n    \n    \n\n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.0\">The Senate HELP committee paid the salaries of seven researchers, but little more, so Kadlec cobbled together the best team he could. From the State Department, he borrowed a veterinary epidemiologist as well as Reid, whom he’d met just weeks earlier through a mutual friend who was a Dalai Lama aficionado. At the time, Reid was detailed to the office of <a href=\"https://projects.propublica.org/represent/members/R000595-marco-rubio\">Sen. Marco Rubio</a> to work on China policy issues. Kadlec also leaned on scientific advisers with expertise in virology, epidemiology and biodefense. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.1\">Kadlec, a former Air Force officer who worked with Burr years earlier on bioterrorism issues, has served under both Republican and Democratic presidents. In 2003, he deployed to Iraq for the Department of Defense and played a critical role in debunking the false claims that trailers there doubled as mobile bioweapons labs. That experience, he says, equipped him to navigate the murky world of“dual-use research,” where civilian scientific work sometimes has a clandestine military purpose.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.2\">In February 2020, in his role at HHS, Kadlec allowed sick Americans on a cruise ship to return to the U.S. Angry that the move added to the domestic COVID-19 case count, Trump threatened to fire him. And when Rick Bright, a senior HHS official turned whistleblower, accused the Trump administration of politicizing the pandemic response, he also alleged that Kadlec demoted him in retaliation and used federal funds to <a href=\"https://www.vanityfair.com/news/2020/05/whistleblower-complaint-rick-bright-blasts-team-trumps-pandemic-response\">bestow contracts on favored drugmakers</a>. The House Select Subcommittee on the Coronavirus Crisis investigated. While it did not issue formal findings against Kadlec, it noted in a <a href=\"https://coronavirus.house.gov/news/press-releases/clyburn-maloney-trump-emergent-biosolutions-vaccines\">press release</a> that an HHS division under Kadlec’s control awarded a lucrative contract to a drugmaker, despite regulators’ warnings about its troubled manufacturing plants. Calling the experience “very hurtful,” Kadlec says, “I got slimed in the press.” He adds, “I still carry that with me today.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.3\">Kadlec says the investigation of the 2003 Columbia space shuttle disaster, in which seven astronauts died, inspired his approach to the inquiry. It showed that “in complex disasters and events, there is always a political side, an engineering side, a human error side,” he says. “These things happen for a variety of reasons, so you have to open the aperture of your mind.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"10.4\">In recruiting Reid, Kadlec found an analyst who would look for clues in places a typical scientist wouldn’t. “The things that I’ve been researching and translating are not really science,” Reid says. “It’s the party speaking to the world of science and trying to manage it.”</p>\n        \n    \n                        \n    \n        “Complex and Grave Situation”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.0\">Even the authors of the relentlessly cheerful party branch dispatches and meeting summaries in the WIV archive found it hard to sugarcoat the events of Nov. 19, 2019, Toy Reid discovered as he delved into the WIV’s archives. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.1\">Seven days after the Zhengdian party branch members wrote their memo about rushing to the front line to defend against viral dangers, fallout arrived in the form of an official visitor from Beijing. That visitor, Dr. Ji Changzheng, is the technology safety and security director for the Chinese Academy of Sciences, the sprawling state agency that oversees more than 100 research institutions in China, including the WIV. His visit was billed as a senior safety-training seminar for a small high-level audience, including the WIV’s research department heads and top biosafety officials. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.2\">But the meeting, chronicled in a one and a half page summary uploaded to the WIV website on Nov. 21, was no pro forma seminar. According to Reid, it appears to have been “out of the ordinary and event driven,” and distinct from the annual safety training, which had been <a href=\"https://www.documentcloud.org/documents/23171882-wu-yi-bing-du-suo-zhao-kai-2019nian-du-an-quan-gong-zuo-hui-yi-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo\">held</a> in April.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.3\">For Reid, the import of Ji’s opening remarks practically leapt off the page. Ji told the assembled group that he had come bearing “<a href=\"https://www.documentcloud.org/documents/23169482-wu-yi-bing-du-suo-kai-zhan-an-quan-gong-zuo-pei-xun-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p1/a2165114\">important oral remarks and written instructions</a>” from General Secretary Xi Jinping and China’s premier, Li Keqiang, to address a “complex and grave situation.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.4\">Though the summary’s language is characteristically vague, Ji described:</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.5\">many large-scale cases of domestic and foreign safety incidents in recent years, and from the perspective of shouldering responsibility, standardizing operations, emergency planning, and inspecting hidden dangers one-by-one, [he] laid out a deep analysis, with many layers and taken from many angles, which vividly revealed the complex and grave situation currently facing [bio]security work.</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.6\">The WIV’s deputy director of safety and security spoke next, summarizing “several general problems that were found over the course of the last year during safety and security investigations, and [he] pointed to the <a href=\"https://www.documentcloud.org/documents/23169482-wu-yi-bing-du-suo-kai-zhan-an-quan-gong-zuo-pei-xun-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p2/a2164597\">severe consequences that could result from hidden safety dangers.</a>”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.7\">But what drew Reid’s full attention was the word Ji used to describe the important “written instructions” he was relaying from Beijing: “pishi.” When China’s senior leaders receive written reports on a worrying or important issue, they will write instructions in the margins, known as pishi, to be carried out swiftly by lower-level officials. As Reid interpreted it, the pishi that Ji arrived with that day appeared to have come directly from Xi, arguably China’s most powerful leader since Mao Zedong. To Reid, it suggested that Xi himself had been briefed on an ongoing crisis at the WIV. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.8\">Is it possible that Ji meant to invoke the authority of China’s supreme leader in a general way? As Reid acknowledges, “When Chinese officials want to be taken seriously by whoever their audience is, they invoke more senior officials.” To assess whether Ji had simply been dropping Xi’s name, as a way to underscore the importance of his message, Reid researched nine of Ji’s visits to different facilities prior to the pandemic. All were characterized as annual or routine. None mentioned a pishi. “There wasn’t this bandying about of Xi,” Reid says. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.9\">Further, when Chinese officials are invoking a higher authority in general terms, they will typically cite an important speech, says Reid. For example, Ji could have referenced the one Xi gave at the Chinese Academy of Sciences’ plenary session in May 2018. As Reid puts it, “If he just wanted to invoke the authority of Xi, the natural way to do that is to say, ‘Remember when he came to speak to all of us?’” Invoking the pishi, Reid believes, was “taking it to another level.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.10\">Ji did not respond to questions and a request for comment sent to the Chinese Academy of Sciences. The director general at the WIV and the head of the WIV party committee did not respond to emails seeking comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.11\">Vanity Fair and ProPublica examined research from Chinese academics on pishi and separately got three experts on CCP communications to review the WIV meeting summary. All agreed that it appeared to be urgent, nonroutine and related to some sort of biosafety emergency. Two also agreed that it appeared Xi himself had issued a pishi.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.12\">A former senior U.S. intelligence official said that, while the pishi in the dispatch is not necessarily a smoking gun, he reads it as saying that “there is some issue related to lab security, which doesn’t come up very often, that needed to be seen by Xi Jinping.” He added, “Something signed off on by the General Secretary (Xi) and Premier (Li) is high priority.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.13\">Another longtime CCP analyst said it was not possible to conclude from the document that Xi and Li had actually issued a pishi related to a specific incident, or even that they had been informed of one. Ji, in her view, might well have been invoking their names without their knowledge to underscore the importance of his message. However, she said that, given the party’s preference for positive communications, the acknowledgment of a “‘complex and grave situation’ means ‘We are facing something really bad.’” She also said that the language of the summary implied that the situation in question was happening <em>at that time.</em></p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.14\">Reading between the lines is essential to understanding what the WIV dispatches really mean. As Geremie Barmé, an emeritus professor of Chinese history at the Australian National University, who analyzed key documents at our request, said of CCP communications, “The style of self-protection, of rounding things out, of avoiding the truth, is a highly developed, bureaucratic art form.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.15\">Without more evidence, it is impossible to know the details of what the assembled group knew and discussed that day. But at least one news report supports the notion that the virus may have been circulating at that time. In March 2020, a veteran journalist with the South China Morning Post <a href=\"https://www.scmp.com/news/china/society/article/3074991/coronavirus-chinas-first-confirmed-covid-19-case-traced-back\">reported</a> that she reviewed internal Chinese government data on early cases of COVID-19 that included a 55-year-old in Hubei province, where Wuhan is located, who contracted COVID-19 on Nov. 17, 2019. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"12.16\">That was just two days before Ji arrived at the WIV, bearing urgent instructions from the highest levels of China’s government.</p>\n        \n    \n                        \n    \n        “Black Swans and Gray Rhinos”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.0\">A virologist and former Army officer, James LeDuc spent half a century studying how infectious diseases impact public health and national security. Over the course of his career, he witnessed China’s rise from a “not well-developed country” to a biotechnology superpower, he told Vanity Fair and ProPublica.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"14.1\">In December 1985, LeDuc, then a supervisor at the U.S. Army medical research center, Fort Detrick, arrived at the Wuhan Institute of Virology to help work on a trial of drug efficacy for the hantavirus, a life-threatening disease transmitted by rodents. “China was emerging from the Cultural Revolution. Everyone was on bicycles,” he recalls. “I can remember giving a talk — the screen was a sheet one of us had to hold. The windows were broken out.”</p>\n        \n    \n                    \n\n    \n        <p>China \"didn’t have the background of how to run [advanced laboratories] safely,\" says James LeDuc. \"They were trying to do their best.\"</p>\n\n    \n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.0\">Two and a half decades later, with help from French scientists and engineers, the WIV laid the cornerstone for China’s first BSL-4 laboratory. That facility, the Wuhan National Biosafety Laboratory, would become synonymous with the country’s lofty biotech ambitions. “China has said repeatedly and forcefully — and they’re backing up their words with actions — that they intend to own the bio-revolution,” the biodefense expert Dr. Tara J. O’Toole testified in November 2019 before a U.S. Senate Armed Services Subcommittee on Emerging Threats and Capabilities. O’Toole served as one of Kadlec’s scientific advisers for the report.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.1\">Today, China operates three BSL-4 laboratories and plans to build at least five more. (Biolabs are rated 1-4, from least to most secure, according to standards set by the Centers for Disease Control and Prevention and international public health agencies.) </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.2\">China’s progress has been fast — arguably too fast for its infrastructure to keep pace. It remains dependent on other countries for critical technology and supplies, leading to chronic procurement hurdles that party branch members <a href=\"https://www.documentcloud.org/documents/23169464-xiang-shui-lun-kao-he-wu-yi-bing-du-suo-hong-qi-dang-zhi-bu-chuang-jian-gong-zuo-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p2/a2165125\">refer</a> to as the “stranglehold problem.” It has a thin bench of experts to run the most advanced laboratories. China “didn’t have the background of how to run [advanced laboratories] safely,” says LeDuc. “They were trying to do their best.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.3\">From 2010 until his retirement in 2021, LeDuc served as director of the Galveston National Laboratory, <a href=\"https://www.selectagents.gov/resources/publications/annualreport/2021.htm\">one of eight BSL-4 facilities in the U.S</a>. During that time, he went out of his way to help improve standards at the WIV. He brought several of the WIV’s scientists to Galveston for training and invited its officials to attend an international conference he hosted.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.4\">In 2016, LeDuc returned to the WIV for a scientific meeting in which he shared a new set of recommendations. The National Science Advisory Board for Biosecurity had urged the U.S. government to more intensively screen proposals for what it called “gain-of-function research of concern” in which scientists manipulate dangerous pathogens to gauge their likelihood of sparking a pandemic.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.5\">LeDuc says his presentation was “not necessarily well received. Most of the folks were scientists and could care less about policy.” But he felt he had a responsibility to warn them all the same. “It’s enlightened self-interest that we are doing everything to ensure [China’s] success,” he says. “We want to make sure they have the best practices. If someone screws up, we all suffer.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.6\">Poring through publicly available documents, Kadlec’s researchers saw that China’s top scientists had been sounding the alarm too. “The biosafety laboratory is a double-edged sword; it can be used for the benefit of humanity but can also lead to a ‘disaster,’” warned a March 2019 article co-written by Yuan Zhiming, director of the WIV’s BSL-4 laboratory. “With increasing numbers of high-level biosafety laboratories constructed in China, it is urgent to establish and implement standardized management measures.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.7\">That same month, the director of China’s CDC cautioned that bioengineering technologies would “also be available to the ambitious, careless, inept and outright malcontents, who may misuse them in ways that endanger our safety.” Writing in the journal Biosafety and Health<em>,</em> the director at the time, George Fu Gao, also urged that “modifying the genomes of animals (including humans), plants, and microbes (including pathogens) must be highly regulated.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.8\">Meanwhile, reports of sloppy practices, hazardous conditions and inadequate oversight reverberated across China’s laboratories, according to documents unearthed by Reid and reviewed by Vanity Fair and ProPublica. A 2018 study by a municipal agency in Zhangjiajie, which canvassed 37 laboratories in the area, came to a scorching conclusion. “Our findings allow for no optimism about biosafety conditions,” the study said. “There are many hidden safety dangers, including occupational exposure, hospital acquired infections, environmental hazard, lack of training, those without credentials taking posts, management systems that do not operate effectively, leadership that does not place enough importance [on lab safety], deficient supervision and management by relevant health departments, etc.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.9\">On Nov. 7, 2018, an official with the Municipal Health Inspection Bureau of Guangzhou, China’s largest manufacturing hub, identified a litany of hazards found during laboratory biosafety inspections: improper use of disinfectants, substandard management of samples, personnel with inadequate training and protective gear, and laboratory wastewater released directly into sewage systems.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.10\">The WIV was by no means exempt from such problems, according to reports in its own archives. In <a href=\"https://www.documentcloud.org/documents/23171882-wu-yi-bing-du-suo-zhao-kai-2019nian-du-an-quan-gong-zuo-hui-yi-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo\">2011</a> and <a href=\"https://www.documentcloud.org/documents/23171882-wu-yi-bing-du-suo-zhao-kai-2019nian-du-an-quan-gong-zuo-hui-yi-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo\">2018</a>, inspections of WIV laboratories turned up lapses including improper storage of viral samples and management failings.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.11\">Then, on Dec. 24, 2018, an incident that was impossible to conceal helped catapult lab safety to the top of China’s policy agenda. Three students at Beijing Jiaotong University burned to death after improperly stored chemicals exploded inside the school’s laboratory. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.12\">On Jan. 21, 2019, Xi Jinping gave a speech to the CCP’s Central Party School, where budding young cadres receive their higher education. Conveying a sense of “anxious urgency,” according to The New York Times, he stressed the need to prepare for two kinds of risks: “black swans and gray rhinos.” He was referring to two concepts popularized in bestselling books: A <a href=\"https://www.goodreads.com/book/show/242472.The_Black_Swan\">black swan</a> is a rare and unpredictable event, while a <a href=\"https://www.wucker.com/writing/the-gray-rhino/\">gray rhino</a> is an obvious risk that is ignored until it poses an immediate threat. Xi proceeded to describe potential security problems in China’s state laboratories, leaving no doubt that he was concerned about the issue.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.13\">With Xi himself calling for action, a biosecurity bill that had been on the back burner became a top priority and later passed. In October 2019, Gao Hucheng, chairman of a National People’s Congress committee responsible for environmental protection, argued for its importance before the Congress’ standing committee.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.14\">In the fall of that year, according to declassified intelligence in <a href=\"https://2017-2021.state.gov/fact-sheet-activity-at-the-wuhan-institute-of-virology/index.html\">a U.S. State Department fact sheet</a>, several researchers inside the WIV became sick “with symptoms consistent with both COVID-19 and common seasonal illnesses.” The fact sheet did not say who the researchers were or how the US government learned of their illnesses.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.15\">As the Chinese government raced to overhaul biosafety regulations, scientists at the WIV faced a conflicting imperative: Beijing’s demand for scientific breakthroughs, which created pressure to perform cutting-edge experiments that could be published in prestigious journals. A party branch dispatch noted that Tong Xiao, a member of the WIV’s CCP committee, often <a href=\"https://www.documentcloud.org/documents/23169138-zuo-wo-guo-gao-deng-ji-sheng-wu-an-quan-ling-yu-de-kai-tuo-zhe-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p3/a2165129\">told</a> scientists there: “Don’t look at your work duties as pressure. Every task is an opportunity and a ladder for continuous self-improvement. Our team’s belief is that suffering losses is good fortune.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"16.16\">“They’ve got this really aggressive regime breathing down their neck,” says Reid. “These guys are in a political pressure cooker.”</p>\n        \n    \n                        \n    \n        “A Doom Loop of Pressure”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"18.0\">In 2002, an outbreak of the SARS coronavirus that originated in China spread around the world, killing 774 people and infecting more than 8,000. At first, China tried to conceal the problem. When that became impossible, it played down the severity, falsely claiming the epidemic was under control. Meanwhile, in two separate incidents in 2004, SARS <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7096887/\">accidentally leaked</a> from a top laboratory in Beijing and led to mini outbreaks. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"18.1\">In the wake of the debacle, China committed to a long-term project to not only repair its public-health reputation but also achieve the cutting-edge scientific prowess worthy of a true global superpower.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"18.2\">In 2004, French president Jacques Chirac flew to Beijing to sign a scientific cooperation agreement that would help catapult China into the big leagues. Welcomed with lavish ceremony, amid Champagne and strutting soldiers, Chirac pledged that France would sell China four mobile BSL-3 laboratories, help build a world-class BSL-4 lab and partner on essential research.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"18.3\">Eleven years and $44 million later, construction of the BSL-4 lab was complete. Set high above a flood plain, the four-story concrete laboratory was designed to withstand a magnitude 7 earthquake. By early 2018, it had been accredited to research the world’s most dangerous pathogens, including Ebola, Marburg and Nipah viruses. Xi Jinping himself hailed it as “of vital importance to Chinese public health.”</p>\n        \n    \n                    \n\n    \n        <p>\"My gut feeling is that the WIV was not ready to go hot when they turned everything on [at the BSL-4] and started doing experiments in early 2018,\" says Larry Kerr.</p>\n\n    \n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.0\">From the outside, the WIV appeared to be a transparent hub for top-caliber international collaborations. That ethos was best embodied by a fearless scientist named Shi Zhengli. She had risen through the ranks at the WIV to become director of its Center for Emerging Infectious Diseases and deputy director of its BSL-4 lab. Fluent in French, she had trained at the BSL-4 Jean Mérieux-Inserm Laboratory in Lyon and was well known in China as “bat woman” for her intrepid exploration of their caves to collect samples. “Shi Zhengli was totally aware of how to handle viruses,” Gabriel Gras, a French biosafety and biocontainment technology expert who helped train the WIV’s BSL-4 staff, told Vanity Fair and ProPublica. “She has handled these all her life.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.1\">As the BSL-4 lab there became one of the nation’s most exalted scientific showpieces, Shi’s research grew in importance and scope. In a 2015 research paper, Shi and a University of North Carolina virologist named Ralph Baric proved that the spike protein of a novel coronavirus could be used to infect human cells. Using mice as subjects, they spliced the spike of a novel SARS-like virus from a bat into a version of the 2003 SARS virus, creating a new infectious pathogen. The virus manipulation was completed at Baric’s BSL-3 lab in North Carolina. This gain-of-function experiment was so fraught that the authors essentially put a warning label on it, writing, “scientific review panels may deem similar studies … too risky to pursue.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.2\">In March 2018, Shi partnered with Baric and a longtime collaborator, Peter Daszak, on a $14 million grant proposal to genetically manipulate bat coronaviruses to see how they might cause pandemics. The proposal called for possibly enhancing the viruses with something called a furin cleavage site to boost their entry into human cells. The Defense Advanced Research Projects Agency (DARPA) rejected the grant proposal for not adequately assessing the risks posed by a supercharged virus. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.3\">It is not clear whether WIV scientists continued the research on their own. Shi and Baric did not offer comment. In his response to our request for comment, Daszak did not address the DARPA grant. He said that he had not reviewed the Senate report and instead pointed to another <a href=\"https://www.pnas.org/doi/10.1073/pnas.2202871119\">report</a>, which he recently co-authored in the Proceedings of the National Academy of Sciences, that “strongly indicates” a natural origin for SARS-CoV-2.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.4\">Though Shi was most often pictured in the Chinese press in her white, pressurized oxygen suit, required for BSL-4 research, published papers show that she and the researchers she supervised did much of their work in BSL-3 and even BSL-2 facilities, which the WIV allowed prior to the pandemic. The interim report enumerates several types of risky research conducted at the WIV at BSL-3 and BSL-2 levels. Animal experiments to test the efficacy of vaccines generated highly infectious aerosols that are “difficult to detect,” the interim report says, adding that “there were concerns about conducting this type of research in a BSL2 laboratory.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.5\">In early 2017, the collaboration with the French fizzled and Gras, the last French expert there, departed. The French had served as designers and contractors but never became partners. “I think the French did not really have a strong interest in working with Wuhan,” in part due to diverging research interests, Gras said. He added that Yuan Zhiming, the BSL-4 director, “was not an easy person. He can put pressure on people.” Yuan did not respond to emails seeking comment.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.6\">Long before the lab began its riskiest work, there were alarming signs of trouble ahead. In 2016, during severe flooding, the waters rose so high that nearby streets were impassable, and researchers had to hike through a forested area to reach the laboratory and ensure its safety, Zhengdian lab party branch members <a href=\"https://www.documentcloud.org/documents/23169138-zuo-wo-guo-gao-deng-ji-sheng-wu-an-quan-ling-yu-de-kai-tuo-zhe-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p3/a2166096\">recounted</a> in a WIV dispatch that Toy Reid unearthed. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.7\">The decision to build the walls out of stainless steel caused a considerable challenge. Stainless steel is “very vulnerable to corrosion” from disinfectants, Bob Hawley, the former chief of safety and radiation protection at the U.S. Army Medical Research Institute of Infectious Disease, told Vanity Fair and ProPublica. Hawley is an expert adviser to the interim report.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.8\">Even in 2016, Chinese technicians were already struggling with how to properly disinfect laboratory surfaces and other items, according to emails obtained in a <a href=\"https://www.judicialwatch.org/documents/jw-v-nih-wuhan-june-2021-00696/\">FOIA lawsuit</a>. That July, Yuan emailed an NIH staffer he’d met the previous year under the subject line “ask for help.” He wrote that he was seeking “some suggestion for the choice of disinfectants” used in the BSL-4 laboratory. “I am sorry to disturb you and I really hope you could give us some suggestion,” he wrote.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.9\">As LeDuc observed, “They were looking for expertise wherever they could find it.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.10\">Yuan himself identified the shortage of expertise as one of many problems that imperiled safe operations in China’s laboratories. In the September 2019 issue of <a href=\"https://www.sciencedirect.com/science/article/pii/S2588933819300391?via%3Dihub.\">the Journal of Biosafety and Security</a>, he described a threadbare system where maintenance costs were “generally neglected” and “several high-level BSLs have insufficient operational funds for routine yet vital processes. Due to the limited resources, some BSL-3 laboratories run on extremely minimal operational costs or in some cases none at all.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.11\">Gerald Parker, associate dean for Global One Health at Texas A&M University’s School of Veterinary Medicine and Biomedical Sciences and an expert adviser to the interim report, told Vanity Fair and ProPublica that he found Yuan’s revelations “jaw-dropping.” The combination of biosafety problems and limited maintenance funds is “a recipe for disaster,” he said. “You further couple that with an authoritarian regime where you could be penalized for reporting safety issues. You are in a doom loop of pressure to produce, and if something goes wrong you may not be incentivized to report.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.12\">As the Zhengdian lab party branch members <a href=\"https://www.documentcloud.org/documents/23169138-zuo-wo-guo-gao-deng-ji-sheng-wu-an-quan-ling-yu-de-kai-tuo-zhe-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo#document/p2/a2166960\">noted</a> in their dispatch of Nov. 12, 2019, which the interim report includes: “In the laboratory, they often need to work for four consecutive hours, even extending to six hours. During this time, they cannot eat, drink or relieve themselves. This is an extreme test of a person’s will and physical endurance.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.13\">A four- to six-hour shift in a positive pressure suit would be “unusually lengthy,” said Hawley, given the stress of dehydration, lack of mobility and noise from oxygen that is so loud it requires hearing protection. “Usually, it’s only a couple of hours at the maximum.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.14\">Larry Kerr, a virologist who recently retired as HHS’s director of the Office of Pandemics and Emerging Threats and served as an expert adviser to the Senate report, told Vanity Fair and ProPublica, “My gut feeling is that the WIV was not ready to go hot when they turned everything on [at the BSL-4] and started doing experiments in early 2018.” He added: “Even the WIV’s people are saying, ‘We don’t have the resources and capabilities to keep this up and running.’ It’s like, holy crap, if you are working in a lab like that, I don’t understand why people don’t shut it down.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"20.15\">But the showpiece laboratory remained as busy as ever. As Reid said of the WIV dispatches he analyzed, “The feel you get from all these documents is: It’s just produce, produce, produce, like an actor preparing to take the stage before they’re ready.”</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            Newspaper clippings on a cork board in the Bat Cave.\n    \n            (Mark Peterson/Redux for Vanity Fair)\n    \n    \n    \n\n    \n\n        \n    \n                        \n    \n        “The CCP’s Version of ‘Cover Your Ass’”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.0\">By the fall of 2019, trouble was brewing at the WIV, according to documents turned up by Toy Reid. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.1\">On Sept. 11, 2019, the CCP’s No. 15 Inspection Patrol Group <a href=\"https://www.cas.cn/yw/201909/t20190912_4714252.shtml\">arrived</a> at the Beijing headquarters of the WIV’s parent organization, the Chinese Academy of Sciences (CAS), to conduct a two-month political inspection. The inspection was part of a larger routine sweep of 37 state organizations. According to the inspection team’s leader, its purpose was to sniff out any “violations of political discipline, party organizational discipline, [financial] ethics discipline, discipline with regard to the masses, work discipline, and discipline in one’s personal life.” They were also on the lookout for instances of insufficient loyalty to the CCP’s mission.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.2\">The Beijing inspectors <a href=\"https://www.cas.cn/yw/202001/t20200110_4730954.shtml\">identified</a> more than a dozen “principal problems” at CAS, among them a “‘persistent gap’ between Xi Jinping’s important instructions on pursuing ‘leap frog development in science and technology’ and CAS’s implementation of Xi’s instructions.” In short: not enough progress, despite all the pressure.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.3\">A week earlier, on Sept. 3, more than 50 managers and staffers at the WIV had <a href=\"https://www.documentcloud.org/documents/23171896-wu-yi-bing-du-suo-zhao-kai-ji-zhong-jing-shi-jiao-yu-da-hui-ji-nei-bu-shen-ji-gong-zuo-qi-dong-hui-zhong-guo-ke-xue-yuan-wu-yi-bing-du-yan-jiu-suo\">met</a> to discuss a looming internal audit that would evaluate political discipline, according to a party branch dispatch. The scientists and their overseers were facing scrutiny at every level.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.4\">A trail of evidence from that fall appears to show the WIV trying to address a crisis. “That’s when you start to see emergency response activity,” says Larry Kerr, the former director of the HHS pandemic office.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"23.5\">It began within 24 hours of the start of the CAS inspection. On Sept. 12 between 2 and 3 a.m., the interim report says, the WIV took down its Wildlife-Borne Viral Pathogen Database, which contained more than 15,000 samples from bats. The database had been a resource for researchers globally. A password-protected section only accessible to WIV personnel contained unpublished sequences of bat beta-coronaviruses — the family of coronaviruses to which SARS-CoV-2 belongs. Public access to the database has not yet been restored.</p>\n        \n    \n                    \n\n    \n        <p>On Dec. 11, a team of WIV researchers submitted a patent application for a device to filter and contain hazardous gases inside a biological chamber, like the ones it used to transport infected animals.</p>\n\n    \n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.0\">The Senate researchers analyzed a trail of procurements and patent applications, which, the interim report notes, suggest that “the WIV struggled to maintain key biosafety capabilities at its high-containment BSL3 and BSL4 laboratories.” On Dec. 11, a team of WIV researchers submitted a patent application in China for a device to filter and contain hazardous gases inside a biological chamber, like the ones it used to transport infected animals. The application, which Vanity Fair and ProPublica reviewed, noted that defective air hoses on animal carriers can lead to “multi-stage” risks when airborne pathogens are involved, and warned that a “stable high-efficiency filtering device” and corrosion-resistant frame were “urgently needed.” The following year, in November 2020, the WIV applied for a patent for a new disinfectant compound that it argued would reduce “the corrosion effect to metal, especially stainless steel material,” the interim report says.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.1\">The patent application, which listed seven inventors, including Yuan Zhiming, vividly describes concerns related to its prior disinfectant: </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.2\">Long-term use will lead to corrosion of metal components such as stainless steel, thereby reducing the protection of … facilities and equipment. It can not only shorten its service life and cause economic losses, but also lead to the escape of highly pathogenic microorganisms into the external environment of the laboratory, resulting in loss of life and property and serious social problems.</p>\n\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.3\">In the words of one China analyst who serves as an adviser to Western companies, when Chinese officials “describe the solution to a problem, that’s how you find out what went wrong.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.4\">Vanity Fair and ProPublica analyzed the WIV website and found that there may have been an after-the-fact attempt to reframe the events of November 2019. On Nov. 11, the WIV appeared to republish the entire section of its website containing institutional and party branch news. Every dispatch from prior dates, even those from several years earlier, contains underlying data that indicates that it was changed on that day. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.5\">While this could have resulted from routine site maintenance, it raises another possibility: that WIV officials removed or revised documents in an effort to insulate themselves from blame ahead of the Nov. 19 visit from Ji Changzheng, the CAS biosecurity official.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.6\">The first dispatch to be posted after Nov. 11 was the one from the Zhengdian lab party branch enumerating how its members had rushed to the front lines every time there had been a biocontainment lapse. The dispatch was dated Nov. 12, but the underlying data suggested the file was actually uploaded on Nov. 19, the day of Ji’s urgent visit.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"25.7\">Matthew Pottinger, who researches China-related issues at Stanford University’s Hoover Institution and was President Trump’s former deputy national security adviser, told Vanity Fair and ProPublica, “This is the CCP’s version of ‘cover your ass.’”</p>\n        \n    \n                        \n    \n        “Scientifically, Technically Not Possible”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.0\">As Senate researchers explored the question of when the outbreak began, they and their scientific advisers examined the surprisingly fast vaccine development by several Chinese research teams.   </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.1\">The work of one military vaccinologist caught their attention: Zhou Yusen, director of the State Key Laboratory of Pathogen and Biosecurity at the Academy of Military Medical Sciences Institute of Microbiology and Epidemiology, in Beijing. Zhou had spent years working to develop vaccines for pathogens including SARS and Middle East Respiratory Syndrome (MERS), a novel coronavirus first identified in Saudi Arabia in 2012. A 2016 <a href=\"http://www.whiov.cas.cn/kxyj_160249/kyjz_160280/201911/t20191103_5420043.html\">report</a> by the WIV featured Zhou as a key partner on its MERS vaccine research. And in November 2019, he collaborated on a paper with a team of WIV scientists that included Shi Zhengli.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.2\">On Feb. 24, 2020, Zhou became the first researcher in the world to <a href=\"https://patents.google.com/patent/CN111333704B/en\">apply for a patent</a> for a SARS-CoV-2 vaccine. His proposed vaccine worked by reproducing a part of the virus’s spike protein known as the receptor binding domain. In order to start vaccine development, researchers would have needed the entire SARS-CoV-2 genetic sequence, the interim report says.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.3\">Shi Zhengli has said that her lab was the first to sequence the virus and completed that work on the morning of Jan. 2, 2020. That sequence is the one Zhou said he worked with in his Chinese patent application, which Vanity Fair and ProPublica reviewed. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.4\">According to the interim report, there are limits to how fast a vaccine can be developed. In particular, it said that “animal studies are designed to last a specific length of time and cannot be curtailed without compromising the resulting data.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.5\">In his patent application and in subsequently published papers, Zhou documented a robust research and development process that included both adapting the virus to wild-type mice and infecting genetically modified ones with humanized lungs. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.6\">Vanity Fair and ProPublica consulted two independent experts and one expert adviser to the interim report to get their assessment of when Zhou’s research was likely to have begun. Two of the three said that he had to have started no later than November 2019, in order to complete the mouse research spelled out in his patent and subsequent papers.   </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.7\">Larry Kerr, who advised on the interim report, called the timeline laid out in Zhou’s patent and research papers “scientifically, technically not possible.” He added, “I don’t think any molecular biology lab in the world, no matter how sophisticated, could pull that off.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.8\">Rick Bright, the former HHS official who helped oversee vaccine development for the U.S. government, told Vanity Fair and ProPublica that even a four-month timetable would be “aggressive,” especially when the virus in question is new. “Things aren’t usually that perfect,” he said.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.9\">Jesse Bloom, a virologist at the Fred Hutchinson Cancer Research Center, told us the timetable was very fast but “feasible for a group with substantial existing expertise and ongoing work” on developing similar SARS-related coronavirus vaccines, but only if “everything went right.” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"27.10\">Zhou and his colleagues described their COVID-19 vaccine research in a preprint posted on May 2, 2020. When it was published in a peer-reviewed journal three months later, Reid found, Zhou was listed as “deceased.” The circumstances of his death have not been disclosed.</p>\n        \n    \n                    \n\n    \n        \n\n                        \n                    \n                \n\n            A chart tabulating early cases of COVID-19 in Wuhan.\n    \n            (Mark Peterson/Redux for Vanity Fair)\n    \n    \n    \n\n    \n\n        \n    \n                        \n    \n        Battle Lines\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.0\">In the early hours of Jan. 1, 2020, Wuhan officials closed the Huanan Seafood Wholesale Market after identifying it as the site of the world’s first cluster of SARS-CoV-2 infections. Animals for sale were carted away, stalls were sanitized and an epidemiology team spent days collecting environmental samples.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.1\">How did the virus arrive in Wuhan, a metropolis of 11 million people hundreds of miles north of China’s teeming bat caves? It was such an unlikely place for a coronavirus outbreak that WIV scientists had in the past used Wuhan residents as a control group when screening people in the countryside of Yunnan Province for exposure to bat-borne viruses. The assumption was that urbanites in Wuhan would have little contact with bats. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.2\">To many scientists, the answer was clear: The wildlife trade in China had brought live animals, an obvious source of disease, into dangerously close proximity with people. Years earlier, something similar had happened with SARS, which spilled over into multiple different markets that sold live animals across Guangdong Province over the course of months. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.3\">But the interim report also highlights questions that soon arose regarding the market theory. If the wildlife trade was the culprit, where was the trail of infected animals? And where was the animal host? </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.4\">The question of where COVID-19 came from has never been a purely scientific one. From the start, in both China and the U.S., it has been politicized almost beyond recognition. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.5\">In April 2020, Trump declared at a press conference that COVID-19 — or “kung flu,” as he soon began calling it — had come from a lab in China. When pressed on the evidence for this claim, he declared: “I can’t tell you that. I’m not allowed to tell you that.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.6\">As a conspiratorial rabble trained its sights on the WIV generally, and Shi Zhengli specifically, Western scientists rushed to their defense. “We stand together to strongly condemn conspiracy theories suggesting that COVID-19 does not have a natural origin,” read a statement signed by 27 scientists and published by the Lancet medical journal on Feb. 19, 2020. It would later emerge that one of the scientists who’d signed that statement had sought to conceal his own role in orchestrating it and creating the impression of a consensus, <a href=\"https://www.vanityfair.com/news/2021/06/the-lab-leak-theory-inside-the-fight-to-uncover-covid-19s-origins\">as Vanity Fair has reported previously</a>. That scientist didn’t address this issue when he replied to our request for comment for this article.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.7\">By then, however, the battle lines had been drawn. If you backed the lab-leak theory, you were with Trump. If you believed in science, you supported the natural-origin theory generally and the market-spillover theory in particular. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.8\">On Feb. 25, 2022, a team of researchers from China’s CDC published <a href=\"https://www.researchsquare.com/article/rs-1370392/v1\">a preprint</a> revealing that of the 457 swabs taken from 18 species of animals in the market, none contained any evidence of the virus. Rather, the virus was found in 73 swabs taken from around the market’s environment, all linked to human infections. And although some seafood and vegetable vendors in the market tested positive, no vendors from animal stalls did. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.9\">The next day, a team of scientists including Michael Worobey, an evolutionary biologist at the University of Arizona, published a preprint identifying the Huanan market as the “unambiguous epicenter of the COVID-19 pandemic.” Using mapping software, they analyzed the locations of 155 of the earliest known cases reported by the Chinese authorities to the World Health Organization and found them to be centered on the market. A companion analysis led by Jonathan Pekar, a bioinformatics graduate student at the University of California San Diego, said there had been not one but “at least two” spillover events at the market. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.10\">The Worobey paper described its findings as “dispositive evidence” for a market origin. The New York Times <a href=\"https://www.nytimes.com/interactive/2022/02/26/science/covid-virus-wuhan-origins.html\">catapulted</a> the preprints to international attention.  When the peer-reviewed version was <a href=\"https://www.science.org/doi/10.1126/science.abp8715\">published</a> in Science in July, the “dispositive evidence” language was gone. In a detailed response to our request for comment, Worobey said that the removal of those words was the authors’ editorial choice and that the language in Science was “no less definitive” than the preprint: “It was replaced with similar language: ‘our analyses indicate that the emergence of SARS-CoV-2 occurred through the live wildlife trade in China.’” </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.11\">By contrast, the interim Senate report concludes that “the hypothesis of a natural zoonotic origin no longer deserves the benefit of the doubt, or the presumption of accuracy.” The available evidence doesn’t fit the patterns of previous outbreaks, it states, including outbreaks of SARS in 2003 and avian influenza in 2013. Those outbreaks saw many independent spillover events in multiple locations, and those viruses “exhibited much greater genetic diversity than early SARS-CoV-2 strains.” And within six months of the first known case of SARS, the report says, Chinese health officials found evidence of the virus in palm civets and raccoon dogs.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.12\">The interim report also points out that, “almost three years after the COVID-19 pandemic began, there is still no evidence of an animal infected with SARS-CoV-2, or a closely related virus, before the first publicly reported human COVID-19 cases in Wuhan in December 2019.”  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.13\">Worobey said, “Our two recent papers establish that a natural zoonotic origin is the only plausible scenario for the origin of the pandemic.” Before this story ran, Worobey posted his comments to us, as well as additional ones, on Twitter, so they would not be “<a href=\"https://twitter.com/MichaelWorobey/status/1585538011634143232\">ignored or filtered</a>,” and stated he had not been given sufficient time to respond.  </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.14\">While the China CDC found no evidence of the virus in animals in the market, Pekar told Vanity Fair and ProPublica that the removal of animals from the market by the start of 2020 made it difficult to “actually sample the correct animals for SARS-CoV-2.”    </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.15\">The Senate’s interim report is no likelier than the Worobey and Pekar studies to close the book on the origins debate, nor does it attempt to. If anything, it seems destined to escalate the battle just as Republicans in Congress hope to retake the majority in the midterm elections. They aim to haul Dr. Anthony Fauci, the outgoing director of the National Institute of Allergy and Infectious Diseases, into Benghazi-style hearings. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"30.16\">The dispute over COVID-19’s origins, fought in the halls of Congress and on the web pages of scientific preprints, has become more toxic and divisive as time has passed. On Twitter, what should be scientific debate has devolved into a mosh pit of poop emojis and middle school insults. It is unclear what is driving the animus, but political advantage, egos, scientific reputations and research dollars all hang in the balance.</p>\n        \n    \n                        \n    \n        “Under the Thumb of the Party State”\n    \n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"32.0\">In early February 2020, as COVID-19 was spreading beyond China, James LeDuc of the Galveston National Laboratory began fielding calls from journalists asking if SARS-CoV-2 could have originated from a lab.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"32.1\">He didn’t think so. Nonetheless, on Feb. 9, he emailed his longtime colleague and mentee at the WIV, Yuan Zhiming. LeDuc encouraged him to “conduct a thorough review of the laboratory activities associated with research on coronaviruses so that you are fully prepared to answer questions dealing with the origin of the virus.” He included a three-page list of “some areas where you may wish to investigate.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"32.2\">Included in LeDuc’s proposed review were the following questions: “Is there any evidence to suggest a mechanical failure in biocontainment during the time in question? -were biological safety cabinets used and appropriately certified? -Exhaust air filtration systems working correctly?”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"32.3\">The questions were apt. Two and a half months earlier, according to the interim report, procurement officials at the WIV posted a call for bids on a government website seeking a costly air incinerator. The post was dated Nov. 19, 2019, the very day that the visiting CAS safety official arrived to address a “complex and grave” situation there.</p>\n        \n    \n                    \n\n    \n        <p>\"The WIV is under the thumb of the party state,\" says Toy Reid. \"American scientists have been slow to realize that.\"</p>\n\n    \n    \n\n        \n    \n                    \n<p data-pp-blocktype=\"copy\" data-pp-id=\"34.0\">Prior to the wider adoption of HEPA filters in the 1950s, air incinerators were used to “superheat air coming from one place and going to another, in order to render them free of any microbial agent,” said Bob Hawley, the former safety chief at the Army’s Medical Research Institute of Infectious Disease. “If somehow the HEPA filter system failed, because there was a tear or breach … then your quick fix would be to bring in an air incinerator.”</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"34.1\">LeDuc says he never heard back from Yuan. </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"34.2\">Toy Reid, who is now in Jakarta, Indonesia, resuming his work for the State Department, says that WIV scientists are not “free agents” who can candidly share what occurred in their laboratories. “The WIV is under the thumb of the party state,” he says. “Just because you can’t see the political pressures they’re under doesn’t mean they’re not under them. American scientists have been slow to realize that.”      </p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"34.3\">Without the cooperation of China’s government, we can’t know exactly what did or didn’t happen at the WIV, or what precise set of circumstances unleashed SARS-CoV-2. But the dispatches that Reid unearthed, when overlaid with additional evidence the Senate team compiled, point to a catastrophe in the making: political pressure to excel, inadequate resources to safeguard risky work and an effort to skirt blame once a crisis hit.</p>\n\n<p data-pp-blocktype=\"copy\" data-pp-id=\"34.4\">As Reid sees it, the international community must continue to demand answers. “If you just throw your hands in the air and say, ‘We’ll never know because it’s China,’ and just move on — if you take that defeatist approach to things — you can’t prepare yourself to prevent something like this from happening in the future.”</p>\n        \n    \n                    \n\n    <p>\n        <strong><a href=\"https://www.propublica.org/getinvolved/we-want-to-talk-to-people-working-or-living-on-the-front-lines-of-coronavirus-help-us-report\">We Want to Talk to People Working, Living and Grieving on the Front Lines of the Coronavirus. Help Us Report.</a></strong>\n    </p>\n\n        \n             \n\n                                    \n        \n                        <p><strong>Clarification, Oct. 28, 2022:</strong> This story has been updated to clarify that Michael Worobey, an evolutionary biologist at the University of Arizona, said two recent papers by him and his colleagues established that “a natural zoonotic origin is the only plausible scenario for the origin of the pandemic.”</p>\n\n        \n\n    \n                                         ",
  "dc:subject": "Coronavirus",
  "dc:date": "2022-10-28T12:45:00-04:00",
  "dc:creator": "by Katherine Eban,  Vanity Fair, and Jeff Kao, ProPublica"
}