{
  "title": "Enhanced Visual Feedback with Decoupled Viewpoint Control in Immersive Humanoid Robot Teleoperation using SLAM. (arXiv:2211.01749v1 [cs.RO])",
  "link": "http://arxiv.org/abs/2211.01749",
  "description": "<p>In immersive humanoid robot teleoperation, there are three main shortcomings\nthat can alter the transparency of the visual feedback: the lag between the\nmotion of the operator's and robot's head due to network communication delays\nor slow robot joint motion. This latency could cause a noticeable delay in the\nvisual feedback, which jeopardizes the embodiment quality, can cause dizziness,\nand affects the interactivity resulting in operator frequent motion pauses for\nthe visual feedback to settle; (ii) the mismatch between the camera's and the\nheadset's field-of-views (FOV), the former having generally a lower FOV; and\n(iii) a mismatch between human's and robot's range of motions of the neck, the\nlatter being also generally lower. In order to leverage these drawbacks, we\ndeveloped a decoupled viewpoint control solution for a humanoid platform which\nallows visual feedback with low-latency and artificially increases the camera's\nFOV range to match that of the operator's headset. Our novel solution uses SLAM\ntechnology to enhance the visual feedback from a reconstructed mesh,\ncomplementing the areas that are not covered by the visual feedback from the\nrobot. The visual feedback is presented as a point cloud in real-time to the\noperator. As a result, the operator is fed with real-time vision from the\nrobot's head orientation by observing the pose of the point cloud. Balancing\nthis kind of awareness and immersion is important in virtual reality based\nteleoperation, considering the safety and robustness of the control system. An\nexperiment shows the effectiveness of our solution.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Chen_Y/0/1/0/all/0/1\">Yang Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Sun_L/0/1/0/all/0/1\">Leyuan Sun</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Benallegue_M/0/1/0/all/0/1\">Mehdi Benallegue</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Cisneros_R/0/1/0/all/0/1\">Rafael Cisneros</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Singh_R/0/1/0/all/0/1\">Rohan P. Singh</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kaneko_K/0/1/0/all/0/1\">Kenji Kaneko</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tanguy_A/0/1/0/all/0/1\">Arnaud Tanguy</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Caron_G/0/1/0/all/0/1\">Guillaume Caron</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Suzuki_K/0/1/0/all/0/1\">Kenji Suzuki</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kheddar_A/0/1/0/all/0/1\">Abderrahmane Kheddar</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kanehiro_F/0/1/0/all/0/1\">Fumio Kanehiro</a>"
}