{
  "title": "Electrically controlling vortices in a neutral exciton polariton condensate at room temperature. (arXiv:2211.01680v1 [physics.optics])",
  "link": "http://arxiv.org/abs/2211.01680",
  "description": "<p>Manipulating bosonic condensates with electric fields is very challenging as\nthe electric fields do not directly interact with the neutral particles of the\ncondensate. Here we demonstrate a simple electric method to tune the vorticity\nof exciton polariton condensates in a strong coupling liquid crystal (LC)\nmicrocavity with CsPbBr$_3$ microplates as active material at room temperature.\nIn such a microcavity, the LC molecular director can be electrically modulated\ngiving control over the polariton condensation in different modes. For\nisotropic non-resonant optical pumping we demonstrate the spontaneous formation\nof vortices with topological charges of -2, -1, +1, and +2. The topological\nvortex charge is controlled by a voltage in the range of 1 to 10 V applied to\nthe microcavity sample. This control is achieved by the interplay of a built-in\npotential gradient, the anisotropy of the optically active perovskite\nmicroplates, and the electrically controllable LC molecular director in our\nsystem with intentionally broken rotational symmetry. Besides the fundamental\ninterest in the achieved electric polariton vortex control at room temperature,\nour work paves the way to micron-sized emitters with electric control over the\nemitted light's phase profile and quantized orbital angular momentum for\ninformation processing and integration into photonic circuits.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Zhai_X/0/1/0/all/0/1\">Xiaokun Zhai</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Ma_X/0/1/0/all/0/1\">Xuekai Ma</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gao_Y/0/1/0/all/0/1\">Ying Gao</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Xing_C/0/1/0/all/0/1\">Chunzi Xing</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gao_M/0/1/0/all/0/1\">Meini Gao</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Dai_H/0/1/0/all/0/1\">Haitao Dai</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Wang_X/0/1/0/all/0/1\">Xiao Wang</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Pan_A/0/1/0/all/0/1\">Anlian Pan</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Schumacher_S/0/1/0/all/0/1\">Stefan Schumacher</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Gao_T/0/1/0/all/0/1\">Tingge Gao</a>"
}