{
  "id": "tag:blogger.com,1999:blog-8878620400258430757.post-6687304554029516572",
  "published": "2019-05-29T09:02:00.000-07:00",
  "updated": "2019-05-29T09:02:36.255-07:00",
  "category": "",
  "title": "My Path to Google: Brian Calbeck, Mechanical Manufacturing Engineer",
  "content": "<div dir=\"ltr\" style=\"text-align: left;\" trbidi=\"on\">Welcome to the 33rd installment of our blog series “My Path to Google.” These are real stories from Googlers, interns, and alumni highlighting how they got to Google, what their roles are like, and even some tips on how to prepare for interviews.<br /><br />Today’s post is all about Mechanical Manufacturing Engineer, Brian Calbeck. Read on!<br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://3.bp.blogspot.com/-hqGGatj113Q/XOYQRHhNcDI/AAAAAAAAAjs/McEFPnczSMs6FYgVsd4WuYYlIkc2vyTWACLcBGAs/s1600/Brian%2BCalbeck.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"1200\" data-original-width=\"1600\" height=\"480\" src=\"https://3.bp.blogspot.com/-hqGGatj113Q/XOYQRHhNcDI/AAAAAAAAAjs/McEFPnczSMs6FYgVsd4WuYYlIkc2vyTWACLcBGAs/s640/Brian%2BCalbeck.jpg\" width=\"640\" /></a></div><br /><b>Can you tell us a bit about yourself?</b><br />I’m from the Bay Area and grew up in Walnut Creek, CA. I received both my Mechanical Engineering undergraduate degree and a Masters in Engineering from California Polytechnic State University (Cal Poly). I interned at Apple during grad school and joined Google upon graduating. I enjoy road and mountain cycling, traveling, and spending time with my wife and two daughters.<br /><br /><b>What’s your role at Google?</b><br />I’m a Mechanical Manufacturing Engineer working on Google’s Data Center Infrastructure. My team figures out how and where to build the hardware that runs Google’s software. I love the challenge of working on cutting edge technology at a scale that you can’t find anywhere else. I’m currently working on building tensor processing unit (TPU) hardware to power our machine learning technology.<br /><br /><b>Complete the following: \"I [choose one: code/create/design/build] for...\"</b><br />I help build the hardware that runs Google.<br /><br /><b>What inspires you to come in every day?</b><br />I’m inspired by the scale and complexity of the work we do. It’s rare to work on products that will touch billions of people. I remember the first time I saw a demo of Google Photos and was amazed by the app’s ability to understand the content of my photos. Machine Learning is enabling amazing advancements in almost every industry and I love that I get to be at the forefront of that.<br /><br /><b>Can you tell us about your decision to enter the process?</b><br />I was really excited to apply to Google. I had always admired Google’s culture, but I never thought I would find a role as a Mechanical Engineer until I ran across the posting for my current role. I was skeptical that I’d get an interview since I was a new college grad and the role called for someone with more experience, but my dad encouraged me to take a chance so I applied.<br /><br /><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://1.bp.blogspot.com/-B6dCc7GbFw8/XOYQTHOo9mI/AAAAAAAAAjw/t4lh8D8PnUYjGJa3RXawbSbMYAIgv1rWwCEwYBhgL/s1600/MVIMG_20180531_193126.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"254\" data-original-width=\"338\" height=\"480\" src=\"https://1.bp.blogspot.com/-B6dCc7GbFw8/XOYQTHOo9mI/AAAAAAAAAjw/t4lh8D8PnUYjGJa3RXawbSbMYAIgv1rWwCEwYBhgL/s640/MVIMG_20180531_193126.jpg\" width=\"640\" /></a></div><br /><b>What do you wish you’d known when you started the process?</b><br />It’s easy to get frustrated with a hiring process when you don’t see everything that’s going on behind the scenes, but know that if you’re being considered for a role you’ve already made it past the hardest part. My recruiter did a great job of talking me through the process and helped me provide an honest and accurate picture of what I could bring to the job.<br /><br /><b>Can you tell us about the resources you used to prepare for your interview or role?</b><br />I prepared by reviewing the details of some technical projects I spearheaded in college and put together a portfolio with visual aides. I wanted to make sure I could clearly recall the details of the projects I worked on and communicate them to my interviewers. Interviewers at Google want to know how you think through multi-faceted problems, so having examples fresh in your mind will help when communicating your skills.<br /><br /><b>Do you have any tips you’d like to share with aspiring Googlers?</b><br />Be honest about your experience, skills, and passions and be sure to communicate how these could strengthen your prospective team. When you’re early on in your college career, look for unique jobs and experiences that interest you and relate to your course of study. Your first internship probably won’t be your dream one. I spent two summers working in a machine shop. I started out sweeping the floors but worked my way up to running the machines. That job not only gave me great hands-on experience but helped me stand out when I went to apply for opportunities later on in my college career.</div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Students",
    "uri": "http://www.blogger.com/profile/15517669815238556768",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 28
}