{
  "title": "Identifying influential users in a social network to aid public health",
  "link": "https://blogs.sas.com/content/subconsciousmusings/2022/08/29/identifying-influential-users-in-a-social-network-to-aid-public-health/",
  "comments": "https://blogs.sas.com/content/subconsciousmusings/2022/08/29/identifying-influential-users-in-a-social-network-to-aid-public-health/#respond",
  "dc:creator": "Damian Herrick",
  "pubDate": "Mon, 29 Aug 2022 18:05:27 +0000",
  "category": [
    "Uncategorized",
    "Analytics R&D",
    "SAS Viya",
    "social network analysis"
  ],
  "guid": "https://blogs.sas.com/content/subconsciousmusings/?p=13413",
  "description": "<p>SAS' Damian Herrick chronicles the refresh of a 2002 social-network analysis aimed at identifying influential peer educators among former drug users.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blogs.sas.com/content/subconsciousmusings/2022/08/29/identifying-influential-users-in-a-social-network-to-aid-public-health/\">Identifying influential users in a social network to aid public health</a> appeared first on <a rel=\"nofollow\" href=\"https://blogs.sas.com/content/subconsciousmusings\">The SAS Data Science Blog</a>.</p>\n",
  "content:encoded": "<p>In this post, we examine a <a href=\"https://scholars.uky.edu/en/publications/social-networks-of-drug-users-in-high-risk-sites-finding-the-conn\">network data set study</a> released in 2002 that documented efforts identifying influential users in a social network. The goal of the study was to find the most connected social network users who used drugs themselves and train them as peer educators to help reduce needle sharing and other high-risk behaviors among drug users. The study wanted to find the fewest number of peer educator candidates that could reach the greatest number of other users in the network. To achieve this, the 2002 study utilized degree centrality measures, supplemented with demographic, gender, and racial attributes. Our study demonstrates three methods to find peer educators using only anonymized network data.</p>\n<h2>Hartford drug user social network</h2>\n<p>In their 2002 paper “<a href=\"https://scholars.uky.edu/en/publications/social-networks-of-drug-users-in-high-risk-sites-finding-the-conn\">Social Networks of Drug Users in High-Risk Sides: Finding the Connections</a>,” the authors presented a social network of drug users in Hartford, CT. The research team collected data through interviews with a community of drug users. Users provided information about the types of drugs used, needle-sharing activities, recency of usage, and demographic information such as age, gender, race, and housing status.</p>\n<p>The research team then built a directed network (one in which node connections have a known direction) from the data, where links represented needle-sharing. See Figure 1.</p>\n<figure id=\"attachment_13416\" aria-describedby=\"caption-attachment-13416\" style=\"width: 610px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure1.png\"><img loading=\"lazy\" class=\"size-full wp-image-13416\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure1.png\" alt=\"\" width=\"610\" height=\"132\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure1.png 610w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure1-300x65.png 300w\" sizes=\"(max-width: 610px) 100vw, 610px\" /></a><figcaption id=\"caption-attachment-13416\" class=\"wp-caption-text\">Figure 1: Sample relationship between users in the Hartford Drug User Social Network. In this example, user 1 shares a needle with user 2.</figcaption></figure>\n<p>The team chose to focus on the largest connected component, which represented connections between 193 individuals. This component was later released as an anonymized data set representing links <em>from</em> and <em>to</em> terminals. Each user was assigned a unique number between 1 and 193. So, the primary information content of this network existed within the linkages. The network itself, while connected, was sparse. There were 273 links between nodes. The density was only 0.007. Network density, which ranges from 0 to 1, is defined as actual links divided by potential links. The average links per node was only 1.4. 80 of the 193 nodes were leaf nodes. This means they contained in-links but no out-links.</p>\n<p>A network diagram representing only the raw network is shown in Figure 2. Initial examination of this network shows that the fully connected component is a set of two loosely connected components. In Figure 2, each subcomponent is enclosed by ellipses. The network can be further divided into smaller subgroups, which is described later in Method B.</p>\n<figure id=\"attachment_13419\" aria-describedby=\"caption-attachment-13419\" style=\"width: 676px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure2.png\"><img loading=\"lazy\" class=\"size-full wp-image-13419\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure2.png\" alt=\"\" width=\"676\" height=\"701\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure2.png 676w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure2-289x300.png 289w\" sizes=\"(max-width: 676px) 100vw, 676px\" /></a><figcaption id=\"caption-attachment-13419\" class=\"wp-caption-text\">Figure 2: Initial plot of the full network. Note that the network is a single connected component but can also be viewed as containing two weakly connected subcomponents. Each subcomponent is approximately enclosed by purple and yellow ellipses.</figcaption></figure>\n<h2>Three methods to identify influential users</h2>\n<p>In our attempt to identify important users in the network, we chose three approaches to identify potential peer educator candidates. Once the candidates were identified, we tested their influence by calculating each candidate’s reach (ego) network over two hops. Simply put, we defined a peer educator’s potential influence by counting their friends, and friends of friends. This differs slightly from the efforts of the original 2002 study. Their team relied only on direct (one-hop) connections. Two-hop reach networks were chosen because we didn’t have access to key data available to the original authors. In each method, we attempted to minimize the number of peer educators necessary to reach half of the network (97 nodes).</p>\n<h3>Method A: degree centrality influence</h3>\n<p>The first method we used to identify peer educators was the simplest. Here, we attempted the methods of the original study albeit without some important information about relationships that were used in the paper. For our tests, we could only look at the degree centrality of individual nodes. Degree centrality is a simple-to-understand measure that defines a node’s importance. It is found by counting the total links (both <em>from</em> and <em>to</em>) for each node. A higher degree centrality indicates greater importance.</p>\n<p>We can separate total degree centrality into two categories. The first is in-degree which counts links pointing to a node. The second is out-degree which counts links originating from a node. In our case, we defined a “good” candidate as someone who has a high total degree centrality and a high out-degree centrality. In our test, we identified 19 potential peer educators who have at least five total connections, as well as at least four connections that originate from the node.</p>\n<p>After calculating the two-hop reach (ego) network, we found that these 19 peer educator candidates could potentially reach 132 additional users. This gave us a total network coverage of 151 nodes. Figure 3 shows the extent of influence from the selected peer educators.</p>\n<figure id=\"attachment_13422\" aria-describedby=\"caption-attachment-13422\" style=\"width: 702px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3.png\"><img loading=\"lazy\" class=\"wp-image-13422 size-large\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3-1024x964.png\" alt=\"Identifying Influential Users in a Social Network figure 3\" width=\"702\" height=\"661\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3-1024x964.png 1024w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3-300x282.png 300w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3-768x723.png 768w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure3.png 1417w\" sizes=\"(max-width: 702px) 100vw, 702px\" /></a><figcaption id=\"caption-attachment-13422\" class=\"wp-caption-text\">Figure 3: Influence diagram for Method A - degree centrality influence. Peer educators are yellow nodes, and the nodes they influence are maroon and teal. Unreached nodes are colored blue.</figcaption></figure>\n<h3>Method B: degree centrality within the community influence</h3>\n<p>The second method refined the first approach by first estimating the communities present in the network. Then we calculated the most “important” nodes within each community from the degree centrality.</p>\n<p>For community detection, we used the Louvain method. Then we tested various total community assignments. See Table 1. After reviewing the results, we chose an arrangement that returns five communities, as shown in Figure 4.</p>\n<table width=\"100%\">\n<tbody>\n<tr>\n<td style=\"text-align: center\" width=\"33%\"><strong>Resolution</strong></td>\n<td style=\"text-align: center\" width=\"33%\"><strong>Communities</strong></td>\n<td style=\"text-align: center\" width=\"33%\"><strong>Modularity</strong></td>\n</tr>\n<tr>\n<td width=\"33%\">1.5</td>\n<td width=\"33%\">16</td>\n<td width=\"33%\">0.722</td>\n</tr>\n<tr>\n<td width=\"33%\">1.0</td>\n<td width=\"33%\">12</td>\n<td width=\"33%\">0.727</td>\n</tr>\n<tr>\n<td width=\"33%\">0.5</td>\n<td width=\"33%\">7</td>\n<td width=\"33%\">0.675</td>\n</tr>\n<tr>\n<td width=\"33%\">0.25</td>\n<td width=\"33%\">5</td>\n<td width=\"33%\">0.630</td>\n</tr>\n</tbody>\n</table>\n<figure id=\"attachment_13425\" aria-describedby=\"caption-attachment-13425\" style=\"width: 702px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4.png\"><img loading=\"lazy\" class=\"wp-image-13425 size-large\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4-1024x979.png\" alt=\"Identifying Influential Users in a Social Network figure 4\" width=\"702\" height=\"671\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4-1024x979.png 1024w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4-300x287.png 300w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4-768x734.png 768w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure4.png 1432w\" sizes=\"(max-width: 702px) 100vw, 702px\" /></a><figcaption id=\"caption-attachment-13425\" class=\"wp-caption-text\">Figure 4: Community assignment from the Louvain method. In this example, we used a resolution of 0.25, which resulted in a modularity of 0.63.</figcaption></figure>\n<p>Once community detection was completed, we proceeded with the selection of peer educator candidates. We again used degree centrality as the primary tool to determine influence. For each community, we determined the distribution of out-degree centrality among the community members. In each community, we standardized by z-score and calculated the kernel density estimate as well as the cumulative distribution (CDF) function. From the CDF we derived a score for each node between 0 and 1. Any node with a score of at least 0.85 was selected as a candidate for peer educator. As in Method A, we then calculated the two-hop reach (ego) network for these candidates and determined their total potential influence on the network.</p>\n<p>Method B identified 13 peer educator candidates who could potentially reach 133 additional users for a total network coverage of 146 nodes. Figure 5 shows the extent of influence from the selected peer educators.</p>\n<figure id=\"attachment_13428\" aria-describedby=\"caption-attachment-13428\" style=\"width: 702px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5.png\"><img loading=\"lazy\" class=\"wp-image-13428 size-large\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5-1024x993.png\" alt=\"Identifying Influential Users in a Social Network figure 5\" width=\"702\" height=\"681\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5-1024x993.png 1024w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5-300x291.png 300w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5-768x745.png 768w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure5.png 1440w\" sizes=\"(max-width: 702px) 100vw, 702px\" /></a><figcaption id=\"caption-attachment-13428\" class=\"wp-caption-text\">Figure 5: Influence diagram for Method B - degree centrality within community influence. Peer educators are yellow nodes, and the nodes they influence are maroon and teal. Unreached nodes are colored blue.</figcaption></figure>\n<h3>Method C: influence potential based on two-hop reach networks</h3>\n<p>In Method C, we used a different approach to identify peer educator candidates. Instead of degree centrality, we first calculated all two-hop reach networks over all nodes.  We then submitted these networks into an optimization solver to determine the fewest peer educators that could influence at least half of the nodes in the network. We used the SAS documentation example <a href=\"https://go.documentation.sas.com/doc/en/pgmsascdc/v_028/procgralg/procgralg_optgraph_examples14.htm\">Reach Networks for Computation of Market Coverage of a Terrorist Network</a> as inspiration.</p>\n<p>Relying on reach networks only, Method C identified 25 peer educator candidates who could potentially reach 114 additional users. This gave us a total network coverage of 139 nodes. Figure 6 shows the extent of influence from the selected peer educators.</p>\n<figure id=\"attachment_13431\" aria-describedby=\"caption-attachment-13431\" style=\"width: 598px\" class=\"wp-caption aligncenter\"><a href=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure6.png\"><img loading=\"lazy\" class=\"size-full wp-image-13431\" src=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure6.png\" alt=\"\" width=\"598\" height=\"565\" srcset=\"https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure6.png 598w, https://blogs.sas.com/content/subconsciousmusings/files/2022/08/august-herrick-social-netwrok-figure6-300x283.png 300w\" sizes=\"(max-width: 598px) 100vw, 598px\" /></a><figcaption id=\"caption-attachment-13431\" class=\"wp-caption-text\">Figure 6: Influence diagram for Method C - influence potential from two-hop reach networks. Peer educators are yellow nodes, and the nodes they influence are maroon and teal. Unreached nodes are colored blue.</figcaption></figure>\n<h2>Results</h2>\n<p>Table 2 shows the peer educator candidates and potentially reached users for each of the three methods described above.</p>\n<table width=\"100%\">\n<tbody>\n<tr>\n<td style=\"text-align: center\" width=\"40%\"><strong>Method</strong></td>\n<td style=\"text-align: center\" width=\"15%\"><strong>Peer Educators</strong></td>\n<td style=\"text-align: center\" width=\"15%\"><strong>Users Reached</strong></td>\n<td style=\"text-align: center\" width=\"15%\"><strong>Total Reached</strong></td>\n<td style=\"text-align: center\" width=\"15%\"><strong>Users Not Reached</strong></td>\n</tr>\n<tr>\n<td width=\"40%\">Degree Centrality Influence</td>\n<td width=\"15%\">19</td>\n<td width=\"15%\">132</td>\n<td width=\"15%\">151</td>\n<td width=\"15%\">42</td>\n</tr>\n<tr>\n<td width=\"40%\">Degree Centrality within Community Influence</td>\n<td width=\"10%\">13</td>\n<td width=\"10%\">133</td>\n<td width=\"10%\">146</td>\n<td width=\"10%\">47</td>\n</tr>\n<tr>\n<td width=\"40%\">Two-Hop Reach Network Influence Potential</td>\n<td width=\"15%\">25</td>\n<td width=\"15%\">114</td>\n<td width=\"15%\">139</td>\n<td width=\"15%\">54</td>\n</tr>\n</tbody>\n</table>\n<p>Recall that the original study attempted to minimize the total number of peer educators while reaching the most users in the network. They identified 13 candidates who could reach 97 other users in the network. This would be equivalent to reaching 50% of the network. We were unable to match their methods directly. However, Method A (degree centrality influence) represents the closest approximation to the original study. In our case, Method A identifies 19 candidates who could reach 132 others in the network. Method B has a slightly smaller total reach (146 users as opposed to 151 for Method A). But it achieves this with only 13 peer educator candidates. In Method C, when only two-hop reach networks are considered, then optimized for as close to 100% network coverage, we find that 25 candidates can only reach 114 individuals.</p>\n<p>Of the three methods presented here, only one node (115) was identified as a peer educator candidate by all three methods. Methods A and B identify seven common peer educator candidates (nodes 115, 27, 34, 43, 61, 69, and 77). Methods A and C share only three nodes (115, 28, and 53). Unfortunately, peer educator candidates identified by the original study authors are not available, so we cannot directly compare our results with theirs.</p>\n<h2>Summary</h2>\n<p>This post attempts to replicate results from a <a href=\"https://scholars.uky.edu/en/publications/social-networks-of-drug-users-in-high-risk-sites-finding-the-conn\">2002 paper</a> that identifies connections between drug users in Hartford, CT. In the paper, peer educators are identified by a combination of network analytics methods and prior known information about demographics, gender, race, and behaviors. In our study, we used only network analytics methods without the inclusion of information that could introduce bias into the results.</p>\n<p>Even though we were unable to directly replicate the results from the study, the three methodologies shown provide similar network coverage to the original results. This indicates that it is possible to use only mathematical techniques to identify peer educator candidates in a social network. Method B generated the most favorable results of the fewest peer educators that reached the most members of the network.</p>\n<p>The analyses for this post were developed using <a href=\"https://support.sas.com/en/software/sas-viya.html\">SAS Viya</a>, Jupyter, and Python. If you are interested in learning more about the technical details of this post, and seeing the code used, go to the <a href=\"https://github.com/sassoftware/sas-network-analysis\">SAS Software Network Analysis Github repository</a>. This specific example is located in <a href=\"https://github.com/sassoftware/sas-network-analysis/blob/main/applications/hartford/notebooks/Hartford%20Drug%20User%20Network%20Analysis.ipynb\">applications/Hartford</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://blogs.sas.com/content/subconsciousmusings/2022/08/29/identifying-influential-users-in-a-social-network-to-aid-public-health/\">Identifying influential users in a social network to aid public health</a> appeared first on <a rel=\"nofollow\" href=\"https://blogs.sas.com/content/subconsciousmusings\">The SAS Data Science Blog</a>.</p>\n",
  "wfw:commentRss": "https://blogs.sas.com/content/subconsciousmusings/2022/08/29/identifying-influential-users-in-a-social-network-to-aid-public-health/feed/",
  "slash:comments": 0,
  "enclosure": ""
}