{
  "title": "The Old Farm House | Best of RGSO",
  "link": "https://audioboom.com/posts/8140573",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 1985,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>What is lurking in the darkness of an old haunted house that a child grew up in?<br>\n<br>\nHere is a preview of the story.<br>\n“Old houses settle and have creaks and cracks that are recognizable after years of hearing it. What I heard was not that. You could hear someone walk up the stairs one step at a time from the bottom step to the top step. I remember one time when I was about twelve, I was moving my room around and because of how I rearranged my furniture, I needed to move a picture I had hanging on the wall. My dad always stayed up to watch the 10 o'clock news and then would come up to bed. My parents’ bedroom was on the south side of the stairwell and mine was on the north side. I had my door shut so I would not disturb my mom who was already asleep. I heard my dad come up the stairs and I thought okay, I need to tell him that I need him to move the picture tomorrow. I flung my bedroom door open and said, \"Dad\" then realized he was not there. I thought he had already made it around the corner and was getting into bed so I walked over to their doorway and before I could say anything, I realized he was already in bed and sound asleep. I went back to my room, and it was after 11:30.”<br>\n<br>\nWatch more at: <a href=\"http://www.realghoststoriesonline.com/\">http://www.realghoststoriesonline.com/</a><br>\n<br>\nIf you have a real ghost story or supernatural event to report, please write into our show or call 1-855-853-4802!<br>\nIf you like the show, please help keep us on the air and support the show by becoming an EPP (Extra Podcast Person). We'll give you a BONUS episode every week as a \"Thank You\" for your support. Become an EPP here: <a href=\"http://www.ghostpodcast.com/?page_id=118\">http://www.ghostpodcast.com/?page_id=118</a> or at or at <a href=\"http://www.patreon.com/realghoststories\">http://www.patreon.com/realghoststories</a><br>\n<br>\n\n</div>\n",
  "pubDate": "Sun, 21 Aug 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-16:/posts/8140573",
  "itunes:author": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "dc:creator": "Real Ghost Stories Online | Paranormal, Supernatural & Horror Radio",
  "media:rights": ""
}