{
  "title": "Rishi Sunak seeks to score easy political points by closing down Chinese institutes",
  "link": "https://www.rt.com/news/565800-rishi-sunak-confucius-institutes-china/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565800-rishi-sunak-confucius-institutes-china/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6362598a85f54005914ce39b.jpg\" /> The new UK prime minister, Rishi Sunak, wants to close down Chinese-sponsored Confucius Institutes, which are accused of pushing propaganda <br/><a href=\"https://www.rt.com/news/565800-rishi-sunak-confucius-institutes-china/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The Chinese-sponsored Confucius Institutes have been accused of being influence operations</strong></p>\n            \n                        \n            <p>British Minister for Security Tom Tugendhat, a member of the newly formed Rishi Sunak cabinet, recently responded to a question from anti-China MP Iain Duncan Smith regarding the future of China&rsquo;s Confucius Institutes (CI) in the UK. Smith, the biggest cheerleader of the anti-China agenda in the UK, has a reputation for asking such opportunistic, inflammatory questions in a bid to generate headlines and put items on the agenda.</p>\n<p>Tugendhat responded to the question, saying the government &ldquo;<em><a href=\"https://www.thenational.scot/news/23094268.rishi-sunak-looking-close-confucius-institutes-pose-threat-civil-liberties/\" target=\"_blank\" rel=\"noopener noreferrer\">is looking to close</a></em>&rdquo; all of the institutions. The news was widely acclaimed online, and the talking point was again pushed that Confucius Institutes, whose official state purpose is providing instruction in the Chinese language, are really a &lsquo;trojan horse&rsquo; project for political influence and &lsquo;propaganda&rsquo;.</p>\n<p>Confucius Institutes have been subjected to a longstanding propaganda campaign originating from the US, and now a highly unpopular and brittle Rishi Sunak government eyes them as an easy kill to pacify the right-wing constituency and prove its credentials. Sunak may be the new prime minister, but he is but a legacy of two previous governments who were forced to step down in disgrace and disarray. He trails Labour by 30 points in most polls, pointing to a wipe-out for the Conservatives when the next general election comes.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635917b885f5402da638e2bc.jpg\" alt=\"RT\" />\n            <figcaption><a href=\"https://www.rt.com/news/565327-uk-democracy-china-dictatorship/\">It’s no surprise many Brits would prefer ‘some form of dictatorship’</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Sunak&rsquo;s stance as Britain&rsquo;s first ethnic minority prime minister does not soften his outlook. Rather, it leaves him with something to prove. He is but one of a group of British Indians who, having made it to the highest levels of politics, have sought to buy legitimacy and support for themselves not by preaching tolerance, equality, and goodwill, but by hard-line right-wing nationalism. Just ask Priti Patel, or Home Secretary Suella Braverman, who <a href=\"https://www.theguardian.com/uk-news/2022/nov/01/bravermans-invasion-claim-not-backed-by-facts-say-experts\" target=\"_blank\" rel=\"noopener noreferrer\">described migrants as an <em>&ldquo;invasion&rdquo;</em></a> last week. They aim to be more British than the British themselves.</p>\n<p>And when not bashing migrants, what more of an easy target is there than China? During his time as chancellor, Sunak seemed favourable to Beijing. However, since aiming to become the leader of the party, he has become increasingly sensitive to the idea of being &lsquo;soft&rsquo; on Beijing, and has sought to appeal to ultra-hawks with inflammatory and aggressive rhetoric towards China, even <a href=\"https://www.theguardian.com/politics/2022/oct/26/biden-and-sunak-vow-to-support-ukraine-and-counter-china-in-first-call\" target=\"_blank\" rel=\"noopener noreferrer\">on his first day</a> as prime minister. Through this, he has conjured up the proposal to close all Confucius Institutes. For his government, it is seen as an easy target because it is incredibly easy to demonize and spread paranoia, and few members of the public have an objective or informed understanding of what Confucius Institutes actually do, not least the core Conservative Party constituency, who will be the least likely to use them.</p>\n<p>Confucius Institutes have been repeatedly accused of spreading <em>&ldquo;propaganda&rdquo;</em> and &ldquo;<em>stifling academic freedom</em>.&rdquo; These talking points are not, of course, serious, but stem from a campaign created by the US, which has sought to contain China by deliberately whipping up a McCarthyist climate to undermine engagement with the PRC. The institutes have been made into a grotesque bogeyman, transforming something as innocent and benign as Chinese language education into a massive, out-of-proportion threat. There is no serious evidence that any of these institutions have really pursued what they have been accused of, from &lsquo;propaganda&rsquo; to &lsquo;stifling academic freedom&rsquo; to even &lsquo;espionage&rsquo;.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/635951fe85f54011b6515c8f.jpg\" alt=\"A view of the Cuadrilla exploratory drilling site in Balcombe, West Sussex, England, August 20, 2013\" />\n            <figcaption><a href=\"https://www.rt.com/news/565387-sunak-reinstates-fracking-ban/\">Sunak reinstates UK fracking ban</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The campaign against CI, not surprisingly, emerged in 2018-19, as did most anti-China talking points, including the propaganda against Huawei, Xinjiang, etc., and was pushed by US-sponsored think tanks and individuals. For example, one German Marshall Fund scholar told the BBC that Confucius Institutes collect &ldquo;<em>Military Intelligence.&rdquo;</em> US politicians likewise began to push them out of the US, including cutting government funding for universities which hosted them, and then designating them as <em>&ldquo;foreign missions.&rdquo;</em> Above all, the campaign against CI has been a staple of American propaganda, smear tactics, and alarmism, which brings great inconveniences to those simply trying to learn Chinese language and culture.</p>\n<p>In addition to this, Sunak demonstrates his determination to continue the foreign policy set by his disgraced predecessors &ndash; that is, one based on ideology, nationalism, and &lsquo;post-truth&rsquo; politics, which runs contrary to Britain&rsquo;s national interests. The proposal to close Confucius Institutes for easy political points will harm Britain&rsquo;s educational and academic environment. This is opportunism by a broken, disfigured government that has mismanaged Britain in every way imaginable.</p>\n<p>But finally, we should see that this saga shows how the propaganda campaign against China is so intense that even something as positive as a language class can be depicted in dishonest, threatening, and opportunistic ways. This speaks volumes not only about the US, but also about the circus that governs Britain.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 22:36:15 +0000",
  "dc:creator": "RT"
}