{
  "title": "The Longform Manifesto",
  "link": "https://datamining.typepad.com/data_mining/2014/09/the-longform-manifesto.html",
  "description": "Sometimes a title for a blog posts suggests itself to me which seems so self contained that it takes real effort to actual write the post ('Machine Intelligence, not Machine Learning is the Next Big Thing' is another in this...",
  "content:encoded": "<p>Sometimes a title for a blog posts suggests itself to me which seems so self contained that it takes real effort to actual write the post (&#39;Machine Intelligence, not Machine Learning is the Next Big Thing&#39; is another in this line). The idea behind the (or a) Longform Manifesto is as follows. I have become aware of late of the sense of deterioration that is associated with the mobile &#39;revolution&#39; and the info snacking, casual gaming and interupt driven lifestyle that it has entailed. The behaviours are perfectly illustrated in this scene from Portlandia:</p>\n<p><iframe allowfullscreen=\"\" frameborder=\"0\" height=\"281\" src=\"http://www.youtube.com/embed/Pe-zq4bFPFU?feature=oembed\" width=\"500\"></iframe>&#0160;</p>\n<p>With a daughter who has now come of technological age (she has a cell phone) it has become important to me to remind myself what content consumption was like before this mobile mess appeared.</p>\n<p>We read books, we watched movies, we listened to music. But, of course, we haven&#39;t stopped doing that. Rather, we have started all this other stuff, and the problem is that this is influencing how we approach longform content. I find myself watching bits of movies, or listening to bits of music or reading parts of essays.</p>\n<p>The Longform Manifesto, through the definition of longform content and the discipline and commitment needed to consume it as it was meant to be consumed, helps to dillute and remove the behaviour degrading influence of mobile technology. Someone should write it.</p>",
  "dc:subject": "Content",
  "dc:creator": "Matthew Hurst",
  "dc:date": "2014-09-26T01:37:15-04:00"
}