{
  "title": "Coherently averaged dual-comb spectroscopy with a low-noise and high-power free-running gigahertz dual-comb laser. (arXiv:2211.01368v1 [physics.optics])",
  "link": "http://arxiv.org/abs/2211.01368",
  "description": "<p>We present a new type of dual optical frequency comb source capable of\nscaling applications to high measurement speeds while combining high average\npower, ultra-low noise operation, and a compact setup. Our approach is based on\na diode-pumped solid-state laser cavity which includes an intracavity biprism\noperated at Brewster angle to generate two spatially-separated modes with\nhighly correlated properties. The 15-cm-long cavity uses an Yb:CALGO crystal\nand a SESAM as an end mirror to generate more than 3 W average power per comb,\nbelow 80 fs pulse duration, a repetition rate of 1.03 GHz, and a continuously\ntunable repetition rate difference up to 27 kHz. We carefully investigate the\ncoherence properties of the dual-comb by a series of heterodyne measurements,\nrevealing several important features: (1) ultra-low jitter on the uncorrelated\npart of the timing noise; (2) the radio frequency comb lines of the\ninterferograms are fully resolved in free-running operation; (3) we validate\nthat through a simple measurement of the interferograms we can determine the\nfluctuations of the phase of all the radio frequency comb lines; (4) this phase\ninformation is used in a post-processing routine to perform coherently averaged\ndual-comb spectroscopy of acetylene (C2H2) over long timescales. Our results\nrepresent a powerful and general approach to dual-comb applications by\ncombining low noise and high power operation directly from a highly compact\nlaser oscillator.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Phillips_C/0/1/0/all/0/1\">C. R. Phillips</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Willenberg_B/0/1/0/all/0/1\">B. Willenberg</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Nussbaum_Lapping_A/0/1/0/all/0/1\">A. Nussbaum-Lapping</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Callegari_F/0/1/0/all/0/1\">F. Callegari</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Camenzind_S/0/1/0/all/0/1\">S. L. Camenzind</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Pupeikis_J/0/1/0/all/0/1\">J. Pupeikis</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Keller_U/0/1/0/all/0/1\">U. Keller</a>"
}