{
  "id": "https://bibleinoneyear.org/en/youth/122",
  "title": "Day 122: How to Handle Confrontation",
  "description": "Psalm 55:1-3a, 9, Joshua 22:24, John 3:1–3,8,14–18. I greatly admire the skill of those who know when to confront and are good at confronting in a loving way  They have learnt how to speak the truth in love (Ephesians 4:15)",
  "pubDate": "Sun, 02 May 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/122/?ignore",
  "itunes:duration": "13:13",
  "guid": "enyouth02052021-122",
  "length": 793.18,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 122: How to Handle Confrontation",
  "itunes:subtitle": "Psalm 55:1-3a, 9, Joshua 22:24, John 3:1–3,8,14–18. I greatly admire the skill of those who know when to confront and are good at confronting in a loving way  They have learnt how to speak the truth in love (Ephesians 4:15)",
  "itunes:summary": "Before we start the Bible in One Year for today we wanted to let you know about our annual Leadership Conference coming up on Tuesday 4 May and again on Wednesday 5 May. It’s online, 2 hours, and free – and we would love you to join us. Pippa and I will be hosting live from London and we will be speaking to some hugely inspiring friends including the Archbishop of Cape Town, Thabo Makgoba, Rick and Kay Warren (co pastors of Saddleback church), Heidy Quah, founder of Refuge for the Refugees, and Francis Collins – one of the greatest scientists in our world today, who is leading the charge in the fight against Covid 19. Our hope is that everyone who joins will be inspired, encouraged, and refreshed by the Holy Spirit. To find out more and to register please visit leadershipconference.org.uk.\nConfrontation is not something that I find easy. It is a delicate operation. It is crucial to find the right approach, the right words for the job. Or, to use a golfing analogy, it is like the skill of knowing which club to use.\nThose who are skilled at confrontation have a great variety of approaches and words, and know when and how to use the appropriate one.\nConfrontation is not always the right course. Not every critic has to be confronted. Not every wrong statement needs to be refuted.\nI greatly admire the skill of those who know when to confront and are good at confronting in a loving way. They have learnt how to speak the truth in love (Ephesians 4:15).\nWhen confrontation is necessary, how should you go about it?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 122
}