{
  "title": "Helping blockchain communities fix bugs",
  "link": "https://news.mit.edu/2022/metrika-blockchain-1028",
  "description": "MIT alumnus-founded Metrika has developed a suite of analytics tools giving blockchain communities visibility into their networks.",
  "pubDate": "Fri, 28 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/metrika-blockchain-1028",
  "dc:creator": "Zach Winn | MIT News Office",
  "content:encoded": "<p>If the crypto enthusiasts are right, the next decade will see billions of people begin using applications built off distributed, user-owned blockchains. The new paradigm has been dubbed Web 3. But Web 3 still has some significant challenges to overcome if it’s going to replace the digital world as we know it.</p>\n\n<p>Blockchain networks, for instance, are going to need an efficient way of detecting and resolving performance problems. Current analytics tools are built for companies to monitor their websites and apps. Such services need only be designed for one user. In the decentralized world of the blockchains, however, the users are the owners, turning the traditional model of maintenance and bug fixes on its head.</p>\n\n<p>The MIT alumnus-founded company Metrika has developed a suite of tools to help the distributed communities of the blockchain world monitor and improve their networks. The company allows users to create alerts, access reports, and view real-time community dashboards that visualize network performance, problems, and trends over time.</p>\n\n<p>“Metrika is a community-based monitoring and collaboration platform,” founder and CEO Nikos Andrikogiannopoulos SM ’06, MBA ’11 says. “We’re making [blockchain network] telemetry a public good for everyone. These applications are holding billions of dollars in assets, so it's unimaginable that we wouldn't have service assurance and deep visibility of what is happening in real-time.”</p>\n\n<p>Metrika is currently providing services for popular blockchain protocols including Ethereum, Algorand, Flow, and Solana. The company plans to expand that list as other networks grow in popularity in hopes of enabling the much-hyped shift to Web 3.</p>\n\n<p>“Our vision at Metrika is to become a critical layer of the Web 3 world,” Andrikogiannopoulos says. “Ten years from now, kids will be interacting with assets on their mobile phone. The idea of a bank account will be foreign to them. There will be no corner banks. The whole idea of finance will not go through physical stores and bank accounts — you’ll have assets on every application you use. In that world, where everything is happening on a blockchain, how can Metrika help provide the observability, reliability, and visibility of the blockchain network?”</p>\n\n<p><strong>Bouncing ideas off MIT</strong></p>\n\n<p>Andrikogiannopoulos first came to MIT as a graduate student in 2004 and he likes to say he never really left. To this day he lives in Cambridge with his wife, who works at MIT, and returns to campus often.</p>\n\n<p>After earning his second MIT degree, an MBA from the Sloan School of Management, Andrikogiannopoulos began a telecommunications consulting job. During lunch breaks, he’d return to MIT to work with the Venture Mentoring Services (VMS), where entrepreneurs from the MIT community can connect with mentors and receive advice. While kicking around telecommunications startup ideas, a VMS mentor connected him to internet entrepreneur Rubin Gruber, who suggested he explore the blockchain space instead.</p>\n\n<p>It was mid 2018 — what many remember as the “crypto winter” for the lull in blockchain hype and the corresponding crash of crypto prices. But Andrikogiannopoulos began researching the industry and networking with people in the blockchain space, including an MIT alumnus working at the blockchain company Algorand, which was founded by Silvio Micali, the Ford Foundation Professor of Engineering at MIT.</p>\n\n<p>A few months after their initial talk, Andrikogiannopoulos returned to Gruber’s office and told him blockchains were lacking monitoring and operational intelligence.</p>\n\n<p>The problem stems from the decentralized structure of blockchains. Each user operates as a node in the system by creating, receiving, and moving data through their server. When users encounter a problem, they need to figure out if the problem lies within their node or involves the network as a whole.</p>\n\n<p>“They might go on Twitter and Discord and ask other users what they’re experiencing,” Andrikogiannopoulos says. “They’re trying to triangulate the problem, and it takes several hours for them to figure out the issue, coordinate a response, and resolve it.”</p>\n\n<p>To build Metrika, Andrikogiannopoulos set up open-source nodes across the globe that pull data from the nodes and networks, then aggregate those data into easy-to-understand reports and other tools.</p>\n\n<p>“We act as public infrastructure, so users get visibility through dashboards, alerting, and reports, and then we add collaboration tools on top of that,” Andrikogiannopoulos explains.</p>\n\n<p>By 2019, Metrika had begun detecting problems with node performance, staking, network latency, and errors like blocks not being produced at the right rate. Andrikogiannopoulos showed his progress to employees at Algorand, who expressed interest, so he continued building out Metrika's suite of tools.</p>\n\n<p>\"You can see the idea of Metrika bounced across the entire MIT ecosystem,” Andrikogiannopoulos says. “It’s crucial when you start companies that you have these kinds of insight and resource-rich environments like MIT, where you can iterate on your ideas and find team members to join you.”</p>\n\n<p><strong>Enabling Web 3</strong></p>\n\n<p>Blockchains are no longer a niche technology. Around the world, companies in finance and logistics, as well gamers and other creatives, are adopting the technology.</p>\n\n<p>“The blockchain world up to today has been a large experiment,” Andrikogiannopoulos says. “A lot of this infrastructure just hasn’t been built. But Bitcoin proved this can work outside of the traditional finance world, and Ethereum is bringing it to another level with applications, smart contracts, and by creating essentially a decentralized, smart computer. We think about enabling that world we see coming.”</p>\n\n<p>As Metrika continues building out solutions to monitor blockchains, it also wants to offer services for the many applications being built on top of that infrastructure.</p>\n\n<p>“In the future, if a blockchain transaction doesn’t go through and you’re Goldman Sachs or JP Morgan, you need to know why that transaction didn’t go through and what happened,” Andrikogiannopoulos says. “Or if you’re an application playing a game or buying assets and the transactions are lagging, you need to understand why the user experience is being impacted. In Web 3 these things are every important because of the scale and the flow of value we’re talking about.”</p>\n\n<p>For Nikos, improving blockchain performance is not just about optimizing networks. It’s also about helping to usher in the world of open finance and open applications that Web 3 promises.</p>\n\n<p>“We’ve reached 17 hours of outage on blockchain networks in some cases, but what’s even more important to me is not the outages themselves, but the infrastructure needed to avoid them as the industry continues maturing,” Nikos says. “These problems can compromise trust as we’re onboarding users into the Web 3 world. Metrika’s mission is to enable a compelling Web 3 ecosystem.”</p>",
  "media:content": {
    "media:description": "Metrika has developed tools to help the distributed communities of the blockchain world monitor and improve their networks."
  },
  "category": [
    "Alumni/ae",
    "Cybersecurity",
    "Startups",
    "Innovation and Entrepreneurship (I&E)",
    "Venture Mentoring Service",
    "Computer science and technology",
    "Computer Science and Artificial Intelligence Laboratory (CSAIL)",
    "Electrical Engineering & Computer Science (eecs)",
    "MIT Sloan School of Management",
    "School of Engineering"
  ]
}