{
  "title": "EP 159 Psych Files Brief #3: Evidence in Favor of Affirmations? The Licensing Effect and the Power of Gossip",
  "pubDate": "Tue, 06 Sep 2011 23:20:03 +0000",
  "guid": "b27f16d3a9e2f7b3b309af20accb3523",
  "link": "https://traffic.libsyn.com/secure/thepsychfiles/TPF_159_Brief3_090611.mp3",
  "itunes:image": "",
  "description": "<p>What's Wrong With a Little Gossip?<br /><br />While some research points out that gossipers are in general disliked, there is an upside: sharing negative gossip can actually help two people like each other better. In this episode we'll find out the benefits of sharing a tasty piece of negative gossip.<br /><br />The Licensing Effect<br /><br />If you take supplements you need to hear this news about how you might be using your taking of the supplements to \"license\" other activities that aren't so good for your health.<br /><br />Evidence in Favor of Affirmations?<br /><br />In a previous episode on self affirmations I presented some strongly negative evidence. However, in this study there might be a role for affirmations - especially in helping people with social anxiety to feel a bit more confident.</p>",
  "content:encoded": "<p>What's Wrong With a Little Gossip?While some research points out that gossipers are in general disliked, there is an upside: sharing negative gossip can actually help two people like each other better. In this episode we'll find out the benefits of sharing a tasty piece of negative gossip.The Licensing EffectIf you take supplements you need to hear this news about how you might be using your taking of the supplements to \"license\" other activities that aren't so good for your health.Evidence in Favor of Affirmations?In a previous episode on self affirmations I presented some strongly negative evidence. However, in this study there might be a role for affirmations - especially in helping people with social anxiety to feel a bit more confident.</p>",
  "enclosure": "",
  "itunes:duration": "31:11",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "What's Wrong With a Little Gossip?While some research points out that gossipers are in general disliked, there is an upside: sharing negative gossip can actually help two people like each other better. In this episode we'll find out the benefits of...",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "What's Wrong With a Little Gossip? While some research points out that gossipers are in general disliked, there is an upside: sharing negative gossip can actually help two people like each other better. In this episode we'll find out the benefits of sharing a tasty piece of negative gossip. The Licensing Effect If you take supplements you need to hear this news about how you might be using your taking of the supplements to \"license\" other activities that aren't so good for your health. Evidence in Favor of Affirmations? In a previous episode on self affirmations I presented some strongly negative evidence. However, in this study there might be a role for affirmations - especially in helping people with social anxiety to feel a bit more confident."
}