{
  "title": "Jenny Hickinbotham: Sticks And Stones Will Break My Bones, But Words Can Totally Destroy My Mind!",
  "itunes:author": "Liquid Architecture",
  "itunes:subtitle": "Sound Series",
  "itunes:summary": "Jenny Hickinbotham is an artist working across writing, video, sculpture, and songs. Sticks and Stones will break my bones, But Words Can Totally Destroy My Mind! took place at Blindside Gallery for Liquid Architecture’s Sound Series exhibition in April 2022. The exhibition featured a series of experimental song-poems, performed unaccompanied by the artist in her home, in Gisborne, regional Victoria, and presented in video form in collaboration with Joel Stern and Carmen Sibha-Keiso. In these performances Hickinbotham inhabits multiple voices, perspectives and temporalities as she explores the epigenetic impacts of trauma, and the narratives of individuals swept up by the force of history, institutions, and the places in which they live. \n\nHere, Hickinbotham reflects on the exhibition and performances, the influence of childhood experiences and hearing voices, and the freedom that song writing provided. Throughout this episode Hickinbotham’s songs also feature the musicians Steph Treesea, Mish Szhekelyhidi, James Rushford, and Sam Pankhurst. \n\nhttps://liquidarchitecture.org.au/events/jenny-hickinbotham\n\nSound Series\n06 April – 23 April 2022\nBlindside, Melbourne\nPresented by Blindside, City of Melbourne and Liquid Architecture\n\nImage: ​​Rudi Williams\n\nFinancial support from patrons at any level has a resounding impact on our work. You can support Liquid Architecture’s weekly podcast and our online journal Disclaimer, for new thinking and writing on listening and sound through a Patreon subscription, for as little as $5 a month.\n\nhttps://www.patreon.com/liquidarchitecture\n\nFor the past 20 years, Liquid Architecture has been Australia’s leading organisation for artists working with sound and listening. LA investigates the sounds themselves, but also the ideas communicated about, and the meaning of, sound and listening.\n\nProduced by Mara Schwerdtfeger",
  "itunes:image": "",
  "enclosure": "",
  "guid": "https://liquidarchitecture.org.au/podcast/jenny-hickenbotham-sticks-and-stones-will-break-my-bones-but-words-can-totally-destroy-my-mind",
  "pubDate": "Tue, 03 May 2022 08:00:00 +1000",
  "itunes:duration": "29:42",
  "itunes:explicit": "no"
}