{
  "title": "514 - How the Reversal of Roe v. Wade is Already Disrupting Lifesaving Health Care",
  "itunes:title": "514 - How the Reversal of Roe v. Wade is Already Disrupting Lifesaving Health Care",
  "pubDate": "Wed, 07 Sep 2022 10:00:17 +0000",
  "guid": "34b611b8-83b4-49ad-92c2-7ad0321c31fa",
  "link": "https://johnshopkinssph.libsyn.com/514-how-the-reversal-of-roe-v-wade-is-already-disrupting-lifesaving-health-care",
  "itunes:image": "",
  "description": "<p>Since the Supreme Court’s reversal of Roe v. Wade, many states have passed restrictive, confusing, and sometimes contradictory laws impacting health care. <strong>Dr. Jack Resneck, Jr</strong>, the new president of the American Medical Association talks with <strong>Stephanie Desmon</strong> about the challenges physicians are facing when making critical decisions with patients about often lifesaving health care, the threat of a “mass exodus” of practitioners from states with more restrictive laws, and who ultimately pays the highest price for the “egregious allowance of government in the exam room.” <a href= \"http://PublicHealth.jhu.edu/PublicHealthOnCall/Survey\"><strong>We want to hear from you!</strong></a> </p>",
  "content:encoded": "<p>Since the Supreme Court’s reversal of Roe v. Wade, many states have passed restrictive, confusing, and sometimes contradictory laws impacting health care. Dr. Jack Resneck, Jr, the new president of the American Medical Association talks with Stephanie Desmon about the challenges physicians are facing when making critical decisions with patients about often lifesaving health care, the threat of a “mass exodus” of practitioners from states with more restrictive laws, and who ultimately pays the highest price for the “egregious allowance of government in the exam room.” <a href= \"http://PublicHealth.jhu.edu/PublicHealthOnCall/Survey\">We want to hear from you!</a> </p>",
  "enclosure": "",
  "itunes:duration": "15:57",
  "itunes:explicit": false,
  "itunes:keywords": "healthcare,publichealth,roevwade",
  "itunes:subtitle": "Since the Supreme Court’s reversal of Roe v. Wade, many states have passed restrictive, confusing, and sometimes contradictory laws impacting health care. Dr. Jack Resneck, Jr, the new president of the American Medical Association talks with...",
  "itunes:season": 6,
  "itunes:episode": 514,
  "itunes:episodeType": "full",
  "itunes:author": "Johns Hopkins Bloomberg School of Public Health"
}