{
  "id": "yt:video:QPQUrUS47Hg",
  "yt:videoId": "QPQUrUS47Hg",
  "yt:channelId": "UCjmJDM5pRKbUlVIzDYYWb6g",
  "title": "Baz Luhrmann’s ELVIS | “Trouble” Lyric Video",
  "link": "",
  "author": {
    "name": "Warner Bros. Pictures",
    "uri": "https://www.youtube.com/channel/UCjmJDM5pRKbUlVIzDYYWb6g"
  },
  "published": "2022-06-30T16:00:17+00:00",
  "updated": "2022-06-30T19:35:38+00:00",
  "media:group": {
    "media:title": "Baz Luhrmann’s ELVIS | “Trouble” Lyric Video",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "If you’re looking for trouble, you came to the right place. ⚡️ \nAustin Butler stars in Baz Luhrmann’s #ElvisMovie. \nGet your tickets now and experience it only in theaters TODAY! #TCB https://elvis.warnerbros.com\n\nhttps://www.facebook.com/ElvisMovie \nhttps://www.instagram.com/ElvisMovie \nhttps://twitter.com/ElvisMovie \nhttps://www.tiktok.com/@ElvisFilm\n\nELVIS is an epic, big-screen spectacle from Warner Bros. Pictures and visionary, Oscar-nominated filmmaker Baz Luhrmann that explores the life and music of Elvis Presley, starring Austin Butler and Oscar winner Tom Hanks. \n\nA thoroughly cinematic drama, Elvis’s (Butler) story is seen through the prism of his complicated relationship with his enigmatic manager, Colonel Tom Parker (Hanks). As told by Parker, the film delves into the complex dynamic between the two spanning over 20 years, from Presley’s rise to fame to his unprecedented stardom, against the backdrop of the evolving cultural landscape and loss of innocence in America. Central to that journey is one of the significant and influential people in Elvis’s life, Priscilla Presley (Olivia DeJonge). \n\nStarring alongside Butler and Hanks, award-winning theatre actress Helen Thomson (“Top of the Lake: China Girl,” “Rake”) plays Elvis’s mother, Gladys, Richard Roxburgh (“Moulin Rouge!” “Breath,” “Hacksaw Ridge”) portrays Elvis’s father, Vernon, and DeJonge (“The Visit,” “Stray Dolls”) plays Priscilla. Luke Bracey (“Hacksaw Ridge,” “Point Break”) plays Jerry Schilling, Natasha Bassett (“Hail, Caesar!”) plays Dixie Locke, David Wenham (“The Lord of the Rings” Trilogy, “Lion,” “300”) plays Hank Snow, Kelvin Harrison Jr. (“The Trial of the Chicago 7,” “The High Note”) plays B.B. King, Xavier Samuel (“Adore,” “Love & Friendship,” “The Twilight Saga: Eclipse”) plays Scotty Moore, and Kodi Smit-McPhee (“The Power of the Dog”) plays Jimmie Rodgers Snow. \n\nAlso in the cast, Dacre Montgomery (“Stranger Things,” “The Broken Heart Gallery”) plays TV director Steve Binder, alongside Australian actors Leon Ford (“Gallipoli,” “The Pacific”) as Tom Diskin, Kate Mulvany (“The Great Gatsby,” “Hunters”) as Marion Keisker, Gareth Davies (“Peter Rabbit,” “Hunters”) as Bones Howe, Charles Grounds (“Crazy Rich Asians,” “Camp”) as Billy Smith, Josh McConville (“Fantasy Island”) as Sam Phillips, and Adam Dunn (“Home and Away”) as Bill Black. \n\nTo play additional iconic musical artists in the film, Luhrmann cast singer/songwriter Yola as Sister Rosetta Tharpe, model Alton Mason as Little Richard, Austin, Texas native Gary Clark Jr. as Arthur Crudup, and artist Shonka Dukureh as Willie Mae “Big Mama” Thornton. \n\nOscar nominee Luhrmann (“The Great Gatsby,” “Moulin Rouge!”) directed from a screenplay by Baz Luhrmann & Sam Bromell and Baz Luhrmann & Craig Pearce and Jeremy Doner, story by Baz Luhrmann and Jeremy Doner. The film’s producers are Luhrmann, Oscar winner Catherine Martin (“The Great Gatsby,” “Moulin Rouge!”), Gail Berman, Patrick McCormick and Schuyler Weiss. Toby Emmerich, Courtenay Valenti and Kevin McCormick executive produced. \n\nThe director’s behind-the-scenes creative team includes director of photography Mandy Walker (“Mulan,” “Australia”), Oscar-winning production designer and costume designer Catherine Martin (“The Great Gatsby,” “Moulin Rouge!”), production designer Karen Murphy (“A Star Is Born”), editors Matt Villa (“The Great Gatsby,” “Australia”) and Jonathan Redmond (“The Great Gatsby”), Oscar-nominated visual effects supervisor Thomas Wood (“Mad Max: Fury Road”), music supervisor Anton Monsted (“Australia,” “Moulin Rouge!”) and composer Elliott Wheeler (“The Get Down”). \n\nPrincipal photography on “Elvis” took place in Queensland, Australia with the support of the Queensland Government, Screen Queensland, and the Australian Government’s Producer Offset program. \n\nA Warner Bros. Pictures Presentation, A Bazmark Production, A Jackal Group Production, A Baz Luhrmann Film, “Elvis” will be distributed worldwide by Warner Bros. Pictures. It is set to release in theaters in North America on June 24, 2022, and internationally beginning 22 June 2022.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}