{
  "title": "Goalkeeping Robot Dog Tends Its Net Like a Pro",
  "link": "https://spectrum.ieee.org/football-robot-mini-cheetah",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/animated-gif-of-a-human-kicking-a-soft-football-soccer-ball-at-a-small-quadruped-robot-which-leaps-to-successfully-block-the.gif?id=31924013&width=1245&height=700&coordinates=67%2C0%2C67%2C0\"/><br/><br/><p>The best professional football goalkeepers in the English Premiere League (we’re talking about the sport called soccer in North America) are able to save <a href=\"https://scores.nbcsports.com/epl/player_leaders.asp?category=107\" rel=\"noopener noreferrer\" target=\"_blank\">almost, but not quite, 80 percent of shots taken on goal</a>. This is very good. But it’s not nearly as good as the 87.5 percent of shots that a 9-kilogram quadrupedal robot can block: In its tiny goal, and versus tiny children taking tiny shots, <a href=\"https://robots.ieee.org/robots/minicheetah/\" target=\"_blank\">Mini Cheetah</a> turns out to be an excellent goalie.</p><hr/><p class=\"shortcode-media shortcode-media-youtube\">\n<span class=\"rm-shortcode\" data-rm-shortcode-id=\"bf3226393fe9a40eb601854c472834d3\" style=\"display:block;position:relative;padding-top:56.25%;\"><iframe frameborder=\"0\" height=\"auto\" lazy-loadable=\"true\" scrolling=\"no\" src=\"https://www.youtube.com/embed/iX6OgG67-ZQ?rel=0\" style=\"position:absolute;top:0;left:0;width:100%;height:100%;\" width=\"100%\"></iframe></span>\n</p><p>What’s the point of this? Well, it’s fun! Also, this is a challenging problem, because it involves highly dynamic locomotion with object manipulation—specifically, manipulating a fast-moving ball in any direction except for into the goal. Teaching the robot to move its body dynamically while also making sure that its feet (or face) end up where they need to be in time to block the ball is basically two problems combined into one. The trick here is combining the right locomotion controller with a planner for the end-effector trajectory that can find the best way to get Mini Cheetah in front of the ball for the save—all in the less than a second that it takes for the ball to travel to the goal.</p><p>The approach to solving this was to train Mini Cheetah on a set of useful goalkeeping skills: sidestepping for intercepts near the robot and close to the ground, diving to reach the lower corners of the goal, and jumping to cover the top of the goal and the upper corners. The idea (or hope?) is that all of these skills are recoverable and that the robot will end up making a safe landing on its feet afterward. But as with human goalies, that’s a secondary concern behind making a successful save. A reference motion for each skill is manually programmed in, and then the system is trained up in simulation before being transferred directly to the robot. Intercepting the ball involves the system choosing which skill will get a piece of the robot to intersect the ball’s trajectory in the most stable and energy-efficient way.</p><p>The goal that Mini Cheetah is defending is 1.5 meters wide and 0.9 meters high, and the ball (size 3) is kicked from about 4 meters away. The ball is tracked externally. The robot’s performance here is pretty impressive for such a little robot, but we should keep it in context:</p><blockquote>We show that our system can be used to directly transfer dynamic maneuvers and goalkeeping skills learned in simulation to a real quadrupedal robot, with an 87.5 [percent] successful interception rate of random shots in the real world. We note that human soccer goalkeepers average around a 69 [percent] save rate. Although this is against professional players shooting towards regulation sized goals, we hope this paper takes us one step closer to enabling robotic soccer players to compete with humans in the near future.</blockquote><p>If you think about it, the sport of football is basically a bunch of discrete skills that can be chained together around the trajectory of a ball in support of a high-level goal. And the researchers say that “the proposed framework can be extended to other scenarios, such as multiskill soccer-ball kicking.” This group has already done some early work on shooting, and it’ll be fun to see what they come up with next.</p><p>And also, watch your back, English Premiere League goalies: Mini Cheetah is coming for you.</p><em>Creating a Dynamic Quadrupedal Robotic Goalkeeper with Reinforcement Learning</em>, by Xiaoyu Huang, Zhongyu Li, Yanzhen Xiang, Yiming Ni, Yufeng Chi, Yunhao Li, Lizhi Yang, Xue Bin Peng, and Koushil Sreenath from <a href=\"https://hybrid-robotics.berkeley.edu/\" target=\"_blank\">the University of California, Berkeley's Hybrid Robotics Lab</a>, is <a href=\"https://arxiv.org/abs/2210.04435\" rel=\"noopener noreferrer\" target=\"_blank\">available on arXiv</a>.",
  "pubDate": "Sun, 16 Oct 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/football-robot-mini-cheetah",
  "category": [
    "Mini cheetah",
    "Legged robots",
    "Soccer robots",
    "Football robots",
    "Robotics"
  ],
  "dc:creator": "Evan Ackerman",
  "media:content": ""
}