{
  "id": "tag:blogger.com,1999:blog-15045980.post-1212546976395040289",
  "published": "2020-05-08T09:00:00.000-07:00",
  "updated": "2020-05-08T14:50:55.792-07:00",
  "category": [
    "",
    "",
    ""
  ],
  "title": "COOL to be a TE @ Google",
  "content": "<span style=\"font-family: inherit;\">By&nbsp;Anantha Keesara</span><br /><span style=\"font-family: inherit;\"><br /></span><span style=\"font-family: inherit;\">Test Engineers are a part of Google’s Engineering Productivity (EngProd) Group. As mentioned in a <a href=\"https://testing.googleblog.com/2016/09/what-test-engineers-do-at-google.html\">previous post</a>, we advocate for our users, provide comprehensive testing solutions, and play a key role creating successful and reliable products and platforms. At Google, Test Engineers are not manual testers; we are technical engineers whose focus is on advancing product excellence and engineering productivity.</span><br /><div><span style=\"font-family: inherit;\"><br /></span><span style=\"font-family: inherit;\">In short, it’s <span style=\"color: blue; font-weight: bold;\">COOL</span> (<span style=\"font-weight: bold;\">C</span>onstant learner, <span style=\"font-weight: bold;\">O</span>ut-of-the-box thinker, <span style=\"font-weight: bold;\">O</span>rchestrator, <span style=\"font-weight: bold;\">L</span>eading-edge user) to be a Test Engineer at Google:</span></div><br /><span style=\"font-family: inherit;\"><span style=\"font-family: &quot;times&quot; , &quot;times new roman&quot; , serif;\"><br /></span><span style=\"font-family: inherit;\"><span style=\"color: blue; font-size: larger; font-weight: bold;\">C</span>onstant learning is what keeps Google Test Engineers motivated. We understand holistically how all the pieces of the software stack are interconnected and what kind of coverage exists or is needed to test the connections between the stacks.This product knowledge makes us test experts. We work closely with Software Engineers from the very beginning of the development process to discuss the testability of the designs before the features are implemented.&nbsp; We develop test strategies, methodologies, and test plans; we write scripts, design systems, and build tools and test infrastructure. We review design docs, do deep dives into Google's massive codebase, evaluate stack traces, and determine the root causes of production outages. Through this constant learning, we not only build deep technical expertise and do risk management by identifying weak spots in the code base, we also find creative ways to break software and identify potential problems. Our job ladder also gives us the flexibility and independence to explore and learn new technologies like ML concepts and Cloud computing and to build new testing solutions or improve existing ones.</span></span><br /><div><span style=\"font-family: inherit;\"><br /></span></div><div><span style=\"font-family: inherit;\"><span style=\"color: blue; font-size: larger; font-weight: bold;\">O</span>ut-of-the-box thinking, a result of constant learning, is another thing that keeps us motivated. As Google Test Engineers, we champion Engineering excellence by&nbsp; providing optimized solutions to address engineering inefficiencies, testing gaps, and process gaps. We constantly think of ways to make machines do the work to increase testability and productivity. Hundreds and thousands of lines of code get checked-in every minute at Google. To maintain velocity, quality, and code health, we devise creative ways to test and debug the test failures -- like performing diff testing, building dynamic test cases from the logs, designing heuristic algorithms to identify culprits for test failures, building solutions to reduce the test run time, and implementing stubs, fakes, and mock objects and servers to help developers write stable unit and integration testing. Along with devising creative ways to test and debug the test failures, we also focus on improving engineering excellence and product excellence by defining and measuring productivity metrics and product health metrics like quality, stability, and performance. The testing of, for example, Search, Ads, Maps, YouTube, Cloud, self-driving cars, and Google Apps would not have scaled with traditional testing practices.&nbsp;</span></div><div><span style=\"font-family: inherit;\"><br /></span></div><div><div><span style=\"font-family: inherit;\"><span style=\"color: blue; font-size: larger; font-weight: bold;\">O</span>rchestrating the testing efforts is a key responsibility of Google Test Engineers. As orchestrators we can collaborate with cross functional teams including Product Managers, Technical Program Managers, and Software engineers to define critical user journeys (CUJs), determine testing strategies, and ensure that the right tests are run on the right configurations/environments. With our strong communication and collaboration skills, we work with the cross-functional teams and play the role of evangelists in spreading the word on new tools, technologies, and best testing practices.&nbsp; We also have the opportunity to host Hackathons and Fixits, host interns, drive college recruiting events, engage with the open source community in testing the open source products, listen to feedback, and convert that feedback into product improvements.</span></div></div><div><span style=\"font-family: inherit;\"><br /></span></div><div><div><span style=\"font-family: inherit;\"><span style=\"color: blue; font-size: larger; font-weight: bold;\">L</span>eading-edge user: the fun part of being a Test Engineer! We can engage with product development, participate in the review of product designs, documentation, and prototypes, play with features and products early on, and provide informed feedback. Best of all, as early adopters we get to wear wearables, ride in self driving cars, be in our own world with AR/VR, engage with Google Assistant to get our chores done, and have multiple laptops, phones, and smart display units!&nbsp;</span></div></div><div><span style=\"font-family: inherit;\"><br /></span><span style=\"font-family: inherit;\"><br /></span></div><div><div><span style=\"font-family: inherit;\">Stay tuned to learn more <span style=\"color: blue; font-weight: bold;\">COOL</span> things about Test Engineering at Google!&nbsp;</span></div></div><div><br /></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Google Testing Bloggers",
    "uri": "http://www.blogger.com/profile/03153388556673050910",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 6
}