{
  "id": "yt:video:1Dq0VGnEMjI",
  "yt:videoId": "1Dq0VGnEMjI",
  "yt:channelId": "UCddem5RlB3bQe99wyY49g0g",
  "title": "\"DOWN THE AMAZON TO BELEM”   1958 BOLD JOURNEY TV SHOW  BRAZIL RAIN FOREST TRAVELOGUE   96764",
  "link": "",
  "author": {
    "name": "PeriscopeFilm",
    "uri": "https://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g"
  },
  "published": "2022-11-01T16:29:49+00:00",
  "updated": "2022-11-01T16:29:49+00:00",
  "media:group": {
    "media:title": "\"DOWN THE AMAZON TO BELEM”   1958 BOLD JOURNEY TV SHOW  BRAZIL RAIN FOREST TRAVELOGUE   96764",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Join this channel to get access to perks:\nhttps://www.youtube.com/channel/UCddem5RlB3bQe99wyY49g0g/join\n\nWant to learn more about Periscope Film and get access to exclusive swag? Join us on Patreon. Visit https://www.patreon.com/PeriscopeFilm\nVisit our website www.PeriscopeFilm.com\n\nThis black and white adventure film is part of the “Bold Journey” program broadcast by ABC Television in the late 1950s. This episode titled “Amazon to Belem” covers an epic journey made by adventurer Eric Pavel and his wife from the Andes in Argentina, down the Amazon River through Brazil.  The episode was released on October 6, 1958. Belém is the capital of the Brazilian state of Pará, and is a port city and gateway to Brazil’s lower Amazon region. Eric Pavel was a filmmaker best known for his movie \"Three Worlds of Peru.\" \n\nThe film begins with actor Jack Douglas introducing the program featuring Eric Pavel, who made the journey across the Amazon River with his wife (00:06). The start of the river in the Andes Mountain range (00:18). Jaguars swimming through the river (00:24). The flesh-eating Piranha fish (00:27). Primitive tribes of Hebrew Indians live along the Amazon River (00:29). Jack Douglas interviews Eric Pavel about the upcoming episode in a studio (00:31). Pavel and his wife aboard an Argentine Air Force Plane, and they fly over the jungle (02:19). They land high in the Andes Mountains (02:53) and continue their journey in a four-wheel drive (03:17). They start the sail across the river in dugout canoes (03:29). The nature alongside the Amazon River is inhabited by many exotic animals such as macaw parrots (03:40), poisonous rattlesnakes (03:55), flat-headed snakes (04:05), leafcutter ants (04:17), centipedes (04:38), and two-toed sloths (04:43). The canoe travels up smaller tributaries (04:54), and people of a Hebrew Indian tribe greets them on the riverbank (05:14). The people of the tribe wear unique face paint and sticks through their ears and chins (05:32). The elder council discusses to make a discussion (06:05). The journey down the river continues (06:21) decorated by special trees, plants, and flower only found in this jungle (06:30). They pass through a small town, and local women wash their clothes in the river while conversing and smoking cigars (07:14). Local men wash gold found in the river (07:30). Rubber is tapped from rubber trees (08:03) and coagulated to form rubber balls (08:22), and finally it is transported by canoes (08:42). A tribe member catches a crocodile by hand (09:00) and catches Piranha fish using a spear (09:48). They pass by a trading post for crocodile skin, fish, sugar, and alcohol, built on a raft on the river (10:26). The children of the tribes sail in smaller dugout canoes (11:28). The canoes are built by burning out a wooden log (11:40). Cattle can cross the river during dry season (12:40). Piranhas eat dead cattle and left behind is only the skeleton (12:46). Some tribes fish for Piranha using bow and arrow (14:07), and they grill them over a fire before eating them (14:18). An American missionary is living with a Hebrew Indian tribe with his wife and children (14:26). In the area lives emus, (14:36), monkeys (14:48), iguanas (15:03), spotted leopards (15:14), and tarantulas (15:46). Pavel and his wife continue their journey on horses (16:23). Another Indian tribe use macaw parrots as watchdogs (16:48), and owls as a pet (17:03). The women of the tribe comb their hair and wash themselves and their children (17:22). They work with an Amazon spinning wheel and homegrown cotton to make clothes and decorations (17:44). With tied hair, lower-lip piercings, body paint and feathers, the people of the tribe are ready for a celebration (18:17). Two men wrestle wearing duck feather stuck to their arms and legs using tar (19:10). They eat special celebratory foods like maniac and mango soup (19:58). Carved figures present the people of the tribe (20:24). A Garza bird stands in water (20:36). They pass through the city of Manaus (21:08) where traders sell bread, milk, and meat from canoes (21:08), and a boat functions as a floating coffee shop (21:20). The Amazon Theatre is the Opera House in Manaus (21:24). In the zoological garden, Pavel is holding non-poisonous snakes (21:31). They arrive to their final destination, the city of Belem (21:51). Jack Douglas interviews Pavel in the studio to summarize the journey across the Amazon River (22:09). Scenes from the following episode of the Bold Journey Program covering Siberia (24:14). Jack Douglas makes an outro (24:55). \n\nThe film was produced by Julian Lesser and edited by Bill O’Hara with Leon Barsha as editorial supervisor. \n \nThis film is part of the Periscope Film LLC archive, one of the largest historic military, transportation, and aviation stock footage collections in the USA. Entirely film backed, this material is available for licensing in 24p HD, 2k and 4k. For more information visit http://www.PeriscopeFilm.com",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}