{
  "title": "Debunking the 270 \"Doctors\" Who Criticized Joe Rogan",
  "itunes:title": "Debunking the 270 \"Doctors\" Who Criticized Joe Rogan",
  "pubDate": "Fri, 21 Jan 2022 17:03:00 +0000",
  "guid": "8992c0f9-544b-49ab-b253-e50a6c4f34ac",
  "link": "https://thejimmydoreshow.libsyn.com/debunking-the-270-doctors-who-criticized-joe-rogan",
  "itunes:image": "",
  "description": "Turns out that the story about 270 \"doctors\" criticizing Joe Rogan's \"misinformation\" that was widely touted by the mainstream media was itself misinformation. Jimmy and comedian Kurt Metzger discuss this epic swing and a miss from the corporate media and many others.<br /> <br /> Plus a segment on Dr. Fauci admitting that Jimmy's been right about the spread of coronavirus since August.<br /> <br /> <div class= \"product-hero-desc product-hero-desc--spacer-bottom-large\"> <section class= \"section section--no-padding-bottom product-hero-desc__section\"> <p dir=\"ltr\" data-test-bidi=\"\">Also featuring Stef Zamorano and Mike MacRae! A phone call from Joe Biden!</p> </section> </div>",
  "content:encoded": "Turns out that the story about 270 \"doctors\" criticizing Joe Rogan's \"misinformation\" that was widely touted by the mainstream media was itself misinformation. Jimmy and comedian Kurt Metzger discuss this epic swing and a miss from the corporate media and many others.  Plus a segment on Dr. Fauci admitting that Jimmy's been right about the spread of coronavirus since August.    <p dir=\"ltr\" data-test-bidi=\"\">Also featuring Stef Zamorano and Mike MacRae! A phone call from Joe Biden!</p>  ",
  "enclosure": "",
  "itunes:duration": "58:49",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Turns out that the story about 270 \"doctors\" criticizing Joe Rogan's \"misinformation\" that was widely touted by the mainstream media was itself misinformation. Jimmy and comedian Kurt Metzger discuss this epic swing and a miss from the corporate media...",
  "itunes:episodeType": "full",
  "itunes:summary": "Turns out that the story about 270 \"doctors\" criticizing Joe Rogan's \"misinformation\" that was widely touted by the mainstream media was itself misinformation. Jimmy and comedian Kurt Metzger discuss this epic swing and a miss from the corporate media and many others. Plus a segment on Dr. Fauci admitting that Jimmy's been right about the spread of coronavirus since August. Also featuring Stef Zamorano and Mike MacRae! A phone call from Joe Biden!"
}