{
  "title": "Your old HDMI cable isn&#8217;t good enough anymore. Here&#8217;s why",
  "link": "https://www.digitaltrends.com/home-theater/how-to-choose-an-hdmi-cable/",
  "pubDate": "Sat, 05 Nov 2022 19:00:34 +0000",
  "dc:creator": "Caleb Denison",
  "category": [
    "Features",
    "Home Theater",
    "HDMI",
    "HDMI 2.1",
    "HDMI cables"
  ],
  "guid": "https://www.digitaltrends.com/?p=3212003",
  "description": "Selecting the right HDMI cable for your setup used to be a simple thing. Now? Not so much. Here's how and why HDMI standards have changed and what to look for. ",
  "content:encoded": "<p>Not long ago, good advice for selecting an HDMI cable was pretty simple: get an HDMI cable. Nowadays? Not so much. Whether you’re just about to set up a next-generation game console or building a big entertainment system, if HDMI is involved, you need to know the game has changed.</p>\n<p>And if you’ve already discovered that something is up because you’ve been having problems getting picture or sound on your new gear, well then you have definitely landed in the right spot.</p>\n<p>I’m about to explain a little about why your new tech might not be working, and also how to avoid running into that problem in the first place.</p>\n<h2>The old HDMI standard</h2>\n<p>In the recent past, my advice for people who were looking for <a href=\"https://www.digitaltrends.com/home-theater/best-hdmi-cables/\">guidance on HDMI</a> cables was pretty simple. Your bread-and-butter HDMI cable at lengths up to 15 feet was almost guaranteed to work OK. You&#8217;d probably still be safe up to 25 feet. But any longer than that and you’d want to at least look at a lower-gauge cable — keeping in mind that the lower the gauge number, the thicker the copper in the cable.</p>\n<p>Basically, the longer your HDMI cable needed to be, the more it would need to resemble a fire hose as opposed to, say, a drinking straw. Or, you could step up to a different kind of cable — but we will get into that a bit more below. Outside of that, you wanted to do your best to make sure you had good build quality and a solid connector on each end. And then there were bonuses like high pliability for easier cable management or maybe there’s a color you like better than black.</p>\n<figure class=\"alignnone\"><img  class=\" size-large wp-image-1193286\" src=\"https://www.digitaltrends.com/wp-content/uploads/2017/06/hdmi-cable.jpg?fit=720%2C404&p=1\" alt=\"HDMI cables in red, ble, and orange colors\"   /></figure>\n<p>For a long time, I was perfectly OK with most folks going with an  for most practical at-home consumer uses. So long as the cable wasn’t complete garbage, it would usually get the job done. The ones and zeroes would make it from point A to point B and you would get picture and sound. If you wanted to spend insane bucks on a high-end cable hoping you would get slightly better video and audio quality, then knock yourself out.</p>\n<p>Now, things are different. In the world of HDMI 2.1 — or more specifically, a world in which new HDMI cables are supposed to be able to handle 40 to 48 gigabits per second of bandwidth (which is way up from the 18Gbps standard we had before), all bets are off. Well, not all of them, but enough to cause some problems.</p>\n<p>Today, if you buy a cable that is supposed to handle up to 48Gbps at lengths between 2 and 3 meters (about 6 to 9 feet), the odds are pretty good that whichever brand of cable you buy will work. At lengths longer than that (and actually, any shorter than that, too) you are more likely to run into some trouble.</p>\n<h2>HDMI 2.1: what has changed</h2>\n<p>At the heart of the issue of why the old cables no longer are enough is an intersection between the higher bandwidth or speed of information that we are trying to shove down the series of pipes in an HDMI cable, the construction of the cable itself, and a bunch of complicated math and physics. The bottom line is there’s a lot more going on inside that HDMI cable than you probably think. Most people I talk to are of the opinion that we’re talking about digital signals — ones and zeroes — and that since it is a digital process, it should be super simple and that there’s no real quality difference in the output of one HDMI cable and another.</p>\n<p>And to a point, that’s true. The signal that is being delivered is digital. But the manner in which it is delivered involves a bunch of pretty analog factors.</p>\n<p>Take a look at this diagram that I’ve borrowed from a <a href=\"https://www.youtube.com/watch?v=1IoyrUntMII\" target=\"_blank\" rel=\"noopener\">conversation on YouTube</a> between <a href=\"https://www.dpllabs.com/page/about-dpl-labs\" target=\"_blank\" rel=\"noopener\">Jeff Boccaccio at DPL labs</a> and <a href=\"https://www.murideo.com/\" target=\"_blank\" rel=\"noopener\">Jason Dustal at Murideo</a>. As you can see below, there’s a 5-volt line, a hot plug, a display data channel, some video channels, and then down at the bottom, a clock &#8212; all individual lines within one HDMI cable.</p>\n<figure id=\"attachment_3218021\" aria-describedby=\"caption-attachment-3218021\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-3218021\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/HDMI-cable-breakdown-DPL-Labs.jpg?fit=720%2C480&p=1\" alt=\"A breakdown of the channels within an HDMI cable, as represented under HDMI 2.1\"   /><figcaption id=\"caption-attachment-3218021\" class=\"wp-caption-text\"><span class=\"credit\">Jeff Boccacico/DPL Labs</span></figcaption></figure>\n<p>I don’t know about you, but just that diagram shows me there’s more going on in an HDMI cable than I thought.</p>\n<p>This is a major oversimplification, but that 5V channel on top has to negotiate a very specific milliamperage between a source, like an Xbox Series X, and a receiver, like a TV or an A/V receiver, just to get the party started. If this one little thing doesn’t happen, then nothing happens. And while that trigger went off fairly successfully in the past, it is now getting more difficult to do. I’ll get into why in a moment.</p>\n<p>On the other side of this diagram is a clock. Without getting into what the clock actually does, it could be likened to acting as air traffic control. If that clock can’t do its job, then forget it &#8212; no audio or video signal goes to your TV or A/V receiver. If the clock falters, you&#8217;re likely to see the audio and video signal dip in and out.</p>\n<p>There are other factors like <a href=\"https://www.digitaltrends.com/home-theater/hdmi-explained-everything-you-need-to-know-news-specs/\">HDCP and EDID and CEC</a> that need to be successfully negotiated digitally before audio and video will be sent down the pipeline as well.</p>\n<p>So, where am I going here? I mentioned that the higher speed or higher bandwidth was a factor. The more you are trying to jam down a pipe, the more demand there is for that pipe’s capacity. The bottom line is that now that the demands have gone way up with 4K resolution at 60 fps or more, with HDR metadata, and uncompressed audio — if the copper in the cable isn’t stout enough and isn’t stout enough in the right places for a given length of cable, then failure is imminent in a way it wasn’t before.</p>\n<p>Demands were lower in the past, so there was more tolerance for error. As demand has risen, that tolerance has gone down. And now we’re seeing more failures than we used to.</p>\n<p>The longer your HDMI cable is, the better built the cable needs to be, or the more urgency there is to go to a different kind of cable that isn’t just a bunch of thin copper inside.</p>\n<p>So, what if you buy a cable that says &#8220;HDMI 2.1&#8221; on it, or &#8220;8K certified,&#8221; or &#8220;48 Gbps guaranteed&#8221;? Then that cable should work, right? It says &#8220;certified&#8221; right on the package. Well, in a perfect world, yes. It should. And for shorter runs, it probably will. But all I can say is that we’re hearing about a lot more failures than we used to. That’s the A/V world we’re living in.</p>\n<figure id=\"attachment_2599610\" aria-describedby=\"caption-attachment-2599610\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-2599610\" src=\"https://www.digitaltrends.com/wp-content/uploads/2020/12/zeskit-ultra-high-speed-certified-hdmi-cable.jpeg?fit=720%2C479&p=1\" alt=\"The Zeskit Ultra High Speed 8K HDMI cable.\"   /><figcaption id=\"caption-attachment-2599610\" class=\"wp-caption-text\"><span class=\"credit\">Zeskit</span></figcaption></figure>\n<p>And it’s not just the cables, but the source devices and receiving devices we use. Those are changing, too. It’s an evolving situation and, based on conversations I’ve had with some industry folks who are in the know … it’s kind of a mess, and getting messier.</p>\n<h2>What to look for</h2>\n<p>So, what do we look for when shopping for HDMI cables that will reduce the risk that something will go wrong? And if it does go wrong, what do you do? First, buy from a reputable retailer so you can get a refund or exchange for another product. Save your receipts!</p>\n<p>Second, when you do get your cable, plug it in and stress-test it before you do anything else. Game in 4K/120Hz or do whatever the highest-demand audio and video thing you might want from your system. Do it before you carefully route cables and move hundreds of pounds of equipment back and forth. If it works, great. If it doesn’t? Exchange it. This should save you from learning the hard way that your cable doesn’t work, and you should be able to remedy the problem relatively quickly.</p>\n<p>In terms of picking an HDMI cable, all I can do is try to point you in the right direction.</p>\n<p>Keep in mind the following advice is for folks who are dealing with 4K, high frame rates, HDR, next-gen consoles — that kind of advanced stuff. Or, if you’re someone who just wants to future-proof as much as possible. If you’re hooking up your PS3 or an old laptop, you’re going to be fine with most of the decent HDMI cables on the market today.</p>\n<h3>Copper Cables</h3>\n<p>First off, you’ll be safest if you don’t buy a standard, copper-based HDMI cable shorter than 1 meter, or 6 feet. If you do, there’s a possibility the clock I mentioned earlier won’t work and the cable could fail. So even though it may be longer than you think you need, you’re safest by starting at 1 meter.</p>\n<p>From there, don’t go with a standard copper cable longer than 2 meters. I’ll get to other cable types in a moment, but between 1 and 2 meters make sure that the cable is rated to handle 48Gbps, and buy a cable from a brand you trust. I’m not going to specify brands here, but if you’ve never heard of the brand before – well, it could be OK, but you’re taking a risk. Be sure you’re alright with taking that chance and be prepared to return it if it doesn’t work.</p>\n<p>Also, don’t buy the cheapest cable, and don’t buy anything outrageously expensive. The good stuff is somewhere in the middle. The really expensive cables are probably going to be totally reliable but they are probably overkill. However, the notion that anything other than the most basic inexpensive cable is snake oil is just not true.</p>\n<h3>HDMI AOC</h3>\n<p>If you are going to run an HDMI cable over 2 meters, or 10 feet, I think you should very seriously consider stepping up to an HDMI Active Optical Cable or HDMI AOC. You could get away with longer runs with copper cables before, but it’s too risky now.</p>\n<p>HDMI AOC is a hybrid that uses fiber optics for some jobs and copper for others and is a much safer bet for longer runs. How long is HDMI AOC reliable in a 40Gbps world? We are still trying to determine that but will update this article as soon as we find out. I can say that if an HDMI AOC cable doesn’t work, there’s one more step up for longer runs.</p>\n<figure id=\"attachment_3218029\" aria-describedby=\"caption-attachment-3218029\" class=\"wp-caption alignnone\"><img  class=\" size-large wp-image-3218029\" src=\"https://www.digitaltrends.com/wp-content/uploads/2022/11/HDMI-Cable-Power-Marseille.jpg?fit=720%2C720&p=1\" alt=\"HDMI Cable Power type cable with USB power connector\"   /><figcaption id=\"caption-attachment-3218029\" class=\"wp-caption-text\"><span class=\"credit\">Amazon</span></figcaption></figure>\n<h3>HDMI Cable Power</h3>\n<p>That would be HDMI Cable Power. There are two types of utilizing the HDMI Cable Power feature. Right now, most devices don’t have HDMI Cable Power built in, so the HDMI Cable Power cables you get will come with a separate connector that will provide power via USB, for example. But in the future, as more devices support HDMI Cable Power, you’ll be able to start using HDMI Cable Power cables without that little connector – the power will be baked into the HDMI cable connector itself. If HDMI AOC doesn’t work, HDMI Cable power should.</p>\n<p>One more important note. If you are talking about in-wall use, then you need to make sure that – on top of everything else we just discussed – the cable is rated for in-wall use. That usually means it has a special jacket on the outside to prevent the spread of, or in some cases, the cause of a fire.</p>\n<p>I understand there&#8217;s a lot to absorb here, but I hope this explanation and guide have been helpful. As always, I&#8217;ll update this article as new information is presented.</p>\n",
  "thumbnail": "https://www.digitaltrends.com/wp-content/uploads/2022/03/ugreen-right-angle-hdmi-1.jpg?p=1",
  "enclosure": "",
  "post-id": 3212003
}