{
  "id": "yt:video:xCG0e4r_Tj4",
  "yt:videoId": "xCG0e4r_Tj4",
  "yt:channelId": "UCzR-rom72PHN9Zg7RML9EbA",
  "title": "Darwin Missed An Example of Evolution Right Under His Nose",
  "link": "",
  "author": {
    "name": "PBS Eons",
    "uri": "https://www.youtube.com/channel/UCzR-rom72PHN9Zg7RML9EbA"
  },
  "published": "2022-10-18T20:18:25+00:00",
  "updated": "2022-10-21T02:28:28+00:00",
  "media:group": {
    "media:title": "Darwin Missed An Example of Evolution Right Under His Nose",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Kallie's book \"Tales of the Prehistoric World\": https://bookshop.org/p/books/tales-of-the-prehistoric-world-adventures-from-the-land-of-the-dinosaurs-neon-squid/17724211\n\nThe 2023 Eons calendar: https://www.complexlycalendars.com/products/eons\n\nCharles Darwin encountered a tiny fox-like creature during his famous voyage but instead of discovering its fascinating evolutionary story, he just knocked it on the head with his geology hammer.\n\nThanks as always to Julio Lacerda (https://twitter.com/JulioTheArtist) for the tremendous reconstruction of Darwin's Fox!\n\n*****\nPBS Member Stations rely on viewers like you. To support your local station, go to http://to.pbs.org/DonateEons\n*****\n\nProduced by Complexly for PBS Digital Studios\n\nSuper special thanks to the following Patreon patrons for helping make Eons possible:\nAmanda Ward, Stephen Patterson, Mark Foster, Karen Farrell, Trevor Long, Raphael Haase, daniel blankstein, Roberto Adrian Ramirez Flores, Jason Rostoker, Jonathan Rust, Avery Sanford, Mary Tevington, Bart & Elke van Iersel - De Jong, William Craig II, James Dowling-Healey, Irene Wood, Derek Helling, WilCatRhClPPh33, Mark Talbott-Williams, Nomi Alchin, Hillary Ryde-Collins, Yu Mei, Dan Ritter, 4th_phase, Jayme Coyle, Ben Cooper, Albert Folsom, Oscar Amoros Huguet, Patrick Wells, Matt Parker, Jerrit Erickson, MissyElliottSmith, Stefan Weber, Dan Caffee, Merri Snaidman, Gabriel Cortez, Stephanie Tan, Marcus Lejon, Nick Ryhajlo, Sean Dennis, Betsy Radley, Anthony, Philip Slingerland, John Vanek, Eric Vonk, Jon Monteiro, James Bording, Miles Chaston, Michael McClellan, Jeff Graham, Daisuke Goto, Gregory Kintz, Chandler Bass, Tsee Lee, and Robert Hill. \nIf you'd like to support the channel, head over to http://patreon.com/eons and pledge for some cool rewards!\n\nWant to follow Eons elsewhere on the internet?\nFacebook - https://www.facebook.com/eonsshow\nTwitter - https://twitter.com/eonsshow\nInstagram - https://www.instagram.com/eonsshow/\n\nReferences:\nhttps://docs.google.com/document/d/1UAT4WfNSBy909xlocOkK3XE794-PCmGqRqjakDwyq60/edit?usp=sharing",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}