{
  "id": "https://bibleinoneyear.org/en/youth/43",
  "title": "Day 43: He Saved You",
  "description": "Psalm 21:1–7, Exodus 12:26–27, Matthew 27:11–37.  In an even more amazing way, Jesus did not save himself because he was out to save you and me Today, focus your thoughts on Jesus, the Saviour of the world, and meditate on how he saved you",
  "pubDate": "Sat, 12 Feb 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/43/",
  "itunes:duration": "12:30",
  "guid": "enyouth12022022-43",
  "length": 750.37,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 43: He Saved You",
  "itunes:subtitle": "Psalm 21:1–7, Exodus 12:26–27, Matthew 27:11–37.  In an even more amazing way, Jesus did not save himself because he was out to save you and me Today, focus your thoughts on Jesus, the Saviour of the world, and meditate on how he saved you",
  "itunes:summary": "On 13 January 1982, Air Florida Flight 90 taking off from Washington, DC, crashed into the Potomac River. It was winter and the river was full of ice. The crash happened near a bridge going over the river. The TV cameras could see everything. Millions of viewers, sitting in their living rooms, watched as a helicopter overhead let down a life-belt on a line to a man struggling in the water. He grabbed the line, swam to another survivor just by him, clipped the woman in and they hoisted her up to safety. The helicopter let down the line again, and again the man did the same thing. He swam to someone else, and rescued them. He saved others, before finally, exhausted, he himself drowned.\nWhy did this man not save himself? The answer is that he was out to save others. In an even more amazing way, Jesus did not save himself because he was out to save you and me.\nToday, focus your thoughts on Jesus, the Saviour of the world, and meditate on how he saved you.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 408
}