{
  "title": "How to Succeed With AI Augmentation",
  "link": "https://sloanreview.mit.edu/video/how-to-succeed-with-ai-augmentation/",
  "comments": "https://sloanreview.mit.edu/video/how-to-succeed-with-ai-augmentation/#respond",
  "pubDate": "Fri, 21 Oct 2022 09:50:15 +0000",
  "dc:creator": "Thomas H. Davenport, Steven M. Miller, and Abbie Lundberg. <p>Thomas H. Davenport is President’s Distinguished Professor of Information Technology and Management at Babson College; a visiting professor at Saïd Business School, University of Oxford; and a fellow at the MIT Initiative on the Digital Economy. Steven M. Miller is a professor emeritus of information systems, Singapore Management University (SMU) and an adviser to Singapore government agencies and industry on analytics, AI R&#038;D, AI applications, and manpower development. Abbie Lundberg is editor in chief at <cite>MIT Sloan Management Review</cite>. She moderated the session.</p>\n",
  "category": [
    "AI",
    "AI Augmentation",
    "Human-Machine Collaboration",
    "Machine Learning",
    "Video",
    "Webinar",
    "Webinars & Videos",
    "AI & Machine Learning",
    "Data, AI, & Machine Learning",
    "Leadership",
    "Organizational Transformation",
    "Strategy"
  ],
  "description": "For all the remarkable things that machine learning and advanced analytics can do, there are scores of things that AI-enabled machines still can’t do &#8212; at least not reliably enough on their own in the real world of business. That doesn’t mean you can afford to wait to take advantage of AI. Rather, it means [&#8230;]",
  "content:encoded": "<p></p>\n<p>For all the remarkable things that machine learning and advanced analytics can do, there are scores of things that AI-enabled machines still <em>can’t</em> do &mdash; at least not reliably enough on their own in the real world of business. That doesn’t mean you can afford to wait to take advantage of AI. Rather, it means designing AI applications that leverage what people and machines each do best, and how they can most effectively work together.</p>\n<aside class=\"callout-info\">\n<h5 style=\"margin-top:0\">Related Reading</strong></h5>\n<p>T. Davenport and S. Miller, “<a href=\"https://sloanreview.mit.edu/article/what-machines-cant-do-yet-in-real-work-settings/\" class=\"marketing-click\" id=\"Sidebar_callout[WebinarArchive]\" target=\"_blank\" rel=\"noopener\">What Machines Can’t Do (Yet) in Real Work Settings</a>,” MIT Sloan Management Review, Oct. 5, 2022.</p>\n</aside>\n<p>In their new book, <cite>Working With AI: Real Stories of Human-Machine Collaboration</cite>, authors Thomas H. Davenport and Steven M. Miller draw on 29 detailed examples of jobs and work settings in which humans are already working day to day with AI-enabled systems and automation.</p>\n<p>In this webinar, you will learn:</p>\n<ul>\n<li>Why focusing on AI augmentation is the right strategy right now.</li>\n<li>The aspects of work that AI can’t do (yet).</li>\n<li>How people work day to day with smart machines.</li>\n<li>What it takes to successfully engage the right people in the organization.</li>\n</ul>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/video/how-to-succeed-with-ai-augmentation/feed/",
  "slash:comments": 0
}