{
  "id": "yt:video:3N3Bl5AA5QU",
  "yt:videoId": "3N3Bl5AA5QU",
  "yt:channelId": "UCZHmQk67mSJgfCCTn7xBfew",
  "title": "This is a game changer! (AlphaTensor by DeepMind explained)",
  "link": "",
  "author": {
    "name": "Yannic Kilcher",
    "uri": "https://www.youtube.com/channel/UCZHmQk67mSJgfCCTn7xBfew"
  },
  "published": "2022-10-07T22:45:51+00:00",
  "updated": "2022-10-08T09:45:08+00:00",
  "media:group": {
    "media:title": "This is a game changer! (AlphaTensor by DeepMind explained)",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "#alphatensor #deepmind #ai \n\nMatrix multiplication is the most used mathematical operation in all of science and engineering. Speeding this up has massive consequences. Thus, over the years, this operation has become more and more optimized. A fascinating discovery was made when it was shown that one actually needs less than N^3 multiplication operations to multiply to NxN matrices. DeepMind goes a step further and creates AlphaTensor, a Deep Reinforcement Learning algorithm that plays a single-player game, TensorGame, in order to find even more optimized algorithms for matrix multiplication. And it turns out, there exists a plethora of undiscovered matrix multiplication algorithms, which not only will make everything from computers to smart toasters faster, but also bring new insights into fundamental math and complexity theory.\n\nSponsor: Assembly AI\nLink: https://www.assemblyai.com/?utm_source=youtube&utm_medium=social&utm_campaign=yannic_sentiment\n\nOUTLINE:\n0:00 - Intro\n1:50 - Sponsor: Assembly AI (link in description)\n3:25 - What even is Matrix Multiplication?\n6:10 - A very astounding fact\n8:45 - Trading multiplications for additions\n12:35 - Matrix Multiplication as a Tensor\n17:30 - Tensor Decompositions\n20:30 - A formal way of finding multiplication algorithms\n31:00 - How to formulate this as a game?\n39:30 - A brief primer on AlphaZero / MCTS\n45:40 - The Results\n48:15 - Optimizing for different hardware\n52:40 - Expanding fundamental math\n53:45 - Summary & Final Comments\n\nPaper: https://www.nature.com/articles/s41586-022-05172-4\nTitle: Discovering faster matrix multiplication algorithms with reinforcement learning\n\nAbstract:\nImproving the efficiency of algorithms for fundamental computations can have a widespread impact, as it can affect the overall speed of a large amount of computations. Matrix multiplication is one such primitive task, occurring in many systems—from neural networks to scientific computing routines. The automatic discovery of algorithms using machine learning offers the prospect of reaching beyond human intuition and outperforming the current best human-designed algorithms. However, automating the algorithm discovery procedure is intricate, as the space of possible algorithms is enormous. Here we report a deep reinforcement learning approach based on AlphaZero1 for discovering efficient and provably correct algorithms for the multiplication of arbitrary matrices. Our agent, AlphaTensor, is trained to play a single-player game where the objective is finding tensor decompositions within a finite factor space. AlphaTensor discovered algorithms that outperform the state-of-the-art complexity for many matrix sizes. Particularly relevant is the case of 4 × 4 matrices in a finite field, where AlphaTensor’s algorithm improves on Strassen’s two-level algorithm for the first time, to our knowledge, since its discovery 50 years ago2. We further showcase the flexibility of AlphaTensor through different use-cases: algorithms with state-of-the-art complexity for structured matrix multiplication and improved practical efficiency by optimizing matrix multiplication for runtime on specific hardware. Our results highlight AlphaTensor’s ability to accelerate the process of algorithmic discovery on a range of problems, and to optimize for different criteria.\n\nAuthors: Alhussein Fawzi, Matej Balog, Aja Huang, Thomas Hubert, Bernardino Romera-Paredes, Mohammadamin Barekatain, Alexander Novikov, Francisco J. R. Ruiz, Julian Schrittwieser, Grzegorz Swirszcz, David Silver, Demis Hassabis & Pushmeet Kohli\n\nLinks:\nHomepage: https://ykilcher.com\nMerch: https://ykilcher.com/merch\nYouTube: https://www.youtube.com/c/yannickilcher\nTwitter: https://twitter.com/ykilcher\nDiscord: https://ykilcher.com/discord\nLinkedIn: https://www.linkedin.com/in/ykilcher\n\nIf you want to support me, the best thing to do is to share out the content :)\n\nIf you want to support me financially (completely optional and voluntary, but a lot of people have asked for this):\nSubscribeStar: https://www.subscribestar.com/yannickilcher\nPatreon: https://www.patreon.com/yannickilcher\nBitcoin (BTC): bc1q49lsw3q325tr58ygf8sudx2dqfguclvngvy2cq\nEthereum (ETH): 0x7ad3513E3B8f66799f507Aa7874b1B0eBC7F85e2\nLitecoin (LTC): LQW2TRyKYetVC8WjFkhpPhtpbDM4Vw7r9m\nMonero (XMR): 4ACL8AGrEo5hAir8A9CeVrW8pEauWvnp1WnSDZxW7tziCDLhZAGsgzhRQABDnFy8yuM9fWJDviJPHKRjV4FWt19CJZN9D4n",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}