{
  "title": "569: What Happened to the Room of Requirement? And More Questions 'Deathly Hallows' Didn't Answer",
  "link": "https://audioboom.com/posts/8118390",
  "itunes:episode": 569,
  "itunes:title": "What Happened to the Room of Requirement? And More Questions 'Deathly Hallows' Didn't Answer",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4727,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's episode of MuggleCast, we begin our celebration of the 15th anniversary of Harry Potter and the Deathly Hallows by looking at the burning questions the seventh  book didn't answer. In the weeks ahead, stay tuned for more Deathly Hallows book discussions in honor of the anniversary!<br>\n<br>\n\n</div>\n<ul>\n<li>\n<a href=\"https://www.patreon.com/posts/introducing-2022-68800529\">We're excited to announce our 2022 Patreon Gifts</a> - The MuggleCast Collectors Club and the MuggleCast Wand! Pledge to our Patreon by August 7, 2022 and fill out the form(s) to receive your gifts! We are so proud of this year's items and hope you check them out!</li>\n<li>Main Discussion: Burning Questions Harry Potter and the Deathly Hallows Didn’t Answer</li>\n<li>Did Deathly Hallows provide the conclusion we all wanted?</li>\n<li>Which character(s) got the most disappointing Deathly Hallows resolution?</li>\n<li>Lavender Brown: dead or alive?</li>\n<li>What retributions (if any) were there for Death Eaters and Voldemort sympathizers after the second war?</li>\n<li>Did Kreacher live through the Battle of Hogwarts, and did he ever find out that the locket was destroyed?</li>\n<li>Gringotts, The Room of Requirement & Grimmauld Place: what happened to some of our favorite wizarding world locations?</li>\n<li>Listeners share their questions on everything from The Veil to Snape's Boggart to Fawkes and more!</li>\n<li>How did Harry figure out so much during his time at Shell Cottage?</li>\n<li>Did the snake Harry set free in Sorcerer's Stone ever make it to Brazil?</li>\n<li>Nagini & Bathilda Bagshot... HOW?!?</li>\n<li>What was the relationship like between Harry and Ginny? Luckily, <a href=\"https://docs.google.com/document/d/1t95Wn8MPv865FGVLST9tBnDd05v9jpQBTR8Loi7-IzQ\">Eric's filling in the gaps in his fan-fiction</a>!</li>\n<li>Was the taboo on Voldemort's name a copout?</li>\n<li>Was Azkaban absolutely PACKED after the Battle of Hogwarts?</li>\n<li>On next week's episode, we'll revisit our reactions to Deathly Hallows after reading the book for the first time, and read old e-mails from the days just after the book was released! </li>\n<li>Quizzitch: In Deathly Hallows, during the camping scenes, after complaining about their meal to Harry and Hermione and saying his mom can conjure food from thin air, what does Ron Summon for dinner?</li>\n<li>This week's episode is brought to you by MasterClass (get 15% off an annual membership at <a href=\"http://www.masterclass.com/mugglecast\">MasterClass.com/MuggleCast</a>) and BetterHelp (get 10% off your first month at <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/MuggleCast</a>)!</li>\n</ul>\n",
  "pubDate": "Tue, 12 Jul 2022 09:00:00 +0000",
  "guid": "tag:audioboom.com,2022-07-11:/posts/8118390",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}