{
  "guid": "prx_137_5ce71ad4-3daa-40e1-a5e9-af022488d0f2",
  "title": "665 - Friends of Sonic and Mario",
  "pubDate": "Sun, 06 May 2018 23:00:00 -0000",
  "link": "https://beta.prx.org/stories/242679",
  "description": "<p>Don’t worry about hanging on or racing carts, if sleeping were an Olympic event you would get a gold medal.<br>\n<br>\n<strong>Tonight’s show is sponsored by Backblaze-Receive a fully featured 15-day freetrial at <a href=\"http://www.backblaze.com/sleep\" rel=\"nofollow\" target=\"_blank\">www.backblaze.com/sleep</a>. Go there, play with it, and start protecting yourself from potential bad times! Start Today!Cloud storage that's astonishingly easy and low-cost. 500 Petabytes stored & over 25 billion files recovered (and counting)! Backblaze cloud backup has backed up over 350 million GB of data for Mac and PC laptops and desktops. To date Backblaze has restored over 25 billion files for our customers. Without our cloud backup service, those files would have been lost forever.<br>\nCustomers can also locate their computer if lost or stolen, and have a hard drive shipped to their door with their data on it. Read Backblaze reviews from some of our customers how backing up online proved to be a crucial lifeline.</strong></p>\n\n<p><strong><br>\nTonight’s episode is brought to you by</strong>Hello Fresh-the meal kit delivery service that makes cooking more fun so you can focus on the whole experience, not just the final plate.<br>\n<strong>For $30 off your first week of HelloFresh, visit <a href=\"http://www\" rel=\"nofollow\" target=\"_blank\">http://www</a>.<a href=\"http://hellofresh.com\" rel=\"nofollow\" target=\"_blank\">hellofresh.com</a></strong>/sleep30 <strong>and enter“sleep30”</strong></p>\n\n<p><br>\n<strong>Thanks to all the listeners who barter pizzas and coffees for a month a good sleep by becoming patrons @<a href=\"http://www.sleepwithmepodcast.com/patron\" rel=\"nofollow\" target=\"_blank\">http://www.sleepwithmepodcast.com/patron</a></strong></p>",
  "enclosure": "",
  "itunes:title": "Friends of Sonic and Mario",
  "itunes:subtitle": "Don’t worry about hanging on or racing carts, if sleeping were an Olympic event you would get a gold medal.",
  "itunes:explicit": false,
  "itunes:episodeType": "full",
  "itunes:episode": 665,
  "itunes:duration": "01:01:23"
}