{
  "title": "Computing zero-group-velocity points in anisotropic elastic waveguides: globally and locally convergent methods. (arXiv:2211.01995v1 [physics.class-ph])",
  "link": "http://arxiv.org/abs/2211.01995",
  "description": "<p>Dispersion curves of elastic waveguides exhibit points where the group\nvelocity vanishes while the wavenumber remains finite. These are the so-called\nzero-group-velocity (ZGV) points. As the elastodynamic energy at these points\nremains confined close to the source, they are of practical interest for\nnondestructive testing and quantitative characterization of structures. These\napplications rely on the correct prediction of the ZGV points. In this\ncontribution, we first model the ZGV resonances in anisotropic plates based on\nthe appearance of an exceptional mode. The resulting governing equation is\ninterpreted as a two-parameter eigenvalue problem. We then present three\ncomplementary numerical procedures capable of computing ZGV points in arbitrary\nnondissipative elastic waveguides. The first method is globally convergent and\nguarantees to find all ZGV points but can only be used for small problems. The\nsecond procedure is a very fast, generally-applicable, Newton-type iteration\nthat is locally convergent and requires initial guesses. The third method\ncombines both kind of approaches and yields a procedure that is applicable to\nlarge problems, does not require initial guesses and is likely to find all ZGV\npoints.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Kiefer_D/0/1/0/all/0/1\">Daniel A. Kiefer</a> (1), <a href=\"http://arxiv.org/find/physics/1/au:+Plestenjak_B/0/1/0/all/0/1\">Bor Plestenjak</a> (2), <a href=\"http://arxiv.org/find/physics/1/au:+Gravenkamp_H/0/1/0/all/0/1\">Hauke Gravenkamp</a> (3), <a href=\"http://arxiv.org/find/physics/1/au:+Prada_C/0/1/0/all/0/1\">Claire Prada</a> (1) ((1) Institut Langevin, ESPCI Paris, Universit&#xe9; PSL, CNRS, Paris, France, (2) Faculty of Mathematics and Physics, University of Ljubljana, Ljubljana, Slovenia, (3) International Centre for Numerical Methods in Engineering (CIMNE), Barcelona, Spain)"
}