{
  "title": "Epitaxial hexagonal boron nitride for hydrogen generation by radiolysis of interfacial water. (arXiv:2211.01953v1 [physics.chem-ph])",
  "link": "http://arxiv.org/abs/2211.01953",
  "description": "<p>Hydrogen is an important building block in global strategies towards a future\ngreen energy system. To make this transition possible, intense scientific\nefforts are needed, also in the field of materials science. Two-dimensional\ncrystals, such as hexagonal boron nitride (hBN), are very promising in this\nregard, as it was demonstrated that micrometer-sized exfoliated flakes are\nexcellent barriers to molecular hydrogen. However, it remains an open question\nwhether large-area layers fabricated by industrially relevant methods preserve\nsuch promising properties. In this work we show that electron beam-induced\nsplitting of water creates hBN bubbles that effectively store molecular\nhydrogen for weeks and under extreme mechanical deformation. We demonstrate\nthat epitaxial hBN allows direct visualization and monitoring of the process of\nhydrogen generation by radiolysis of interfacial water. Our findings show that\nhBN is not only a potential candidate for hydrogen storage, but also holds\npromise for the development of unconventional hydrogen production schemes.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Binder_J/0/1/0/all/0/1\">Johannes Binder</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Dabrowska_A/0/1/0/all/0/1\">Aleksandra Krystyna D&#x105;browska</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Tokarczyk_M/0/1/0/all/0/1\">Mateusz Tokarczyk</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Ludwiczak_K/0/1/0/all/0/1\">Katarzyna Ludwiczak</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Bozek_R/0/1/0/all/0/1\">Rafa&#x142; Bo&#x17c;ek</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Kowalski_G/0/1/0/all/0/1\">Grzegorz Kowalski</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Stepniewski_R/0/1/0/all/0/1\">Roman St&#x119;pniewski</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Wysmolek_A/0/1/0/all/0/1\">Andrzej Wysmo&#x142;ek</a>"
}