{
  "title": "EPISODE 94: The Last War Chief",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Sat, 24 Sep 2022 12:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2022/9/18/episode-94-the-last-war-chief",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:632719ae787a9c68505cf9e1",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/fbbd547e-b5cd-4d47-8040-0217ef8cae85/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"63271a41b387fd68e9ed63df\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/fbbd547e-b5cd-4d47-8040-0217ef8cae85/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“Reflecting upon the chiefs I had known, I realized that here had never been one who was very well off. Poverty was part of a chief’s obligations…”</em>  — Frank Bird Linderman &nbsp;</p><p class=\"\">“<em>While we painted ourselves the drums kept beating, and our women sang war-songs. No man can feel himself a coward at such a time. Every man that lives will welcome battle while brave men and women sing war-songs. I would have willingly gone alone against our enemies that day.”</em>&nbsp; — Plenty Coups</p><p class=\"\"><em>“To be alone with our war-horses at such a time teaches them to understand us, and us to understand them. My horse fights with me and fasts with me, because if he is to carry me in battle he must know my heart and I must know his or we shall never become brothers. I have been told that the white man, who is almost a god, and yet a great fool, does not believe that the horse has a spirit. This cannot be true. I have many times seen my horse’s soul in his eyes.”</em>  — Plenty Coups</p><p class=\"\"><em>\"The story of Joseph Medicine Crow is something I've wanted to tell for 20 years.\"</em>  — Ken Burns&nbsp;</p><p class=\"\"><em>“I felt good. I was a Crow warrior. My grandfathers would have been proud of me.”</em>  — Joe Medicine Crow&nbsp;</p><p class=\"\">Lakota history has been the subject of many episodes of History on Fire. Today, however, we’ll see history through the eye of their traditional enemies, the Crow. Part of the episode will cover the history and culture of the Crow nation up to the late 1800s. The other part will move into the 1900s and follow the tale of Joe Medicine Crow, the last man to achieve the status of war chief of the Crow Nation thanks to the coups he counted during WWII against the Nazi. The fact that Joe Medicine Crow’s story has not been made into a movie is a crime. I can’t fix that, but at least I can dedicate a podcast to him.&nbsp;</p><p data-rte-preserve-empty=\"true\" class=\"\"></p><p class=\"\">If you feel generous and enjoy History on Fire, please consider joining my Patreon at <a href=\"https://www.patreon.com/historyonfire\">https://www.patreon.com/historyonfire</a> to access plenty of bonus content.&nbsp;</p><p class=\"\">If you’d like to go to Japan for a historical tour with yours truly as a guide, please check out <a href=\"https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/\">https://geeknationtours.com/tours/signature-battlefield-series-classic-samurai-from-the-gempei-war-to-the-mongol-invasions-2023/</a></p><p class=\"\">Big thank you to True Classic for sponsoring this episode. For incredibly soft, great-fitting t-shirts, please enjoy a 25% discount at @trueclassic with promo code HISTORYONFIRE at <a href=\"http://trueclassictees.com/HISTORYONFIRE\">trueclassictees.com/HISTORYONFIRE</a>&nbsp;</p><p class=\"\">Also, to thank you to Magic Mind for sponsoring this episode. For an incredible energy drink that will keep you alert through the day go to <a href=\"https://www.magicmind.co/hof\">https://www.magicmind.co/hof</a> for 20% off. And for the first 10 days, use code HOF20 for a 40% off a subscription.&nbsp;</p><p class=\"\">And for some of my favorite CBD products on the market, check out <a href=\"https://palomaverdecbd.com/\">https://palomaverdecbd.com/</a> and use the promo code history for a 20% discount.&nbsp;</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "02:37:17",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 94,
  "itunes:title": "EPISODE 94: The Last War Chief",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 94: The Last War Chief"
  }
}