{
  "title": "S1E67 - Unlocking Your Potential with High Diver Ellie Smart",
  "guid": "https://pinecast.com/guid/8aca265b-e99d-4199-8165-29d72229d1d8",
  "pubDate": "Thu, 22 Sep 2022 07:30:00 -0000",
  "itunes:duration": "00:58:42",
  "description": "<p>Joining Laura on today’s episode is professional high diver, CEO of the International High Diving Institute—America’s first high-diving facility, and founder of the Clean Cliffs project, Ellie Smart. Their conversation begins with Ellie’s journey from childhood dreams of diving at the Olympics to the tough realization that she wouldn’t reach that standard and her decision to retire from diving during college. She shares the challenges of walking away from the sport that defined her, finding her worth outside of diving, and finally discovering her purpose in cliff diving. Ellie then discusses how she made the move into professional high diving, started competing, and eventually made it onto the Red Bull Cliff Diving World Series as a permanent diver.</p>\n<p>Next, Ellie talks about her desire to keep challenging herself and working on new dives—including one partly inspired by Laura—so that she can continue unlocking her potential to the highest degree. She also speaks to how she and other cliff divers manage their fear, pointing out that fear can be a good thing physiologically, but only if we learn how to control it and use it in a healthy way. Ellie takes a moment to discuss the impact of social media and how she uses it as a tool while enforcing personal boundaries to ensure she avoids the urge to compare herself with others. Closing out the episode, Ellie reveals some of her pursuits when she’s not diving herself, including creating the High Diving Institute at the Utah Olympic Park and co-founding Clean Cliffs, a project with the mission to prevent plastic pollution in the world’s bodies of water.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>Walking away from and coming back to diving</li>\n<li>Learning to cliff dive and starting to compete</li>\n<li>Unlocking potential and managing fear</li>\n<li>Creating the International High Diving Institute</li>\n<li>Giving back with Clean Cliffs</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“I wanted to represent Team USA, I wanted to go to the Olympics, and I would practice my gold medals speech in the shower every single night as a kid and my autograph. In class, I used to get in trouble all the time for practicing my autograph.”</li>\n<li>“The answer is always ‘no’ if you never ask, so I would rather ask and get the answer ‘no’ than not ask at all and maybe miss out on a really cool, incredible opportunity. So I definitely get embarrassed or shy or self-conscious sometimes when I have things that I really want to do, like, it’s definitely not just easy. But I know that the reward of asking and what could come of it is so much better than not asking.”</li>\n<li>“It was also very humbling to realize that if I was going to keep diving, I needed to dive for me and not for the results or what it looked like from the outside to other people. Because there’s always going to be something bigger and better and different that you can do if you’re basing your life on decisions or opinions of other people.”</li>\n<li>“I really think comparison is just the absolute worst thing that you can do. And so, I try to eliminate that as much as possible from my everyday life. So you know, if any of my friends are listening to this, I love you, but I’m not going to watch your Instagram stories. You can tell me all about it in person.”</li>\n<li>“I think that that’s the most exciting thing about life is we don’t know, we get to figure it out as we go. And, you know, I used to have a different approach of, ‘I want to know the answer now. I want to know what I’m supposed to do.’ And now I have this whole new mindset of, ‘I’m so excited to see what I can do versus what I’m supposed to do.’”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://laurawilkinson.com/coaching\" rel=\"nofollow\">1-on-1 Coaching with Laura</a>\n<a href=\"https://www.laurawilkinson.com/journal\" rel=\"nofollow\">The Confidence Journal</a>\n<a href=\"https://laurawilkinson.com/book\" rel=\"nofollow\">Life at 10 Meters: Lessons from an Olympic Champion</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Ellie’s Social Media:\n<a href=\"https://www.instagram.com/ellietsmart/\" rel=\"nofollow\">Ellie’s Instagram</a></p>",
  "itunes:title": "Unlocking Your Potential with High Diver Ellie Smart",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 67
}