{
  "title": "The Stuxnet Virus Pt. 2",
  "link": "https://malicious.life/the-stuxnet-virus-pt-2/",
  "pubDate": "Thu, 12 Jul 2018 15:39:43 +0000",
  "guid": "http://malicious.life/?p=552",
  "comments": "https://malicious.life/the-stuxnet-virus-pt-2/#respond",
  "wfw:commentRss": "https://malicious.life/the-stuxnet-virus-pt-2/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "Stuxnet was a weapon, a kind of a smart bomb- perhaps one of the smartest bombs ever created. A bomb that couldn’t rely on operators, cameras, and laser targeting, instead it had to “think” its way to its destination. An invisible commando unit, dropped deep behind enemy lines. And its payload- not explosives, but lines […]",
  "content:encoded": "<p>Stuxnet was a weapon, a kind of a smart bomb- perhaps one of the smartest bombs ever created. A bomb that couldn’t rely on operators, cameras, and laser targeting, instead it had to &#8220;think&#8221; its way to its destination. An invisible commando unit, dropped deep behind enemy lines. And its payload- not explosives, but lines of code. Part two of the three part Stuxnet series explores how the first bits of code were weaponized.</p>\n<p>With special guests: Andrew Ginter, and Blake Sobczak.</p>\n",
  "enclosure": "",
  "itunes:subtitle": "Stuxnet was a weapon, a kind of a smart bomb- perhaps one of the smartest bombs ever created. A bomb that couldn’t rely on operators, cameras, and laser targeting, instead it had to “think” its way to its destination. An invisible commando unit,",
  "itunes:summary": "Stuxnet was a weapon, a kind of a smart bomb- perhaps one of the smartest bombs ever created. A bomb that couldn’t rely on operators, cameras, and laser targeting, instead it had to “think” its way to its destination. An invisible commando unit, dropped deep behind enemy lines. And its payload- not explosives, but lines […]",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:explicit": "clean",
  "itunes:duration": "27:22"
}