{
  "title": "05:  Mind-Body Medicine Pioneer Dr. Bernie Siegel on A Book of Miracles",
  "pubDate": "Fri, 09 Jan 2015 03:12:49 +0000",
  "guid": "4f9bf091e486c1485e259aab78a289b4",
  "link": "https://traffic.libsyn.com/secure/lifeonpurpose/LifeOnPurposeBernieNORM.mp3",
  "itunes:image": "",
  "description": "<p><strong>Dr. Bernie Siegel</strong> is a sought-after speaker and media presence and the author of more than a dozen books, which have sold more than 1.5 million copies! They include the blockbuster <strong>Love, Medicine, and Miracles</strong>; <strong>Peace, Love, and Healing</strong>; and <strong>365 Prescriptions for the Soul</strong>.</p>\n<p><strong>Bernie</strong> first wrote about miracles when he was a practicing surgeon and pioneered Exceptional Cancer Patients, a groundbreaking synthesis of group, individual, dream, and art therapy. His safe and loving approach facilitated patients’ awareness of their own physical, spiritual, and psychological healing potential.</p>\n<p>Compiled during his more than thirty years of practice as well as his speaking and teaching events, the new paperback edition of his book <strong>A Book of Miracles</strong> <em>(published by New World Library)</em> offers a cross-section of the healing and miracles he has personally seen and facilitated.</p>\n<p>The book is dvided into fifteen sections, each consisting of stories of miracles, pertinent quotes, anecdotes and his personal reflections.</p>\n<p>We talk all about that, along with his life journey, and how he lives his own life “on purpose.”</p>\n<p>For more information on <strong>Dr. Bernie Siegel</strong>, visit: <a href=\"http://berniesiegelmd.com\" target=\"_blank\">http://berniesiegelmd.com</a>.</p>",
  "content:encoded": "<p>Dr. Bernie Siegel is a sought-after speaker and media presence and the author of more than a dozen books, which have sold more than 1.5 million copies! They include the blockbuster Love, Medicine, and Miracles; Peace, Love, and Healing; and 365 Prescriptions for the Soul.</p>\n<p>Bernie first wrote about miracles when he was a practicing surgeon and pioneered Exceptional Cancer Patients, a groundbreaking synthesis of group, individual, dream, and art therapy. His safe and loving approach facilitated patients’ awareness of their own physical, spiritual, and psychological healing potential.</p>\n<p>Compiled during his more than thirty years of practice as well as his speaking and teaching events, the new paperback edition of his book A Book of Miracles <em>(published by New World Library)</em> offers a cross-section of the healing and miracles he has personally seen and facilitated.</p>\n<p>The book is dvided into fifteen sections, each consisting of stories of miracles, pertinent quotes, anecdotes and his personal reflections.</p>\n<p>We talk all about that, along with his life journey, and how he lives his own life “on purpose.”</p>\n<p>For more information on Dr. Bernie Siegel, visit: <a href=\"http://berniesiegelmd.com\" target=\"_blank\">http://berniesiegelmd.com</a>.</p>",
  "enclosure": "",
  "itunes:duration": "01:00:21",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Dr. Bernie Siegel is a sought-after speaker and media presence and the author of more than a dozen books, which have sold more than 1.5 million copies! They include the blockbuster Love, Medicine, and Miracles; Peace, Love, and Healing; and 365..."
}