{
  "title": "Online Resource Allocation under Horizon Uncertainty. (arXiv:2206.13606v2 [cs.DS] UPDATED)",
  "link": "http://arxiv.org/abs/2206.13606",
  "description": "<p>We study stochastic online resource allocation: a decision maker needs to\nallocate limited resources to stochastically-generated sequentially-arriving\nrequests in order to maximize reward. At each time step, requests are drawn\nindependently from a distribution that is unknown to the decision maker. Online\nresource allocation and its special cases have been studied extensively in the\npast, but prior results crucially and universally rely on the strong assumption\nthat the total number of requests (the horizon) is known to the decision maker\nin advance. In many applications, such as revenue management and online\nadvertising, the number of requests can vary widely because of fluctuations in\ndemand or user traffic intensity. In this work, we develop online algorithms\nthat are robust to horizon uncertainty. In sharp contrast to the known-horizon\nsetting, no algorithm can achieve even a constant asymptotic competitive ratio\nthat is independent of the horizon uncertainty. We introduce a novel\ngeneralization of dual mirror descent which allows the decision maker to\nspecify a schedule of time-varying target consumption rates, and prove\ncorresponding performance guarantees. We go on to give a fast algorithm for\ncomputing a schedule of target consumption rates that leads to near-optimal\nperformance in the unknown-horizon setting. In particular, our competitive\nratio attains the optimal rate of growth (up to logarithmic factors) as the\nhorizon uncertainty grows large. Finally, we also provide a way to incorporate\nmachine-learned predictions about the horizon which interpolates between the\nknown and unknown horizon settings.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Balseiro_S/0/1/0/all/0/1\">Santiago Balseiro</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kroer_C/0/1/0/all/0/1\">Christian Kroer</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Kumar_R/0/1/0/all/0/1\">Rachitesh Kumar</a>"
}