{
  "id": "yt:video:5e6DmT2AzQc",
  "yt:videoId": "5e6DmT2AzQc",
  "yt:channelId": "UCOY6nAvXpLem0XczOq3wYQA",
  "title": "Why Men Love \"Literally Me\" Characters",
  "link": "",
  "author": {
    "name": "Du Cinema",
    "uri": "https://www.youtube.com/channel/UCOY6nAvXpLem0XczOq3wYQA"
  },
  "published": "2022-08-30T18:03:11+00:00",
  "updated": "2022-10-23T08:39:20+00:00",
  "media:group": {
    "media:title": "Why Men Love \"Literally Me\" Characters",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Fight club and American Psycho have been warning us, the idea of what it means to be a man is destabilizing in modern society. Recently a lot of characters have gained renewed interest among young men calling them \"literally me\": Travis Bickle from Taxi Driver, Ryan Gosling from Drive, Tyler Durden from Fight Club, Lou Bloom from Nightcrawler and ofcourse Patrick Bateman from American Psycho.\nIn this video essay we will dive deeper into the psyche of men in order to get a grip on why men find them so relatable and understand the so-called crisis of masculinity...\n\nGood Time, Fallen Angels and Another Round are now showing on MUBI in the Netherlands. Get 30 days free at http://mubi.com/ducinema\n\nStory, narration and editing by Eloi du Cinema. \n- My instagram: https://www.instagram.com/eloiducinema/ \n- Business Inquiries: ducinemaofficial@gmail.com\n\nThe rights for all the songs in this video are purchased through Artlist: https://artlist.io/Eloi-3497535\nSummer in Oxford - Jakob Pietras\nAves - The Chase\nFloat - Notize\nGnossienne 3 - Romi Kopelman\nMozart - Lacrimosa but humanity has ended\nNobou - The Beginning\nArdie Son - Aftershocks\nArdie Son - The New World\n\n\nCopyright Disclaimer under section 107 of the Copyright Act 1976, allowance is made for “fair use” for purposes such as criticism, comment, news reporting, teaching, scholarship, education and research. Fair use is a use permitted by copyright statute that might otherwise be infringing.\n\n\n#fightclub #tylerdurden #masculinity",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}