{
  "itunes:order": 46,
  "category": [
    "gender revolution",
    "gender mobility"
  ],
  "description": "The author describes sweeping changes in the gender system and offers explanations for why change has been uneven. In this article, the author describes sweeping changes in the gender system and offers explanations for why change has been uneven. Because the devaluation of activities done by women has changed little, women have had strong incentive to enter male jobs, but men have had little incentive to take on female activities or jobs. The gender egalitarianism that gained traction was the notion that women should have access to upward mobility and to all areas of schooling and jobs.  But persistent gender essentialism means that most people follow gender-typical paths except when upward mobility is impossible otherwise. Middle-class women entered managerial and professional jobs more than working-class women integrated blue-collar jobs because the latter were able to move up while choosing a \"female\" occupation; many mothers of middle-class women were already in the highest-status female occupations. The author also notes a number of gender-egalitarian trends that have stalled.",
  "guid": "http://rss.oucs.ox.ac.uk/tag:2011-05-27:180153:952:sociology/sociology-audio",
  "link": "http://media.podcasts.ox.ac.uk/sociology/sociology/Sociology_T2_paula_england.mp3",
  "itunes:subtitle": "The author describes sweeping changes in the gender system and offers explanations for why change has been uneven.",
  "creativeCommons:license": "http://creativecommons.org/licenses/by-nc-sa/2.0/uk/",
  "itunes:summary": "The author describes sweeping changes in the gender system and offers explanations for why change has been uneven. In this article, the author describes sweeping changes in the gender system and offers explanations for why change has been uneven. Because the devaluation of activities done by women has changed little, women have had strong incentive to enter male jobs, but men have had little incentive to take on female activities or jobs. The gender egalitarianism that gained traction was the notion that women should have access to upward mobility and to all areas of schooling and jobs.  But persistent gender essentialism means that most people follow gender-typical paths except when upward mobility is impossible otherwise. Middle-class women entered managerial and professional jobs more than working-class women integrated blue-collar jobs because the latter were able to move up while choosing a \"female\" occupation; many mothers of middle-class women were already in the highest-status female occupations. The author also notes a number of gender-egalitarian trends that have stalled. Creative Commons Attribution-Non-Commercial-Share Alike 2.0 UK: England & Wales; http://creativecommons.org/licenses/by-nc-sa/2.0/uk/",
  "itunes:keywords": "gender revolution,gender mobility,2011-05-16",
  "itunes:author": "Paula England",
  "itunesu:category": "",
  "itunes:duration": 2397,
  "enclosure": "",
  "pubDate": "Fri, 27 May 2011 20:01:53 +0100",
  "source": "Department of Sociology Podcasts",
  "title": "The gender revolution: uneven and stalled"
}