{
  "title": "#458: Portrait Party (OOTP 22, St. Mungo's, Part 1)",
  "link": "https://audioboom.com/posts/7538040",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4355,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>We had a blast at our <a href=\"https://www.youtube.com/watch?v=nOhOgFdrtDs\">Forget About The World live show</a> earlier in the week! Tune in for a show and tell and a few rounds of Harry Potter Heads Up!</li>\n<li>The hosts receive candles from our listener Devin, including a goat-scented one for Micah! Check out Devin's website - <a href=\"https://www.worndoll.com/\">Worndoll.com</a>\n</li>\n<li>J.K. Rowling loosens guidelines on recording Harry Potter books for schools </li>\n<li>To liven things up we play a fun Sporcle game - <a href=\"https://www.sporcle.com/games/crookshanks/harrypotternamechain\">Harry Potter Name Chain</a>\n</li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 22: St. Mungo's for Magical Maladies and Injuries (Part One)</li>\n<li>7-Word Summary: Arthur survives by receiving care from portraits </li>\n<li>What's up with Dumbledore's passwords? They seem kind of... weak!</li>\n<li>Portrait Party! Is this is a nightly occurrence? How annoying for Dumbledore!</li>\n<li>Why does Dumbledore not acknowledge Harry... or Ron?</li>\n<li>Portrait Superstars: Everard and Dilys</li>\n<li>Why does the Order not have better security alert measures in place?</li>\n<li>Phineas Nigellus Black says Sirius always had odd houseguests. Really? Like who?</li>\n<li>In Essence Divided - Dumbledore's Horcrux epiphany!</li>\n<li>We discuss Dumbledore's bond with Fawkes - how is the phoenix able to track Umbridge?</li>\n<li>Who tipped off the old toad? Mrs. Norris?</li>\n<li>Harry's Rage toward Dumbledore: part Harry and part Horcrux!</li>\n<li>Sirius shows maturity in his handling of the Weasleys at Grimmauld Place</li>\n<li>OUT! How a single word to Kreacher seals Sirius' fate!</li>\n<li>The Waiting Game</li>\n<li>The Umbridge Suck Count climbs to 49!</li>\n<li>Connecting The Threads, MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What color robes do Healers of St Mungo’s wear?</li>\n<li>This week's episode is sponsored by Thirdlove. Find your perfect fitting bra and receive 15% off your first order by visiting <a href=\"http://www.Thirdlove.com/MuggleCast\">Thirdlove.com/MuggleCast</a>!</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week, we discuss that silvery instrument inside Dumbledore's office and J.K. Rowling's post-Deathly Hallows comments about it!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 24 Mar 2020 10:00:00 +0000",
  "guid": "tag:audioboom.com,2020-03-23:/posts/7538040",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}