{
  "title": "Episode 116: &#8220;Where Did Our Love Go?&#8221; by The Supremes",
  "link": "https://500songs.com/podcast/episode-116-where-did-our-love-go-by-the-supremes/",
  "pubDate": "Wed, 10 Mar 2021 01:25:01 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/episode-116-where-did-our-love-go-by-the-supremes/",
  "description": "Episode one hundred and sixteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Where Did Our Love Go?\" by the Supremes, and how the \"no-hit Supremes\" became the biggest girl group in history. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/48557951\">\"She's Not There\" by the Zombies</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-116-where-did-our-love-go/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em>&nbsp;by Lamont Dozier and Scott B. Bomar&nbsp;</a>is Dozier's autobiography, while&nbsp;<a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories&nbsp;</em>by Brian and Eddie Holland and Dave Thompson</a>&nbsp;is the Holland brothers'.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I mention in the podcast is&nbsp;<a href=\"https://amzn.to/30teiyS\"><em>The Supremes</em> by Mark Ribowsky</a>, which seems factually accurate but questionable in its judgments of people.\n\nI also used <a href=\"https://amzn.to/3bwBwKH\">this omnibus edition</a> of Mary Wilson's two volumes of autobiography.\n\n<a href=\"https://amzn.to/3t3Cwfl\">This box set</a> contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. <a href=\"https://amzn.to/3l1FfD5\">This</a> is a good budget substitute, though oddly doesn't contain \"Stop in the Name of Love\".\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nBefore I start, this episode contains a brief mention of rape, and the trauma of a victim, and a glancing mention of an eating disorder. The discussion is not particularly explicit, but if you think you might find it upsetting, you might be advised to check the transcript before listening, which as always can be found on the site website, or to skip this episode.\n\nToday, we're going to look at the first big hit from the group who would become the most successful female vocal group of the sixties, the group who would become the most important act to come out of Motown, and who would be more successful in chart terms than anyone in the sixties except the Beatles and Elvis. &nbsp;We're going to look at the record that made Holland, Dozier, and Holland the most important team in Motown, and that made a group that had been regarded as a joke into superstars. We're going to look at \"Where Did Our Love Go?\" by the group that up until this record was known in Motown as \"the no-hit Supremes\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nThe story of the Supremes starts, like almost every Motown act, in Detroit. Specifically, it starts with a group called the Primes, a trio who had grown up in Birmingham, Alabama, and then had moved to Cleveland, before moving in turn to Detroit. The Primes consisted of Eddie Kendricks, Paul Williams, and Kell Osborne, and were gaining popularity around the city.\n\nBut their act was lacking something, and their manager, Milton Jenkins, was inspired by Ray Charles' backing vocalists, the Raelettes. What if, he thought, his male vocal group had a group of female backing singers, the Primettes?\n\nStories vary about exactly how Jenkins pulled the group members together, including the idea that he literally stopped girls on the streets of the housing projects where the eventual members all lived. But what everyone seems to agree on is that Betty McGlown was dating Paul Williams, so she was an obvious choice. Mary Wilson and Florence Ballard knew each other and were good singers, especially Ballard, and they joined together, with Ballard becoming the new group's leader. And nobody seems to be clear who asked Diana Ross to join, but she was invited in. Ross says she was already singing with the other three around the neighbourhood. Wilson insisted that they didn't know her, and that she was brought in by Jenkins.\n\nWhile Ballard and Wilson were friendly enough, and all of them were from the same small area and so knew each other by sight, this wasn't a group that came together as friends, but people who were put together by a third party. This would make a big difference to them over the years.\n\nRoss was probably introduced to the group because she already had a reputation among the people who were playing Detroit's talent shows. For example there's Melvin Franklin, who in the late fifties was singing with The Distants:\n\n[Excerpt: The Distants, \"Come On\"]\n\nFranklin was an old friend of Ross' from school, and he would rave about Ross to his friends, so much so that Otis Williams, another member of the Distants (which would soon merge with the Primes to become the Temptations) knew Ross' name long before he ever met her, and later remembered thinking \"Jesus, this girl must be something special.\"\n\nSo Jenkins would have known about Ross through these connections.\n\nIncidentally, before we go any further, I should mention the issue of Diana Ross' name. At this point, she was mostly known by the name on her birth certificate, Diane, and that's how many people who knew her in this period still refer to her when talking about the late fifties and early sixties. However, she says herself that her parents always intended to name her Diana and the person filling in the birth certificate misspelled it, and she's used Diana for many decades now. As a general rule on this podcast I always refer to someone by the name they choose for themselves unless there's a very good reason not to, and so I'm going to be referring to her as Diana throughout -- and later when we talk about the Byrds, I will always refer to Roger McGuinn, and so on.\n\nIt's difficult to talk about Diana Ross in any sensible way, because she is not a person who has inspired the greatest affection among her colleagues, or among people writing about her. But almost all the negative things said about her have a deep undercurrent of misogyny. One of the biographies I used for researching this episode, for example, in the space of four consecutive sentences in the introduction, compares her face to that of ET, says she looked \"emaciated and vacant\" (and this is a woman who suffered from anorexia), talks about how inviting her mouth is and her \"bedroom eyes\", and then talks about how she used her sexuality to get ahead. You will be shocked, I am sure, to hear that this book was written by a male biographer. Oddly, the books I'm using for the upcoming episodes on Manfred Mann and the Beach Boys don't talk of their lead singers in this way...\n\nIn particular, there is a recurring theme in almost everything written about Ross, which criticises her for having affairs with prominent people at Motown, most notably Berry Gordy, and accuses her of doing this in order to further her own ambitions. That sort of criticism is rooted in misogyny. This is not a podcast that will ever deal in shaming women for their sexuality, and what consenting adults do with each other is their business alone. I would also point out that Ross' affair with Gordy is always portrayed as ethical misconduct on Ross' part, but *if* there was anything unethical about their relationship, the fault in a relationship between a rich, powerful, married man in his thirties and his much younger employee is unlikely to have been due to the latter.\n\nThat's not to say that Ross is flawless -- far from it, as the narrative will make clear -- but to say that it's very difficult, when relying on reportage either from people with personal grudges against her or from writers who take attitudes like that, to separate the real flaws in the real woman from the monster of the popular imagination.\n\nBut that's all for later in the story. At this point, Ross was merely one of four girls brought together by Jenkins to form the Primettes - but Jenkins soon realised that this group could be better used as a group in their own right, rather than merely as backing vocalists for the Primes.\n\nAt this point, early on, there was no question but that Florence Ballard was the leader of the group. She had the most outspoken personality, and also had the best voice. When Jenkins had asked to hear the girls sing together, all the others had just looked at each other, while she had burst out into Ray Charles' \"Night Time is the Right Time\":\n\n[Excerpt: Ray Charles, \"Night Time is the Right Time\"]\n\nThat would become a staple of the girls' early act, along with \"The Twist\" and \"There Goes My Baby\".\n\nAll of the girls would take lead vocals on stage, but Florence was the first among equals. At that time, indeed, Ballard thought that Ross should not be a lead singer at all, but Ross got very angry at this, and kept working at her vocals, trying to get them more commercial and make better use of her more limited voice. Ballard was a natural singer, who sang passionately in a way that apparently blew audiences away with relatively little effort, because she was singing from the heart. Ross, on the other hand, was a calculated performer who was deliberately trying to gain the audience's popularity, and was improving with every show as she learned what worked. The combination worked, at least for a time, though the two never got on even from the start.\n\nOf the other members, Mary Wilson was always the peacemaker, someone who was so conflict-averse she would find a way to get Florence and Diana to stop fighting, no matter what. Meanwhile, Betty was the least interested in being in a group -- she was just doing it as a favour for her boyfriend.\n\nAnd finally, there was a fifth member, Marvin Tarplin, who didn't sing but who played guitar, which made them one of the few vocal groups in the city who had their own accompaniment.\n\nFairly quickly, Franklin dropped out of management -- he spent some time in hospital, and after getting out he just never got back in touch with the girls -- and the Primettes took over looking after themselves. There are various stories about them being approached by different people within Motown at different points, but everyone agrees that their first real contact with Motown came through Ross. Ross had, a year or so before the group formed, been friendly with Smokey Robinson, on whom she had a bit of an adolescent crush. Knowing that Robinson was now recording for Motown, she got in touch with him, and he made a suggestion -- her group should audition for him, and if he thought they were good enough, he'd get them an appointment with Berry Gordy.\n\nThe group sang for Robinson, who wasn't hugely impressed, except with their guitarist. So Robinson made a deal with them -- he'd get the girls an audition for Motown, if he could borrow their guitarist for a tour the Miracles were about to do. They agreed, and Robinson's temporary borrowing of Tarplin lasted fifty years, as Tarplin continued working with Robinson, both in the Miracles and on Robinson's solo records, until 2008, and co-wrote many of Robinson's biggest hits.\n\nBut Robinson kept his word, and the girls did indeed audition for Berry Gordy, who was encouraging but told them to come back after they had finished school.\n\nBut two other producers at Motown, Richard Morris and Robert Bateman, decided they weren't going to wait around. If Berry Gordy didn't want to sign them yet, they'd get the Primettes work with other labels. Morris became their manager, and they started getting session work on early recordings by future soul legends like Wilson Pickett:\n\n[Excerpt: Wilson Pickett, \"Let Me Be Your Boy\"]\n\nAnd Eddie Floyd:\n\n[Excerpt: Eddie Floyd, \"I am Her Yo-Yo Man\"]\n\nThe group also eventually got to put out their own single. The A-side featured Ross on lead:\n\n[Excerpt: The Primettes, \"Tears of Sorrow\"]\n\nWhile the B-side had Wilson singing lead, but also featured a prominent high part from Ballard:\n\n[Excerpt: The Primettes, \"Pretty Baby\"]\n\nShortly after this, several things happened that would change the group forever. One was that Betty decided to leave the group to get married. She had never been as committed to the group as the other three, and she was quickly replaced with a new singer, Barbara Martin.\n\nThe other, far more devastating, thing was that Florence Ballard was raped by an acquaintance. This traumatised Ballard deeply, and from this point on she became unable to trust anyone, even her friends. She would suffer for the rest of her life from what would now be diagnosed as post-traumatic stress disorder, and while it's likely that the later problems between her and Ross would have occurred in some form, the way they occurred was undoubtedly affected by the fact of Ballard's untreated mental illness as a result of this trauma.\n\nAfter refusing to speak to anyone at all for a couple of weeks, Ballard managed to get herself well enough to start singing again, and then only a few days later Richard Morris was arrested for a parole violation and found himself in prison.\n\nWith all these devastating changes, many groups would have given up. But &nbsp;the Primettes were ambitious, and they decided that they were going to force their way into Motown, whether Berry Gordy wanted them or not. They took to hanging around Hitsville, acting like they belonged there, and they soon found themselves doing minor bits of work on sessions -- handclaps and backing vocals and so on, as almost everyone who hung around the studio long enough would.\n\nEventually they got lucky. Freddie Gorman, who was the girls' postman in his day job and had not yet written \"Please Mr. Postman\", had been working on a song with Brian Holland, and the girls happened to be around. &nbsp;Gorman suggested they try the song out, to see what it sounded like with harmonies, and the result was good enough that Holland and Gorman called in Gordy, who tinkered with the song to get his name on the credits, and then helped produce the session:\n\n[Excerpt: The Supremes, \"I Want a Guy\"]\n\nThat came out under the name The Supremes, with a Berry Gordy song on the B-side, a knock-off of \"Maybe\" by the Chantels called \"Never Again\".\n\nHow the group got their new name has also been a subject of some dispute, in part because of legal issues later on, as Florence Ballard tried to claim some intellectual property rights in the group name as the one who had chosen it. Everyone involved has a different story about how the name was chosen, but it seems to be the consensus that Ballard did pick the name from a shortlist, with the dispute being over whether that shortlist was of names that the group members had come up with between them, or whether it was created by Janie Bradford, and whether Ballard made a conscious choice of the name or just picked it out of a hat. Whatever the case, the Primettes had now become the Supremes.\n\nThe problem was that Berry Gordy wasn't really interested in them as a group. Right from the start, he was only interested in Diana Ross as an individual, though at least at first all the members would get to take lead vocals on album tracks -- though the singles would be saved for Diana. With one exception -- after the group's first single flopped, they decided to go in a very different direction for the second single.\n\nFor that, Gordy wrote a knock-off of a knock-off. In 1959 the Olympics had had a very minor hit with \"Hully Gully\":\n\n[Excerpt: The Olympics, \"Hully Gully\"]\n\nWhich had been remade a few months later by the Marathons as \"Peanut Butter\":\n\n[Excerpt: The Marathons, \"Peanut Butter\"]\n\nGordy chose to rework this song as \"Buttered Popcorn\", a song that's just an excuse for extremely weak double entendres, and Florence got to sing lead:\n\n[Excerpt: The Supremes, \"Buttered Popcorn\"]\n\nThat was no more successful than \"I Want a Guy\", and that would be the last time Florence Ballard ever got to sing lead on a Supremes single.\n\nIt would also be the last single the Supremes released as a four-piece. While Barbara Martin had recorded some material with the group that would be released later, she became pregnant and decided to leave the group. Having decided that they clearly couldn't keep a fourth singer around, the other three decided to continue on as a trio.\n\nBy this time, Motown had signed the Marvelettes, and they'd leapfrogged over the Supremes to become major stars. The Supremes, meanwhile had had two flops in a row, and their third did little better, though \"Your Heart Belongs to Me\", &nbsp;written and produced for them by Smokey Robinson, did make number ninety-five in the charts.\n\nThat was followed by a string of flops that often did, just, make the Hot One Hundred but didn't qualify as hits by any measure -- and many of them were truly terrible. The group got the nickname \"the no-hit Supremes\" and tended to get the songs that wouldn't pass muster for other groups. Their nadir was probably the B-side \"The Man with the Rock & Roll Banjo Band\", a song that seems to have been based around Duane Eddy's \"Dance With the Guitar Man\":\n\n[Excerpt: Duane Eddy, \"Dance With the Guitar Man\"]\n\nBut instead of the electric guitar, the Supremes' song was about the banjo, an instrument which has many virtues, but which does not really fit into the Motown sound:\n\n[Excerpt: The Supremes, \"The Man with the Rock and Roll Banjo Band\"]\n\nThis sort of thing continued for two years, with the Supremes now being passed in chart success not only by the Marvelettes but also by the Vandellas, who also signed to Motown after them and had hits before. The \"no-hit Supremes\" at their best only just scraped the bottom of the Hot One Hundred, no matter who produced them -- Lamont Dozier and Brian Holland, Clarence Paul, Berry Gordy, and Smokey Robinson all had multiple attempts at recording with the group, because of Gordy's belief in Ross' star potential, but nothing happened until they were paired with Holland, Dozier, and Holland, fresh off their success with the Vandellas.\n\nThe musical side of the Holland/Dozier/Holland team had already worked with the group, but with little success. But once Holland/Dozier/Holland became a bona fide hit-making team, they started giving the Supremes additional backing vocal parts. They're in the vocal stack, for example, on Marvin Gaye's extraordinary \"Can I Get a Witness\":\n\n[Excerpt: Marvin Gaye, \"Can I Get a Witness\"]\n\nThe first song that Holland, Dozier, and Holland wrote as a team for the Supremes is very different from the heavy, soulful, records they'd specialised in up until that point. Lamont Dozier has said that when he came up with the idea for \"When the Lovelight Starts Shining in His Eyes\" he was thinking of Phil Spector and Brian Wilson, although it's unlikely he was actually thinking of Wilson, who at this point in 1963 was still making rather garagey surf-rock records rather than the symphonic pop he would start to specialise in the next year. Which is not to say that Holland, Dozier, and Holland weren't paying attention to Wilson -- after all, they wrote \"Surfer Boy\" for the Supremes in 1965 -- but Dozier is probably misremembering here. It's entirely plausible, though, that he was thinking of Spector, and the song definitely has a wall of sound feel, albeit filtered through Motown's distinctly funkier, non-Wrecking-Crew, sound, and with more than a little Bo Diddley influence:\n\n[Excerpt: The Supremes, \"When the Lovelight Starts Shining Through His Eyes\"]\n\nThat also featured additional backing vocals from the Four Tops, another group with whom Holland, Dozier, and Holland were working, and who we'll be hearing more of in future episodes.\n\n\"When the Lovelight Starts Shining Through His Eyes\" went to number twenty-three, the first bona fide hit the Supremes had ever had. So they were set. They even had a surefire smash follow-up. With Holland, Dozier, and Holland they'd recorded *another* Phil Spector knock-off, *before* \"Lovelight\", a record modelled on \"Da Doo Ron Ron\", titled \"Run Run Run\", but they'd held it back so they could release it next -- they decided to release a record that sounded like a medium-sized hit first, to get some momentum and name recognition, so they could then release the big smash hit.\n\nBut \"Run Run Run\" only went to number ninety-four.\n\nThe group were at a low point, and as far as they could tell they were only going to get lower. They'd had their hit and it looked like a fluke. The big one they'd had hopes for had gone nowhere.\n\nThe story of their next single has been told many ways by many different people. This is a version of the story as best I can put it together, but everything that follows might be false, because as with so much of Motown, everyone has their own agenda.\n\nAs best I can make out, Holland, Dozier, and Holland were working on tracks for a proposed Marvelettes album and came up with a simple, stomping, song based on a repetitive eight-bar verse, with no bridge, chorus, or middle eight.\n\nThe Holland brothers disagree about what happened next, and it sounds odd, but Lamont Dozier, Mary Wilson, and Katherine Anderson of the Marvelettes all say the same thing -- while normally Motown artists had no say in what songs they recorded, this time the Marvelettes were played a couple of backing tracks which had been proposed as their next recording, and they chose to dump the eight-bar one, and go instead with \"Too Many Fish in the Sea\":\n\n[Excerpt: The Marvelettes, \"Too Many Fish in the Sea\"]\n\nThe way Dozier tells the story, that presented Holland, Dozier, and Holland with a problem. They'd recorded the backing track, and one of the many ways that Motown caused problems for its creative workers was that they would be charged against royalties for studio time. If the track didn't get released, they'd lost all the money.\n\nSo they turned to the Supremes, and Dozier tried to persuade Mary Wilson that he'd written this great new song, just for them, they'd love it, but by this point they'd already talked to the Marvelettes and been told about this dreadful song they'd managed to get out of doing, and advised to avoid it if they could.\n\nBut while the Marvelettes were a big, successful group, the Supremes weren't yet, and didn't have any choice. They were going to record the song whether they liked it or not.\n\nThey didn't like it. Having already been poisoned against the song by the Marvelettes, there were further problems in the studio because one of the production team had originally told Mary Wilson she could sing lead on the song. Everyone seems agreed that Brian Holland insisted on Diana Ross singing it instead, but Eddie Holland remembers that he thought that Wilson should sing and it was Brian and Dozier who insisted on Ross, while Dozier remembers that *he* thought that Wilson should sing, and it was the Holland brothers who insisted on Ross.\n\nSomehow, if all these memories are to be believed, Brian Holland outvoted his partners one to two, possibly because Berry Gordy had declared that Ross should be the lead singer on all Supremes singles. Mary was devastated, while Ross was annoyed that she was having to sing what she thought was a terrible song, in a key that was much lower than she was used to. She got more annoyed when Eddie Holland kept coaching her on how he wanted the song sung -- she was playing with the phrasing and Holland insisted she sing it straight. Eventually she started threatening to get Gordy to come down, at which point Eddie told her that she could do that, but then Gordy could just produce the session and they needn't bother hoping for any more Holland/Dozier/Holland songs.\n\nShe sang through her lead putting as little emotion as she could into her voice, while glaring daggers at the producers, before storming off as soon as she'd completed the take they wanted, complaining about being given everyone else's leftovers:\n\n[Excerpt: The Supremes, “Where Did Our Love Go?”]\n\nHolland, Dozier, and Holland then got on with trying to get the other two Supremes to do the backing vocal parts. But the parts Lamont Dozier had come up with were difficult, nobody was in a good mood, and Mary Wilson was still upset that she wasn't going to be singing lead. They couldn't get the vocals down, and eventually, frustrated, Dozier told them to just sing \"baby baby\" when he pointed, and they went with that.\n\nTowards the end of the session, Ross came back in, with Berry Gordy, who she had clearly been complaining to about the song. He asked to hear it, and they played back this recording that nobody was happy with. Gordy, much to Ross' shock, was convinced it was a hit, and said to them \"Cheer up, everybody! From now on, you're the big-hit Supremes!\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nMotown was in a bit of a slump at that point -- several of the label's big stars had had disappointing follow-ups to their hits, and they'd just lost Mary Wells, one of their biggest stars, to another label. Gordy decided that they were going to give \"Where Did Our Love Go?\" a huge push, and persuaded Dick Clark to put the Supremes on his Caravan of Stars tour. When the record came out in June, they were at the bottom of the bill, opening the show on a bill with more than a dozen other acts, from the Zombies to the Shirelles to Freddie \"Boom Boom\" Cannon above them. By the end of the tour, their record was at number one in the charts and they had already recorded a follow-up. As \"Where Did Our Love Go?\" had included the word \"baby\" sixty-eight times, the production team had decided not to mess with a winning formula:\n\n[Excerpt: The Supremes, \"Baby Love\"]\n\nThat went to number one by the end of October 1964, making the Supremes the first Motown act to have two number ones. There would be a lot more where that came from.\n\nBut there was already trouble brewing in the group. Even on the Dick Clark tourbus, there were rumours that Diana Ross wanted a solo career, and there was talk of her forcing Florence Ballard out of the group. We'll look at that, and what happened with the Supremes in the latter part of the sixties in a few months' time.\n\nBut I can't end this time without acknowledging the sad death, a month ago today, of Mary Wilson, the only member of the Supremes who stayed with the group from the beginning right through to their split in 1977. For a member of a group who were second only to the Beatles for commercial success in the sixties, she was underrewarded in life, and her death went underreported. She'll be missed.",
  "itunes:subtitle": "Episode one hundred and sixteen of A History of Rock Music in Five Hundred Songs looks at Where Did Our Love Go? by the Supremes, and how the no-hit Supremes became the biggest girl group in history. Click the full post to read liner notes, links to more",
  "itunes:keywords": "Berry Gordy,Diana Ross,Dick Clark,Freddie Gorman,girl groups,Holland-Dozier-Holland,Motown,Robert Bateman,Smokey Robinson,The Funk Brothers,The Marvelettes,The Supremes,The Temptations,vocal groups",
  "itunes:episodeType": "full",
  "itunes:episode": 116,
  "content:encoded": "Episode one hundred and sixteen of <em>A History of Rock Music in Five Hundred Songs</em> looks at \"Where Did Our Love Go?\" by the Supremes, and how the \"no-hit Supremes\" became the biggest girl group in history. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on <a href=\"https://www.patreon.com/posts/48557951\">\"She's Not There\" by the Zombies</a>.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, I've created&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-116-where-did-our-love-go/\">a Mixcloud streaming playlist&nbsp;</a>with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\n<a href=\"https://amzn.to/2QTOvdM\"><em>Where Did Our Love Go? The Rise and Fall of the Motown Sound</em>&nbsp;by Nelson George</a>&nbsp;is an excellent popular history of the various companies that became Motown.\n\n<a href=\"https://amzn.to/2QQhXRZ\"><em>To Be Loved</em>&nbsp;by Berry Gordy</a>&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\n<a href=\"https://amzn.to/2VIpXII\"><em>Women of Motown: An Oral History</em>&nbsp;by Susan Whitall</a> is a collection of interviews with women involved in Motown.\n\n<a href=\"https://amzn.to/2xVdvfD\"><em>I Hear a Symphony: Motown and Crossover R&B&nbsp;</em>by J. Andrew Flory</a>&nbsp;is an academic look at Motown.\n\n<a href=\"https://amzn.to/2VLquJX\"><em>The Motown Encyclopaedia</em>&nbsp;by Graham Betts</a>&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\n<a href=\"https://amzn.to/3bZd5q6\"><em>How Sweet It Is</em>&nbsp;by Lamont Dozier and Scott B. Bomar&nbsp;</a>is Dozier's autobiography, while&nbsp;<a href=\"https://amzn.to/3903ey8\"><em>Come and Get These Memories&nbsp;</em>by Brian and Eddie Holland and Dave Thompson</a>&nbsp;is the Holland brothers'.\n\nAnd&nbsp;<a href=\"https://motownjunkies.co.uk/\">Motown Junkies</a>&nbsp;is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\n<a href=\"https://amzn.to/3iOneXx\">Girl Groups</a> by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I mention in the podcast is&nbsp;<a href=\"https://amzn.to/30teiyS\"><em>The Supremes</em> by Mark Ribowsky</a>, which seems factually accurate but questionable in its judgments of people.\n\nI also used <a href=\"https://amzn.to/3bwBwKH\">this omnibus edition</a> of Mary Wilson's two volumes of autobiography.\n\n<a href=\"https://amzn.to/3t3Cwfl\">This box set</a> contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. <a href=\"https://amzn.to/3l1FfD5\">This</a> is a good budget substitute, though oddly doesn't contain \"Stop in the Name of Love\".\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon. <a href=\"http://patreon.com/AndrewHickey\">Why not join them?</a>\n\n<strong>Transcript</strong>\n\nBefore I start, this episode contains a brief mention of rape, and the trauma of a victim, and a glancing mention of an eating disorder. The discussion is not particularly explicit, but if you think you might find it upsetting, you might be advised to check the transcript before listening, which as always can be found on the site website, or to skip this episode.\n\nToday, we're going to look at the first big hit from the group who would become the most successful female vocal group of the sixties, the group who would become the most important act to come out of Motown, and who would be more successful in chart terms than anyone in the sixties except the Beatles and Elvis. &nbsp;We're going to look at the record that made Holland, Dozier, and Holland the most important team in Motown, and that made a group that had been regarded as a joke into superstars. We're going to look at \"Where Did Our Love Go?\" by the group that up until this record was known in Motown as \"the no-hit Supremes\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nThe story of the Supremes starts, like almost every Motown act, in Detroit. Specifically, it starts with a group called the Primes, a trio who had grown up in Birmingham, Alabama, and then had moved to Cleveland, before moving in turn to Detroit. The Primes consisted of Eddie Kendricks, Paul Williams, and Kell Osborne, and were gaining popularity around the city.\n\nBut their act was lacking something, and their manager, Milton Jenkins, was inspired by Ray Charles' backing vocalists, the Raelettes. What if, he thought, his male vocal group had a group of female backing singers, the Primettes?\n\nStories vary about exactly how Jenkins pulled the group members together, including the idea that he literally stopped girls on the streets of the housing projects where the eventual members all lived. But what everyone seems to agree on is that Betty McGlown was dating Paul Williams, so she was an obvious choice. Mary Wilson and Florence Ballard knew each other and were good singers, especially Ballard, and they joined together, with Ballard becoming the new group's leader. And nobody seems to be clear who asked Diana Ross to join, but she was invited in. Ross says she was already singing with the other three around the neighbourhood. Wilson insisted that they didn't know her, and that she was brought in by Jenkins.\n\nWhile Ballard and Wilson were friendly enough, and all of them were from the same small area and so knew each other by sight, this wasn't a group that came together as friends, but people who were put together by a third party. This would make a big difference to them over the years.\n\nRoss was probably introduced to the group because she already had a reputation among the people who were playing Detroit's talent shows. For example there's Melvin Franklin, who in the late fifties was singing with The Distants:\n\n[Excerpt: The Distants, \"Come On\"]\n\nFranklin was an old friend of Ross' from school, and he would rave about Ross to his friends, so much so that Otis Williams, another member of the Distants (which would soon merge with the Primes to become the Temptations) knew Ross' name long before he ever met her, and later remembered thinking \"Jesus, this girl must be something special.\"\n\nSo Jenkins would have known about Ross through these connections.\n\nIncidentally, before we go any further, I should mention the issue of Diana Ross' name. At this point, she was mostly known by the name on her birth certificate, Diane, and that's how many people who knew her in this period still refer to her when talking about the late fifties and early sixties. However, she says herself that her parents always intended to name her Diana and the person filling in the birth certificate misspelled it, and she's used Diana for many decades now. As a general rule on this podcast I always refer to someone by the name they choose for themselves unless there's a very good reason not to, and so I'm going to be referring to her as Diana throughout -- and later when we talk about the Byrds, I will always refer to Roger McGuinn, and so on.\n\nIt's difficult to talk about Diana Ross in any sensible way, because she is not a person who has inspired the greatest affection among her colleagues, or among people writing about her. But almost all the negative things said about her have a deep undercurrent of misogyny. One of the biographies I used for researching this episode, for example, in the space of four consecutive sentences in the introduction, compares her face to that of ET, says she looked \"emaciated and vacant\" (and this is a woman who suffered from anorexia), talks about how inviting her mouth is and her \"bedroom eyes\", and then talks about how she used her sexuality to get ahead. You will be shocked, I am sure, to hear that this book was written by a male biographer. Oddly, the books I'm using for the upcoming episodes on Manfred Mann and the Beach Boys don't talk of their lead singers in this way...\n\nIn particular, there is a recurring theme in almost everything written about Ross, which criticises her for having affairs with prominent people at Motown, most notably Berry Gordy, and accuses her of doing this in order to further her own ambitions. That sort of criticism is rooted in misogyny. This is not a podcast that will ever deal in shaming women for their sexuality, and what consenting adults do with each other is their business alone. I would also point out that Ross' affair with Gordy is always portrayed as ethical misconduct on Ross' part, but *if* there was anything unethical about their relationship, the fault in a relationship between a rich, powerful, married man in his thirties and his much younger employee is unlikely to have been due to the latter.\n\nThat's not to say that Ross is flawless -- far from it, as the narrative will make clear -- but to say that it's very difficult, when relying on reportage either from people with personal grudges against her or from writers who take attitudes like that, to separate the real flaws in the real woman from the monster of the popular imagination.\n\nBut that's all for later in the story. At this point, Ross was merely one of four girls brought together by Jenkins to form the Primettes - but Jenkins soon realised that this group could be better used as a group in their own right, rather than merely as backing vocalists for the Primes.\n\nAt this point, early on, there was no question but that Florence Ballard was the leader of the group. She had the most outspoken personality, and also had the best voice. When Jenkins had asked to hear the girls sing together, all the others had just looked at each other, while she had burst out into Ray Charles' \"Night Time is the Right Time\":\n\n[Excerpt: Ray Charles, \"Night Time is the Right Time\"]\n\nThat would become a staple of the girls' early act, along with \"The Twist\" and \"There Goes My Baby\".\n\nAll of the girls would take lead vocals on stage, but Florence was the first among equals. At that time, indeed, Ballard thought that Ross should not be a lead singer at all, but Ross got very angry at this, and kept working at her vocals, trying to get them more commercial and make better use of her more limited voice. Ballard was a natural singer, who sang passionately in a way that apparently blew audiences away with relatively little effort, because she was singing from the heart. Ross, on the other hand, was a calculated performer who was deliberately trying to gain the audience's popularity, and was improving with every show as she learned what worked. The combination worked, at least for a time, though the two never got on even from the start.\n\nOf the other members, Mary Wilson was always the peacemaker, someone who was so conflict-averse she would find a way to get Florence and Diana to stop fighting, no matter what. Meanwhile, Betty was the least interested in being in a group -- she was just doing it as a favour for her boyfriend.\n\nAnd finally, there was a fifth member, Marvin Tarplin, who didn't sing but who played guitar, which made them one of the few vocal groups in the city who had their own accompaniment.\n\nFairly quickly, Franklin dropped out of management -- he spent some time in hospital, and after getting out he just never got back in touch with the girls -- and the Primettes took over looking after themselves. There are various stories about them being approached by different people within Motown at different points, but everyone agrees that their first real contact with Motown came through Ross. Ross had, a year or so before the group formed, been friendly with Smokey Robinson, on whom she had a bit of an adolescent crush. Knowing that Robinson was now recording for Motown, she got in touch with him, and he made a suggestion -- her group should audition for him, and if he thought they were good enough, he'd get them an appointment with Berry Gordy.\n\nThe group sang for Robinson, who wasn't hugely impressed, except with their guitarist. So Robinson made a deal with them -- he'd get the girls an audition for Motown, if he could borrow their guitarist for a tour the Miracles were about to do. They agreed, and Robinson's temporary borrowing of Tarplin lasted fifty years, as Tarplin continued working with Robinson, both in the Miracles and on Robinson's solo records, until 2008, and co-wrote many of Robinson's biggest hits.\n\nBut Robinson kept his word, and the girls did indeed audition for Berry Gordy, who was encouraging but told them to come back after they had finished school.\n\nBut two other producers at Motown, Richard Morris and Robert Bateman, decided they weren't going to wait around. If Berry Gordy didn't want to sign them yet, they'd get the Primettes work with other labels. Morris became their manager, and they started getting session work on early recordings by future soul legends like Wilson Pickett:\n\n[Excerpt: Wilson Pickett, \"Let Me Be Your Boy\"]\n\nAnd Eddie Floyd:\n\n[Excerpt: Eddie Floyd, \"I am Her Yo-Yo Man\"]\n\nThe group also eventually got to put out their own single. The A-side featured Ross on lead:\n\n[Excerpt: The Primettes, \"Tears of Sorrow\"]\n\nWhile the B-side had Wilson singing lead, but also featured a prominent high part from Ballard:\n\n[Excerpt: The Primettes, \"Pretty Baby\"]\n\nShortly after this, several things happened that would change the group forever. One was that Betty decided to leave the group to get married. She had never been as committed to the group as the other three, and she was quickly replaced with a new singer, Barbara Martin.\n\nThe other, far more devastating, thing was that Florence Ballard was raped by an acquaintance. This traumatised Ballard deeply, and from this point on she became unable to trust anyone, even her friends. She would suffer for the rest of her life from what would now be diagnosed as post-traumatic stress disorder, and while it's likely that the later problems between her and Ross would have occurred in some form, the way they occurred was undoubtedly affected by the fact of Ballard's untreated mental illness as a result of this trauma.\n\nAfter refusing to speak to anyone at all for a couple of weeks, Ballard managed to get herself well enough to start singing again, and then only a few days later Richard Morris was arrested for a parole violation and found himself in prison.\n\nWith all these devastating changes, many groups would have given up. But &nbsp;the Primettes were ambitious, and they decided that they were going to force their way into Motown, whether Berry Gordy wanted them or not. They took to hanging around Hitsville, acting like they belonged there, and they soon found themselves doing minor bits of work on sessions -- handclaps and backing vocals and so on, as almost everyone who hung around the studio long enough would.\n\nEventually they got lucky. Freddie Gorman, who was the girls' postman in his day job and had not yet written \"Please Mr. Postman\", had been working on a song with Brian Holland, and the girls happened to be around. &nbsp;Gorman suggested they try the song out, to see what it sounded like with harmonies, and the result was good enough that Holland and Gorman called in Gordy, who tinkered with the song to get his name on the credits, and then helped produce the session:\n\n[Excerpt: The Supremes, \"I Want a Guy\"]\n\nThat came out under the name The Supremes, with a Berry Gordy song on the B-side, a knock-off of \"Maybe\" by the Chantels called \"Never Again\".\n\nHow the group got their new name has also been a subject of some dispute, in part because of legal issues later on, as Florence Ballard tried to claim some intellectual property rights in the group name as the one who had chosen it. Everyone involved has a different story about how the name was chosen, but it seems to be the consensus that Ballard did pick the name from a shortlist, with the dispute being over whether that shortlist was of names that the group members had come up with between them, or whether it was created by Janie Bradford, and whether Ballard made a conscious choice of the name or just picked it out of a hat. Whatever the case, the Primettes had now become the Supremes.\n\nThe problem was that Berry Gordy wasn't really interested in them as a group. Right from the start, he was only interested in Diana Ross as an individual, though at least at first all the members would get to take lead vocals on album tracks -- though the singles would be saved for Diana. With one exception -- after the group's first single flopped, they decided to go in a very different direction for the second single.\n\nFor that, Gordy wrote a knock-off of a knock-off. In 1959 the Olympics had had a very minor hit with \"Hully Gully\":\n\n[Excerpt: The Olympics, \"Hully Gully\"]\n\nWhich had been remade a few months later by the Marathons as \"Peanut Butter\":\n\n[Excerpt: The Marathons, \"Peanut Butter\"]\n\nGordy chose to rework this song as \"Buttered Popcorn\", a song that's just an excuse for extremely weak double entendres, and Florence got to sing lead:\n\n[Excerpt: The Supremes, \"Buttered Popcorn\"]\n\nThat was no more successful than \"I Want a Guy\", and that would be the last time Florence Ballard ever got to sing lead on a Supremes single.\n\nIt would also be the last single the Supremes released as a four-piece. While Barbara Martin had recorded some material with the group that would be released later, she became pregnant and decided to leave the group. Having decided that they clearly couldn't keep a fourth singer around, the other three decided to continue on as a trio.\n\nBy this time, Motown had signed the Marvelettes, and they'd leapfrogged over the Supremes to become major stars. The Supremes, meanwhile had had two flops in a row, and their third did little better, though \"Your Heart Belongs to Me\", &nbsp;written and produced for them by Smokey Robinson, did make number ninety-five in the charts.\n\nThat was followed by a string of flops that often did, just, make the Hot One Hundred but didn't qualify as hits by any measure -- and many of them were truly terrible. The group got the nickname \"the no-hit Supremes\" and tended to get the songs that wouldn't pass muster for other groups. Their nadir was probably the B-side \"The Man with the Rock & Roll Banjo Band\", a song that seems to have been based around Duane Eddy's \"Dance With the Guitar Man\":\n\n[Excerpt: Duane Eddy, \"Dance With the Guitar Man\"]\n\nBut instead of the electric guitar, the Supremes' song was about the banjo, an instrument which has many virtues, but which does not really fit into the Motown sound:\n\n[Excerpt: The Supremes, \"The Man with the Rock and Roll Banjo Band\"]\n\nThis sort of thing continued for two years, with the Supremes now being passed in chart success not only by the Marvelettes but also by the Vandellas, who also signed to Motown after them and had hits before. The \"no-hit Supremes\" at their best only just scraped the bottom of the Hot One Hundred, no matter who produced them -- Lamont Dozier and Brian Holland, Clarence Paul, Berry Gordy, and Smokey Robinson all had multiple attempts at recording with the group, because of Gordy's belief in Ross' star potential, but nothing happened until they were paired with Holland, Dozier, and Holland, fresh off their success with the Vandellas.\n\nThe musical side of the Holland/Dozier/Holland team had already worked with the group, but with little success. But once Holland/Dozier/Holland became a bona fide hit-making team, they started giving the Supremes additional backing vocal parts. They're in the vocal stack, for example, on Marvin Gaye's extraordinary \"Can I Get a Witness\":\n\n[Excerpt: Marvin Gaye, \"Can I Get a Witness\"]\n\nThe first song that Holland, Dozier, and Holland wrote as a team for the Supremes is very different from the heavy, soulful, records they'd specialised in up until that point. Lamont Dozier has said that when he came up with the idea for \"When the Lovelight Starts Shining in His Eyes\" he was thinking of Phil Spector and Brian Wilson, although it's unlikely he was actually thinking of Wilson, who at this point in 1963 was still making rather garagey surf-rock records rather than the symphonic pop he would start to specialise in the next year. Which is not to say that Holland, Dozier, and Holland weren't paying attention to Wilson -- after all, they wrote \"Surfer Boy\" for the Supremes in 1965 -- but Dozier is probably misremembering here. It's entirely plausible, though, that he was thinking of Spector, and the song definitely has a wall of sound feel, albeit filtered through Motown's distinctly funkier, non-Wrecking-Crew, sound, and with more than a little Bo Diddley influence:\n\n[Excerpt: The Supremes, \"When the Lovelight Starts Shining Through His Eyes\"]\n\nThat also featured additional backing vocals from the Four Tops, another group with whom Holland, Dozier, and Holland were working, and who we'll be hearing more of in future episodes.\n\n\"When the Lovelight Starts Shining Through His Eyes\" went to number twenty-three, the first bona fide hit the Supremes had ever had. So they were set. They even had a surefire smash follow-up. With Holland, Dozier, and Holland they'd recorded *another* Phil Spector knock-off, *before* \"Lovelight\", a record modelled on \"Da Doo Ron Ron\", titled \"Run Run Run\", but they'd held it back so they could release it next -- they decided to release a record that sounded like a medium-sized hit first, to get some momentum and name recognition, so they could then release the big smash hit.\n\nBut \"Run Run Run\" only went to number ninety-four.\n\nThe group were at a low point, and as far as they could tell they were only going to get lower. They'd had their hit and it looked like a fluke. The big one they'd had hopes for had gone nowhere.\n\nThe story of their next single has been told many ways by many different people. This is a version of the story as best I can put it together, but everything that follows might be false, because as with so much of Motown, everyone has their own agenda.\n\nAs best I can make out, Holland, Dozier, and Holland were working on tracks for a proposed Marvelettes album and came up with a simple, stomping, song based on a repetitive eight-bar verse, with no bridge, chorus, or middle eight.\n\nThe Holland brothers disagree about what happened next, and it sounds odd, but Lamont Dozier, Mary Wilson, and Katherine Anderson of the Marvelettes all say the same thing -- while normally Motown artists had no say in what songs they recorded, this time the Marvelettes were played a couple of backing tracks which had been proposed as their next recording, and they chose to dump the eight-bar one, and go instead with \"Too Many Fish in the Sea\":\n\n[Excerpt: The Marvelettes, \"Too Many Fish in the Sea\"]\n\nThe way Dozier tells the story, that presented Holland, Dozier, and Holland with a problem. They'd recorded the backing track, and one of the many ways that Motown caused problems for its creative workers was that they would be charged against royalties for studio time. If the track didn't get released, they'd lost all the money.\n\nSo they turned to the Supremes, and Dozier tried to persuade Mary Wilson that he'd written this great new song, just for them, they'd love it, but by this point they'd already talked to the Marvelettes and been told about this dreadful song they'd managed to get out of doing, and advised to avoid it if they could.\n\nBut while the Marvelettes were a big, successful group, the Supremes weren't yet, and didn't have any choice. They were going to record the song whether they liked it or not.\n\nThey didn't like it. Having already been poisoned against the song by the Marvelettes, there were further problems in the studio because one of the production team had originally told Mary Wilson she could sing lead on the song. Everyone seems agreed that Brian Holland insisted on Diana Ross singing it instead, but Eddie Holland remembers that he thought that Wilson should sing and it was Brian and Dozier who insisted on Ross, while Dozier remembers that *he* thought that Wilson should sing, and it was the Holland brothers who insisted on Ross.\n\nSomehow, if all these memories are to be believed, Brian Holland outvoted his partners one to two, possibly because Berry Gordy had declared that Ross should be the lead singer on all Supremes singles. Mary was devastated, while Ross was annoyed that she was having to sing what she thought was a terrible song, in a key that was much lower than she was used to. She got more annoyed when Eddie Holland kept coaching her on how he wanted the song sung -- she was playing with the phrasing and Holland insisted she sing it straight. Eventually she started threatening to get Gordy to come down, at which point Eddie told her that she could do that, but then Gordy could just produce the session and they needn't bother hoping for any more Holland/Dozier/Holland songs.\n\nShe sang through her lead putting as little emotion as she could into her voice, while glaring daggers at the producers, before storming off as soon as she'd completed the take they wanted, complaining about being given everyone else's leftovers:\n\n[Excerpt: The Supremes, “Where Did Our Love Go?”]\n\nHolland, Dozier, and Holland then got on with trying to get the other two Supremes to do the backing vocal parts. But the parts Lamont Dozier had come up with were difficult, nobody was in a good mood, and Mary Wilson was still upset that she wasn't going to be singing lead. They couldn't get the vocals down, and eventually, frustrated, Dozier told them to just sing \"baby baby\" when he pointed, and they went with that.\n\nTowards the end of the session, Ross came back in, with Berry Gordy, who she had clearly been complaining to about the song. He asked to hear it, and they played back this recording that nobody was happy with. Gordy, much to Ross' shock, was convinced it was a hit, and said to them \"Cheer up, everybody! From now on, you're the big-hit Supremes!\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nMotown was in a bit of a slump at that point -- several of the label's big stars had had disappointing follow-ups to their hits, and they'd just lost Mary Wells, one of their biggest stars, to another label. Gordy decided that they were going to give \"Where Did Our Love Go?\" a huge push, and persuaded Dick Clark to put the Supremes on his Caravan of Stars tour. When the record came out in June, they were at the bottom of the bill, opening the show on a bill with more than a dozen other acts, from the Zombies to the Shirelles to Freddie \"Boom Boom\" Cannon above them. By the end of the tour, their record was at number one in the charts and they had already recorded a follow-up. As \"Where Did Our Love Go?\" had included the word \"baby\" sixty-eight times, the production team had decided not to mess with a winning formula:\n\n[Excerpt: The Supremes, \"Baby Love\"]\n\nThat went to number one by the end of October 1964, making the Supremes the first Motown act to have two number ones. There would be a lot more where that came from.\n\nBut there was already trouble brewing in the group. Even on the Dick Clark tourbus, there were rumours that Diana Ross wanted a solo career, and there was talk of her forcing Florence Ballard out of the group. We'll look at that, and what happened with the Supremes in the latter part of the sixties in a few months' time.\n\nBut I can't end this time without acknowledging the sad death, a month ago today, of Mary Wilson, the only member of the Supremes who stayed with the group from the beginning right through to their split in 1977. For a member of a group who were second only to the Beatles for commercial success in the sixties, she was underrewarded in life, and her death went underreported. She'll be missed.",
  "enclosure": "",
  "itunes:summary": "Episode one hundred and sixteen of A History of Rock Music in Five Hundred Songs looks at \"Where Did Our Love Go?\" by the Supremes, and how the \"no-hit Supremes\" became the biggest girl group in history. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"She's Not There\" by the Zombies.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of the various companies that became Motown.\n\nTo Be Loved&nbsp;by Berry Gordy&nbsp;is Gordy's own, understandably one-sided, but relatively well-written, autobiography.\n\nWomen of Motown: An Oral History&nbsp;by Susan Whitall is a collection of interviews with women involved in Motown.\n\nI Hear a Symphony: Motown and Crossover R&B&nbsp;by J. Andrew Flory&nbsp;is an academic look at Motown.\n\nThe Motown Encyclopaedia&nbsp;by Graham Betts&nbsp;is an exhaustive look at the people and records involved in Motown's thirty-year history.\n\nHow Sweet It Is&nbsp;by Lamont Dozier and Scott B. Bomar&nbsp;is Dozier's autobiography, while&nbsp;Come and Get These Memories&nbsp;by Brian and Eddie Holland and Dave Thompson&nbsp;is the Holland brothers'.\n\nAnd&nbsp;Motown Junkies&nbsp;is an infrequently-updated blog looking at (so far) the first 694 tracks released on Motown singles.\n\nGirl Groups by John Clemente contains potted biographies of many groups of the era.\n\nThe Supremes biography I mention in the podcast is&nbsp;The Supremes by Mark Ribowsky, which seems factually accurate but questionable in its judgments of people.\n\nI also used this omnibus edition of Mary Wilson's two volumes of autobiography.\n\nThis box set contains everything you could want by the Supremes, but is extraordinarily expensive in physical form at the moment, though cheap as MP3s. This is a good budget substitute, though oddly doesn't contain \"Stop in the Name of Love\".\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nBefore I start, this episode contains a brief mention of rape, and the trauma of a victim, and a glancing mention of an eating disorder. The discussion is not particularly explicit, but if you think you might find it upsetting, you might be advised to check the transcript before listening, which as always can be found on the site website, or to skip this episode.\n\nToday, we're going to look at the first big hit from the group who would become the most successful female vocal group of the sixties, the group who would become the most important act to come out of Motown, and who would be more successful in chart terms than anyone in the sixties except the Beatles and Elvis. &nbsp;We're going to look at the record that made Holland, Dozier, and Holland the most important team in Motown, and that made a group that had been regarded as a joke into superstars. We're going to look at \"Where Did Our Love Go?\" by the group that up until this record was known in Motown as \"the no-hit Supremes\":\n\n[Excerpt: The Supremes, \"Where Did Our Love Go?\"]\n\nThe story of the Supremes starts, like almost every Motown act, in Detroit. Specifically, it starts with a group called the Primes, a trio who had grown up in Birmingham, Alabama, and then had moved to Cleveland, before moving in turn to Detroit. The Primes consisted of Eddie Kendricks, Paul Williams, and Kell Osborne, and were gaining popularity around the city.\n\nBut their act was",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode one hundred and sixteen of A History of Rock Music in Five Hundred Songs looks at \"Where Did Our Love Go?\" by the Supremes, and how the \"no-hit Supremes\" became the biggest girl group in history. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"She's Not There\" by the Zombies.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, I've created&nbsp;a Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nFor Motown-related information in this and other Motown episodes, I've used the following resources:\n\nWhere Did Our Love Go? The Rise and Fall of the Motown Sound&nbsp;by Nelson George&nbsp;is an excellent popular history of t",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}