{
  "id": "https://bibleinoneyear.org/en/youth/131",
  "title": "Day 131: Endless Energy, Boundless Strength",
  "description": "Psalm 59:16-17, Judges 13:2–3,5b,24–25, John 6:60–69.  That same strength now lives in *you* and ‘will give life to your mortal body through his Spirit, *who lives in you*’ (v 11b)",
  "pubDate": "Wed, 11 May 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/131/",
  "itunes:duration": "12:30",
  "guid": "enyouth11052022-131",
  "length": 750.26,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 131: Endless Energy, Boundless Strength",
  "itunes:subtitle": "Psalm 59:16-17, Judges 13:2–3,5b,24–25, John 6:60–69.  That same strength now lives in *you* and ‘will give life to your mortal body through his Spirit, *who lives in you*’ (v 11b)",
  "itunes:summary": "We often tell the story of when John Wimber first visited our church. We saw a remarkable outpouring of the Holy Spirit and several healings. One incident, which occurred on the second night, is indelibly printed in my memory. One of our closest friends was eight months pregnant at the time. The Holy Spirit came upon her with great power. She started to whirl around at high speed. As she did so, she exclaimed over and over again, ‘I feel so strong!’\nA few weeks later she gave birth to a son who, from his earliest days, showed not only spiritual and emotional strength but also extraordinary physical strength. He became an outstanding rugby player, a superb athlete and is now a successful model.\nTo some (like Samson, who we read about in today’s Old Testament passage), the Holy Spirit gives extraordinary physical strength. To all of us, the Holy Spirit gives spiritual strength.\nThe apostle Paul describes God’s ‘incomparably great power for us who believe. That power is like the working of his mighty strength, which he exerted in Christ when he raised him from the dead’ (Ephesians 1:19–20).\nIt was the Holy Spirit who raised Jesus from the dead (Romans 8:11a). The Holy Spirit is ‘his mighty strength’. That same strength now lives in you and ‘will give life to your mortal body through his Spirit, who lives in you’ (v.11b).\nI love Eugene Peterson’s translation (of the Ephesians passage) where he speaks of God giving ‘endless energy, boundless strength’!",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 496
}