{
  "title": "e000: Hello, world!",
  "link": "https://newrustacean.com/show_notes/e000/",
  "description": "<h1 id=\"hello-world\">Hello, World!</h1>\n<p>Subject: The host, the language, and the show!</p>\n<p>Today’s show is pretty meta. You can skip it if you just want to start with something more technical, but I thought listeners might want to know a little about the origins of the show and my own background, so that’s what you get today. Next time, we’ll be tackling the <code>rustdoc</code> command in some detail.</p>\n<hr />\n<p>This is an almost-empty module: we aren’t doing any fun code samples yet. I included the standard “Hello, world!” example, because how could I not? However, at some point in the future, there will be much more detailed code samples available:</p>\n<ul>\n<li>in the <a href=\"https://github.com/chriskrycho/newrustacean.com\">GitHub repository</a> for the show</li>\n<li>in the show notes attached to each episode</li>\n</ul>\n<p>Hopefully, the result will be a pretty helpful bunch of side content along with the audio of the podcast itself.</p>",
  "pubDate": "Thu, 24 Sep 2015 17:14:50 -0600",
  "enclosure": "",
  "guid": "CCE404BC-4B4A-4F28-A687-9BCC66C08CEF",
  "itunes:author": "Chris Krycho",
  "itunes:subtitle": "A little about the host, and a little about the format of the show!",
  "itunes:summary": "Hello, world! * Date: September 24, 2015 * Subject: The host, the language, and the show! * Audio: * M4A * MP3 Today’s show is pretty meta. You can skip it if you just want to start with something more technical, but I thought listeners might want to know a little about the origins of the show and my own background, so that’s what you get today. Next time, we’ll be tackling the rustic command in some detail. This is an almost-empty module: we aren’t doing any fun code samples yet. I included the standard “Hello, world!” example, because how could I not? However, at some point in the future, there will be much more detailed code samples available: * in the GitHub repository for the show * in the show notes attached to each episode Hopefully, the result will be a pretty helpful bunch of side content along with the audio of the podcast itself.",
  "itunes:duration": "17:11",
  "itunes:episodeType": "full"
}