{
  "title": "202: Malice At The Palace",
  "link": "https://audioboom.com/posts/7962842",
  "itunes:episode": 202,
  "itunes:title": "Malice At The Palace",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3407,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>YOU GUYS ARE NOT READY TO HEAR PATRICK AND GILLIAN TALK ABOUT THE SPORTS! At a 2004 Sportsgitball game between the Indiana Pacers and the Detroit Pacers (oh my god, listen to me knowing the NAMES!) all hell breaks loose when a fan (who we MEET and who Gillian has WORDS for) throws a beer at one of the players. Suddenly we're in the middle of the biggest brawl in sports history. It's 20,000 IDIOT fans throwing bottles, ripping chairs out of concrete, and TRYING TO FIGHT BASKETBALL players. Patrick and Gillian do not the vocabulary for this, but they try their theater-kid best AND IT IS HILARIOUS. (Also, this documentary is FANTASTIC).<br>\n<br>\nFAM! IF YOU'RE COMING TO SEE US ON BROADWAY ON APRIL 11, 2020 YOU MUST CONFIRM YOUR TICKETS BY OCTOBER 31  <a href=\"https://2st.formstack.com/forms/tcoexchange?promo&fbclid=IwAR2eunIi0uQwxh6-ecXOflE11pmu9fwRkqdYm5WZcwxeHk7AI-8pOowdmlc\">BY USING THIS LINK</a> (you can also use this link to cancel and get a refund). <strong>If you do not confirm your tickets by 10/31 you will be automatically refunded and your tickets will be resold!</strong> WE LOVE YOU AND WE CAN'T WAIT TO SEE YOU ON BROADWAY!<br>\n<br>\n<strong>LOOKING FOR MORE TCO?</strong> On our <a href=\"https://www.patreon.com/TrueCrimeObsessed\">Patreon feed</a>, you'll find over 200 FULL BONUS episodes to <strong>BINGE RIGHT NOW! </strong>Including our episode-by-episode coverage of <strong>\"John Wayne Gacy: Devil in Disguise\" </strong>\"<strong>Night Stalker</strong>\" <strong>\"The Jinx,\" \"Making A Murderer,\" \"The Staircase,\" </strong>\"<strong>I'll Be Gone in the Dark</strong>,\" \"<strong>A Wilderness of Error</strong>\" \"<strong>The Vow</strong>\"  \"<strong>Tiger King</strong>\" <strong>\"Don't F**K With Cats,\" \"The Menendez Murders,\" \"The Murder of Laci Peterson,\"</strong> <strong>\"Casey Anthony: American Murder Mystery,\"</strong> <strong>\"Serial,\" \"Lorena,\" \"The Disappearance of Madeleine McCann,\" \"OJ: Made in America\" </strong>and so many more! <a href=\"https://www.patreon.com/TrueCrimeObsessed\">JOIN HERE!</a> </div>\n",
  "pubDate": "Tue, 19 Oct 2021 10:00:00 +0000",
  "guid": "tag:audioboom.com,2021-10-19:/posts/7962842",
  "itunes:author": "Obsessed Network",
  "dc:creator": "Obsessed Network",
  "media:rights": ""
}