{
  "title": "EPISODE 8 Crazy Horse (Part 2)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Mon, 23 May 2016 15:59:27 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2016/5/18/episode-8-crazy-horse-part-2",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:573c74d301dbae9b52ceb53d",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1464015440005-5IZ5MJZTVH9FXYOLYETG/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"57431a4e4d088e58bcd7a3e9\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1464015440005-5IZ5MJZTVH9FXYOLYETG/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n\n\n\n<p class=\"\"><em>“There were many bullets, but there were more arrows—so many that it was like a cloud of grasshoppers all above and around the soldiers”</em><br>— Fire Thunder</p><p class=\"\">In Episode 8, we pause the blow by blow narration of Crazy Horse’s life to focus on the larger context: the war between Lakota & Cheyenne and the United States in the mid-1860s. In this episode: things heat up with battles at Platte River Station and Red Buttes, “the yellow metal that makes the wasichus crazy”, just for fun Crazy Horse lets soldiers shoot at him, the 1866 State of the Union address misses the target by a mile, painting the Bozeman Trail red with blood, the head of a photographer rolling in a wagon, Captain Brown’s obsession with scalps, the winkte prophet, spirits could use math tutoring, making arrowheads from a frying pan, Lakota warriors honoring a soldier they killed, and after the battle… a dreadful silence, Hieronymus Bosch, and coyotes & crows. Also, General Sherman’s diplomatic reaction (“We must act with vindictive earnestness against the Sioux even to their extermination—men, women and children”), the 1868 Fort Laramie Treaty, and setting fire to the forts.&nbsp;</p><p class=\"\"><br>This Crazy Horse series is dedicated to James R. Weddell (“Ista To’paicagopi”), a great friend and the subject of <a href=\"http://www.amazon.com/Dakota-Warrior-Story-James-R-Weddell/dp/1495963853/ref=as_li_ss_tl?ie=UTF8&linkCode=ll1&tag=wwwdanieleb0f-20&linkId=48e988bd198c846904f47b396e2e0c12\" target=\"_blank\">Dakota Warrior: The Story of James R. Weddell</a></p><p class=\"\">This episodes is sponsored by <a href=\"http://www.geeknationtours.com\">http://www.geeknationtours.com</a> &nbsp;In addition to offering tours to many locations that would be of interest to fans of history, next summer they will lead a tour to the Little Bighorn Battlefield in Montana, site of the 1876 epic clash between the 7th Cavalry and the Lakota and Cheyenne forces.&nbsp;<br>Also, please show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\" target=\"_blank\">http://www.onnit.com/history</a> and receive a 10% discount. And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\" target=\"_blank\">http://www.dsgear.com</a> and use the code “daniele” at checkout for a discount.&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy:</p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "1:40:36",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 8,
  "itunes:title": "EPISODE 8 Crazy Horse (Part 2)",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 8 Crazy Horse (Part 2)"
  }
}