{
  "id": "tag:blogger.com,1999:blog-5547907074344788039.post-7687531104976794102",
  "published": "2013-05-02T19:20:00.001-07:00",
  "updated": "2013-05-02T19:20:42.420-07:00",
  "category": "",
  "title": "Leading Indicators: a response",
  "content": "<br /><div class=\"p1\">In an interesting <a href=\"http://radar.oreilly.com/2013/04/leading-indicators.html\">thought experiment</a>, Mike Loukides and Q Ethan McCallum asked the question&nbsp;</div><blockquote class=\"tr_bq\"><span class=\"s2\">\"</span>If you’re looking at an organization’s data science group from the outside, possibly as a potential employee, what can you use to evaluate it?\"</blockquote><div class=\"p6\">I certainly have my list of what I think are great companies and organizations for data science. Quora users have <a href=\"http://www.quora.com/Which-companies-have-the-best-data-science-teams\">their list</a>&nbsp;too but how do we know if we have don't first hand knowledge of working at all these places?</div><div class=\"p5\"><br /></div><div class=\"p6\">The&nbsp;authors provide two&nbsp;examples to motivate the discussion. The first I consider a kind of negative evidence: in a hotel, if they can't get a club sandwich right (the basics) they are certainly not going to get the details (such as great concierge service) right. That is,&nbsp;a club sandwich is a good indictor or proxy of&nbsp;the&nbsp;hotel's overall quality and level of service. The second&nbsp;example,&nbsp;I consider more as&nbsp;positive&nbsp;evidence. If a&nbsp;school has a&nbsp;great music program then it almost certainly excels in other areas too. Again, the music program is a good proxy for the school's overall program.&nbsp;</div><div class=\"p5\"><br /></div><div class=\"p6\">With this framework, they reframe the overall question:</div><blockquote class=\"tr_bq\">\"What are the proxies that allow you to evaluate a data science program from the “outside,” on the information that you might be able to cull from company blogs, a job interview, or even a job posting?\"</blockquote><div class=\"p5\">They then list out 7 ideas. However, I am&nbsp;not convinced&nbsp;that many of them are evaluable as an outsider---excepting asking the questions explicitly during a job interview. Let's review them one by one.</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #1</span>:&nbsp;</i></span><i>Are the data scientists simply human search engines, or do they have real projects that allow them to explore and be curious? If they have management support for learning what can be learned from the organization’s data, and if management listens to what they discover, they’re accomplishing something significant. If they’re just playing Q&amp;A with the company data, finding answers to specific questions without providing any insight, they’re not really a data science group.</i></blockquote><div class=\"p5\">How would I determine that as an outsider? Those projects would have to be externally visible, on a website, on a blog or published. Or, if the project refers solely to code, it&nbsp;would have&nbsp;to be open source. However, any write up is unlikely to contain information about the managerial component.</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #2</span>:&nbsp;</i></span><i>Do the data scientists live in a silo, or are they connected with the rest of the company? In&nbsp;</i><a href=\"http://radar.oreilly.com/2011/09/building-data-science-teams.html\"><span class=\"s3\"><i>Building Data Science Teams</i></span></a><i>, DJ Patil wrote about the value of seating data scientists with designers, marketers, with the entire product group so that they don’t do their work in isolation, and can bring their insights to bear on all aspects of the company.</i></blockquote><div class=\"p5\">This is how data scientists should be incorporated into a organization but unless a job&nbsp;description&nbsp;explicitly says \"you will be reporting to the head of {marketing,operations,customer insight,...}\", you will be hard-pressed to know as an outsider.</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #3</span>:&nbsp;</i></span><i>When the data scientists do a study, is the outcome predetermined by management? Is it OK to say “we don’t have an answer” or to come up with a solution that management doesn’t like? Granted, you aren’t likely to be able to answer this question without insider information.</i></blockquote><div class=\"p5\">Self-explanatory</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #4</span>:&nbsp;</i></span><i>What do job postings look like? Does the company have a mission and know what it’s looking for, or are they asking for someone with a huge collection of skills, hoping that they will come in useful? That’s a sign of data science cargo culting.</i></blockquote><div class=\"p5\">This is certainly a valid point and a primary indicator. A buzz-word filled job ad with little focus may well indicate a company jumping on the bandwagon.&nbsp;Conversely, a larger company with a larger, more well-established team are more&nbsp;likely to have more specialized job descriptions. [examples]</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #5</span>:&nbsp;</i></span><i>Does management know what their tools are for, or have they just installed Hadoop because it’s what the management magazines tell them to do? Can managers talk intelligently to data scientists?</i></blockquote><div class=\"p5\">How would I determine that as an outsider?&nbsp;You might be able to question that during a job&nbsp;interview though.</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #6</span>:&nbsp;</i></span><i>What sort of documentation does the group produce for its projects? Like a club sandwich, it’s easy to shortchange documentation.</i></blockquote><div class=\"p6\">If the project is open source, then yes, good documentation is a great indicator.</div><blockquote class=\"tr_bq\"><span class=\"s2\"><i><span style=\"color: #6fa8dc;\">Loukides &amp; McCallum #7</span>:&nbsp;</i></span><i>Is the business built around the data? Or is the data science team an add-on to an existing company? A data science group can be integrated into an older company, but you have to ask a lot more questions; you have to worry a lot more about silos and management relations than you do in a company that is built around data from the start.</i></blockquote><div class=\"p6\">This is the sort of information that you may be able to glean as an interviewee.</div><div class=\"p5\"><br /></div><div class=\"p6\">I had a few other ideas:</div><ul class=\"ul1\"><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Tech talks</span></b>: if&nbsp;the&nbsp;company is hosting tech talks and attracting well-known and&nbsp;respected&nbsp;speakers from other high&nbsp;quality&nbsp;organizations, this is good positive evidence.</li><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Team size</span></b>: how many other data scientists work there? You can likely find this out from a LinkedIn search. If you are young, starting out, you might prefer a larger team with more potential mentors, better tools and&nbsp;so on. Those with&nbsp;more&nbsp;experience&nbsp;might&nbsp;prefer&nbsp;to blaze a trail.</li><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Existing team members</span></b>: who are they and what is their pedigree? You can check their LinkedIn profiles or personal websites but there are other ways. For instance, LinkedIn has some great data scientists. How do I know they are good? They tweet relevant information, they post thoughtful posts. The speak at conferences. Their team is highly active in the general data science scene. All this visibility---provided the content is meaningful---is all good evidence.</li><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Publications</span></b>: academic journal publications may or may not be a good indicator. There is typically a big gulf between academic systems and toy problems and the mess and noise of real world systems and data. An algorithm may work great on the static data set that the grad student has worked with for 3 years but it might not scale, might require far too much parameter tuning in the real world.&nbsp;There are many exceptions of course. It really depends on the system.&nbsp;</li><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Patents</span></b>: patents coming out of an organization may or may not be a good indicator. It is essentially stales data as patents reveal the degree of innovation at the company <i>two or more years ago</i> (given the time it takes to process and award). A strong patent culture might mean that the IP is locked down so that you may not be able to discuss systems in development at conferences,&nbsp;publish&nbsp;work, open source the code etc.</li><li class=\"li6\"><b><span style=\"color: #6fa8dc;\">Internship program</span></b>: if the company has a strong internship program, attracting top young talent from top schools, and those interns go on to do good things as data scientists, this is very good evidence.</li></ul>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Carl Anderson",
    "uri": "http://www.blogger.com/profile/11930448254473684406",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 2
}