{
  "id": "yt:video:ZeXN7PchnkQ",
  "yt:videoId": "ZeXN7PchnkQ",
  "yt:channelId": "UCPD_bxCRGpmmeQcbe2kpPaA",
  "title": "Emma Chamberlain Has a Spiritual Awakening While Eating Spicy Wings | Hot Ones",
  "link": "",
  "author": {
    "name": "First We Feast",
    "uri": "https://www.youtube.com/channel/UCPD_bxCRGpmmeQcbe2kpPaA"
  },
  "published": "2022-11-03T15:00:31+00:00",
  "updated": "2022-11-04T08:45:30+00:00",
  "media:group": {
    "media:title": "Emma Chamberlain Has a Spiritual Awakening While Eating Spicy Wings | Hot Ones",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Emma Chamberlain is an internet juggernaut-turned-coffee and fashion mogul. Check out her YouTube page for everything from European travel vlogs, to swap-meet shopping hauls, and listen to Anything Goes with Emma Chamberlain wherever you get your podcasts. But how is she with spicy food? Find out as Emma takes on the wings of death and discusses becoming a meme with Jack Harlow at the Met Gala, Architectural Digest house tours, and how she became a Vogue muse.\n\nWATCH MORE Emma Chamberlain: https://www.youtube.com/c/emmachamberlain\n\nBUY HOT ONES BONELESS CHICKEN BITES NOW: https://hotoneschallenge.com/\n\nMAKE A DIFFERENCE BY DONATING TO COMMON THREADS, THE BRAND-NEW CHARITY PARTNER OF HOT ONES: https://www.commonthreads.org/firstwefeast/\n\nBUY HOT ONES TRUTH OR DAB THE GAME NOW: http://truthordabgame.com\n\nBUY HOT ONES HOT SAUCE NOW: https://fwfea.st/hotsauces\n\nHOT ONES MERCH AVAILABLE NOW: https://bit.ly/2AIS271\n\nSIGN UP FOR THE HOT ONES MONTHLY HOT SAUCE SUB BOX: https://bit.ly/2veY50P\n\nSIGN UP FOR THE FIRST WE FEAST NEWSLETTER: http://firstwefeast.com/signup\n\nSubscribe to First We Feast on YouTube: http://goo.gl/UxFzhK\n\nCheck out more of First We Feast here:\n\nhttp://firstwefeast.com/\n\nhttps://twitter.com/firstwefeast\n\nhttps://www.facebook.com/FirstWeFeast\n\nhttp://instagram.com/firstwefeast\n\nFirst We Feast videos offer an iconoclastic view into the culinary world, taking you behind-the-scenes with some of the country’s best chefs and finding the unexpected places where food and pop culture intersect. #hotones #emmachamberlain #seanevans",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}