{
  "title": "Researchers Tap Infrared Light to Produce Hydrogen",
  "link": "https://spectrum.ieee.org/infrared-solar-panels",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/sun-rays-coming-up-over-the-earth-s-horizon.jpg?id=32022079&width=1245&height=700&coordinates=0%2C297%2C0%2C297\"/><br/><br/><p>A little more than half of the sun’s energy that reaches Earth does so as infrared rays. The longer wavelength of infrared light makes it less energetic, which makes it hard to capture with existing solar cells.</p><p>Researchers have made semiconductor nanocrystals that can convert infrared light to higher-energy visible light with an efficiency of over 5 percent, much higher than methods reported so far. The team could use the converted light to drive a chemical reaction that produces hydrogen fuel from methanol.</p><p>“Solar light in the infrared region has been a vast source of untapped energy,” says <a href=\"http://www.kuchem.kyoto-u.ac.jp/organization/member/bk_200710/sakamoto_e_preview.html\" rel=\"noopener noreferrer\" target=\"_blank\">Masanori Sakamoto</a>, a professor of chemistry at <a href=\"https://www.kyoto-u.ac.jp/en\" target=\"_blank\">Kyoto University</a>. Developing an artificial infrared light-to-fuel conversion system is key for the complete utilization of sustainable solar energy, he says.</p><hr/><p>Generating high-energy light from multiple low-energy photons, a process called infrared upconversion, has caught researchers’ attention recently as a way to utilize the full solar-energy spectrum. There are two prominent ways researchers are exploring upconversion, explains <a href=\"http://naik.rice.edu/gururaj-naik/\" rel=\"noopener noreferrer\" target=\"_blank\">Gururaj Naik</a>, an electrical and computer engineering professor at <a href=\"https://www.rice.edu/\" target=\"_blank\">Rice University</a>, who was not involved in the research. One is to use organic molecules in which infrared light creates unpaired electrons; those electrons can then come together to emit higher-energy photons with about 5 percent efficiency. </p><p>The practical choice of materials for solar cells are lanthanides like ytterbium or erbium, which have multiple energy levels for electrons to occupy. When the material absorbs low-energy infrared photons, excited electrons jump up and around multiple times to reach higher energy levels before falling and emitting high-energy photons. Lanthanides have an upconversion efficiency of 0.5 to 2 percent.</p><p>In 2015, Naik and <a href=\"http://dionne.stanford.edu/\" target=\"_blank\">Jennifer Dionne</a> of Stanford University proposed a <a href=\"https://arxiv.org/pdf/1501.04159.pdf\" rel=\"noopener noreferrer\" target=\"_blank\">new route</a> to infrared upconversion that relied on plasmon resonance, one that could in theory give an efficiency of 25 percent. <a href=\"https://spectrum.ieee.org/plasmonics-takes-a-step-closer-to-realworld-applications\" target=\"_self\">Surface plasmons</a> are waves of electrons formed when light hits a metal surface. The excitation of plasmonic materials also creates high-energy “hot electrons” and “hot holes.”</p><p>Naik found a way to channel those hot electrons and holes into structures made of thin alternating layers of indium gallium nitride and gallium nitride. These structures act as quantum wells and trap the hot carriers, where they can recombine and release a high-energy photon. The efficiency was only 0.1 percent, far from the theoretical maximum.</p><p>This is where the Japanese researchers’ work comes in. By cleverly designing nanocrystals of cadmium sulfide and copper sulfide, they have made quantum wells into which the hot carriers flow more easily and get trapped better. The result is an infrared-to-visible upconversion efficiency of over 5 percent.</p><p>Their nanocrystals are hexagonal, platelike crystals of copper sulfide, with a border of cadmium sulfide. Infrared excitation in the copper sulfide creates hot electrons and holes, which are injected into the cadmium sulfide and recombine to emit high-energy light in the visible region.</p><p>Naik says the Japanese team chose the right material and nanoparticle size to achieve this feat. “As you shrink the particles, hot-carrier injection gets very efficient,” Naik says. “The metal-semiconductor interface also makes a very big difference. These researchers did both—created a better interface and smaller size.”</p><p>As a demonstration, the researchers placed the nanoparticles in a methanol-water solution and shone infrared light on it. Without the nanoparticles, the low-energy light would do nothing. But the nanoparticles soaked up the infrared light and produced higher-energy light, which was absorbed by platinum catalysts to trigger a chemical reaction that produces hydrogen.</p><p>Applying this system in solar cells to produce electricity from infrared light could be tricky, Sakamoto admits. So for now, the team is planning to pursue infrared-driven solar fuels. “We are planning to apply the current system to other IR-driven photocatalytic reactions,” he says.</p>",
  "pubDate": "Mon, 31 Oct 2022 14:19:14 +0000",
  "guid": "https://spectrum.ieee.org/infrared-solar-panels",
  "category": [
    "Hydrogen",
    "Upconversion nanoparticles",
    "Quantum well",
    "Infrared light",
    "Solar power"
  ],
  "dc:creator": "Prachi Patel",
  "media:content": ""
}