{
  "id": "https://bibleinoneyear.org/en/youth/199",
  "title": "Day 199: How to Feel God’s Love for You",
  "description": "Psalm 86:11b–13,15, Amos 6:1a, 7:1–6, 14-15, Romans 4:18–25, 5:1–5.  If the written word of the Bible could be changed into a spoken word and become one single voice, this voice, more powerful than the roaring of the sea would cry out: “the Father loves you!” (John 16:27)  Everything that God does and says in the Bible is love, even God’s anger is nothing but love",
  "pubDate": "Mon, 18 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/199/",
  "itunes:duration": "14:39",
  "guid": "enyouth18072022-199",
  "length": 879.46,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 199: How to Feel God’s Love for You",
  "itunes:subtitle": "Psalm 86:11b–13,15, Amos 6:1a, 7:1–6, 14-15, Romans 4:18–25, 5:1–5.  If the written word of the Bible could be changed into a spoken word and become one single voice, this voice, more powerful than the roaring of the sea would cry out: “the Father loves you!” (John 16:27)  Everything that God does and says in the Bible is love, even God’s anger is nothing but love",
  "itunes:summary": "Robbie Williams’ evocative lyric in the song ‘Feel’ echoes the deep longing of the human heart: ‘I just wanna feel real love’. God wants you to feel his love for you. He wants you to accept his love in your heart. You can receive his love in a new way today.\nI remember an occasion when our grandson, aged two, wanted to feel his father’s love. He raised both hands in the air and said, ‘Hugga Dadda’. My son picked up his son, lifted him into his arms, embraced him, kissed him and hugged him. It is a wonderful thing to hold a parent’s hand but an incomparably greater thing to have their arms wrapped around you. This is an illustration of the experience of God’s love.\nYou know that God loves you through the cross: ‘God demonstrated his own love for us in this: While we were still sinners, Christ died for us’ (Romans 5:8). You experience God’s love through the Holy Spirit: ‘God has poured out his love into our hearts by the Holy Spirit, whom he has given us’ (5:5).\n‘The whole Bible,’ St Augustine observes, ‘does nothing but tell of God’s love.’ Father Raniero Cantalamessa writes: ‘This is the message that supports and explains all the other messages. The love of God is the answer to all the “whys” in the Bible: the why of creation, the why of the incarnation, the why of redemption. If the written word of the Bible could be changed into a spoken word and become one single voice, this voice, more powerful than the roaring of the sea would cry out: “the Father loves you!” (John 16:27). Everything that God does and says in the Bible is love, even God’s anger is nothing but love. God “is” love!’",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 564
}