{
  "title": "Episode 101: &#8220;Telstar&#8221; by the Tornados",
  "link": "https://500songs.com/podcast/episode-101-telstar-by-the-tornadoes/",
  "pubDate": "Sat, 17 Oct 2020 20:34:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=356",
  "description": "<p>Episode 101 of <em>A History of Rock Music in Five Hundred Songs</em> is the first one of the podcast's third year. This one looks at \"Telstar\" by the Tornados, and the tragic life of Joe Meek, Britain's first great pop auteur. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n<p>Apologies for the lateness of this one -- my two-week break got extended when my computer broke down.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42833409\"> on \"Wipe Out\" by the Surfaris</a>.</p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-101-telstar/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.&nbsp;</p>\n\n\n\n<p>Most of the information here comes from&nbsp;<a href=\"https://amzn.to/3lU2ZIB\"><em>The Legendary Joe Meek: The Telstar Man</em> by John Repsch</a>. Some bits come from&nbsp;<em><a href=\"https://amzn.to/2T42yzb\">Clem Cattini: My Life Through the Eye of a Tornado</a>.</em></p>\n\n\n\n<p><a href=\"https://amzn.to/3dFDLuH\">This compilation</a> contains most of the important singles Meek produced, with the notable exceptions of the Tornados' singles. <a href=\"https://amzn.to/3j6O9fW\">This, </a>meanwhile, contains the early records he engineered before going into production. <a href=\"https://amzn.to/37efkDy\">This</a> is probably the best compilation of the Tornados' music available.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Welcome to the third year of A History of Rock Music in 500 Songs, and welcome to the future! Although for this particular future we're actually going backwards a couple of months. This episode and the next one are both about records that were released a little before \"Love Me Do\", which the most recent episode covered, and that's something I should point out -- the podcast is never going to be absolutely chronological, and in this case it made sense to tell that story before these ones.</p>\n\n\n\n<p>Before we start this episode, I need to give warnings for a whole lot of different things, because we're looking at one of the most tragic stories we'll see during the course of this podcast. This story contains discussion of occultism, severe mental illness, legalised homophobia, &nbsp;an unsolved probably homophobic murder, and a murder-suicide. I am going to try to deal with all those subjects as sensitively as possible, but if you might become distressed by hearing about those things, you might want to skip this episode, or at least read the transcript before listening.</p>\n\n\n\n<p>I also want to make something very clear right now -- this episode deals with a mentally ill man who commits a murder. He did not commit that murder *because* he was mentally ill. Mental illness is far more likely to make someone the victim of a crime than the perpetrator, and I have known many, many people who have had the same symptoms but who have not committed such awful acts. It is impossible to talk about the events in this episode without the risk of increasing stigma for mentally ill people, but I hope by saying this I can reduce that risk at least somewhat.</p>\n\n\n\n<p>Today we're going to look at the first British rock and roll record to make number one in the USA, and at the career of the first independent record producer and engineer in Britain. We're going to look at the sad life and tragic end of Joe Meek, and at \"Telstar\" by the Tornados:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Telstar\"]</p>\n\n\n\n<p>Joe Meek is someone who has become something of a legend among music lovers, and he's someone whose music is more talked about than listened to. People talk about him as a genius, but rather fewer of them explain what it was that he did that was so impressive. This is partly because, more than much of the music of the era, it requires context to appreciate. Meek was a producer above all else -- he had no real knowledge of music, and had no ear for singers. What Meek did know was sounds, and how to achieve sounds in the recording studio that could not be achieved anywhere else.</p>\n\n\n\n<p>Meek had, from a very young age, been fascinated by the possibilities of both sound and electronics. He had experimented with both as a child, and when he'd moved to London he'd quickly found himself jobs where he could make use of that -- he'd started out as a TV repairman, but quickly moved on to working at IBC, one of the few independent studios in existence. There he was given the job of assistant engineer on a Radio Luxembourg show that was recorded live in theatres up and down the country -- he had to plug in all the mics and so on. He soon moved on to editing the tape recordings, and then to working the controls himself.</p>\n\n\n\n<p>As well as being main engineer on the radio show, though, he was also still an assistant engineer in the studio for music sessions, and for a long time that was all he was doing. However, he kept trying to get more involved in recording the music, and eventually to shut him up the studio boss gave him the chance to be the main engineer at a session -- for a twenty-piece string section. The boss assumed that Meek wouldn't be able to handle such a complicated assignment as his first engineering job, and that he'd be kept quiet if he knew how hard the job was. Instead, he did such a good job balancing the sound that the musicians in the studio applauded the playback, and he was quickly promoted to senior balance engineer.</p>\n\n\n\n<p>The world got its first small inkling of what Meek could do in 1956, when he created the unique sound of \"Bad Penny Blues\", a record by the trad jazz trumpet player Humphrey Lyttleton.</p>\n\n\n\n<p>\"Bad Penny Blues\" actually happened more or less by accident, at least as far as the musicians were concerned. There was a five-piece band in the studio, but the saxophone player had to leave early, and so they were stuck for what to record once he was gone. Denis Preston, the producer in charge of the session, suggested that they just play a blues, and so they improvised a boogie woogie piece, based around something they played in the clubs -- Johnny Parker, the piano player, played somewhat in the style of Dan Burley, the man who had coined the term \"skiffle\". But what made the track wasn't the group or the producer, but the engineering:</p>\n\n\n\n<p>[Excerpt: Humphrey Lyttleton, \"Bad Penny Blues\"]</p>\n\n\n\n<p>These days, that doesn't sound all that revolutionary, but when they heard it back the group were furious at what Meek had done to the sound, because it just didn't sound like what they were used to.</p>\n\n\n\n<p>&nbsp;There were several innovative things about it, at least for a British record, but one of the most important was that Meek had actually bothered to mic the drum kit separately -- at this point in British studios, which were several years behind American ones, it was considered unnecessary to mic the drums properly, as their sound would get into the other microphones anyway, because the musicians were all playing together in the same room. If you really wanted a good drum sound, you'd hang a single mic over the drummer's head. Meek was using separate mics for each drum on the kit.</p>\n\n\n\n<p>Because of this, Meek had managed to get a drum sound which was unlike anything that had been heard in a British record before. You can actually *hear* the kick drum. It sounds normal now, but that's because everyone who followed Meek realised that actually bothering to record the drums was something worth doing.&nbsp;</p>\n\n\n\n<p>There was another thing Meek did, which again you will almost certainly not have noticed when listening to that recording -- he had added a lot of compression.</p>\n\n\n\n<p>Compression is a standard part of the sound engineer's toolkit, and a simple one to understand. All it does is make quiet sounds louder and loud sounds quieter. Used sparingly, it gives a recording a little more punch, and also evens out the sound a bit. So for example, when you're listening to a playlist on Spotify, that playlist applies a little compression to everything, so when you go from a Bach piece for solo piano to a Slayer track, you can hear the Bach piece but your earbuds don't make your eardrums bleed when the Slayer record comes on.</p>\n\n\n\n<p>By the way, this is one of those words that gets used confusingly, because the word \"compression\", when referring to Internet sound files such as MP3s, has a totally different meaning, so you might well see someone talking about compression of a recording in ways that seem to contradict this. But when I refer to compression in this episode, and in any of the episodes in the foreseeable future, I mean what I've talked about here.</p>\n\n\n\n<p>Generally speaking, recordings have had steadily more compression applied to them over the decades, and so the moderate use of compression on \"Bad Penny Blues\" might not sound like much to modern ears -- especially since when older recordings have been reissued, they almost always have additional compression on them, so even when I've excerpted things in these episodes, they've sounded more compressed than the original recordings did. But Meek would soon start using a *lot* more compression, even than is used these days, and that drastically changed the character of the sound.</p>\n\n\n\n<p>To show what I mean, here's me playing a few bars on the guitar, recorded with no compression whatsoever:</p>\n\n\n\n\n\n<p>Here's the same recording with a touch of compression:</p>\n\n\n\n\n\n<p>And the same recording with a *lot* of compression:</p>\n\n\n\n\n\n<p>This was one of the things that Meek would do over the course of his career, and which very few other people were doing at the time in the UK.&nbsp;</p>\n\n\n\n<p>\"Bad Penny Blues\" became one of the most important British jazz records ever -- probably *the* most important British jazz record ever -- and it made the top twenty, which never happened with jazz records at the time. Meek's reputation as an innovative engineer was set.</p>\n\n\n\n<p>Shortly after \"Bad Penny Blues\", Meek was given his first opportunity to indulge his love of sound effects, on what became one of the biggest-selling British records of the year. Anne Shelton was recording a military-themed song, and the producer suggested that they needed the sound of marching feet. Rather than play in something from a sound-effects album, which was what the producer expected but which wouldn't have been in time with the music, Meek got a box of gravel and had someone shake it in time with the music. The result did sound exactly like marching feet, though the dust from the gravel apparently made Shelton's new suit into a mess, and the record went to number one for a month:</p>\n\n\n\n<p>[Excerpt: Anne Shelton, \"Lay Down Your Arms\"]</p>\n\n\n\n<p>Another hit Meek engineered in the mid-fifties has led to an urban myth that's been repeated unquestioningly even in the Guardian, even though a second's thought proves that it's nonsense. Frankie Vaughan's \"Green Door\" went to number two in 1957:</p>\n\n\n\n<p>[Excerpt: Frankie Vaughan, \"Green Door\"]</p>\n\n\n\n<p>That line, \"When I said 'Joe sent me' someone laughed out loud\" has been taken to be referring to Meek himself, and a whole elaborate mythology has been spun around this. As Meek was gay, and as there was a lesbian club called The Gateways in London which happened to have a green door, people have stated as fact that the song is about that club, and that the people in there were laughing because a man was trying to get into a lesbian club.</p>\n\n\n\n<p>There's only one slight problem with this, which is that it's complete nonsense. For a start, while Meek was gay, he saw being gay as an affliction, something to be ashamed of, and was hardly likely to make a whole jokey record about that — at least at this time. He did some things later on.</p>\n\n\n\n<p>Then there's the fact that Meek was at the time only a moderately-known engineer, not the famous producer and songwriter he became later.</p>\n\n\n\n<p>But more important than either of those things -- the song was a cover of an American hit record by Jim Lowe, written by songwriters who had almost certainly never even been to Britain. And the line about \"Joe\"? That was in the original, and was a reference to a 1954 hit on the same lines, \"Hernando's Hideaway\":</p>\n\n\n\n<p>[Excerpt: Ella Fitzgerald, \"Hernando's Hideaway\"]</p>\n\n\n\n<p>During this early period of his career, Meek was recording all sorts of music. While the bread-and-butter work of a recording engineer at the time was orchestral pop covers of American records, he also engineered skiffle records by Lonnie Donegan, with a stinging guitar sound he would later use on many other records:</p>\n\n\n\n<p>[Excerpt: Lonnie Donegan, \"Cumberland Gap\"]</p>\n\n\n\n<p>Calypso records by people like Lord Invader or the Mighty Terror:</p>\n\n\n\n<p>[Excerpt: Mighty Terror, \"T.V. Calypso\"]</p>\n\n\n\n<p>And jazz records by Chris Barber, Acker Bilk, and Humphrey Lyttleton, usually produced by Denis Preston, who after \"Bad Penny Blues\" insisted on using Meek for all of his sessions. Because of this connection, Meek also got to engineer some of the very first blues records cut in Britain. Barber would bring over American folk-blues artists to tour with him -- and we'll be looking at the consequences of that for much of the next three years -- and Preston arranged sessions, engineered by Meek, for Big Bill Broonzy:</p>\n\n\n\n<p>[Excerpt: Big Bill Broonzy, \"When Do I Get To Be Called A Man?\"]</p>\n\n\n\n<p>And Sonny Terry and Brownie McGhee -- who wouldn't seem a natural fit with Meek's very artificial style, but the echo he applies to Terry's harmonica, in particular, gives it a haunting feel that really works, to my ears at least:</p>\n\n\n\n<p>[Excerpt: Sonny Terry and Brownie McGhee, \"Key to the Highway\"]</p>\n\n\n\n<p>But while Meek was becoming the best engineer in Britain, he was not getting on at all well with his boss. In large part this was because of the boss in question being extremely homophobic, so when Meek refused to work with assistants he perceived as incompetent and insisted on other ones, the boss assumed he wanted to work with people he fancied.</p>\n\n\n\n<p>In fact, Meek was just being a perfectionist -- but he was also very prone to mood swings and stubbornness, and bursts of paranoia. He started to think that the people he was working with were stealing his ideas.&nbsp;</p>\n\n\n\n<p>And he was having a lot of ideas. As well as close-micing instruments, adding compression as a sound effect, and adding extra echo, all of which were almost unknown in British studios at the time, he was also the first person in Britain to deliberately add distortion to a sound, and he also came up with a primitive method of multi-tracking, at a time when everything in British studios was recorded straight to mono. He would record a backing track, then play it back into the studio for the musicians to play along with, rerecording the backing track into another microphone. This way of working round the limitations of the studio ended up giving some of the records a swimmy sound because of loss of fidelity, but Meek leaned into that, and it became a signature of his music even after he eventually gained access to multi-track recording.</p>\n\n\n\n<p>So Meek knew he would have to move on from just being an engineer, working for a homophobe who also didn't appreciate his talents. He needed to become a producer, and this is where Denis Preston came in. Preston was himself an independent record producer -- the only one in Europe at the time. He would make records and only after they were recorded would he make an agreement with a record label to release them.&nbsp;</p>\n\n\n\n<p>Meek wanted to go even further than Preston -- he wanted to become the first independent producer *and engineer* in the UK. Up to this point, in Britain, the jobs of producer and engineer were separate. Meek had recently built a tiny studio in his flat, for recording demos, and he had cowritten a song, \"Sizzling Hot\", that he thought had hit potential. He recruited a local skiffle band to record a demo of the song, and Preston agreed it had potential, and funded the recording of a proper version of the song:</p>\n\n\n\n<p>[Excerpt: Jimmy Miller, \"Sizzling Hot\"]</p>\n\n\n\n<p>Jimmy Miller, the singer of that song, was present at an event that shaped much of the rest of Joe Meek's life. Now, I need to emphasise that when he reported this, Miller was talking many years later, so he may have exaggerated what actually happened, and I have no reason to think that what I'm about to describe actually involved anything supernatural. But the way Miller told the story, he, Meek, and a friend of Meek's named Faud were conducting a seance in January 1958. Miller was shuffling and dealing tarot cards with one hand, while holding Meek's hand with the other. Meek in turn was holding one of Faud's hands, while Faud held a pen in the other hand and was performing automatic writing. As Miller told it, at one point he felt strange and gripped Meek's hand so hard it drew blood, and at the same moment Faud wrote down the words \"Feb 3, Buddy Holly dies\", in what looked to Miller like Miller's own handwriting rather than Faud's.</p>\n\n\n\n<p>Meek tried to get the record labels and publishers to warn Holly, but they didn't. February the third 1958 came and went with no problem, but Meek was still worried, and so when Holly and the Crickets toured Britain in March that year, Meek waited outside the stage door and slipped Holly a bit of paper warning him. Holly apparently treated him politely, but he was later heard to joke on the radio about some of the strange things that had happened to him on tour, including being slipped this note.</p>\n\n\n\n<p>And then, on February the third 1959, Buddy Holly did die.</p>\n\n\n\n<p>Now, again, we only have Miller's after the fact word that the seance predicted the exact date of Holly's death, but it's very clear that something happened that day that affected Meek deeply, and that he did make efforts to warn Holly. Meek was severely disturbed when Holly died, and while he had already been a fan of Holly's, he was now something more. He was convinced that Buddy Holly was *important* to him in some way, and that Holly's music, and Holly's personality, were something he needed to study. Later on, he would become convinced that Holly's ghost was talking to him.</p>\n\n\n\n<p>But for the moment, this, and Meek's mood swings, didn't affect things too much. He quit working at IBC and started his own studio, Landsdowne studio, which was funded and owned by Preston, but with equipment designed by Meek, who was to have the run of the place.</p>\n\n\n\n<p>His songwriting was starting to pay off, too. While \"Sizzling Hot\" hadn't been a hit, Meek had written another song, \"Put a Ring on Her Finger\", which had been recorded by Eddie Silver, and had been unsuccessful. But then Les Paul and Mary Ford had covered it in the US, and it had made the US top forty:</p>\n\n\n\n<p>[Excerpt: Les Paul and Mary Ford, \"Put a Ring on My Finger\"]</p>\n\n\n\n<p>And Tommy Steele had covered their version as the B-side of his top-ten UK hit cover of Richie Valens' \"Come on Let's Go\".&nbsp;</p>\n\n\n\n<p>But that success as a songwriter led to Meek leaving Lansdowne studios in November 1959. Denis Preston owned the publishing company that published Meek's songs, and Meek started pestering him to take more songs. He did this in a recording session, and Preston told him to concentrate on the session and leave pitching songs to afterwards. Meek stormed out, leaving his assistant to finish the session, and Preston told him not to bother coming back -- Meek was a great engineer and producer, but was just too difficult to work with.</p>\n\n\n\n<p>Luckily for Meek, his firing came at a time when he was in high demand in the industry. He'd just co-produced \"What Do You Want to Make Those Eyes at Me For?\" by Emile Ford and the Checkmates, which became both the first number one of the sixties and the first number one by a Black British artist:</p>\n\n\n\n<p>[Excerpt: Emile Ford and the Checkmates, \"What Do You Want To Make Those Eyes At Me For?\"]</p>\n\n\n\n<p>He had two more records in the top ten as well. But even so, he found it hard to get any more work, and so he spent his time working on an experimental album, I Hear a New World, which was inspired by the launch of the first Sputnik satellite and by his getting hold of a clavioline, the same kind of keyboard instrument that had been modified into the Musitron on \"Runaway\". &nbsp;I Hear A New World wasn't a success, but it was the first attempt at something that would later become very big for Meek:</p>\n\n\n\n<p>[Excerpt: The Blue Men, \"Magnetic Field\"]</p>\n\n\n\n<p>I Hear a New World was eventually released as a limited-pressing EP and an even more limited pressing album by a new label that Meek set up with William Barrington-Coupe, Triumph Records.</p>\n\n\n\n<p>Triumph lasted less than a year. While working at the label, Meek did produce three hit singles, including \"Angela Jones\" by Michael Cox, which made the top ten:</p>\n\n\n\n<p>[Excerpt: Michael Cox, \"Angela Jones\"]</p>\n\n\n\n<p>But Meek soon became paranoid about Barrington-Coupe, and for once he may have been right. Most of the businesses Barrington-Coupe was involved with collapsed, he spent some time in prison for tax fraud in the mid-sixties, and he would later become involved in one of the great scandals to hit the classical music world. Before linking up with Meek, he had married the minor concert pianist Joyce Hatto, who had a reputation as being moderately, but not exceptionally, talented, and who recorded for Barrington-Coupe's Saga Records:</p>\n\n\n\n<p>[Excerpt: Joyce Hatto and the New York Pro Arte Symphony, \"Rhapsody in Blue\"]</p>\n\n\n\n<p>While Hatto's career continued into the seventies, both she and Barrington-Coupe then disappeared from public view.&nbsp;</p>\n\n\n\n<p>Then, in 2002, Hatto started releasing what was the most extraordinary outpouring of music from any classical musician. She released over a hundred CDs in the next four years on a label owned by Barrington-Coupe, performing almost the entire major classical piano repertoire. She was only working in the studio -- she was very ill -- but she became a legend among lovers of classical music:</p>\n\n\n\n<p>[Excerpt: \"Joyce Hatto\" (Vladimir Ashkenazy), Brahms Piano Concerto #2]</p>\n\n\n\n<p>It was only after her death in 2006 that the truth came out -- none of the recordings from her late golden period were actually of her. Barrington-Coupe had simply been taking other people's recordings of these pieces -- often recordings by relatively obscure musicians -- and reissuing them under her name, with made-up conductors and orchestras.&nbsp;</p>\n\n\n\n<p>That's the kind of person that Barrington-Coupe was, and it suggests that Meek was correct in his suspicions of his business partner.</p>\n\n\n\n<p>But for a short time, Meek was happy at Triumph, and he set up a fruitful working partnership with Charles Blackwell, his young co-writer on \"Sizzling Hot\", who worked as his arranger and would translate Meek's ideas into music that other musicians could understand -- Meek couldn't play an instrument, or read music, or sing in tune. To write songs, Meek would often take an old rhythm track he happened to have lying around and record a new vocal on it, la-laing his way through a melody even if the chords didn't go with it. Blackwell would take these demos and turn them into finished songs, and write string arrangements.</p>\n\n\n\n<p>So he was creatively happy, but he needed to move on. And while he quickly decided that Barrington-Coupe was a chancer who he shouldn't be having any dealings with, he didn't feel the same about Major Banks, who had provided the funding for Barrington-Coupe's investment in Triumph.</p>\n\n\n\n<p>Banks came to Meek with a new idea -- rather than have a record company, they would do like Denis Preston did and make records which they would then lease to the major labels. Meek would deal with all the music, and Banks with the money, and Banks would pay for Joe to move into a bigger flat, where he could have his own professional recording studio, which would be cheaper than recording in other studios, as he had been since he'd left Lansdowne. RGM Sound was born.</p>\n\n\n\n<p>Meek's new studio was something utterly unheard of in Britain, and almost unheard of in the world. It was a three-storey flat above a shop on a residential street. He was recording in a normal home. The live room he used was a bedroom, and sometimes musicians would play in the hallway or the bathroom.&nbsp;</p>\n\n\n\n<p>Other than odd amateur disc-cutting places, there was no such thing as a home studio in the Britain of the 1950s and sixties. Studios were large, purpose-built facilities run by very serious pipe-smoking men employed by major multinational firms, who wore lab coats if they were doing technical work or a suit and tie if they were on the creative side. The idea of making a record in someone's bedroom was just nonsensical.</p>\n\n\n\n<p>Meek started making records with a new young songwriter named Geoff Goddard, who took on the stage name Anton Hollywood, and found a lucrative opportunity in a young Australian manager and agent named Robert Stigwood. Stigwood had a lot of actors on his books who had TV careers, and he wanted to promote them as all-round entertainers. He started sending them to Meek, who was good enough in the studio that he could make even the worst singer sound competent, and then one of them, John Leyton, got a part in a soap opera as a pop singer. Whatever his next record was, it would get the kind of TV exposure most acts could only dream of. &nbsp;Goddard wrote a song called \"Johnny Remember Me\", Blackwell came up with the arrangement, and Meek produced it and managed to get Leyton sounding like a singer:</p>\n\n\n\n<p>[Excerpt: John Leyton, \"Johnny Remember Me\"]</p>\n\n\n\n<p>It went to number one and sold half a million copies. But those lyrics about hearing a dead person's voice were a sign of something that was eventually going to lead to tragedy. Goddard shared many of Meek's obsessions. Goddard, like Meek, was a spiritualist, and he thought he could talk to the dead. The two started to hold regular seances, in which they would try to contact Buddy Holly, who Goddard believed had sent him \"Johnny Remember Me\" from the spirit world.</p>\n\n\n\n<p>Meek's obsession with the undead also showed in some of the other records he was making, like the instrumental \"Night of the Vampire\" by the Moontrekkers:</p>\n\n\n\n<p>[Excerpt: The Moontrekkers, \"Night of the Vampire\"]</p>\n\n\n\n<p>The Moontrekkers did have a singer, but after hearing him audition, Meek came running into the room flapping his arms and blowing raspberries, because he thought he was too awful to record. Rod Stewart would have to wait a while longer for his recording career.</p>\n\n\n\n<p>In 1961, Meek put together a group for studio work. The group started because the lead guitarist of the Outlaws, one of the bands Meek produced, got sacked. Their bass player, Chas Hodges, later more famous as half of Chas & Dave, switched to guitar, and Meek had tried to replace him with a new bass player, one Heinz Burt. Heinz was someone who Meek was very attracted to -- reports differ on whether they were lovers or not, but if not then Meek definitely wanted them to be -- and Meek was moulding Heinz to be a future star, despite his lack of musical ability. While he was being groomed for stardom, he was made the bass player in the group -- until Hodges decided he was going to switch back to bass, because Heinz couldn't play. Alan Caddy, formerly of Johnny Kidd and the Pirates, became the new guitarist for the Outlaws, and then the group lost their drummer, who was replaced with Clem Cattini, Caddy's old Pirates bandmate.</p>\n\n\n\n<p>By this point Chas Hodges was the only Outlaw left, and Meek really wanted to give Heinz a job, and so he took Caddy and Cattini and made them into a new group, for studio work, who were to be known as the Tornados, with Heinz on bass. Soon they added a rhythm guitarist, George Bellamy, and a keyboard player, Norman Hale.</p>\n\n\n\n<p>Larry Parnes was, as we saw in the last episode, always on the lookout for bands to back his stars, and so in 1962 the Tornados became Billy Fury's backing band -- something that was to cause problems for them more quickly than they imagined. At the time, it seemed like a great opportunity. They were going to record for Meek -- both their own records and as the backing musicians for anyone else that Meek thought they'd work with -- and they were going to tour with Fury, so they'd have regular work. And Meek saw it as an opportunity for him to possibly get involved with Fury's recording career, which would have been a great opportunity for him had it worked out.</p>\n\n\n\n<p>The Tornados' first single, \"Love and Fury\", seems to have been named with this new association in mind:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Love and Fury\"]</p>\n\n\n\n<p>Unfortunately for the group, it wasn't a hit. But then Meek got inspired. In July 1962, the first ever communications satellite, Telstar, was launched. For the first time in history, people could see events on the other side of the world broadcast live, and so Europeans got to see, in real time, a speech by President Kennedy and part of a baseball game. It's hard now to imagine how revolutionary this was at the time, but this was a time when things like the Olympics were shown on twelve-hour delays or longer, as to show them the TV companies had to film them on actual film, and then fly the film over to the UK.</p>\n\n\n\n<p>Telstar was the future, and Meek, with his interest in space, was going to commemorate that. He took a song he'd recorded with Geoff Goddard, “Try Once More”:</p>\n\n\n\n<p>[Excerpt: Geoff Goddard, “Try Once More”]</p>\n\n\n\n<p>As was always his way with writing, he took that backing track, and sang a new melody over it:</p>\n\n\n\n<p>[Excerpt: Joe Meek, “Telstar (demo)”]</p>\n\n\n\n<p>He then got the keyboard player Dave Adams to work out the melody based on that demo, and recorded Adams playing that melody over a different pre-recorded backing track:</p>\n\n\n\n<p>[Excerpt: Dave Adams, “Telstar demo”]</p>\n\n\n\n<p>He then used that as the demo to show the Tornados what to play. They spent twelve hours in the studio recording the backing track, between Billy Fury shows, and then Meek got Goddard in to play piano and clavioline, and do some wordless vocals, as the Tornados didn't have enough time between shows to finish the track by themselves. Meek then overdubbed the track with various backwards-recorded and echoed sound effects:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Telstar\"]</p>\n\n\n\n<p>\"Telstar\" entered the charts on the fifth of September, and reached number one on the tenth of October, the week after \"Love Me Do\" came out. It stayed there for five weeks, and as well as that it went to number one in America -- the first British rock and roll record ever to do so.</p>\n\n\n\n<p>The follow-up, \"Globetrotter\", also charted -- and got into the top ten while \"Telstar\" was still there:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Globetrotter\"]</p>\n\n\n\n<p>Unfortunately, that was to be the high point for the Tornados. Larry Parnes, who was managing them, didn't want them to take the spotlight away from Billy Fury, who they were backing -- he let them play \"Telstar\" on stage, but that was it, and when they got offers to tour America, he insisted that Fury had to be on the bill, which caused the American promoters to back out. Not only that, but the other Tornados were getting sick of Meek putting all his attention into Heinz, who he was still trying to make into a solo star, recording songs like the Eddie Cochran tribute \"Just Like Eddie\", written by Geoff Goddard and with a new young guitarist called Ritchie Blackmore, who was the guitarist in Chas Hodges' latest lineup of Outlaws, playing lead:</p>\n\n\n\n<p>[Excerpt: Heinz, \"Just Like Eddie\"]</p>\n\n\n\n<p>And then in March 1963, the composer of a piece of French film music, \"Le Marche d’Austerlitz\", sued Meek over \"Telstar\"s similarity to that tune:</p>\n\n\n\n<p>[Excerpt: Jean Ledrut, \"Le Marche d’Austerlitz\"]</p>\n\n\n\n<p>It was a frivolous suit -- Meek had no way of having heard that piece, which was from a film which hadn't been released in Britain -- but it tied up all Meek's royalties from “Telstar” for the next four years.</p>\n\n\n\n<p>Meek was still having hits -- \"Just Like Eddie\" eventually made number five – for example, but in 1963 with the rise of Merseybeat he was having fewer and fewer. Not only that, but his mental health was getting worse and worse, especially after he was arrested for soliciting.</p>\n\n\n\n<p>He started getting more and more paranoid that people were stealing his ideas, and one by one he cut ties with business associates like Larry Parnes and Robert Stigwood. Heinz got a girlfriend, and everyone was in Meek's bad books.</p>\n\n\n\n<p>But he was still turning out the hits, like \"Have I The Right\" by the Honeycombs:</p>\n\n\n\n<p>[Excerpt: The Honeycombs, \"Have I the Right\"]</p>\n\n\n\n<p>That went to number one, but meant the end of Meek's association with Goddard -- Goddard claimed that he had written the song, which was credited to the Honeycombs' managers, and Meek thought he was just claiming this so he could avoid being associated with Meek now that his homosexuality was public knowledge after his arrest. Goddard ended up suing over the song.</p>\n\n\n\n<p>Meek was also just producing too much music in an attempt to remain on top. He's often compared to Phil Spector, but in a three-year period Spector had twenty-one hit singles out of twenty-four releases. Meek, in the same period, had twenty-five hit singles -- but released 141 singles, almost one a week. His failure rate in turn made record labels more and more wary of buying his tapes.</p>\n\n\n\n<p>By the mid-sixties, the hits were well and truly drying up. Meek was still producing a group called the Tornados, but it had none of the original members in and now featured guitarist Ritchie Blackmore and drummer Mitch Mitchell . This lineup of Tornados split up shortly after Meek pulled out a shotgun in the studio and aimed it at Mitchell's head, saying he'd shoot him if he didn't get the drum part right.</p>\n\n\n\n<p>Meek's final important record was in mid 1966, when he finally jumped on the Merseybeat bandwagon two years late, with \"Please Stay\" by the Cryin' Shames, the most popular band in Liverpool at the time:</p>\n\n\n\n<p>[Excerpt: The Cryin' Shames, \"Please Stay\"]</p>\n\n\n\n<p>Unfortunately, that only made the lower reaches of the top thirty. Meek was getting deeper and deeper in debt, and his mental health was getting worse. He was seriously considering quitting as an independent producer and taking a steady job with EMI instead.</p>\n\n\n\n<p>And then, a tragic event happened which eventually led to the unravelling of Meek's entire life. Meek was already in a very low place when he learned of the murder of sixteen-year-old Bernard Oliver, a young gay teenager who Meek had known (reports vary on how well they knew each other, with some saying that Oliver had done some work for Meek at his studio, while others say they just vaguely knew each other). The murder, which has still never been solved, was a major news story at the time, and it led to a massive increase in police harassment of anyone who was known to be gay, especially if they knew Oliver -- and Meek had a conviction.</p>\n\n\n\n<p>Meek already believed he was being spied on and that his phone was being tapped, and now the world started giving him reason to think that -- strange cars parked outside his house, almost certainly undercover police spying on him.&nbsp;</p>\n\n\n\n<p>On February the second, 1967, the PRS received a letter from the French performing rights society, saying that Meek's problems with the Telstar lawsuit would soon be over -- the court had determined that no matter what had happened, the composer of “Le Marche d'Austerlitz” would only be entitled to a small percentage of the royalties from \"Telstar\" at most. Frederick Woods, the assistant general manager of the PRS and a friend of Meek's, put the letter aside intending to call Meek and tell him the good news -- all he had to do was to write to the PRS and they'd be able to give him an advance on the money, and soon almost all of it would be coming through. He'd soon be getting the bulk of the £150,000 he was owed -- nearly three million pounds in today's money.</p>\n\n\n\n<p>But Woods got distracted and didn't make the phone call, and Meek never found out that his money troubles were nearly over. &nbsp;Ritchie Blackmore's wife Margaret called round to see Joe, as she sometimes did. He was apparently not in his right mind, talking a lot about black magic and comparing Margaret to Frieda Harris, one of Aleister Crowley's associates. He was convinced people were stealing his ideas from his mind, and asked her to leave. While she was there, she saw him destroying correspondence and paintings he owned.</p>\n\n\n\n<p>The next morning, February the third, Meek asked his assistant to get his landlady, Violet Shenton, up to Meek's office. There was some shouting from Meek, and then he turned a gun he had, which was owned by Heinz, on Mrs. Shenton and killed her. Meek's assistant ran into the room, but before he could get to Meek, Meek shot himself, dying instantly. It was the eighth anniversary of Buddy Holly's death.</p>\n\n\n\n<p>The lawsuit over \"Telstar\" was finally resolved just three weeks later, in Meek's favour.</p>\n\n\n\n<p>There's a plaque now at the building where Meek's studio was. It says that Joe Meek, \"the Telstar man\", \"Lived, worked, and died here\". It doesn't mention Violet Shenton. After all, she wasn't a great male genius, just the male genius' female victim.</p>",
  "itunes:subtitle": "Episode 101 of A History of Rock Music in Five Hundred Songs is the first one of the podcasts third year. This one looks at Telstar by the Tornados, and the tragic life of Joe Meek, Britains first great pop auteur. Click the full post to read liner notes",
  "itunes:keywords": "Alan Caddy,Big Bill Broonzy,Billy Fury,British rock,Buddy Holly,calypso,Chas Hodges,claviioline,Clem Cattini,Denis Preston,Geoff Goddard,homophobia,Humphrey Lyttleton,Joe Meek,Johnny Kidd and the Pirates,Larry Parnes,lawsuits,Les Paul,LGBT+ people,Merseybeat,Mitch Mitchell,Ritchie Blackmore,Robert Stigwood,Rod Stewart,satellites,skiffle,The Tornados,trad jazz,Triumph Records,William Barrington-Coupe",
  "itunes:episodeType": "full",
  "itunes:episode": 101,
  "content:encoded": "<p>Episode 101 of <em>A History of Rock Music in Five Hundred Songs</em> is the first one of the podcast's third year. This one looks at \"Telstar\" by the Tornados, and the tragic life of Joe Meek, Britain's first great pop auteur. Click the full post to read liner notes, links to more information, and a transcript of the episode.</p>\n\n\n<p>Apologies for the lateness of this one -- my two-week break got extended when my computer broke down.</p>\n\n\n\n<p>Patreon backers also have a ten-minute bonus episode available,<a href=\"https://www.patreon.com/posts/42833409\"> on \"Wipe Out\" by the Surfaris</a>.</p>\n\n\n\n<p>Tilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;<a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a>&nbsp;and&nbsp;<a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a></p>\n\n\n\n\n\n<p><strong>Resources</strong></p>\n\n\n\n<p>As always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-101-telstar/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.&nbsp;</p>\n\n\n\n<p>Most of the information here comes from&nbsp;<a href=\"https://amzn.to/3lU2ZIB\"><em>The Legendary Joe Meek: The Telstar Man</em> by John Repsch</a>. Some bits come from&nbsp;<em><a href=\"https://amzn.to/2T42yzb\">Clem Cattini: My Life Through the Eye of a Tornado</a>.</em></p>\n\n\n\n<p><a href=\"https://amzn.to/3dFDLuH\">This compilation</a> contains most of the important singles Meek produced, with the notable exceptions of the Tornados' singles. <a href=\"https://amzn.to/3j6O9fW\">This, </a>meanwhile, contains the early records he engineered before going into production. <a href=\"https://amzn.to/37efkDy\">This</a> is probably the best compilation of the Tornados' music available.</p>\n\n\n\n<p><strong>Patreon</strong></p>\n\n\n\n<p>This podcast is brought to you by the generosity of&nbsp;<a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?</p>\n\n\n\n<p><strong>Transcript</strong></p>\n\n\n\n<p>Welcome to the third year of A History of Rock Music in 500 Songs, and welcome to the future! Although for this particular future we're actually going backwards a couple of months. This episode and the next one are both about records that were released a little before \"Love Me Do\", which the most recent episode covered, and that's something I should point out -- the podcast is never going to be absolutely chronological, and in this case it made sense to tell that story before these ones.</p>\n\n\n\n<p>Before we start this episode, I need to give warnings for a whole lot of different things, because we're looking at one of the most tragic stories we'll see during the course of this podcast. This story contains discussion of occultism, severe mental illness, legalised homophobia, &nbsp;an unsolved probably homophobic murder, and a murder-suicide. I am going to try to deal with all those subjects as sensitively as possible, but if you might become distressed by hearing about those things, you might want to skip this episode, or at least read the transcript before listening.</p>\n\n\n\n<p>I also want to make something very clear right now -- this episode deals with a mentally ill man who commits a murder. He did not commit that murder *because* he was mentally ill. Mental illness is far more likely to make someone the victim of a crime than the perpetrator, and I have known many, many people who have had the same symptoms but who have not committed such awful acts. It is impossible to talk about the events in this episode without the risk of increasing stigma for mentally ill people, but I hope by saying this I can reduce that risk at least somewhat.</p>\n\n\n\n<p>Today we're going to look at the first British rock and roll record to make number one in the USA, and at the career of the first independent record producer and engineer in Britain. We're going to look at the sad life and tragic end of Joe Meek, and at \"Telstar\" by the Tornados:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Telstar\"]</p>\n\n\n\n<p>Joe Meek is someone who has become something of a legend among music lovers, and he's someone whose music is more talked about than listened to. People talk about him as a genius, but rather fewer of them explain what it was that he did that was so impressive. This is partly because, more than much of the music of the era, it requires context to appreciate. Meek was a producer above all else -- he had no real knowledge of music, and had no ear for singers. What Meek did know was sounds, and how to achieve sounds in the recording studio that could not be achieved anywhere else.</p>\n\n\n\n<p>Meek had, from a very young age, been fascinated by the possibilities of both sound and electronics. He had experimented with both as a child, and when he'd moved to London he'd quickly found himself jobs where he could make use of that -- he'd started out as a TV repairman, but quickly moved on to working at IBC, one of the few independent studios in existence. There he was given the job of assistant engineer on a Radio Luxembourg show that was recorded live in theatres up and down the country -- he had to plug in all the mics and so on. He soon moved on to editing the tape recordings, and then to working the controls himself.</p>\n\n\n\n<p>As well as being main engineer on the radio show, though, he was also still an assistant engineer in the studio for music sessions, and for a long time that was all he was doing. However, he kept trying to get more involved in recording the music, and eventually to shut him up the studio boss gave him the chance to be the main engineer at a session -- for a twenty-piece string section. The boss assumed that Meek wouldn't be able to handle such a complicated assignment as his first engineering job, and that he'd be kept quiet if he knew how hard the job was. Instead, he did such a good job balancing the sound that the musicians in the studio applauded the playback, and he was quickly promoted to senior balance engineer.</p>\n\n\n\n<p>The world got its first small inkling of what Meek could do in 1956, when he created the unique sound of \"Bad Penny Blues\", a record by the trad jazz trumpet player Humphrey Lyttleton.</p>\n\n\n\n<p>\"Bad Penny Blues\" actually happened more or less by accident, at least as far as the musicians were concerned. There was a five-piece band in the studio, but the saxophone player had to leave early, and so they were stuck for what to record once he was gone. Denis Preston, the producer in charge of the session, suggested that they just play a blues, and so they improvised a boogie woogie piece, based around something they played in the clubs -- Johnny Parker, the piano player, played somewhat in the style of Dan Burley, the man who had coined the term \"skiffle\". But what made the track wasn't the group or the producer, but the engineering:</p>\n\n\n\n<p>[Excerpt: Humphrey Lyttleton, \"Bad Penny Blues\"]</p>\n\n\n\n<p>These days, that doesn't sound all that revolutionary, but when they heard it back the group were furious at what Meek had done to the sound, because it just didn't sound like what they were used to.</p>\n\n\n\n<p>&nbsp;There were several innovative things about it, at least for a British record, but one of the most important was that Meek had actually bothered to mic the drum kit separately -- at this point in British studios, which were several years behind American ones, it was considered unnecessary to mic the drums properly, as their sound would get into the other microphones anyway, because the musicians were all playing together in the same room. If you really wanted a good drum sound, you'd hang a single mic over the drummer's head. Meek was using separate mics for each drum on the kit.</p>\n\n\n\n<p>Because of this, Meek had managed to get a drum sound which was unlike anything that had been heard in a British record before. You can actually *hear* the kick drum. It sounds normal now, but that's because everyone who followed Meek realised that actually bothering to record the drums was something worth doing.&nbsp;</p>\n\n\n\n<p>There was another thing Meek did, which again you will almost certainly not have noticed when listening to that recording -- he had added a lot of compression.</p>\n\n\n\n<p>Compression is a standard part of the sound engineer's toolkit, and a simple one to understand. All it does is make quiet sounds louder and loud sounds quieter. Used sparingly, it gives a recording a little more punch, and also evens out the sound a bit. So for example, when you're listening to a playlist on Spotify, that playlist applies a little compression to everything, so when you go from a Bach piece for solo piano to a Slayer track, you can hear the Bach piece but your earbuds don't make your eardrums bleed when the Slayer record comes on.</p>\n\n\n\n<p>By the way, this is one of those words that gets used confusingly, because the word \"compression\", when referring to Internet sound files such as MP3s, has a totally different meaning, so you might well see someone talking about compression of a recording in ways that seem to contradict this. But when I refer to compression in this episode, and in any of the episodes in the foreseeable future, I mean what I've talked about here.</p>\n\n\n\n<p>Generally speaking, recordings have had steadily more compression applied to them over the decades, and so the moderate use of compression on \"Bad Penny Blues\" might not sound like much to modern ears -- especially since when older recordings have been reissued, they almost always have additional compression on them, so even when I've excerpted things in these episodes, they've sounded more compressed than the original recordings did. But Meek would soon start using a *lot* more compression, even than is used these days, and that drastically changed the character of the sound.</p>\n\n\n\n<p>To show what I mean, here's me playing a few bars on the guitar, recorded with no compression whatsoever:</p>\n\n\n\n\n\n<p>Here's the same recording with a touch of compression:</p>\n\n\n\n\n\n<p>And the same recording with a *lot* of compression:</p>\n\n\n\n\n\n<p>This was one of the things that Meek would do over the course of his career, and which very few other people were doing at the time in the UK.&nbsp;</p>\n\n\n\n<p>\"Bad Penny Blues\" became one of the most important British jazz records ever -- probably *the* most important British jazz record ever -- and it made the top twenty, which never happened with jazz records at the time. Meek's reputation as an innovative engineer was set.</p>\n\n\n\n<p>Shortly after \"Bad Penny Blues\", Meek was given his first opportunity to indulge his love of sound effects, on what became one of the biggest-selling British records of the year. Anne Shelton was recording a military-themed song, and the producer suggested that they needed the sound of marching feet. Rather than play in something from a sound-effects album, which was what the producer expected but which wouldn't have been in time with the music, Meek got a box of gravel and had someone shake it in time with the music. The result did sound exactly like marching feet, though the dust from the gravel apparently made Shelton's new suit into a mess, and the record went to number one for a month:</p>\n\n\n\n<p>[Excerpt: Anne Shelton, \"Lay Down Your Arms\"]</p>\n\n\n\n<p>Another hit Meek engineered in the mid-fifties has led to an urban myth that's been repeated unquestioningly even in the Guardian, even though a second's thought proves that it's nonsense. Frankie Vaughan's \"Green Door\" went to number two in 1957:</p>\n\n\n\n<p>[Excerpt: Frankie Vaughan, \"Green Door\"]</p>\n\n\n\n<p>That line, \"When I said 'Joe sent me' someone laughed out loud\" has been taken to be referring to Meek himself, and a whole elaborate mythology has been spun around this. As Meek was gay, and as there was a lesbian club called The Gateways in London which happened to have a green door, people have stated as fact that the song is about that club, and that the people in there were laughing because a man was trying to get into a lesbian club.</p>\n\n\n\n<p>There's only one slight problem with this, which is that it's complete nonsense. For a start, while Meek was gay, he saw being gay as an affliction, something to be ashamed of, and was hardly likely to make a whole jokey record about that — at least at this time. He did some things later on.</p>\n\n\n\n<p>Then there's the fact that Meek was at the time only a moderately-known engineer, not the famous producer and songwriter he became later.</p>\n\n\n\n<p>But more important than either of those things -- the song was a cover of an American hit record by Jim Lowe, written by songwriters who had almost certainly never even been to Britain. And the line about \"Joe\"? That was in the original, and was a reference to a 1954 hit on the same lines, \"Hernando's Hideaway\":</p>\n\n\n\n<p>[Excerpt: Ella Fitzgerald, \"Hernando's Hideaway\"]</p>\n\n\n\n<p>During this early period of his career, Meek was recording all sorts of music. While the bread-and-butter work of a recording engineer at the time was orchestral pop covers of American records, he also engineered skiffle records by Lonnie Donegan, with a stinging guitar sound he would later use on many other records:</p>\n\n\n\n<p>[Excerpt: Lonnie Donegan, \"Cumberland Gap\"]</p>\n\n\n\n<p>Calypso records by people like Lord Invader or the Mighty Terror:</p>\n\n\n\n<p>[Excerpt: Mighty Terror, \"T.V. Calypso\"]</p>\n\n\n\n<p>And jazz records by Chris Barber, Acker Bilk, and Humphrey Lyttleton, usually produced by Denis Preston, who after \"Bad Penny Blues\" insisted on using Meek for all of his sessions. Because of this connection, Meek also got to engineer some of the very first blues records cut in Britain. Barber would bring over American folk-blues artists to tour with him -- and we'll be looking at the consequences of that for much of the next three years -- and Preston arranged sessions, engineered by Meek, for Big Bill Broonzy:</p>\n\n\n\n<p>[Excerpt: Big Bill Broonzy, \"When Do I Get To Be Called A Man?\"]</p>\n\n\n\n<p>And Sonny Terry and Brownie McGhee -- who wouldn't seem a natural fit with Meek's very artificial style, but the echo he applies to Terry's harmonica, in particular, gives it a haunting feel that really works, to my ears at least:</p>\n\n\n\n<p>[Excerpt: Sonny Terry and Brownie McGhee, \"Key to the Highway\"]</p>\n\n\n\n<p>But while Meek was becoming the best engineer in Britain, he was not getting on at all well with his boss. In large part this was because of the boss in question being extremely homophobic, so when Meek refused to work with assistants he perceived as incompetent and insisted on other ones, the boss assumed he wanted to work with people he fancied.</p>\n\n\n\n<p>In fact, Meek was just being a perfectionist -- but he was also very prone to mood swings and stubbornness, and bursts of paranoia. He started to think that the people he was working with were stealing his ideas.&nbsp;</p>\n\n\n\n<p>And he was having a lot of ideas. As well as close-micing instruments, adding compression as a sound effect, and adding extra echo, all of which were almost unknown in British studios at the time, he was also the first person in Britain to deliberately add distortion to a sound, and he also came up with a primitive method of multi-tracking, at a time when everything in British studios was recorded straight to mono. He would record a backing track, then play it back into the studio for the musicians to play along with, rerecording the backing track into another microphone. This way of working round the limitations of the studio ended up giving some of the records a swimmy sound because of loss of fidelity, but Meek leaned into that, and it became a signature of his music even after he eventually gained access to multi-track recording.</p>\n\n\n\n<p>So Meek knew he would have to move on from just being an engineer, working for a homophobe who also didn't appreciate his talents. He needed to become a producer, and this is where Denis Preston came in. Preston was himself an independent record producer -- the only one in Europe at the time. He would make records and only after they were recorded would he make an agreement with a record label to release them.&nbsp;</p>\n\n\n\n<p>Meek wanted to go even further than Preston -- he wanted to become the first independent producer *and engineer* in the UK. Up to this point, in Britain, the jobs of producer and engineer were separate. Meek had recently built a tiny studio in his flat, for recording demos, and he had cowritten a song, \"Sizzling Hot\", that he thought had hit potential. He recruited a local skiffle band to record a demo of the song, and Preston agreed it had potential, and funded the recording of a proper version of the song:</p>\n\n\n\n<p>[Excerpt: Jimmy Miller, \"Sizzling Hot\"]</p>\n\n\n\n<p>Jimmy Miller, the singer of that song, was present at an event that shaped much of the rest of Joe Meek's life. Now, I need to emphasise that when he reported this, Miller was talking many years later, so he may have exaggerated what actually happened, and I have no reason to think that what I'm about to describe actually involved anything supernatural. But the way Miller told the story, he, Meek, and a friend of Meek's named Faud were conducting a seance in January 1958. Miller was shuffling and dealing tarot cards with one hand, while holding Meek's hand with the other. Meek in turn was holding one of Faud's hands, while Faud held a pen in the other hand and was performing automatic writing. As Miller told it, at one point he felt strange and gripped Meek's hand so hard it drew blood, and at the same moment Faud wrote down the words \"Feb 3, Buddy Holly dies\", in what looked to Miller like Miller's own handwriting rather than Faud's.</p>\n\n\n\n<p>Meek tried to get the record labels and publishers to warn Holly, but they didn't. February the third 1958 came and went with no problem, but Meek was still worried, and so when Holly and the Crickets toured Britain in March that year, Meek waited outside the stage door and slipped Holly a bit of paper warning him. Holly apparently treated him politely, but he was later heard to joke on the radio about some of the strange things that had happened to him on tour, including being slipped this note.</p>\n\n\n\n<p>And then, on February the third 1959, Buddy Holly did die.</p>\n\n\n\n<p>Now, again, we only have Miller's after the fact word that the seance predicted the exact date of Holly's death, but it's very clear that something happened that day that affected Meek deeply, and that he did make efforts to warn Holly. Meek was severely disturbed when Holly died, and while he had already been a fan of Holly's, he was now something more. He was convinced that Buddy Holly was *important* to him in some way, and that Holly's music, and Holly's personality, were something he needed to study. Later on, he would become convinced that Holly's ghost was talking to him.</p>\n\n\n\n<p>But for the moment, this, and Meek's mood swings, didn't affect things too much. He quit working at IBC and started his own studio, Landsdowne studio, which was funded and owned by Preston, but with equipment designed by Meek, who was to have the run of the place.</p>\n\n\n\n<p>His songwriting was starting to pay off, too. While \"Sizzling Hot\" hadn't been a hit, Meek had written another song, \"Put a Ring on Her Finger\", which had been recorded by Eddie Silver, and had been unsuccessful. But then Les Paul and Mary Ford had covered it in the US, and it had made the US top forty:</p>\n\n\n\n<p>[Excerpt: Les Paul and Mary Ford, \"Put a Ring on My Finger\"]</p>\n\n\n\n<p>And Tommy Steele had covered their version as the B-side of his top-ten UK hit cover of Richie Valens' \"Come on Let's Go\".&nbsp;</p>\n\n\n\n<p>But that success as a songwriter led to Meek leaving Lansdowne studios in November 1959. Denis Preston owned the publishing company that published Meek's songs, and Meek started pestering him to take more songs. He did this in a recording session, and Preston told him to concentrate on the session and leave pitching songs to afterwards. Meek stormed out, leaving his assistant to finish the session, and Preston told him not to bother coming back -- Meek was a great engineer and producer, but was just too difficult to work with.</p>\n\n\n\n<p>Luckily for Meek, his firing came at a time when he was in high demand in the industry. He'd just co-produced \"What Do You Want to Make Those Eyes at Me For?\" by Emile Ford and the Checkmates, which became both the first number one of the sixties and the first number one by a Black British artist:</p>\n\n\n\n<p>[Excerpt: Emile Ford and the Checkmates, \"What Do You Want To Make Those Eyes At Me For?\"]</p>\n\n\n\n<p>He had two more records in the top ten as well. But even so, he found it hard to get any more work, and so he spent his time working on an experimental album, I Hear a New World, which was inspired by the launch of the first Sputnik satellite and by his getting hold of a clavioline, the same kind of keyboard instrument that had been modified into the Musitron on \"Runaway\". &nbsp;I Hear A New World wasn't a success, but it was the first attempt at something that would later become very big for Meek:</p>\n\n\n\n<p>[Excerpt: The Blue Men, \"Magnetic Field\"]</p>\n\n\n\n<p>I Hear a New World was eventually released as a limited-pressing EP and an even more limited pressing album by a new label that Meek set up with William Barrington-Coupe, Triumph Records.</p>\n\n\n\n<p>Triumph lasted less than a year. While working at the label, Meek did produce three hit singles, including \"Angela Jones\" by Michael Cox, which made the top ten:</p>\n\n\n\n<p>[Excerpt: Michael Cox, \"Angela Jones\"]</p>\n\n\n\n<p>But Meek soon became paranoid about Barrington-Coupe, and for once he may have been right. Most of the businesses Barrington-Coupe was involved with collapsed, he spent some time in prison for tax fraud in the mid-sixties, and he would later become involved in one of the great scandals to hit the classical music world. Before linking up with Meek, he had married the minor concert pianist Joyce Hatto, who had a reputation as being moderately, but not exceptionally, talented, and who recorded for Barrington-Coupe's Saga Records:</p>\n\n\n\n<p>[Excerpt: Joyce Hatto and the New York Pro Arte Symphony, \"Rhapsody in Blue\"]</p>\n\n\n\n<p>While Hatto's career continued into the seventies, both she and Barrington-Coupe then disappeared from public view.&nbsp;</p>\n\n\n\n<p>Then, in 2002, Hatto started releasing what was the most extraordinary outpouring of music from any classical musician. She released over a hundred CDs in the next four years on a label owned by Barrington-Coupe, performing almost the entire major classical piano repertoire. She was only working in the studio -- she was very ill -- but she became a legend among lovers of classical music:</p>\n\n\n\n<p>[Excerpt: \"Joyce Hatto\" (Vladimir Ashkenazy), Brahms Piano Concerto #2]</p>\n\n\n\n<p>It was only after her death in 2006 that the truth came out -- none of the recordings from her late golden period were actually of her. Barrington-Coupe had simply been taking other people's recordings of these pieces -- often recordings by relatively obscure musicians -- and reissuing them under her name, with made-up conductors and orchestras.&nbsp;</p>\n\n\n\n<p>That's the kind of person that Barrington-Coupe was, and it suggests that Meek was correct in his suspicions of his business partner.</p>\n\n\n\n<p>But for a short time, Meek was happy at Triumph, and he set up a fruitful working partnership with Charles Blackwell, his young co-writer on \"Sizzling Hot\", who worked as his arranger and would translate Meek's ideas into music that other musicians could understand -- Meek couldn't play an instrument, or read music, or sing in tune. To write songs, Meek would often take an old rhythm track he happened to have lying around and record a new vocal on it, la-laing his way through a melody even if the chords didn't go with it. Blackwell would take these demos and turn them into finished songs, and write string arrangements.</p>\n\n\n\n<p>So he was creatively happy, but he needed to move on. And while he quickly decided that Barrington-Coupe was a chancer who he shouldn't be having any dealings with, he didn't feel the same about Major Banks, who had provided the funding for Barrington-Coupe's investment in Triumph.</p>\n\n\n\n<p>Banks came to Meek with a new idea -- rather than have a record company, they would do like Denis Preston did and make records which they would then lease to the major labels. Meek would deal with all the music, and Banks with the money, and Banks would pay for Joe to move into a bigger flat, where he could have his own professional recording studio, which would be cheaper than recording in other studios, as he had been since he'd left Lansdowne. RGM Sound was born.</p>\n\n\n\n<p>Meek's new studio was something utterly unheard of in Britain, and almost unheard of in the world. It was a three-storey flat above a shop on a residential street. He was recording in a normal home. The live room he used was a bedroom, and sometimes musicians would play in the hallway or the bathroom.&nbsp;</p>\n\n\n\n<p>Other than odd amateur disc-cutting places, there was no such thing as a home studio in the Britain of the 1950s and sixties. Studios were large, purpose-built facilities run by very serious pipe-smoking men employed by major multinational firms, who wore lab coats if they were doing technical work or a suit and tie if they were on the creative side. The idea of making a record in someone's bedroom was just nonsensical.</p>\n\n\n\n<p>Meek started making records with a new young songwriter named Geoff Goddard, who took on the stage name Anton Hollywood, and found a lucrative opportunity in a young Australian manager and agent named Robert Stigwood. Stigwood had a lot of actors on his books who had TV careers, and he wanted to promote them as all-round entertainers. He started sending them to Meek, who was good enough in the studio that he could make even the worst singer sound competent, and then one of them, John Leyton, got a part in a soap opera as a pop singer. Whatever his next record was, it would get the kind of TV exposure most acts could only dream of. &nbsp;Goddard wrote a song called \"Johnny Remember Me\", Blackwell came up with the arrangement, and Meek produced it and managed to get Leyton sounding like a singer:</p>\n\n\n\n<p>[Excerpt: John Leyton, \"Johnny Remember Me\"]</p>\n\n\n\n<p>It went to number one and sold half a million copies. But those lyrics about hearing a dead person's voice were a sign of something that was eventually going to lead to tragedy. Goddard shared many of Meek's obsessions. Goddard, like Meek, was a spiritualist, and he thought he could talk to the dead. The two started to hold regular seances, in which they would try to contact Buddy Holly, who Goddard believed had sent him \"Johnny Remember Me\" from the spirit world.</p>\n\n\n\n<p>Meek's obsession with the undead also showed in some of the other records he was making, like the instrumental \"Night of the Vampire\" by the Moontrekkers:</p>\n\n\n\n<p>[Excerpt: The Moontrekkers, \"Night of the Vampire\"]</p>\n\n\n\n<p>The Moontrekkers did have a singer, but after hearing him audition, Meek came running into the room flapping his arms and blowing raspberries, because he thought he was too awful to record. Rod Stewart would have to wait a while longer for his recording career.</p>\n\n\n\n<p>In 1961, Meek put together a group for studio work. The group started because the lead guitarist of the Outlaws, one of the bands Meek produced, got sacked. Their bass player, Chas Hodges, later more famous as half of Chas & Dave, switched to guitar, and Meek had tried to replace him with a new bass player, one Heinz Burt. Heinz was someone who Meek was very attracted to -- reports differ on whether they were lovers or not, but if not then Meek definitely wanted them to be -- and Meek was moulding Heinz to be a future star, despite his lack of musical ability. While he was being groomed for stardom, he was made the bass player in the group -- until Hodges decided he was going to switch back to bass, because Heinz couldn't play. Alan Caddy, formerly of Johnny Kidd and the Pirates, became the new guitarist for the Outlaws, and then the group lost their drummer, who was replaced with Clem Cattini, Caddy's old Pirates bandmate.</p>\n\n\n\n<p>By this point Chas Hodges was the only Outlaw left, and Meek really wanted to give Heinz a job, and so he took Caddy and Cattini and made them into a new group, for studio work, who were to be known as the Tornados, with Heinz on bass. Soon they added a rhythm guitarist, George Bellamy, and a keyboard player, Norman Hale.</p>\n\n\n\n<p>Larry Parnes was, as we saw in the last episode, always on the lookout for bands to back his stars, and so in 1962 the Tornados became Billy Fury's backing band -- something that was to cause problems for them more quickly than they imagined. At the time, it seemed like a great opportunity. They were going to record for Meek -- both their own records and as the backing musicians for anyone else that Meek thought they'd work with -- and they were going to tour with Fury, so they'd have regular work. And Meek saw it as an opportunity for him to possibly get involved with Fury's recording career, which would have been a great opportunity for him had it worked out.</p>\n\n\n\n<p>The Tornados' first single, \"Love and Fury\", seems to have been named with this new association in mind:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Love and Fury\"]</p>\n\n\n\n<p>Unfortunately for the group, it wasn't a hit. But then Meek got inspired. In July 1962, the first ever communications satellite, Telstar, was launched. For the first time in history, people could see events on the other side of the world broadcast live, and so Europeans got to see, in real time, a speech by President Kennedy and part of a baseball game. It's hard now to imagine how revolutionary this was at the time, but this was a time when things like the Olympics were shown on twelve-hour delays or longer, as to show them the TV companies had to film them on actual film, and then fly the film over to the UK.</p>\n\n\n\n<p>Telstar was the future, and Meek, with his interest in space, was going to commemorate that. He took a song he'd recorded with Geoff Goddard, “Try Once More”:</p>\n\n\n\n<p>[Excerpt: Geoff Goddard, “Try Once More”]</p>\n\n\n\n<p>As was always his way with writing, he took that backing track, and sang a new melody over it:</p>\n\n\n\n<p>[Excerpt: Joe Meek, “Telstar (demo)”]</p>\n\n\n\n<p>He then got the keyboard player Dave Adams to work out the melody based on that demo, and recorded Adams playing that melody over a different pre-recorded backing track:</p>\n\n\n\n<p>[Excerpt: Dave Adams, “Telstar demo”]</p>\n\n\n\n<p>He then used that as the demo to show the Tornados what to play. They spent twelve hours in the studio recording the backing track, between Billy Fury shows, and then Meek got Goddard in to play piano and clavioline, and do some wordless vocals, as the Tornados didn't have enough time between shows to finish the track by themselves. Meek then overdubbed the track with various backwards-recorded and echoed sound effects:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Telstar\"]</p>\n\n\n\n<p>\"Telstar\" entered the charts on the fifth of September, and reached number one on the tenth of October, the week after \"Love Me Do\" came out. It stayed there for five weeks, and as well as that it went to number one in America -- the first British rock and roll record ever to do so.</p>\n\n\n\n<p>The follow-up, \"Globetrotter\", also charted -- and got into the top ten while \"Telstar\" was still there:</p>\n\n\n\n<p>[Excerpt: The Tornados, \"Globetrotter\"]</p>\n\n\n\n<p>Unfortunately, that was to be the high point for the Tornados. Larry Parnes, who was managing them, didn't want them to take the spotlight away from Billy Fury, who they were backing -- he let them play \"Telstar\" on stage, but that was it, and when they got offers to tour America, he insisted that Fury had to be on the bill, which caused the American promoters to back out. Not only that, but the other Tornados were getting sick of Meek putting all his attention into Heinz, who he was still trying to make into a solo star, recording songs like the Eddie Cochran tribute \"Just Like Eddie\", written by Geoff Goddard and with a new young guitarist called Ritchie Blackmore, who was the guitarist in Chas Hodges' latest lineup of Outlaws, playing lead:</p>\n\n\n\n<p>[Excerpt: Heinz, \"Just Like Eddie\"]</p>\n\n\n\n<p>And then in March 1963, the composer of a piece of French film music, \"Le Marche d’Austerlitz\", sued Meek over \"Telstar\"s similarity to that tune:</p>\n\n\n\n<p>[Excerpt: Jean Ledrut, \"Le Marche d’Austerlitz\"]</p>\n\n\n\n<p>It was a frivolous suit -- Meek had no way of having heard that piece, which was from a film which hadn't been released in Britain -- but it tied up all Meek's royalties from “Telstar” for the next four years.</p>\n\n\n\n<p>Meek was still having hits -- \"Just Like Eddie\" eventually made number five – for example, but in 1963 with the rise of Merseybeat he was having fewer and fewer. Not only that, but his mental health was getting worse and worse, especially after he was arrested for soliciting.</p>\n\n\n\n<p>He started getting more and more paranoid that people were stealing his ideas, and one by one he cut ties with business associates like Larry Parnes and Robert Stigwood. Heinz got a girlfriend, and everyone was in Meek's bad books.</p>\n\n\n\n<p>But he was still turning out the hits, like \"Have I The Right\" by the Honeycombs:</p>\n\n\n\n<p>[Excerpt: The Honeycombs, \"Have I the Right\"]</p>\n\n\n\n<p>That went to number one, but meant the end of Meek's association with Goddard -- Goddard claimed that he had written the song, which was credited to the Honeycombs' managers, and Meek thought he was just claiming this so he could avoid being associated with Meek now that his homosexuality was public knowledge after his arrest. Goddard ended up suing over the song.</p>\n\n\n\n<p>Meek was also just producing too much music in an attempt to remain on top. He's often compared to Phil Spector, but in a three-year period Spector had twenty-one hit singles out of twenty-four releases. Meek, in the same period, had twenty-five hit singles -- but released 141 singles, almost one a week. His failure rate in turn made record labels more and more wary of buying his tapes.</p>\n\n\n\n<p>By the mid-sixties, the hits were well and truly drying up. Meek was still producing a group called the Tornados, but it had none of the original members in and now featured guitarist Ritchie Blackmore and drummer Mitch Mitchell . This lineup of Tornados split up shortly after Meek pulled out a shotgun in the studio and aimed it at Mitchell's head, saying he'd shoot him if he didn't get the drum part right.</p>\n\n\n\n<p>Meek's final important record was in mid 1966, when he finally jumped on the Merseybeat bandwagon two years late, with \"Please Stay\" by the Cryin' Shames, the most popular band in Liverpool at the time:</p>\n\n\n\n<p>[Excerpt: The Cryin' Shames, \"Please Stay\"]</p>\n\n\n\n<p>Unfortunately, that only made the lower reaches of the top thirty. Meek was getting deeper and deeper in debt, and his mental health was getting worse. He was seriously considering quitting as an independent producer and taking a steady job with EMI instead.</p>\n\n\n\n<p>And then, a tragic event happened which eventually led to the unravelling of Meek's entire life. Meek was already in a very low place when he learned of the murder of sixteen-year-old Bernard Oliver, a young gay teenager who Meek had known (reports vary on how well they knew each other, with some saying that Oliver had done some work for Meek at his studio, while others say they just vaguely knew each other). The murder, which has still never been solved, was a major news story at the time, and it led to a massive increase in police harassment of anyone who was known to be gay, especially if they knew Oliver -- and Meek had a conviction.</p>\n\n\n\n<p>Meek already believed he was being spied on and that his phone was being tapped, and now the world started giving him reason to think that -- strange cars parked outside his house, almost certainly undercover police spying on him.&nbsp;</p>\n\n\n\n<p>On February the second, 1967, the PRS received a letter from the French performing rights society, saying that Meek's problems with the Telstar lawsuit would soon be over -- the court had determined that no matter what had happened, the composer of “Le Marche d'Austerlitz” would only be entitled to a small percentage of the royalties from \"Telstar\" at most. Frederick Woods, the assistant general manager of the PRS and a friend of Meek's, put the letter aside intending to call Meek and tell him the good news -- all he had to do was to write to the PRS and they'd be able to give him an advance on the money, and soon almost all of it would be coming through. He'd soon be getting the bulk of the £150,000 he was owed -- nearly three million pounds in today's money.</p>\n\n\n\n<p>But Woods got distracted and didn't make the phone call, and Meek never found out that his money troubles were nearly over. &nbsp;Ritchie Blackmore's wife Margaret called round to see Joe, as she sometimes did. He was apparently not in his right mind, talking a lot about black magic and comparing Margaret to Frieda Harris, one of Aleister Crowley's associates. He was convinced people were stealing his ideas from his mind, and asked her to leave. While she was there, she saw him destroying correspondence and paintings he owned.</p>\n\n\n\n<p>The next morning, February the third, Meek asked his assistant to get his landlady, Violet Shenton, up to Meek's office. There was some shouting from Meek, and then he turned a gun he had, which was owned by Heinz, on Mrs. Shenton and killed her. Meek's assistant ran into the room, but before he could get to Meek, Meek shot himself, dying instantly. It was the eighth anniversary of Buddy Holly's death.</p>\n\n\n\n<p>The lawsuit over \"Telstar\" was finally resolved just three weeks later, in Meek's favour.</p>\n\n\n\n<p>There's a plaque now at the building where Meek's studio was. It says that Joe Meek, \"the Telstar man\", \"Lived, worked, and died here\". It doesn't mention Violet Shenton. After all, she wasn't a great male genius, just the male genius' female victim.</p>",
  "enclosure": "",
  "itunes:summary": "Episode 101 of A History of Rock Music in Five Hundred Songs is the first one of the podcast's third year. This one looks at \"Telstar\" by the Tornados, and the tragic life of Joe Meek, Britain's first great pop auteur. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\nApologies for the lateness of this one -- my two-week break got extended when my computer broke down.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Wipe Out\" by the Surfaris.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.&nbsp;\n\n\n\nMost of the information here comes from&nbsp;The Legendary Joe Meek: The Telstar Man by John Repsch. Some bits come from&nbsp;Clem Cattini: My Life Through the Eye of a Tornado.\n\n\n\nThis compilation contains most of the important singles Meek produced, with the notable exceptions of the Tornados' singles. This, meanwhile, contains the early records he engineered before going into production. This is probably the best compilation of the Tornados' music available.\n\n\n\nPatreon\n\n\n\nThis podcast is brought to you by the generosity of&nbsp;my backers on Patreon. Why not join them?\n\n\n\nTranscript\n\n\n\nWelcome to the third year of A History of Rock Music in 500 Songs, and welcome to the future! Although for this particular future we're actually going backwards a couple of months. This episode and the next one are both about records that were released a little before \"Love Me Do\", which the most recent episode covered, and that's something I should point out -- the podcast is never going to be absolutely chronological, and in this case it made sense to tell that story before these ones.\n\n\n\nBefore we start this episode, I need to give warnings for a whole lot of different things, because we're looking at one of the most tragic stories we'll see during the course of this podcast. This story contains discussion of occultism, severe mental illness, legalised homophobia, &nbsp;an unsolved probably homophobic murder, and a murder-suicide. I am going to try to deal with all those subjects as sensitively as possible, but if you might become distressed by hearing about those things, you might want to skip this episode, or at least read the transcript before listening.\n\n\n\nI also want to make something very clear right now -- this episode deals with a mentally ill man who commits a murder. He did not commit that murder *because* he was mentally ill. Mental illness is far more likely to make someone the victim of a crime than the perpetrator, and I have known many, many people who have had the same symptoms but who have not committed such awful acts. It is impossible to talk about the events in this episode without the risk of increasing stigma for mentally ill people, but I hope by saying this I can reduce that risk at least somewhat.\n\n\n\nToday we're going to look at the first British rock and roll record to make number one in the USA, and at the career of the first independent record producer and engineer in Britain. We're going to look at the sad life and tragic end of Joe Meek, and at \"Telstar\" by the Tornados:\n\n\n\n[Excerpt: The Tornados, \"Telstar\"]\n\n\n\nJoe Meek is someone who has become something of a legend among music lovers, and he's someone whose music is more talked about than listened to. People talk about him as a genius, but rather fewer of them explain what it was that he did that was so impressive. This is partly because, more than much of the music of the era, it requires context to appreciate. Meek was a producer above all else -- he had no real knowledge of music, and had no ear for singers. What Meek did know was sounds, and how to achieve sounds in t",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 101 of A History of Rock Music in Five Hundred Songs is the first one of the podcast's third year. This one looks at \"Telstar\" by the Tornados, and the tragic life of Joe Meek, Britain's first great pop auteur. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\nApologies for the lateness of this one -- my two-week break got extended when my computer broke down.\n\n\n\nPatreon backers also have a ten-minute bonus episode available, on \"Wipe Out\" by the Surfaris.\n\n\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt's irregular podcasts at&nbsp;http://www.podnose.com/jaffa-cakes-for-proust&nbsp;and&nbsp;http://sitcomclub.com/\n\n\n\n\n\nResources\n\n\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.&nbsp;\n\n\n\nMost of the information here comes from&nbsp;The Legendary Joe Meek: The Telstar Man by John Rep",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}