{
  "guid": "tag:blogger.com,1999:blog-2761684730989137546.post-473268161008398967",
  "pubDate": "Thu, 03 Nov 2022 16:14:00 +0000",
  "atom:updated": "2022-11-03T18:02:41.190-04:00",
  "title": "The Maritime Executive — Maersk Achieves Record Quarter While Warning of Recessionary Signals",
  "description": "<p></p><blockquote><i>”Our third quarter result was another record and the 16th quarter in a row with year-on-year earnings growth. Ocean freight rates, which have driven the exceptional results we have delivered in 2022, were again up both year-on-year and compared to the second quarter. However, it is clear that freight rates have peaked and started to normalize during the quarter, driven by both decreasing demand and easing of supply chain congestion,” said Søren Skou, CEO of A.P. Moller - Maersk.<br /><br />Elaborating on his comments, Skou told the Financial Times “every indicator we are looking at is flashing dark red.” He said that the shipping giant sees a recession looming that will confirm if the shipping industry has become more rational due to consolidation. He also points to Maersk’s decision to maintain its capacity in the 4.1 to 4.3 million TEU mark as opposed to competitors that placed large newbuild orders during the recent surge in shipping volumes.<br /><br />Given the unfolding economic slowdown, Maersk told shareholders that it has lowered its outlook for 2022 growth in global consumer demand....</i></blockquote>The Maritime Esecutive<br /><a href=\"https://www.maritime-executive.com/article/maersk-achieves-record-quarter-while-warning-of-recessionary-signals\">Maersk Achieves Record Quarter While Warning of Recessionary Signals</a><p><a href=\"https://www.maritime-executive.com/article/maersk-achieves-record-quarter-while-warning-of-recessionary-signals\"></a></p>",
  "link": "http://mikenormaneconomics.blogspot.com/2022/11/the-maritime-esecutive-maersk-achieves.html",
  "thr:total": 0,
  "author": "contrarianmedia@hotmail.com (Mike Norman)"
}