{
  "title": "Roger Waters Destroys CNN Host Over Ukraine & Taiwan",
  "itunes:title": "Roger Waters Destroys CNN Host Over Ukraine & Taiwan",
  "pubDate": "Fri, 12 Aug 2022 05:00:35 +0000",
  "guid": "0ba51412-6ade-4bac-a739-b4438ee7f713",
  "link": "https://thejimmydoreshow.libsyn.com/roger-waters-destroys-cnn-host-over-ukraine-taiwan",
  "itunes:image": "",
  "description": "<p>Pink Floyd founding member and outspoken activist Roger Waters appeared on CNN recently and took advantage of the opportunity to school host Michael Smerconish on a range of topics, including the truth about the Ukraine War’s origins, Russia’s role in winning World War II against the Nazis and Taiwan’s relationship to China.<br /> <br /> Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss Waters’ teachable moment and Smerconish’s phony-baloney claims to even-handedness.<br /> <br /> Plus segments on CBS News furiously backpedaling after mistakenly telling the truth about Ukraine and a California county sending police thousands of miles away to harass a small business owner as a favor for a wealthy friend of the sheriff.</p> <p dir=\"ltr\" data-test-bidi=\"\">Also featuring Stef Zamorano and Mike MacRae! And phone calls from Kevin Spacey and the duo of Chuck Schumer and Bernie Sanders!</p>",
  "content:encoded": "<p>Pink Floyd founding member and outspoken activist Roger Waters appeared on CNN recently and took advantage of the opportunity to school host Michael Smerconish on a range of topics, including the truth about the Ukraine War’s origins, Russia’s role in winning World War II against the Nazis and Taiwan’s relationship to China.  Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss Waters’ teachable moment and Smerconish’s phony-baloney claims to even-handedness.  Plus segments on CBS News furiously backpedaling after mistakenly telling the truth about Ukraine and a California county sending police thousands of miles away to harass a small business owner as a favor for a wealthy friend of the sheriff.</p> <p dir=\"ltr\" data-test-bidi=\"\">Also featuring Stef Zamorano and Mike MacRae! And phone calls from Kevin Spacey and the duo of Chuck Schumer and Bernie Sanders!</p>",
  "enclosure": "",
  "itunes:duration": "01:00:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Pink Floyd founding member and outspoken activist Roger Waters appeared on CNN recently and took advantage of the opportunity to school host Michael Smerconish on a range of topics, including the truth about the Ukraine War’s origins, Russia’s...",
  "itunes:episodeType": "full",
  "itunes:summary": "Pink Floyd founding member and outspoken activist Roger Waters appeared on CNN recently and took advantage of the opportunity to school host Michael Smerconish on a range of topics, including the truth about the Ukraine War’s origins, Russia’s role in winning World War II against the Nazis and Taiwan’s relationship to China. Jimmy and his panel of The Dive’s Jackson Hinkle and America’s comedian Kurt Metzger discuss Waters’ teachable moment and Smerconish’s phony-baloney claims to even-handedness. Plus segments on CBS News furiously backpedaling after mistakenly telling the truth about Ukraine and a California county sending police thousands of miles away to harass a small business owner as a favor for a wealthy friend of the sheriff. Also featuring Stef Zamorano and Mike MacRae! And phone calls from Kevin Spacey and the duo of Chuck Schumer and Bernie Sanders!"
}