{
  "title": "532: 'Fantastic Beasts: The Secrets of Dumbledore' Title, Release Date Analysis",
  "link": "https://audioboom.com/posts/7947559",
  "itunes:episode": 532,
  "itunes:title": "'Fantastic Beasts: The Secrets of Dumbledore' Title, Release Date Analysis",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3040,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>On this week's special episode of MuggleCast, we finally have some <em>Fantastic Beasts 3</em> news to discuss! The third entry in the <em>Fantastic Beasts</em> series will be titled, <a href=\"https://www.wizardingworld.com/news/fantastic-beasts-secrets-of-dumbledore-to-be-released-globally-april-2022\"><em>Fantastic Beasts: The Secrets of Dumbledore</em></a>! Also, a plot synopsis and new release date (April 15, 2022) are out! Join Andrew, Eric, Micah and Laura as they discuss their first impressions of the title, what specific \"secrets\" the title may be hinting at, and we hear from Slug Club-level Patrons listening live who have some great theories as well! <br>\n<br>\n\n</div>\n<ul>\n<li>Fantastic Beasts 3 will be titled, <em>The Secrets of Dumbledore.</em>\n</li>\n<li>The hosts all owe Andrew money. He has heavily speculated that \"Dumbledore\" would be in the title!</li>\n<li>Back on <a href=\"https://www.mugglecast.com/episode-442-harry-potter-screenwriter-returns-cursed-child-inside-look/\">MuggleCast 442</a>, the hosts each predicted the title of the movie in 2019, and some came close!</li>\n<li>What do we make of the title? Is this anything other than a money-motivated decision to get people to see the movie because it is called something \"Dumbledore\"?</li>\n<li>What does this mean for how prominent Dumbledore will be versus the Core Four and Grindelwald from previous movies?</li>\n<li>What could the \"secrets\" of Dumbledore be? Will it have to do with the Blood Pact, or Ariana perhaps?</li>\n<li>Will the secrets of Dumbledore be better explained than the crimes of Grindelwald in <em>Crimes of Grindelwald</em>?</li>\n<li>We discover that the film title shares a word with another Harry Potter movie! Will this be a trend?</li>\n<li>Andrew points out the huge visual <a href=\"https://twitter.com/MuggleCast/status/1440728508897001473?s=20\">difference in the size of both series titles</a> on their respective title cards. It's huge!</li>\n<li>The movie's synopsis includes phrases like \"intrepid explorers\" and \"Muggle baker\" - but otherwise is pretty vague.</li>\n<li>Are we still going to visit Rio de Janeiro in this movie?! Was the Brazil setting filmed exclusively at Leavesden?</li>\n<li>Quizzitch: Who is the main character of <em>Fantastic Beasts and Where to Find Them</em>? WRONG answers only! <a href=\"https://www.mugglecast.com/quizzitch/\">Submit your answer</a>!</li>\n<li>This week's episode is brought to you by MeUndies, makers of the most comfortable loungewear and underwear! Get 15% off and free shipping by going to <a href=\"http://www.meundies.com/mugglecast\">MeUndies.com/mugglecast</a>\n</li>\n</ul>\n",
  "pubDate": "Thu, 23 Sep 2021 17:14:13 +0000",
  "guid": "tag:audioboom.com,2021-09-23:/posts/7947559",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}