{
  "id": "https://bibleinoneyear.org/en/youth/247",
  "title": "Day 247: How Can You Be Useful to God?",
  "description": "Psalm 105:23–27, Isaiah 5:9,11, 6:1–2,5–8, 2 Corinthians 7:2–7,8–11. 7, AMP) However bleak things may appear, God always seems to raise up people who are instruments ‘for noble purposes… *useful* to the Master and prepared to do any good work’ (2 Timothy 2:21)",
  "pubDate": "Sat, 04 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/247/?ignore",
  "itunes:duration": "14:54",
  "guid": "enyouth04092021-247",
  "length": 894.09,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 247: How Can You Be Useful to God?",
  "itunes:subtitle": "Psalm 105:23–27, Isaiah 5:9,11, 6:1–2,5–8, 2 Corinthians 7:2–7,8–11. 7, AMP) However bleak things may appear, God always seems to raise up people who are instruments ‘for noble purposes… *useful* to the Master and prepared to do any good work’ (2 Timothy 2:21)",
  "itunes:summary": "Pippa and I had just returned home from the hospital. Earlier that day, my mother had died of a heart attack while at her desk at work. She was sixty-nine.\nI was in a state of shock and turmoil within. I wandered out of our home for a breath of fresh air and was thinking that the one person I really wanted to see was Sandy Millar – our pastor and friend.\nAt that moment, I looked up and recognised his car approaching. He had just heard our news and had driven straight round to see us. God used Sandy’s arrival that day to bring us great comfort and encouragement.\nIn today’s New Testament passage, we read that Titus’ arrival was used by God to bring Paul great comfort and encouragement when Paul was in a state of turmoil, exhaustion, oppression, affliction, dread and fear: ‘But God, who comforts and encourages and refreshes and cheers the depressed and the sinking, comforted and encouraged and refreshed and cheered us by the arrival of Titus’ (2 Corinthians 7:6, AMP).\nTitus’ arrival brought even further encouragement because he carried news of how the Corinthians were being useful to God. As a result, Paul ‘rejoiced still more’ (v.7, AMP).\nHowever bleak things may appear, God always seems to raise up people who are instruments ‘for noble purposes… useful to the Master and prepared to do any good work’ (2 Timothy 2:21). How can you and I be useful to God?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 247
}