{
  "title": "S1E65 - Getting Uncomfortable with Navy SEAL John Doolittle",
  "guid": "https://pinecast.com/guid/73ca03df-63b9-403e-b036-cfec6c64c70a",
  "pubDate": "Thu, 08 Sep 2022 07:30:00 -0000",
  "itunes:duration": "01:01:27",
  "description": "<p>Today, Laura welcomes John Doolittle, a retired Navy SEAL Captain and currently a certified KAATSU Master Specialist who serves as the Chief Revenue Officer of KAATSU Global. Laura and John open the conversation by talking about John’s swimming background and introduction to the Air Force Academy. Supported by his trusted mentor Mike, John decided to join the BUD/S training and become a Navy SEAL. Although the training was one of the most challenging and hardest periods of his life, it served as a great introduction to Navy life.</p>\n<p>From becoming a team player to developing mental toughness, John says this program taught him some of the most valuable lessons in life. He dives deep into the power of trust and how it can be applied in sports, too, not just in the military. He goes on to explain the importance of adopting the ‘never quit’ mindset, highlighting its very powerful and contagious nature. Laura and John also address mental health in sports and the military, pointing out the importance of having strong team support and adequate resources. Finally, John shares an inspiring story about his solo swim across the English Channel to raise money for the Navy SEAL Foundation. He offers an inspiring conclusion to this extraordinary episode by stressing that you can accomplish anything in life if you do it for a reason greater than yourself.</p>\n<p>Episode Highlights:</p>\n<ul>\n<li>John’s swimming background and introduction to the Air Force Academy</li>\n<li>Going from the Air Force Academy to the Navy</li>\n<li>The challenging journey of getting into the BUD/S class</li>\n<li>The three phases of BUD/S training</li>\n<li>Mental toughness vs. physical toughness</li>\n<li>Learning to be a team player</li>\n<li>Adopt a ‘never give up’ mentality</li>\n<li>The importance of trust in teamwork and relationships</li>\n<li>The power of little things</li>\n<li>Protecting the homeland after 9/11</li>\n<li>Pushing yourself without hitting the breaking point</li>\n<li>John’s solo swim across the English Channel to raise money for the Navy SEAL Foundation</li>\n</ul>\n<p>Quotes:</p>\n<ul>\n<li>“One of my biggest takeaways from my time in the teams was about relationships based on trust. And you know why - that starts with our parents, but it also starts with mentors.”</li>\n<li>“Everyone fails physically pretty quick. That first night, you go to failure on just about everything you do. But the mental piece is so important. And you learn very quickly, that when you thought your body was done, you actually do have more to give.”</li>\n<li>“You quickly learn at BUD/S training that if you're trying to do something as an individual, you will fail. There are very few things, even this swimming in BUD/S, you can't do it by yourself. Everybody has a swim buddy. And if the two of you fail, don't make the time, you both failed the swim.”</li>\n<li>“Part of the goal with that type of training is to identify those that when they get really uncomfortable, when they get really tired, they end up making decisions that maybe are not the best. And whether or not somebody is going to quit, you want to identify that pretty early on.”</li>\n<li>“'Never quit mindset' is very, very powerful and contagious to others on the team.”</li>\n<li>“When you're doing something really hard in life, try and find a way to do it for something that's bigger than yourself, it's bigger than you, to do it for a reason greater than yourself and you can do damn near anything.”</li>\n</ul>\n<p><a href=\"https://www.kaatsu.com/go/PURSUIT\" rel=\"nofollow\">Pursuit of Gold Podcast is brought to you by Kaatsu Global</a></p>\n<p>Links:\n<a href=\"http://thepursuitofgold.com/\" rel=\"nofollow\">The Pursuit of Gold</a>\n<a href=\"https://laurawilkinson.com/coaching\" rel=\"nofollow\">1-on-1 Coaching with Laura</a></p>\n<p>Laura’s Social Media:\n<a href=\"https://www.instagram.com/lala_the_diver\" rel=\"nofollow\">Laura’s Instagram</a>\n<a href=\"https://www.facebook.com/TheLauraWilkinson\" rel=\"nofollow\">Laura’s Facebook</a></p>\n<p>Connect with John:\n<a href=\"https://www.linkedin.com/in/john-doolittle/\" rel=\"nofollow\">John’s LinkedIn</a></p>",
  "itunes:title": "Getting Uncomfortable with Navy SEAL John Doolittle",
  "itunes:explicit": "no",
  "enclosure": "",
  "itunes:season": 1,
  "itunes:episode": 65
}