{
  "id": "yt:video:g7sCYN5C5po",
  "yt:videoId": "g7sCYN5C5po",
  "yt:channelId": "UC-NfY72l3Tn-c2qg0iHDUlQ",
  "title": "What Went Wrong? - CodeHatch",
  "link": "",
  "author": {
    "name": "WickedWiz",
    "uri": "https://www.youtube.com/channel/UC-NfY72l3Tn-c2qg0iHDUlQ"
  },
  "published": "2022-09-12T18:45:13+00:00",
  "updated": "2022-09-19T21:47:03+00:00",
  "media:group": {
    "media:title": "What Went Wrong? - CodeHatch",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Patreon → https://www.patreon.com/wickedwiz?fan_landing=true\nTwitter → https://twitter.com/WickedWizard15\nTwitch → https://www.twitch.tv/wickedwiz_twitch\n\nWhat Went Wrong with CodeHatch, Starforge, Reign of Kings and Heat? This is a \"short\" look into the portfolio of an indie development studio who has dropped the ball massively over the past decade. CodeHatch have been called many things, scammers, con-artists, but to me they seem incapable of making good decisions and have succeeded in abandoning every game besides Play Form: Human Dynamics.\n\nCodeHatch, failed the following projects.\n\nStarforge: This game had promise but only on paper, they boast a lot of experience in game development but none of it showed. Starforge released as an unforgivable, unforgettable and unfinished disaster that was so bad that it had to be taken off of Steam.\n\nReign of Kings: This was a fun game that a lot of people enjoyed, but was just abandoned. Left to waste by hackers due to how poorly built the game was. Reign of Kings could've been something if they stuck to it or sold it on.\n\nHeat: This game is what happens when you copy and paste a game, hoping for the same results. Typically unoptimized and barely playable to most. This game clearly shows that they prioritise looks over substance with \"better\" graphics. Failing to see that people just wanted another RoK, not Heat.\n\n0:00 - Intro\n1:30 - CodeHatch\n2:49 - Starforge Recap\n8:37 - Reign of Kings\n18:19 - Heat\n26:30 - Latest Game / Conclusion",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}