{
  "title": "Research on the impact of asteroid mining on global equity. (arXiv:2211.02023v1 [physics.soc-ph])",
  "link": "http://arxiv.org/abs/2211.02023",
  "description": "<p>In the future situation, aiming to seek more resources, human beings decided\nto march towards the mysterious and bright starry sky, which opened the era of\ngreat interstellar exploration. According to the Outer Space Treaty, any\nexploration of celestial bodies should be aimed at promoting global equality\nand for the benefit of all nations. Firstly, we defined global equity and set a\nUnified Equity Index (UEI) model to measure it. We merge the factors with\ngreater correlation, and finally, get 6 elements, and then use the entropy\nmethod (TEM) to find the dispersion of these elements in different countries.\nThen use principal component analysis (PCA) to reduce the dimensionality of the\ndispersion, and then use the scandalized index to obtain the global equity.\nSecondly, we simulated a future with asteroid mining and evaluated its impact\non Unified Equity Index (UEI). Then, we divided the mineable asteroids into\nthree classes with different mining difficulties and values, identified 28\nmining entities including private companies, national and international\norganizations. We considered changes in the asteroid classes, mining\ncapabilities and mining scales to determine the changes in the value of\nminerals mined between 2025 and 2085. We convert mining output value into\nmineral transaction value through allocation matrix. Based on grey relational\nanalysis (GRA). Finally, we presented three possible versions of the future of\nasteroid mining by changing the conditions. We propose two sets of\ncorresponding policies for changes in future trends in global fairness with\nasteroid mining. We test the separate and combined effects of these policies\nand find that they are positive, strongly supporting the effectiveness of our\nmodel.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/physics/1/au:+Sun_H/0/1/0/all/0/1\">He Sun</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Zhu_J/0/1/0/all/0/1\">Junfeng Zhu</a>, <a href=\"http://arxiv.org/find/physics/1/au:+Xu_Y/0/1/0/all/0/1\">Yipeng Xu</a>"
}