{
  "title": "S13 Ep73: Golden State Killer: It's Not Over (Or Is It?)",
  "link": "https://audioboom.com/posts/8098702",
  "itunes:episode": 73,
  "itunes:title": "Golden State Killer: It's Not Over (Or Is It?)",
  "itunes:season": 13,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 6561,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "True Crime Tuesday digs into the case of The Golden State Killer: It's Not Over with <a href=\"http://TrueCrimeGuy.com\">TrueCrimeGuy.com</a> Mike Morford! <br>\nAt the time this originally aired on True Crime Tuesday, He could have still been out there, somewhere. The notorious Golden State Killer, also known as the East Area Rapist and Original Night Stalker is believed to have murdered 12 people, committed 45 sexual assaults, and robbed 120 residences in the span of 10 years.<br>\nHe was one of the most feared name in the Pacific Northwest from 1976 to 1986 — and police, detectives, and the FBI had yet to catch the notorious killer. In fact, despite having a DNA profile that links his crimes, he was still at large.<br>\nBut, Police believe they now have the killer in custody!  Listen to this recap of the profile of the Golden State Killer with Mike Morford, then head over to Patreon and subscribe to True Crime Tuesday to get the update on him from Mike!<br>\n<br>\nPlus on this episode: Dumb Crimes and Stupid Criminals!<br>\n<br>\nWant more great true crime episodes like this?  Get them now at  <a href=\"https://www.patreon.com/truecrimetuesday\">https://www.patreon.com/truecrimetuesday</a>",
  "itunes:summary": "True Crime Tuesday digs into the case of The Golden State Killer: It's Not Over with TrueCrimeGuy.com Mike Morford! \nAt the time this originally aired on True Crime Tuesday, He could have still been out there, somewhere. The notorious...",
  "pubDate": "Tue, 01 May 2018 08:00:00 +0000",
  "guid": "a7ec6267-1232-4af2-9f34-65d1c492d1cf",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}