{
  "title": "China buys up US technology to keep tabs on its citizens",
  "description": "The technology helps monitor groups and censor material in places such as the Xinjiang Uyghur Autonomous Region.",
  "link": "https://www.rfa.org/english/news/china/china-us-technology-11042022021211.html",
  "guid": "https://www.rfa.org/english/news/china/china-us-technology-11042022021211.html",
  "author": "By RFA Staff",
  "media:content": {
    "media:description": "Pedestrians walk on an overpass near a surveillance camera overlooking a street in Beijing, Dec. 14, 2021.",
    "media:credit": "Reuters/Carlos Garcia Rawlins"
  },
  "content:encoded": "\n        <p><strong>Updated at 12:45 p.m. EDT on 11-4-2022</strong></p>\n<p><span style=\"font-weight: 400;\">Chinese public security entities have been acquiring U.S. technology with the transfers becoming increasingly regular, especially of DNA analysis equipment needed for mass surveillance, a new report has found.</span></p>\n<p><a href=\"https://www.recordedfuture.com/the-role-of-us-technology-in-china-public-security-system\"><span style=\"font-weight: 400;\">\"The Role of US Technology in China's Public Security System\"</span></a><span style=\"font-weight: 400;\"> by the U.S. intelligence and security research group <span>Recorded Future</span> revealed the sweeping extent of technology transfers from U.S. companies to Chinese companies to be used by the public security apparatus, including in the Xinjiang Uyghur Autonomous Region.</span></p>\n<p><span style=\"font-weight: 400;\">From DNA analysis to thermal imaging, from data storage to digital forensics and cyber security, a vast range of U.S. technology has been transferred to the Chinese public security system. </span></p>\n<p><span style=\"font-weight: 400;\">Surveillance and counter-surveillance are among the main focuses of the technology transfers, the report said.</span></p>\n<p><span style=\"font-weight: 400;\">“In some cases, public security entities in China almost certainly seek technology from U.S. companies because foreign products outperform domestic equivalents,” it said.</span></p>\n<p><span style=\"font-weight: 400;\">In other cases, the technology was acquired “to ensure compatibility” as it had already been used by Chinese organizations.</span></p>\n<p><span style=\"font-weight: 400;\">According to the report, public security entities in the Xinjiang Uyghur Autonomous Region “appear to have purchased at least 481 hard disk drives from Seagate and Western Digital” in early-to-mid 2022, including surveillance-specialized drives and drives acquired alongside equipment from China’s leading surveillance providers. </span></p>\n<p><span style=\"font-weight: 400;\">Both Seagate Technology Holdings and Western Digital Corporation are well-known American data storage companies.</span></p>\n<p><span style=\"font-weight: 400;\">“Other entities in Xinjiang, such as prisons belonging to the paramilitary Xinjiang Production and Construction Corps, have also recently carried out surveillance-oriented purchases of Seagate or Western Digital hard disk drives,” it said.</span></p>\n<p><a href=\"https://www.top10vpn.com/assets/2021/07/Chinas-Surveillance-State.pdf\"><span style=\"font-weight: 400;\">Another report</span></a><span style=\"font-weight: 400;\"> released last year also said U.S. technology companies were supplying China’s surveillance state with equipment and software for monitoring populations and censoring information, including in Xinjiang.</span></p>\n<p><span style=\"font-weight: 400;\">Western governments and human rights groups have condemned Beijing for </span><span style=\"font-weight: 400;\">surveillance and other abusive policies against the 12 million Muslim Uyghurs in the region, which they said </span><span style=\"font-weight: 400;\">amounted to genocide and crimes against humanity. China has repeatedly denied the allegations.</span></p>\n<p></p>\n<figure><img alt=\"Xinjiang.jpg\" class=\"image-richtext image-inline\" src=\"https://www.rfa.org/english/news/china/xinjiang.jpg/@@images/2c78233b-10cd-4056-973b-bb47d1696799.jpeg\" title=\"Xinjiang.jpg\"/>\n<figcaption>The Chinese flag behind razor wire at a housing compound in Yangisar, south of Kashgar, in China's western Xinjiang region, in a photograph taken on June 4, 2019. <br/>CREDIT: Greg Baker/AFP</figcaption>\n </figure>\n<p><b>‘Extremely common transfers’</b></p>\n<p><span style=\"font-weight: 400;\">“When I started the research, I did not expect these technology transfers to be so prevalent,” said report author Zoe Haver.</span></p>\n<p><span style=\"font-weight: 400;\">She began the project by looking at transfers of counter-surveillance devices used by the U.S. military and U.S. law enforcement, but during the process she found that Chinese public security entities were purchasing U.S. technology for use in many other areas, such as aviation, DNA analysis, thermal imaging, optics, surveillance, cybersecurity, network infrastructure, and data storage.</span></p>\n<p><span style=\"font-weight: 400;\">“With some of the technologies that I was tracking, such as DNA analysis equipment, I observed new purchases on pretty much a day-to-day basis. These transfers are extremely common across China,” she told RFA.</span></p>\n<p><span style=\"font-weight: 400;\">The Chinese public security apparatus has been seeking DNA analysis equipment, with the reliance on U.S. technology in this area “most notable,” according to the analyst.</span></p>\n<p><span style=\"font-weight: 400;\">“This equipment can potentially be used to help build population databases and carry out mass surveillance,” Haver said.</span></p>\n<p><span style=\"font-weight: 400;\">Entities belonging to the powerful Ministry of Public Security (MPS) have been acquiring U.S. technology via legal channels at industry exhibitions, third-party agents and distributors, and even from U.S. companies’ local subsidiaries in China.</span></p>\n<p><span style=\"font-weight: 400;\">Recently more and more U.S. firms have been bought by Chinese companies and this has “aided the growth of China’s domestic industries and facilitated sales of U.S. products to public security end users,” according to the report.</span></p>\n<p><span style=\"font-weight: 400;\">Another factor is the cross-border flows of talent that have become increasingly common in the era of globalization.</span></p>\n<p><b>U.S. control response</b></p>\n<p><span style=\"font-weight: 400;\">Haver compiled the report by sifting through thousands of public Chinese government procurement records and she said that she was struck by the sheer number of procurement documents.</span></p>\n<p><span style=\"font-weight: 400;\">In response to the state violence that Chinese public security entities carry out, particularly in Xinjiang, the U.S. government has taken some steps in recent years to restrict the transfer of U.S. technology to them.</span></p>\n<p><span style=\"font-weight: 400;\">The Export Control Reform Act of 2018 referred to items that have law enforcement-related applications and stipulated that “the U.S. export control policy should serve to protect human rights.”</span></p>\n<p><span style=\"font-weight: 400;\">In 2019 and 2020, the U.S. Department of Commerce Bureau of Industry and Security placed 21 Chinese public security entities (in addition to various Chinese companies) on an export licensing restrictions list.</span></p>\n<p><span style=\"font-weight: 400;\">But Recorded Future report raised the question of “the efficacy of current U.S. export control measures that target Chinese public security entities and the Chinese companies that support them.”</span></p>\n<p><span style=\"font-weight: 400;\">“As third-party distributors and agents play such a prominent role in the technology transfer process, the U.S. government may find it difficult to implement effective export restrictions,” Haver told RFA.</span><span style=\"font-weight: 400;\"></span></p>\n<p><strong>This story has been updated to clarify the attribution of the research report. </strong></p>\n        ",
  "pubDate": "Fri, 04 Nov 2022 02:21:00 -0400"
}