{
  "id": "tag:blogger.com,1999:blog-10004977.post-120946946850229578",
  "published": "2022-11-02T08:26:00.004-04:00",
  "updated": "2022-11-02T08:26:40.406-04:00",
  "title": "ADP: Private Employment Increased 239,000 in October",
  "content": "From ADP: <a href=\"https://adp-ri-nrip-static.adp.com/artifacts/us_ner/20221102/ADP_NATIONAL_EMPLOYMENT_REPORT_Press_Release_2022_10%20FINAL.pdf\">ADP National Employment Report: Private Sector Employment Increased by 239,000 Jobs in October; Annual Pay was Up 7.7%</a><blockquote><b>Private sector employment increased by 239,000 jobs in October</b> and annual pay was up 7.7 percent year-over-year, according to the October ADP® National  Employment ReportTM produced by the ADP Research Institute® in collaboration with the Stanford Digital  Economy Lab (“Stanford Lab”).<br /><br />The jobs report and pay insights use ADP’s fine-grained anonymized and aggregated payroll data of over  25 million U.S. employees to provide a representative picture of the labor market. The report details the  current month’s total private employment change, and weekly job data from the previous month. ADP’s  pay measure uniquely captures the earnings of a cohort of almost 10 million employees over a 12-month  period.<br /><br />“This is a really strong number given the maturity of the economic recovery but the hiring was not broad based,” said Nela Richardson, chief economist, ADP. “Goods producers, which are sensitive to interest  rates, are pulling back, and job changers are commanding smaller pay gains. While we’re seeing early  signs of Fed-driven demand destruction, it’s affecting only certain sectors of the labor market.” <br /><span style=\"font-size: x-small;\">emphasis added</span></blockquote>This was above the consensus forecast of 200,000.&nbsp; The BLS report will be released Friday, and the consensus is for 2o0 thousand non-farm payroll jobs added in October.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Calculated Risk",
    "uri": "http://www.blogger.com/profile/08664541332908374389",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}