{
  "id": "yt:video:05nDoxdSzwY",
  "yt:videoId": "05nDoxdSzwY",
  "yt:channelId": "UCLXo7UDZvByw2ixzpQCufnA",
  "title": "How do we fix the zoo?",
  "link": "",
  "author": {
    "name": "Vox",
    "uri": "https://www.youtube.com/channel/UCLXo7UDZvByw2ixzpQCufnA"
  },
  "published": "2022-10-20T12:00:01+00:00",
  "updated": "2022-10-29T11:45:50+00:00",
  "media:group": {
    "media:title": "How do we fix the zoo?",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Do the benefits of zoos justify the fact that some animals are clearly stressed out?\n\nSubscribe and turn on notifications 🔔  so you don't miss any videos: http://goo.gl/0bsAjO \n\nMany of us have fond memories of visiting the zoo as a child (or at any age), and more than a few of us probably credit those visits with turning us into animal-lovers. So, how should we square those warm fuzzy feelings with research that shows the psychological harms of captivity for some animals? \n\nThat’s what Vox subscriber Gaurav Patil wanted to know, so producer Liz Scheltens started digging in. One way that zoos maintain their social license to operate despite our growing understanding of the harms to certain species is by marketing themselves as beacons of conservation. \n\nProponents argue that not only do zoos help preserve endangered wild populations, they also help make humans better conservationists. But when you look at the research, a different picture starts to emerge. \n\nCheck out the video above to learn more.\n\nNote: The headline on this piece has been updated.\nPrevious headline: Are zoos... bad?\n\nTo submit your on-video question like Gaurav’s follow this link to our submissions form: https://forms.gle/ATu6kYgKNaEXSr3UA \n\nThanks so much to Gaurav for his thoughtful question. Check out his YouTube channel, ECOnnect for videos about humans and nature: https://www.youtube.com/c/ECOnnectYouTube\n\nAn excerpt from writer Emma Marris’ book Wild Souls was published in the New York Times Magazine: https://www.nytimes.com/2021/06/11/opinion/zoos-animal-cruelty.html \n\nConservation psychologist Susan Clayton and two of her colleagues wrote a response the excerpt of Emma’s book, you can read it here: https://www.nytimes.com/2021/07/03/opinion/letters/zoos-animals.html \n\nSusan Clayton writes about the social benefits of zoos: https://humansandnature.org/learning-to-care-about-animal-conservation/ \n\nIf you want to learn more about animal cognition, I highly recommend Frans De Waal’s book Are We Smart Enough to Know how Smart Animals are? https://wwnorton.com/books/Are-We-Smart-Enough-to-Know-How-Smart-Animals-Are/\n\nThe idea of the “circle of empathy” comes from philosopher Peter Singer, who uses the slightly more academic, “circle of moral concern” to describe the same phenomenon in his book The Expanding Circle: Ethics, Evolution, and Moral Progress: https://press.princeton.edu/books/paperback/9780691150697/the-expanding-circle \n\nResearch from the World Association of Zoos and Aquariums on zoo visitor’s self-reported actions to save animals species: https://www.researchgate.net/publication/266444881_A_Global_Evaluation_of_Biodiversity_Literacy_in_Zoo_and_Aquarium_Visitors \n\nCheck out the saga of Happy, an elephant at the Bronx Zoo whose legal team is attempting to have her moved to an elephant sanctuary on the grounds that her captivity violates the legal right not to be detained without cause: https://time.com/6107549/happy-elephant-lawsuit-bronx-zoo/ \n\nMake sure you never miss behind the scenes content in the Vox Video newsletter, sign up here: http://vox.com/video-newsletter\n\nVox.com is a news website that helps you cut through the noise and understand what's really driving the events in the headlines. Check out http://www.vox.com\n\nSupport Vox's reporting with a one-time or recurring contribution: http://vox.com/contribute-now\n\nShop the Vox merch store: http://vox.com/store\n\nWatch our full video catalog: http://goo.gl/IZONyE\n\nFollow Vox on Facebook: http://facebook.com/vox\nFollow Vox on Twitter: http://twitter.com/voxdotcom\nFollow Vox on TikTok: http://tiktok.com/@voxdotcom",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}