{
  "title": "2.5 Leaving Babylon III: The Enigma of Zerubbabel and Joshua",
  "itunes:title": "Leaving Babylon III: The Enigma of Zerubbabel and Joshua",
  "pubDate": "Sun, 17 Sep 2017 06:00:00 +0000",
  "guid": "d5465659504f2b55827b7039b7318300",
  "link": "https://historyinthebible.libsyn.com/25-leaving-babylon-iii-the-enigma-of-zerubbabel-and-joshua",
  "itunes:image": "",
  "description": "<p>After Sheshbazzar's failure, the second wave of returnees are led by the enigmatic figures of the supposed Davidic king Zerubbabel and the high-priest Joshua. Those returning spurn those who stayed behind, implying that the only real Jews are those who were exiled. Zerubbabel inexplicably disappears from the narrative at the moment of his triumph. The book of Esdras Alpha rehabilitates him.<br /> <br /> The prophets Haggai and Zechariah are sources for the period. Zechariah writes the first apocalypse. I finish with the puny prophet Joel, who turns plowshares into swords, and pruning hooks into spears.</p>",
  "content:encoded": "<p>After Sheshbazzar's failure, the second wave of returnees are led by the enigmatic figures of the supposed Davidic king Zerubbabel and the high-priest Joshua. Those returning spurn those who stayed behind, implying that the only real Jews are those who were exiled. Zerubbabel inexplicably disappears from the narrative at the moment of his triumph. The book of Esdras Alpha rehabilitates him.  The prophets Haggai and Zechariah are sources for the period. Zechariah writes the first apocalypse. I finish with the puny prophet Joel, who turns plowshares into swords, and pruning hooks into spears.</p>",
  "enclosure": "",
  "itunes:duration": "30:58",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "The mysterious histories of Zerubbabel and the high-priest Joshua, as told by the prophets Haggai and Zechariah, and that pissant prophet Joel",
  "itunes:season": 2,
  "itunes:episode": 5,
  "itunes:episodeType": "full",
  "itunes:author": "Garry Stevens"
}