{
  "title": "Democratizing Data Intelligence for All",
  "link": "https://medium.com/adatao-narratives/democratizing-data-intelligence-for-all-d2411f645f0d?source=rss-b0cd2903e078------2",
  "guid": "https://medium.com/p/d2411f645f0d",
  "category": [
    "machine-learning",
    "big-data",
    "big-apps"
  ],
  "dc:creator": "Christopher Nguyen",
  "pubDate": "Sat, 02 May 2015 03:04:57 GMT",
  "atom:updated": "2016-02-22T05:47:20.416Z",
  "content:encoded": "<h4>A Major Progress Report</h4><p><em>April 30th, 2015 (</em><a href=\"http://arimo.com/blog/\"><em>Originally published at http://arimo.com/blog/</em></a><em>)</em></p><p>Just as accessibility of the automobile transformed our mobility in the the 20th century, accessibility of data intelligence will transform our minds in the 21st. Over the next 10 years, machine learning is going to be pervasively present in our everyday lives.</p><p>For the past decade, the Big Data conversation has been about HDFS, MapReduce, monads and monoids. Today, we are changing the conversation, from bottom-up to top-down.</p><p>I’m excited to announce the general availability of the <em>Arimo Data Intelligence Platform</em>. The platform comprises of a set of web applications that combine beautiful, consumer-grade user experience with enterprise-grade power and sophistication, for both business users and data scientists. Just as the iPhone democratized the mobile Internet, Arimo Apps are here to democratize data intelligence.</p><h3>An Evolutionary Perspective</h3><p>Twelve years ago, Sanjay Ghemawat et al. published the seminal paper on Google’s distributed filesystem, GFS, that enabled the company to store multiple copies of the entire Internet on inexpensive commodity hardware. A year later, Jeff Dean et al. revealed details of Google’s implementation of MapReduce, the Big-Compute engine that scaled to process all this data. Soon, Hadoop was launched by Doug Cutting, and in 2009, MapR and Cloudera were born to provide commercial support for it. About the same time, Matei Zaharia began work at the Berkeley AMPLab on what became <a href=\"http://adatao.com/why-how-adatao-bet-on-apache-spark/\">Apache Spark</a>, a fast in-memory Big-Compute engine on top of Big-Data storage.</p><p>When we started Arimo with a focus on Big Data and Machine Learning, we knew that Big Compute on Big Data were not enough. We wanted to create the missing Big Apps layer to have all the power and sophistication of big data and machine learning, but also connect all this to human users, with beautiful user experiences. While Steve Jobs’s iPhone was far from being the first mobile phone, it completely changed the conversation from technology to user experience, from bottom-up to top-down, from power to productivity.</p><h3>The Arimo Data Intelligence Platform (ADIP)</h3><p>The <strong>Arimo Data Intelligence Platform</strong> (ADIP) is an execution milestone. It comprises three key components: <strong>(1)</strong> <strong>Arimo</strong> <strong>Apps:</strong> user-facing applications with Google-Docs-like ease of use, yet with the predictive power and sophistication of a state-of-the-art Big Data systems <strong>(2)</strong> <strong>Arimo AppBuilder: </strong>a toolset that allows you to easily build your own custom applications using our patent-pending SmartQuery technology and application templates, and <strong>(3) Arimo PredictiveEngine:</strong> a powerful, distributed server with sophisticated algorithms that scale to petabytes on top of virtually any data source.</p><blockquote>The familiarity of office productivity tools</blockquote><p>If you are in Sales, Marketing or HR, you will experience the familiarity of office productivity tools and be able to ask questions of huge amounts of data without dependence on IT. Arimo Apps blend the simplicity and ease of a consumer application, with the power of Big Compute.</p><blockquote>Use the same languages, directly on all of your data</blockquote><p>If you are a data scientist familiar with R, Python or SQL, you continue to use the same languages, directly on all of your data and not just a sample, then easily share your analyses with a single URL. Arimo helps you eliminate the barriers between advanced analytics and large datasets, between building and deploying models, and facilitates collaboration with your business counterparts.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*oIHoG7YmJjkOUPvCLKIEmQ.png\" /><figcaption>The overview of Adatao Data Intelligence Platform</figcaption></figure><p>Arimo’s Data Intelligence Platform can be deployed on-premise or in the AWS cloud. Arimo has partnered with Databricks, the team that created and continues to drive <a href=\"https://spark.apache.org\">Apache Spark</a>, to provide fully managed Spark clusters, enabling an end-to-end integrated stack for our end users. Arimo has also partnered with Altiscale, the leading Hadoop-as-a-Service provider, to offer an end-to-end Big Data stack to our customers.</p><h3>Our Product Philosophy</h3><p>Our product philosophy is based on three key pillars:</p><ul><li><strong>Natural Interfaces</strong> — Instead of having to deal with clumsy interfaces and stodgy database concepts, business users simply ask questions with Arimo SmartQuery, “How much would revenue change if marketing spend rises by 1%?”, without the need for programming skills.</li><li><strong>Collaboration</strong> — Can you imagine a SWAT team planning a mission by email? Then why would you accept running your hyper-competitive, data-driven business that way? Business users and data scientists collaborate on the same data, at the same time, using tools and languages familiar to them: plain English, R, Python, SQL, Java, or Scala.</li><li><strong>Machine Learning </strong>— Instead of putting Machine Learning (ML) on some intimidating pedestal far removed from business users, Arimo applications are built with inherent predictive capabilities to bring the real value of Big Data to all users. We are at an inflection point in the intelligence of our computing systems; now ML is to software what software was to machines.</li></ul><h3>So why Natural Interfaces, Collaboration, and Machine Learning?</h3><p>Huge end-user value will be realized when the power of Big Data systems is intuitively accessible, through natural human interfaces. And as users of Google Apps testify, when people with diverse skills collaborate in the same space on the same data at the same time, time-to-decision is shortened and team productivity is boosted by 10x-100x.</p><p>The real reason for Big Data is Machine Learning. Big data has existed for a long time, but now data is retained so that our algorithms can automatically learn from them and do useful, intelligent things. ML will become an inherent property in all the tools and devices in our lives. We will demand all of our software and devices to be intelligent enablers for us, through learning from data.</p><p>Today, I welcome you to try the Arimo Data Intelligence Platform and experience the power and ease of use of Natural Interfaces, Collaboration, and Machine Learning in your everyday workflows with your colleagues and friends.</p><p><em>To learn more, please visit </em><a href=\"http://arimo.com/products/\"><em>our product page</em></a><em>.</em></p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=d2411f645f0d\" width=\"1\" height=\"1\" alt=\"\"><hr><p><a href=\"https://medium.com/adatao-narratives/democratizing-data-intelligence-for-all-d2411f645f0d\">Democratizing Data Intelligence for All</a> was originally published in <a href=\"https://medium.com/adatao-narratives\">Arimo Narratives™</a> on Medium, where people are continuing the conversation by highlighting and responding to this story.</p>"
}