{
  "id": "yt:video:YepjMuSdB2M",
  "yt:videoId": "YepjMuSdB2M",
  "yt:channelId": "UCUk0AvSMU5CJ0wUqJf9TX8g",
  "title": "“Of Boys And Men” with Richard Reeves",
  "link": "",
  "author": {
    "name": "Coleman Hughes",
    "uri": "https://www.youtube.com/channel/UCUk0AvSMU5CJ0wUqJf9TX8g"
  },
  "published": "2022-09-23T20:00:10+00:00",
  "updated": "2022-10-01T22:41:50+00:00",
  "media:group": {
    "media:title": "“Of Boys And Men” with Richard Reeves",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "My guest today is Richard Reeves. Richard Reeves is a Senior Fellow in economic studies at the Brookings Institute, where His research focuses on social mobility, inequality, and the middle class. Richard's new book is called \"Of Boys and Men\" and it's all about the specific problems facing men in American society.\n\nIn this episode, Richard and I talk about whether there's any need to address male-specific problems in the first place. We discuss whether gender differences come from nature or nurture. We talk about the so-called feminization of society. We talk about the advantage that girls have in our education system, the wisdom of age segregation in K-12 schooling, the gender disparity and ADHD diagnoses, how the labor market has become less male-friendly, the suicide gap between men and women, the intersection of race and maleness, the unique struggles of black boys, and much more.\n\n#Ad\nIf you’re hiring, you need Indeed. Because Indeed is the hiring partner where you can Attract, Interview, and Hire all in one place. Indeed partners with you on every step of the hiring process. Find great talent through time-saving tools like Indeed Instant Match, Assessments, and Virtual Interviews.  With Instant Match, over 80% of employers get quality candidates, whose resume on Indeed matches their job description, the moment they sponsor a job, according to Indeed data, US. Candidates you invite to apply through Instant Match are 3X more likely to apply to your job than candidates who only see it in search.\nJoin more than three million worldwide that use INDEED to hire great talent fast. \nVisit https://www.indeed.com/CONVERSATIONS to start hiring now\nTerms and conditions apply.\n\n#ColemanUnfiltered\nColeman Unfiltered addresses topics that have been on mute through the ages with silent shifts into polarities, by relentless questioning and observations in coordination with some of the brightest intellectuals of our generation.\nThe Unfiltered Community is an ode to the fans; an environment promoting sound tolerance of ideas to solidify the meaning of liberalism in a changing world.\nIt’s a concrete effort to have open, honest conversations on the most difficult social and political issues we’re surrounded with.\nFor in-depth discussions, unaired/unseen episodes, and bonus content on Conversations With Coleman, participate via a membership and gain access to raw, powerful human ideology. \nWelcome to the new age’s most original intellectual revolution; let’s change the world, one conversation at a time.\nSign up Today  - https://bit.ly/3B1GAlS\n\n\nCheck out Richard's New Book: \"Of Boys and Men\" - https://amzn.to/3R2lZE4\n\n\nFOLLOW COLEMAN\n\nYouTube - http://bit.ly/38kzium \nConversations with Coleman - Spanish Channel: https://bit.ly/CwCSpanish\nTwitter - http://bit.ly/2rbAJue \nFacebook - http://bit.ly/2LiAXH3 \nInstagram - http://bit.ly/2SDGo6o \nPodcast -https://bit.ly/3oQvNUL \nWebsite - https://colemanhughes.org/ \nLimited Edition Merch - https://bit.ly/CWCMerch",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}