{
  "title": "Albert Gonzalez, Part 2",
  "link": "https://malicious.life/albert-gonzalez-part-2/",
  "pubDate": "Wed, 07 Jul 2021 07:04:42 +0000",
  "guid": "https://malicious.life/?p=1334",
  "comments": "https://malicious.life/albert-gonzalez-part-2/#respond",
  "wfw:commentRss": "https://malicious.life/albert-gonzalez-part-2/feed/",
  "slash:comments": 0,
  "category": "Uncategorized",
  "description": "Working with the Secret Service, Albert Gonzalez was outstanding. He was such a good employee, in fact, that they had him do seminars, and speak at government conferences. At one point he met personally with the then Director of the Secret Service. Albert gave a presentation, and got to shake the man’s hand. \nIt’s a remarkable redemption story, you’d have to say. There was just one caveat. You see, Albert Gonzalez went from stealing millions of credit cards to quarterbacking the largest cyber crime bust in U.S history. And then? He went back to the Dark Side.",
  "content:encoded": "\n<hr class=\"wp-block-separator\"/>\n\n\n\n<p>Working with the Secret Service, Albert Gonzalez was outstanding. He was such a good employee, in fact, that they had him do seminars, and speak at government conferences. At one point he met personally with the then Director of the Secret Service. Albert gave a presentation, and got to shake the man’s hand. <br>It’s a remarkable redemption story, you’d have to say. There was just one caveat. You see, Albert Gonzalez went from stealing millions of credit cards to quarterbacking the largest cyber crime bust in U.S history. And then? He went back to the Dark Side.</p>\n",
  "enclosure": "",
  "itunes:subtitle": "Working with the Secret Service, Albert Gonzalez was outstanding. He was such a good employee, in fact, that they had him do seminars, and speak at government conferences. At one point he met personally with the then Director of the Secret Service.",
  "itunes:summary": "Working with the Secret Service, Albert Gonzalez was outstanding. He was such a good employee, in fact, that they had him do seminars, and speak at government conferences. At one point he met personally with the then Director of the Secret Service. Albert gave a presentation, and got to shake the man’s hand. <br />\nIt’s a remarkable redemption story, you’d have to say. There was just one caveat. You see, Albert Gonzalez went from stealing millions of credit cards to quarterbacking the largest cyber crime bust in U.S history. And then? He went back to the Dark Side.",
  "itunes:author": "Cybereason",
  "itunes:image": "",
  "itunes:duration": "37:26"
}