{
  "title": "85: How to Activate Your Multi-Sensory Learning",
  "pubDate": "Mon, 26 Nov 2018 14:00:00 +0000",
  "guid": "ceb4bbda4d7540b384f6590e5db2ab8c",
  "link": "https://sites.libsyn.com/94610/85-how-to-activate-your-multi-sensory-learning",
  "itunes:image": "",
  "description": "<p>How do you become a multi-sensory learner?<br /> <br /> You may be asking, “what is a multi-sensory learner? Is it going to help me with my focus? Is it going to help me retain information better? Is it going to make me a creative thinker?” And my answer is astounding, YES.<br /> <br /> Multi-sensory learning is the idea that individuals learn better if you were taught using more than one of your senses.<br /> <br /> When it comes to learning, the more senses you stimulate, the more you’re able to learn and attain new knowledge.<br /> <br /> In this episode, I’m going to share with you different learning styles and how you can apply them into remembering abstract concepts like numbers.<br /> <br /> ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "content:encoded": "<p>How do you become a multi-sensory learner?  You may be asking, “what is a multi-sensory learner? Is it going to help me with my focus? Is it going to help me retain information better? Is it going to make me a creative thinker?” And my answer is astounding, YES.  Multi-sensory learning is the idea that individuals learn better if you were taught using more than one of your senses.  When it comes to learning, the more senses you stimulate, the more you’re able to learn and attain new knowledge.  In this episode, I’m going to share with you different learning styles and how you can apply them into remembering abstract concepts like numbers.  ** Do you want to stay up to date with every new episode and get my brand new Kwik Brain Accelerator Program? Go to www.KwikBrain.com/podcast to get instant access. **</p>",
  "enclosure": "",
  "itunes:duration": "19:40",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "How do you become a multi-sensory learner?  You may be asking, “what is a multi-sensory learner? Is it going to help me with my focus? Is it going to help me retain information better? Is it going to make me a creative thinker?” And my answer is...",
  "itunes:episodeType": "full"
}