{
  "title": "Ford, Ford Fund Prepare Disaster Relief Response to Hurricane Ian",
  "link": "https://media.ford.com/content/fordmedia/fna/us/en/news/2022/09/30/ford--ford-fund-prepare-disaster-relief-response-to-hurricane-ia.html",
  "description": "In the wake of devastation caused by Hurricane Ian in Florida, Ford, Ford Pro, and Ford Fund are working closely with emergency response organizations, nonprofit partners, local Ford dealers and regional team members to deliver support to communities in need.  \n\nFord and Ford Fund have already taken the following actions: \n&#8226;\tActivated emergency response plan, including contacting Ford employees, Ford dealers and those within our network, helping transport people to Salvation Army pop-up shelters. \n&#8226;\tFord Fund is donating $1M to be distributed to the American Red Cross, Team Rubicon, ToolBank USA , World Central Kitchen and local foodbanks. Each nonprofit specializes in disaster relief efforts and is already on the ground in the area providing meals, shelter and assisting with the clearing of roads for emergency personnel. \n&#8226;\tDeploying and loaning F-150 PowerBoost Hybrid and F-150 Lightning vehicles, plus Transit and E-Transit vehicles for nonprofits to use and power their relief efforts. \n\nMore About Hurricane Ian and How You Can Help \nHurricane Ian has devastated communities in its path, leaving thousands homeless and millions without power. As the storm approaches Georgia and the Carolinas high winds and flooding are now expected.  \nFor those interested in helping recovery efforts, monetary donations are encouraged to any of the nonprofits listed above. Ford Fund is also exploring additional employee volunteer opportunities as well as collections and drives for food, clothing and other essentials.",
  "guid": "https://media.ford.com/content/fordmedia/fna/us/en/news/2022/09/30/ford--ford-fund-prepare-disaster-relief-response-to-hurricane-ia.html",
  "pubDate": "Fri, 30 Sep 2022 10:00:00",
  "heroImage": "https://media.ford.com/content/fordmedia/fna/us/en/news/2022/09/30/ford--ford-fund-prepare-disaster-relief-response-to-hurricane-ia/_jcr_content/image.img.306.172.jpeg/1664898056408.jpeg"
}