{
  "title": "#464: Dumbledore Gone Wild (OOTP 27, The Centaur and The Sneak)",
  "link": "https://audioboom.com/posts/7574536",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 5400,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>JKR commemorates the anniversary of the Battle of Hogwarts (<a href=\"https://twitter.com/jk_rowling/status/1256146109845639185\">and responds to MuggleCast on Twitter</a>!)</li>\n<li>The MuggleCast 15th Anniversary T-Shirt is here! <a href=\"http://www.patreon.com/mugglecast\">Become a Patron</a> by June 30 at the Dumbledore's Army level or higher to get yours! </li>\n<li>\n<a href=\"http://www.mugglecast.com/harry-potter-chapter-chapter-analysis-archive/\">Chapter-by-Chapter</a> continues with Order of the Phoenix – Chapter 27: The Centaur and The Sneak</li>\n<li>7-Word Summary: Hogwarts changes direction due to Dumbledore’s departure </li>\n<li>WHOA, HORSEY! What's up with Hermione's attitude toward Firenze?</li>\n<li>Divination with Firenze - the magical class setting we've been waiting for!</li>\n<li>We analyze Firenze's teaching style and his perspective on humans teaching divination</li>\n<li>Why does Dobby still punish himself?</li>\n<li>Inside Dumbledore's Office</li>\n<li>Fudge's attitude toward Harry in Prisoner of Azkaban vs. Order of the Phoenix</li>\n<li>Marietta's face! Did Hermione go too far?</li>\n<li>Debate: Modifying Marietta's Memory</li>\n<li>Why doesn't Fudge or Umbridge recognize what's been done to Marietta?</li>\n<li>Is Dumbledore's story truly believable?</li>\n<li>Does Fudge ever really regret his decision?</li>\n<li>The Great Escape... with style!</li>\n<li>The Umbridge Suck Count climbs to 69!</li>\n<li>The hosts give their MVP of the Week and Rename The Chapter!</li>\n<li>Quizzitch: What are the three spells James casts on Severus besides Levicorpus?</li>\n<li>Join our community at <a href=\"http://www.patreon.com/MuggleCast\">Patreon.com/MuggleCast</a> and receive magical benefits, including Bonus MuggleCast! This week, we discuss the process behind our brand-spanking-new MuggleCast 15th Anniversary t-shirts and whether or not J.K. Rowling should apologize for killing characters!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Tue, 05 May 2020 14:21:49 +0000",
  "guid": "tag:audioboom.com,2020-05-05:/posts/7574536",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}