{
  "title": "A man of no ambition",
  "link": "https://www.getrichslowly.org/a-man-of-no-ambition/",
  "comments": "https://www.getrichslowly.org/a-man-of-no-ambition/#comments",
  "dc:creator": "J.D. Roth",
  "pubDate": "Wed, 02 Nov 2022 18:23:24 +0000",
  "category": "Administration",
  "guid": "https://www.getrichslowly.org/?p=244458",
  "description": "<p>A memory came to me this morning while I was walking the dog, a memory of those days when I was fresh out of college and just beginning to work for my father at the box factory.</p>\n<p>A salesman had come knocking on our door. This was strange since the box factory was (and still is) located in a rural area. But somehow this guy had found us and he was there to make his pitch: He was a salesman who trained salesmen. (And, presumably, saleswomen although this wasn't part of the <em>spiel</em> in 1992.)</p>\n<p>Dad, amused, introduced this fellow to me. \"This is J.D.,\" Dad said. \"He's our salesman. Talk to him.\" So, this guy sat down with me in a back room of the shabby trailer house that served as company HQ. (This was the very trailer house I'd grown up in. And trust me when I say it was a pit, a sty. It was just as bad as you're imagining. Maybe worse.)</p>\n<p>\"How would you like to make more money?\" the salesman who trained salesmen said to me. He was an older gentleman dressed in a brown corduroy suit.</p>\n<p>\"I'd love it,\" I said. Despite my father's nepotism in hiring me, I wasn't paid much: $16,500 per year and no commissions — about $35,500 in 2022 dollars.</p>\n<p>\"Let me show you what I can do for you,\" the salesman said, smiling. That's my over-riding memory of this conversation: the guy's permagrin. It never went away. Even when he was resting, he had that shit-eating grin on his face.</p>\n",
  "content:encoded": "<p>A memory came to me this morning while I was walking the dog, a memory of those days when I was fresh out of college and just beginning to work for my father at the box factory.</p>\n<p>A salesman had come knocking on our door. This was strange since the box factory was (and still is) located in a rural area. But somehow this guy had found us and he was there to make his pitch: He was a salesman who trained salesmen. (And, presumably, saleswomen although this wasn't part of the <em>spiel</em> in 1992.)</p>\n<p>Dad, amused, introduced this fellow to me. &#8220;This is J.D.,&#8221; Dad said. &#8220;He's our salesman. Talk to him.&#8221; So, this guy sat down with me in a back room of the shabby trailer house that served as company HQ. (This was the very trailer house I'd grown up in. And trust me when I say it was a pit, a sty. It was just as bad as you're imagining. Maybe worse.)</p>\n<p>&#8220;How would you like to make more money?&#8221; the salesman who trained salesmen said to me. He was an older gentleman dressed in a brown corduroy suit.</p>\n<p>&#8220;I'd love it,&#8221; I said. Despite my father's nepotism in hiring me, I wasn't paid much: $16,500 per year and no commissions — about $35,500 in 2022 dollars.</p>\n<p>&#8220;Let me show you what I can do for you,&#8221; the salesman said, smiling. That's my over-riding memory of this conversation: the guy's permagrin. It never went away. Even when he was resting, he had that shit-eating grin on his face.<span id=\"more-244458\"></span></p>\n<p>Mr. Salesman spent the next ten minutes talking about his services, gently asking leading questions designed to get me to agree with everything he said. Standard salesman stuff. Then, after he'd set me up, he came in with his presumptive close.</p>\n<p>&#8220;When can I schedule you for training?&#8221; he asked.</p>\n<p>I sighed.</p>\n<p>&#8220;You can't,&#8221; I said. &#8220;I'm not interested.&#8221; And before he could begin working through his canned rebuttals, I elaborated. &#8220;I'm not like most salesmen. I'm not ambitious,&#8221; I told him. &#8220;Yes, I want to make more money, but I don't want to be King of Sales. Your program sounds fine. Fine for other people, but not for me.&#8221; And I showed him to the door.</p>\n<p>Dad was puzzled. He'd expected me to jump at the chance to improve my sales skills. Dad was the most ambitious person I've ever known. He didn't understand that I truly <em>wasn't</em> ambitious.</p>\n<p>I hadn't been ambitious in grade school. I wan't ambitious in high school. I lacked ambition in college.</p>\n<p>I got good grades, performed well on standardized tests, and excelled at a variety of club activities. (I edited the school literary magazines in high school and college. I competed nationally in Future Business Leaders of America.) But none of this was achieved out of any kind of ambition. It was achieved out of interest and passion and intrinsic motivation.</p>\n<p>I didn't achieve because I was after achievement. I achieved because I was doing what I loved.</p>\n<h2>Allergic to Making Money</h2>\n<p>A couple of months ago, I made the trek to Orlando to attend Fincon, the annual conference for financial bloggers and YouTubers and podcasters and influencers. One morning, a group of us gathered around an empty conference-room table to kick around ideas and to share how things have been going for us.</p>\n<p>This was a great group of folks, people who do good work in the world of personal finance and, more to the point, people who make a <em>lot</em> of money doing so. I always feel a little out of place when I'm with this group. They're all fine people, but they're also so much more ambitious than I am. They're successful (and rich) but they want to be even <em>more</em> successful (and rich). Our discussions are always about how to get <em>more</em>: more readers, more viewers, more publicity, more money.</p>\n<p>Eventually the conversation turned to Get Rich Slowly and its status. I talked about how I wanted to convert it to an &#8220;online encyclopedia of personal finance&#8221;, a go-to destination where people can get reliable, actionable info unclouded by bullshit. I also mentioned that the site only makes $500 per month.</p>\n<p>&#8220;I don't get you, J.D.,&#8221; said one colleague. &#8220;Why are you allergic to making money?&#8221;</p>\n<p>&#8220;Look,&#8221; I said. &#8220;Here's the thing. I was born into a poor family. I grew up in a dirty trailer house. What I have today is already so much more than I ever dreamed I'd have. I don't possess the same ambition that you do. I don't need to be rich. I don't need to be famous. I think it's awesome what you all have accomplished, but I don't want to do it.&#8221;</p>\n<p>This is the truth.</p>\n<p>When I look at the world around me, it seems as if so many of our problems are caused by ambition. (Note that I'm carefully avoiding use of the word &#8220;greed&#8221; here. To me, &#8220;greed&#8221; implies malice. I don't think many people are actually greedy; they're just ambitious.) And when I talk about ambition, I mean a sort of selfishness that comes with a lack of empathy, a sort of willing blindness to the consequences of one's actions and the plights of those less fortunate.</p>\n<p>I could make a lot of money, for instance, by pitching credit cards at Get Rich Slowly. If I were an ambitious fellow, I'd probably do that. But having suffered through years of painful credit-card debt myself, I'm unwilling to lure other people into a similar fate.</p>\n<p>Sure, I know that credit cards are simply tools and they can be used responsibly. I also know that it's not my job to protect everyone from debt. But I don't like the idea of promoting credit cards to people who might damage their lives by using them. It's like offering whisky to an alcoholic, right? Not everyone who comes to Get Rich Slowly is an &#8220;alcoholic&#8221;, I know, but many folks are. So, I'd rather not have &#8220;whisky&#8221; on offer.</p>\n<p>Similarly, I'm unwilling to write about the latest app or website or service that's appeared upon the scene. I'm unwilling to tackle the latest hot topic in the world of personal finance just because it's a hot topic. I'm unwilling to chase my stories that go viral with other similar stories in the hopes of recapturing some of that same audience. Doing these things is fine for other people, but when I do them it feels like I'm selling my soul.</p>\n<h2>Unclouded by Ambition</h2>\n<p>Fincon is an exciting place. It's fun to talk with people who are &#8220;crushing it&#8221;, people who have found a niche and who are reaching millions of people each month and/or making millions of dollars per year. How can I help but come away excited and invigorated?</p>\n<p>After past Fincons, I'd return home wanting to put into practice all of the ideas I'd picked up at the conference. I'd want to do the things that others were doing to maximize traffic and revenue. I've always been drawn to measurable metrics, always been competitive (if not ambitious), so this stuff appeals to me.</p>\n<p>But this time, I returned home more resolved than ever to exit The Game. I don't care about being the biggest. I don't need to have the most traffic. I have zero interest in capturing an audience, putting them through a &#8220;funnel&#8221;, and converting their attention into dollars. I don't like when people do this to <em>me</em>, so why would I want to do it to others?</p>\n<p>Plus, this year has been heavy for me. My experiences in 2022 have altered my perspective. More and more, I'm convinced that I want to be doing three things on the internet.</p>\n<ul>\n<li>First, I really do want to convert the bulk of the Get Rich Slowly archive into an online encyclopedia of personal finance. I want to publish definitive and trustworthy articles on the most important topics in personal finance, articles untainted by affiliate marketing and (when possible) political opinion. I want to show people the things that are known to <em>work</em> when it comes to improving home economies.</li>\n<li>Second, I want to publish more personal stories. My own stories, sure — stories like the ones in this post! — but stories from other people too. I truly believe that people learn best through narrative. Theory is great, but nothing compares to lived experience. Stories bind us. They bring us together. They help us learn. They help us understand each other.</li>\n<li>Third, I want to build a small community of folks who are like me: interested in self-improvement, eager to achieve financial security, but equally seeking to help other people make their lives better too. If this small community is five people, great. If it's 500 people, great. If it's 5000 people, also great. I'm less interested in quantity than I am quality.</li>\n</ul>\n<p>I want to do these three things, and I want to do them in a way that's unclouded by ambition.</p>\n<p>As I said a moment ago, I may not be ambitious but I <em>am</em> competitive. If I'm not careful, I <em>can</em> become too motivated by metrics. I can chase revenue and engagement and all of those other numbers that distract from what's actually important. But all of <a href=\"https://gurwinder.substack.com/p/the-perils-of-audience-capture\" rel=\"noopener\">those numbers are a trap</a>. Chasing numbers is counter to what I actually want to do with my life.</p>\n<p>I want to spend my life telling stories and helping other people — both at the same time, if possible. And I believe that means doing things differently than my colleagues do them. That means casting aside the way things are &#8220;supposed to be done&#8221; in the world of blogging and YouTubing and Twittering, and it means forging my own path.</p>\n<h2>This Is the Way</h2>\n<p>Where does this path lead? I don't know. I don't really care, to be honest.</p>\n<p>It may be that I spend the next ten years creating content for an audience of dozens and continuing to make a meager $500 per month. (I earned $486.60 from this site in October!) In reality, it'll probably mean I earn nothing for several years. Why? Because my current intention is to strip the site of all advertising by the end of December.</p>\n<p>But I do know this: Wherever I'm headed, I'll be following a trail I'm blazing myself, not one that's been laid down by other people. I've been on that well-traveled path for a while now, and I don't like it. I don't like feeling pressured to create content that gets more views, more clicks, <a href=\"https://rosie.land/posts/stop-measuring-community-engagement/\" rel=\"noopener\">more engagement</a>.</p>\n<p>And as I blaze this path, I'm sure to make some wrong turns. I'll stumble upon some dead ends. I may spend months forging my way in a particular direction only to realize I've been going the wrong way. I'm okay with that. That time won't have been wasted.</p>\n<p>So, to belabor this metaphor, I have the machete in hand. I'm ready to hack my way through the undergrowth. Technically, yes, <a href=\"https://www.getrichslowly.org/sabbatical/\">I am on sabbatical</a> until the end of the year. That hasn't changed. But while I'm &#8220;taking a break&#8221;, I'll be casually exploring my surroundings to figure out where I want to begin blazing a path.</p>\n<p>Discarding the metaphors, what I think this means in terms of actual work is this:</p>\n<ol>\n<li>At <a href=\"https://jdroth.com\" rel=\"noopener\">my personal site</a>, I'm going to roll out <a href=\"https://pennyshort.com\" rel=\"noopener\">the &#8220;de-design&#8221; I've been working on</a>. I suspect this means I'll begin publishing a few articles over there now and then to test things.</li>\n<li>Once I'm certain everything works, I'll implement the &#8220;de-design&#8221; here.</li>\n<li>After the cosmetic stuff is in place, I'll re-arrange some of the structural elements of this site. Part of me wants to scrap everything and start over from scratch, but my colleagues have convinced me this is foolish. I think they're right.</li>\n<li>When all of this is finished, I hope to begin a <em>regular</em> publishing schedule. But who knows? As a man of no ambition, this might be too much for me. 😉</li>\n</ol>\n<p>Meanwhile, I'm sure I'll publish a few articles here at Get Rich Slowly despite being on sabbatical. In fact, I know I want to write up my most recent experiences with <a href=\"https://www.getrichslowly.org/designing-your-life/\">the exercises in the book <em>Designing Your Life</em></a>. Plus, I do have some thoughts to share about the death of my mother.</p>\n<p>Returning to my metaphor, I'm pleased to have you on the trail with me. I'm not sure what we'll find down these unexplored paths, but I know I'll enjoy the adventure more with company than I would if I were going it alone. So, pick up your pack. Let's head out to see what we can find!</p>\n<blockquote class=\"highlight\"><p>One quick postscript: I participated in two written interviews recently, and I think they're both interesting. The first is about my experience with financial independence. You can read that interview at The Fioneeers: <a href=\"https://thefioneers.com/money-does-not-solve-all-problems/\" rel=\"noopener\">Money Doesn't Magically Fix Our Problems</a>. The second is a brief conversation about writing with Jacob from The Root of All. You can find that bit at the end of his article about <a href=\"https://rootofall.substack.com/p/spending-in-the-time-of-covid-a-love\" rel=\"noopener\">Spending in the Time of COVID</a>.</p></blockquote>\n<div id=\"mediavine-settings\" data-blacklist-content-desktop=\"1\" data-blacklist-content-mobile=\"1\"></div>\n",
  "wfw:commentRss": "https://www.getrichslowly.org/a-man-of-no-ambition/feed/",
  "slash:comments": 30
}