{
  "id": "yt:video:byvKbMa9zEg",
  "yt:videoId": "byvKbMa9zEg",
  "yt:channelId": "UCCODtTcd5M1JavPCOr_Uydg",
  "title": "Designing Heartbreak, Propaganda and Death - Extra Credits Gaming",
  "link": "",
  "author": {
    "name": "Extra Credits",
    "uri": "https://www.youtube.com/channel/UCCODtTcd5M1JavPCOr_Uydg"
  },
  "published": "2022-10-19T17:29:48+00:00",
  "updated": "2022-10-24T19:48:19+00:00",
  "media:group": {
    "media:title": "Designing Heartbreak, Propaganda and Death - Extra Credits Gaming",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Enjoyed Designing Heartbreak on a secure VPN? No? Then why not check out NordVPN and save on a 2-year plan (+4 extra months) and get a 30 day money-back guarantee by using code “extracreditsvpn” at https://NordVPN.com/extracreditsvpn \n\nHow do you create emotion and heartbreak with math? Video games can create meaningful player interactions and connections with characters but we need to stop treating them like trophies. Instead, we need immersion that makes you connect with the character to make them feel more real in the world around you. So sit back and let us drop some mathematical knowledge into your game's next design!\n\n---- Thanks for participating in this week's discussion! ----\nCheck out our community guidelines so we can have MORE high-quality conversations: https://www.extracredits.site/extra-credits-community-code-of-con\n\n---- Want to support the people who make this show? ----\nBecome a Patreon Member & Vote on future Extra History episodes! http://bit.ly/EHPatreon \nOr show off your fandom with our merch! http://extracredits.store/\n\n---- Want more Extra Credits? Subscribe and Follow us on Social Media! ----\nTwitter: http://bit.ly/ECTweet\nFacebook: http://bit.ly/ECFBPage\nInstagram: http://bit.ly/ECisonInstagram\nTwitch: http://bit.ly/ECtwitch\nTikTok: https://www.tiktok.com/@extracreditz\nWebsite: http://extracredits.site/\n\n---- Interested in sponsoring an episode? Email us: extracredits@standard.tv ----\n♪ Intro Music: \"Penguin Cap\" by CarboHydroM - http://bit.ly/1eIHTDS\n♪ Outro Music: \"Extra Extra Live by Tiffany Roman\n\n#ExtraCredits #Gaming #GameDesign",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}