{
  "id": "tag:theatlantic.com,2022:50-621263",
  "content": "<p dir=\"ltr\">Even on a good day, service jobs are pretty hard. Your schedule is constantly changing, you’re on your feet, you’re at the mercy of the general public, and the pace of your shifts swings between crushing boredom and frenetic activity. You’re probably not guaranteed any particular number of hours in a given week, and you can be cut from the schedule or called in to work at the last second. For all that, you’re paid too little to cover the basic needs of an American adult: a median of $12 to $14 an hour, according to data from the Bureau of Labor Statistics.</p><p dir=\"ltr\">So far, Omicron has not provided service workers with any good days. As the highly transmissible, immunity-evading coronavirus variant surges across the country, it has <a href=\"https://www.theatlantic.com/health/archive/2022/01/omicron-mild-hospital-strain-health-care-workers/621193/?utm_source=feed\">filled hospitals</a>, infected record numbers of people, and made everyday life a nightmare for workers in stores, restaurants, gyms, schools, health-care facilities, and so many other workplaces. Many workers are currently sick or have been exposed to the virus, and <a href=\"https://www.theatlantic.com/health/archive/2022/01/cdc-new-isolation-guidelines-confusing/621192/?utm_source=feed\">changing isolation and quarantine guidelines</a> make it unclear how long they should stay home, or whether their employer will even allow that. Tests to confirm infection are expensive and scarce. In workplaces with Omicron outbreaks, there may not be enough available workers to continue operating the business for days or weeks at a time, which means everyone loses their shifts—and their paychecks—in “<a href=\"https://www.theatlantic.com/health/archive/2021/12/omicron-soft-lockdown/621121/?utm_source=feed\">soft lockdowns</a>” that workers must navigate with little institutional or governmental support. For businesses that remain open, understaffing and supply shortages make workers’ interactions with customers even more tense and dangerous.</p><p dir=\"ltr\">Before the new variant reared its head, <a href=\"https://www.washingtonpost.com/business/2021/12/08/where-workers-quitting-jobs/\">people were already leaving</a> the service sector in droves. Now the Omicron surge is laying bare how few protections workers have retained from the scant services given to them earlier in the pandemic, and just how little safety and stability this kind of work provides to the people who do it. Omicron is making many of America’s bad jobs even worse.</p><p>Some elements of this current crisis were put in place and allowed to fester over the past two years, but many of them spring from the fundamentally precarious nature of service jobs. Understaffing and low pay, for example, have been chronic issues across shift-work occupations for years, according to Daniel Schneider, a sociologist at Harvard and a co-founder of the Shift Project, which surveys tens of thousands of hourly workers at large employers, including Dollar General, Starbucks, and Macy’s. Lowering labor costs makes these businesses more profitable, Schneider told me, but it also makes them brittle, even under the best circumstances. There may be a “kind of tipping-point dynamic here,” he said, “where, yeah, these jobs have always been precarious, they’ve always been bad, but the confluence of those conditions—more difficult customer management and even fewer people on the job—is almost a multiplier on the hazard of this work.”</p><p dir=\"ltr\">One of the most obvious issues is service workers’ widespread lack of access to paid sick leave, according to Schneider. Before the pandemic, more than half of the workers surveyed by the Shift Project lacked paid sick leave completely. As of November, that number had barely moved. This is the case even though in March 2020, the federal government passed the Families First Coronavirus Response Act (FFCRA), which mandated two weeks of paid sick leave for workers previously not given it by their employer. Even at its best, this patchwork of policies had enormous deficiencies, Schneider said: The FFCRA excluded anyone who worked for a company employing more than 500 people, which disqualified workers at big-box stores, supermarkets, chain pharmacies, department stores, fast-food restaurants, and large e-commerce companies. It also left out many of the people who do poorly paid and largely invisible work in workplaces that put them at particularly extreme risk, such as hospitals and care homes, including many janitorial, laundry, and cafeteria workers.</p><p data-id=\"injected-recirculation-link\" dir=\"ltr\"><i>[<a href=\"https://www.theatlantic.com/politics/archive/2022/01/lack-paid-sick-leave-undermines-covid-isolation/621233/?utm_source=feed\">Read: The real reason Americans aren’t isolating</a>]</i></p><p>Some of the big companies not affected by the FFCRA chose to implement leave policies and other pandemic-specific benefits of their own, such as hazard pay and testing programs, thanks at least in part to public pressure to protect workers. Walmart, Amazon, and CVS, for instance, made headlines by extending 10 days of paid leave to anyone who tested positive for COVID-19. But Schneider said this was only ever a tiny minority of employers, and for every large company that made these changes, many more <a href=\"https://www.theatlantic.com/politics/archive/2022/01/lack-paid-sick-leave-undermines-covid-isolation/621233/?utm_source=feed\">didn’t provide any additional benefits at all</a>. “What we’re seeing is large companies really try their best to do the least possible,” Schneider said. “There is really an effort by firms to avoid requirements to do things and instead to just be asked to voluntarily do things.”</p><p dir=\"ltr\">That effort clearly has contributed to the tipping-point dynamic: Cases have surged at the exact same time that many protections for workers, including the FFCRA, have expired, and the relatively small number of employers who voluntarily granted extra sick leave and other benefits have largely rolled back those programs. Amazon, for example, requires employees to submit test results in order to qualify for any COVID-19 sick leave, but a number of the company’s workers told NBC News that they’re now <a href=\"https://www.nbcnews.com/tech/ailing-amazon-workers-struggle-find-covid-tests-rcna11942\">on their own to secure testing</a>, after the company closed down employee testing facilities that provided that service free of charge earlier in the pandemic. (In response to NBC, an Amazon spokesperson said that the company is looking into the reported issues and focusing on getting workers vaccinated.) Many companies have similar testing requirements for service workers to access leave. Without results, taking time off for illness is unpaid for many workers. And making $12 to $14 an hour, vanishingly few service workers have the financial stability necessary to take any amount of unpaid leave, if their employer would even allow it.</p><p dir=\"ltr\">The federal public-health apparatus has effectively endorsed these rollbacks. In late December, the CDC <a href=\"https://www.theatlantic.com/health/archive/2022/01/covid-isolation-muffin-baking-cdc/621209/?utm_source=feed\">reduced isolation guidelines</a> for infected Americans who aren’t severely ill from 10 days to five. Anthony Fauci hailed the move for helping Americans “get back to the workplace, doing things that are important to keep society running smoothly,” but many experts have criticized the agency over a lack of <a href=\"https://www.theatlantic.com/health/archive/2022/01/cdc-new-isolation-guidelines-confusing/621192/?utm_source=feed\">strong evidence</a> that it’s safe for workers to return to in-person jobs so quickly. Requiring a negative test after infection would make these guidelines safer, but the revised rules don’t require that. In the weeks since the announcement was made, <a href=\"https://www.nytimes.com/2022/01/11/business/delta-flight-attendants-union-isolation-covid.html\">Delta</a>, <a href=\"https://www.reuters.com/business/amazon-shortens-covid-isolation-paid-leave-us-workers-2022-01-07/\">Amazon</a>, <a href=\"https://www.reuters.com/business/exclusive-walmart-halves-paid-leave-covid-positive-workers-extends-hybrid-work-2022-01-05/\">Walmart</a>, <a href=\"https://www.reuters.com/business/healthcare-pharmaceuticals/walgreens-cvs-cut-paid-sick-leave-workers-line-with-cdc-guidance-2022-01-11/\">CVS, and Walgreens</a> have all cut their paid-leave policies for COVID-19 infections down to the equivalent of five workdays. And they’ve been slow to add any testing requirement to their own guidelines.</p><p data-id=\"injected-recirculation-link\" dir=\"ltr\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2022/01/cdc-new-isolation-guidelines-confusing/621192/?utm_source=feed\">Read: America’s COVID rules are a dumpster fire</a>]</i></p><p dir=\"ltr\">The story has largely been the same for any other benefits or protections extended to service workers during the pandemic, Schneider said. Enhanced federal unemployment benefits expired months ago; companies that provided hazard-pay wage bumps have almost all rolled those back; and even many simple precautions to protect people who work with the general public, such as local mask mandates, have been repealed. Just this week, the Supreme Court <a href=\"https://www.nytimes.com/2022/01/13/us/politics/supreme-court-biden-vaccine-mandate.html\">blocked</a> the Biden administration’s vaccine-or-test mandate, which would have required large employers to verify that all of their employees are either vaccinated or regularly tested in order to ensure the safety of their workplaces.</p><p dir=\"ltr\">As protections and support wash away, many service jobs themselves have become more difficult. Supply and staffing shortages at stores and restaurants mean that service and selection may not be exactly the same for customers as they were before the pandemic—tiny disappointments that <a href=\"https://www.theatlantic.com/health/archive/2021/08/pandemic-american-shoppers-nightmare/619650/?utm_source=feed\">spark episodes of verbal abuse or violent rage toward workers</a>. A swirl of infections, winter storms, and supply-chain disruptions have left America’s grocery stores, for instance, <a href=\"https://www.usatoday.com/story/money/shopping/2022/01/12/shortage-grocery-store-empty-shelves/9178100002/\">scrounging for goods</a> in recent weeks. “We’re essentially asking this least well compensated and most precariously employed workforce to take on the everyday management of a polarized and angry and dangerous public,” Schneider said. This was the case before Omicron, and even if the variant’s wave is as short as many hope it will be, its interruptions will have effects visible in additional shortages (and their attendant frustrations) for months, at least.</p><p data-id=\"injected-recirculation-link\" dir=\"ltr\"><i>[<a href=\"https://www.theatlantic.com/health/archive/2021/08/pandemic-american-shoppers-nightmare/619650/?utm_source=feed\">Read: American shoppers are a nightmare</a>]</i></p><p dir=\"ltr\">Schneider said no one has a totally satisfying answer as to why retail stores and restaurants have had such a hard time staffing up in the past six months. After all, he pointed out, many of the people who would usually fill those jobs had no safety net before the pandemic either. But a few theories add up to explain much of the problem. <a href=\"https://globalmigration.ucdavis.edu/20-years-declining-immigration-and-disappearance-low-skilled-immigrants\">Long-term downward trends</a> in immigration to the United States, and especially low immigration levels in the past two years, might have choked off an important source of low-wage workers. Increased difficulty in finding adequate and affordable child care is another reason, especially for the many families that may have relied on older relatives who have been lost to the pandemic. And some people have simply left the retail and food-service industries altogether, switching to other kinds of work. “A better way to think about the labor-shortage problem is that we have a pay-shortage problem,” Ben Zipperer, an economist at the Economic Policy Institute, a left-leaning think tank, told me. Workers who take less-than-ideal jobs after mass layoffs might be more likely to stick with them instead of looking for a better role if the circumstances of many of those jobs weren’t so bad.</p><p dir=\"ltr\">There is little reason to believe that the Omicron wave won’t make these jobs even harder to fill. “We haven’t solved any of the kind of fundamental problems of the labor market that make things worse during a pandemic,” Zipperer said. Incredibly popular policies, such as increasing the federal minimum wage, have largely stalled out, even though Zipperer thinks that the pandemic is an ideal time to rally the political will to make something like that happen.</p><p dir=\"ltr\">Schneider didn’t feel much more optimistic about what Omicron might do to the lives of service workers, or about the signals those in power have been sending about how they intend to handle the situation. “It doesn’t feel like there is any real appetite by anybody to return to substantial policy that might protect workers,” he told me. Instead, we’ve committed to riding out this wave, no matter how bad it gets. The hope, Schneider said, is that it’s fast.</p>",
  "author": {
    "name": "Amanda Mull",
    "uri": "http://www.theatlantic.com/author/amanda-mull/?utm_source=feed"
  },
  "media:content": {
    "media:credit": "Alexi Rosenfeld / Getty"
  },
  "title": "Omicron Is Making America’s Bad Jobs Even Worse",
  "published": "2022-01-14T12:31:00-05:00",
  "updated": "2022-01-14T13:13:32-05:00",
  "summary": "The latest wave of the pandemic is pushing service workers to the brink.",
  "link": ""
}