{
  "title": "Reasons to keep your on-site HPC center",
  "link": "",
  "updated": "2019-10-01T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2019/10/01/stay-on-hpc",
  "content": "<p><em>This is co-released with a companion post <a href=\"interactive-hpc\">Tips for Interactive HPC</a>.</em></p>\n\n<p>Scientific institutions today are considering how to balance their current HPC\ninfrastructure with a possible transition to commercial cloud.</p>\n\n<p>This transition is partially motivated by data science users,\nwho find that HPC policies make their workflows difficult.\nThis frustration is reasonable.\nHPC systems weren’t designed around these use cases,\nbut there are steps we can take to adapt HPC centers for data science use.</p>\n\n<p>But should we bother?\nWhy might an institution choose to adopt cloud,\nand why might they choose to stay with in-house HPC resources?\nSome colleagues of mine recently published\n<a href=\"https://arxiv.org/abs/1908.03356?\">an opinion paper supporting a move to cloud</a>,\nso I thought I would respond with some arguments in the other direction.</p>\n\n<p><em>To be clear, I support a move to cloud in many cases, as they would support\nstaying on in-house HPC.  There is no single right answer.</em></p>\n\n<p>With that prelude out of the way, here are some reasons:</p>\n\n<ol>\n  <li>\n    <p><strong>You already have an in-house HPC center</strong> so you might as well use it.\nAdopting a technology is easy, but changing the culture of an institution\nis a multi-year effort that is going to be more intense than you expect.\nEven very nimble for-profit companies have a hard time at this, and if you\nhave an in-house HPC center, then you are probably an organization with\nconsiderable inertia.</p>\n  </li>\n  <li>\n    <p><strong>Your data may be generated in-house</strong> if you’re running\nsimulations or making local observations then you might have data\ngeneration on-premises.  If these datasets are likely to be reused many\ntimes by an entire field then <em>please</em> place them onto the cloud (this is\nwhat it is best at), however if your users are each creating their own\nlarge datasets that have only ephemeral value, then it may not make sense\nto publish these to the cloud, so you will want to support in-house\ncomputation instead.</p>\n\n    <p>To recap:</p>\n\n    <ol>\n      <li>A few long-lived datasets serve a large community: Cloud</li>\n      <li>Everyone makes their own short-lived datasets: In-house</li>\n    </ol>\n  </li>\n  <li>\n    <p><strong>Hiring</strong>: the cloud is a new technology. Actually, it’s a whole new suite\nof new technologies, and people who understand these well are in high demand\nby well-paying employers.  If you have difficulty meeting market rates,\nthen please verify that you’ll be able to hire or retrain experienced\npeople before making this decision.</p>\n  </li>\n  <li>\n    <p><strong>User familiarity</strong>: In some ways HPC systems are more familiar to scientific\nusers today than cloud environments.  For example when you move to the\ncloud you often lose things like POSIX file systems, file formats like HDF,\nand more.  In the long run this is fine, there are excellent alternatives\nto these technologies, but a lot of user code will have to change a bit.</p>\n  </li>\n  <li>\n    <p><strong>Lockin</strong>:  The clouds will sell you products that are highly productive,\nbut will make it difficult for you to leave them in the future.  They will\nmake it very easy to adopt tooling that differentiates them from other\nvendors and that you will, in time, rely upon heavily so that your public\ninstitution becomes a little bit of a captive.  This happens with on-site\nHPC machines and software too, but it’s a bit more prevalent in the cloud.</p>\n\n    <p>Arguably, it’s good for government funded public institutions to maintain\nsome level of independence from commercial cloud.</p>\n  </li>\n</ol>\n\n<p>Again, there are plenty of reasons to move to Cloud.  It can be cheaper, easier\nto maintain, and open up new ways of doing business/science that aren’t\npossible with HPC centers.  But we should acknowledge that in many cases it\nwill also be the wrong choice, especially for some classes of compute and data\nintensive fields.  I’ve listed a few reasons above on why sticking with an HPC\ncenter can make sense, but there are more.</p>\n\n<p><em>Thanks to <a href=\"https://andersonbanihirwe.dev/\">Anderson Banihirwe</a>,\n<a href=\"https://www.jacobtomlinson.co.uk/\">Jacob Tomlinson</a>,\nand <a href=\"http://joehamman.com/\">Joe Hamman</a>\nfor their review and help in writing this post</em></p>"
}