{
  "guid": "https://podcasts.nationalreview.com/?p=1573",
  "title": "Episode 13: Michael C. Moynihan / The Smiths",
  "description": "<p>Scot and Jeff talk to Michael C. Moynihan about The Smiths</p>\n<p><b>Introducing the Band<br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Michael Moynihan, correspondent for Vice News Tonight on HBO and member of <a href=\"http://wethefifth.com/\" target=\"_blank\">the Fifth Column podcast</a>, Follow him on Twitter at <a href=\"https://twitter.com/mcmoynihan\" target=\"_blank\">@mcmoynihan</a> and read his past work both <a href=\"https://www.thedailybeast.com/author/michael-moynihan\" target=\"_blank\">here</a> and <a href=\"https://reason.com/people/michael-c-moynihan/articles\" target=\"_blank\">here</a>.</p>\n<p><span><b>Michael’s Musical Pick: The Smiths<br />\n</b></span>“Is it wrong not to always be glad?” This is the question Jeff poses as the gang launches into Lucky #13: the long-awaited blockbuster Political Beats tribute to The Smiths, legendarily reputed as one of the ’80s most literately mopey bands. (Jeff also pays tribute to <a href=\"https://www.youtube.com/watch?v=XQR78U6zvGI\" target=\"_blank\">a classic <i>Mystery Science Theater 3000</i> bit</a> in passing.) But Michael is immediately at pains to argue with The Smiths-as-miserabilists rap, and he explains that one of the reasons he loves them like no other band in the pantheon is Morrissey’s remarkable wit. Michael talks about getting into music as a kid, discovering postpunk in 1987, quickly finding his way to Newbury Comics in Boston and acquainting himself with the pride of Manchester: The Smiths. Like many a budding Smiths fanatic from the late ’80s and early ’90s, this involved a copy of <i>The Queen Is Dead</i> and an older brother questioning his heterosexuality. The rest is history, including Michael relocating temporarily to England and imbibing the mythos firsthand.</p>\n<p>Jeff’s intro to the band came later: college and a chance encounter with an eccentric friend who refused to lend her Smiths CDs to him because she valued them like other people value family heirlooms. Jeff emphasizes his love not only of Morrissey’s literate, playful lyrics, but actually elevates Johnny Marr’s contribution above it: even if only by a 51-49 margin, Jeff argues, this was Marr’s band, and his love of the eternal verities of melody, production, arrangement, and rock and pop are what make nearly every Smiths track from their beginning right up until the end worth hearing.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=k30XeJNAbt4\" target=\"_blank\">The Queen Is Dead</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=M661HAkr_Dk\" target=\"_blank\">William, It Was Really Nothing</a>” (A-side of single, 1984); “<a href=\"https://www.youtube.com/watch?v=8qCpYMKhj34\" target=\"_blank\">Rusholme Ruffians (alternate version)</a>” (unreleased, originally from <i>Meat Is Murder</i>, 1985)</p>\n<p><span><b>Morrissey meets Marr: The Formation of The Smiths and the Troubled Debut Album<br />\n</b></span>For an album as hailed as <i>The Smiths</i> (1984) is, it had an exceedingly troubled genesis and to this day gets mixed reviews from hardcore fans. The story goes thus: Johnny Marr (guitars, music) introduces himself to local scenester Stephen Morrissey (vocals, lyrics) and says they should form a band. Andy Rourke (bass) and Mike Joyce (drums) are then inducted into this inchoate group and the so-called “Smiths” record a single in a local studio on spec: without a recording contract in hand, but confident enough in their talent to pay out-of-pocket and send it around to various labels in search of a record deal. The name of the label that bit was Rough Trade; the name of the song is their legendary debut single “Hand In Glove.” But the obligatory album follow-up was a much bigger problem: after recording a full version of the debut LP with Teardrop Explodes guitarist Troy Tate producing, The Smiths scrapped it and re-recorded the entire thing from scratch with John Porter.</p>\n<p>And nobody in the gang can agree on its merits! Scot grants Jeff’s point that the Tate version of “Reel Around The Fountain” is magisterial, but he thinks this is the <i>worst</i> of The Smiths’ four proper studio LPs. Jeff thinks it’s their <i>best</i> studio LP, even better than <i>The Queen Is Dead</i>, and explains why in detail<i>. </i>Michael is in the middle: he loathes “The Hand That Rocks The Cradle” with eloquent passion, but praises the obscure B-sides from this era like “Accept Yourself,” “Wonderful Woman” and “Jeane.” How deep does the rabbit-hole go? This deep: Michael spends time praising <i>Sandie Shaw’s</i> (Smiths-produced) covers of “I Don’t Owe You Anything” and “Jeane” (and Jeff agrees)! Michael also calls out Andy Rourke’s follow-the-bouncing-ball bassline on “Pretty Girls Make Graves” and laughs about the song’s conceit as a Beach Boys number gone horribly wrong. He then spends time discussing his personal experiences with Rourke, and the cosmic unfairness of his lack of appreciation (including a depressing story about watching Rourke open for a Smiths cover band where <i>some other guy was pretending to be Andy Rourke</i>).</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=K6uEwpCdV3U\" target=\"_blank\">Hand In Glove</a>” (A-side of single, 1983; <i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=OYYZFx7_DS8\" target=\"_blank\">This Charming Man</a>” (A-side of single, 1983); “<a href=\"https://www.youtube.com/watch?v=VH5BSkVQLsw\" target=\"_blank\">What Difference Does It Make?</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=V04bUY5Kl8w\" target=\"_blank\">Reel Around The Fountain</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=TWvG-QZNsJk\" target=\"_blank\">Still Ill</a>” (<i>The Smiths, </i>1984); “<a href=\"https://www.youtube.com/watch?v=UZYf3-9LtlQ\" target=\"_blank\">You’ve Got Everything Now <span>(live at the BBC June 26th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=VZpmVgpRh9A\" target=\"_blank\">Suffer Little Children</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=azNq-XaaS9Q\" target=\"_blank\">The Hand That Rocks The Cradle</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=lt1YqCpLoYY\" target=\"_blank\">Wonderful Woman</a>” (B-side of “This Charming Man,” 1983); “<a href=\"https://www.youtube.com/watch?v=csn0e27Wp54\">Jeane</a>” (B-side of “This Charming Man,” 1983); “<a href=\"https://www.youtube.com/watch?v=r_Ql8HglIDE\" target=\"_blank\">Pretty Girls Make Graves</a>” (<i>The Smiths</i>, 1984);</p>\n<p><span><b>The Smiths as the Last Great Non-Album Singles Band; <i>Hatful Of Hollow </i>and Smiths Compilations in General<br />\n</b></span>No discussion of The Smiths is complete if all you consider are their formal studio albums; this was one of the all-time great non-album-single acts of the rock era, and Jeff argues that they share the sad distinction with New Order of being the <i>last</i> great one. The gang has a hearty chuckle over the gloriously funny, self-parodying lyrics of “Heaven Knows I’m Miserable Now” and salute Andy Rourke’s lovely bass work, then ponder whether “William It Was Really Nothing” (with its two B-sides “Please Please Please Let Me Get What I Want” and “How Soon Is Now?”) is the greatest non-album single ever released during the 1980s. Michael takes a contrarian turn by insisting that he’s actually rather bored by “How Soon Is Now?” — the most famous Smiths song in the United States — but come on, now.</p>\n<p>This inevitably leads to a long and loving discussion of The Smiths’ adventures in repackaging. Few bands are better known for their sheer compilatory fury (especially given the relatively small overall discography) than The Smiths, but it actually makes sense given how nearly a third of their output was never released on an album. Jeff lays his cards down and declares <i>Hatful Of Hollow</i> (1984) to be the single greatest Smiths album ever released, even though it’s not even really an album: it’s essentially a revision of the debut LP and its various associated session recordings using impressively muscular, raw BBC takes in place of the overproduced studio versions. Add in all those great 1984 singles A’s & B’s, and in Jeff”s opinion you get the best value-for-money proposition in the band’s entire catalogue. Michael is a <i>Louder Than Bombs</i> (1987) man, which makes sense given that this was the USA’s (later) answer to <i>Hatful </i>and thus the one he grew up with: a sprawling 2LP set collecting a slew of non-album singles, B-sides, and obscurities.</p>\n<p>As the gang is talking about the wonderful miniatures of The Smiths’ B-sides and BBC sessions, Michael takes the opportunity to point out how terrible Morrissey is when working in longer form. Particular attention is paid to the self-indulgence of his autobiography (which he insisted on having released as a <a href=\"http://keyassets.timeincuk.net/inspirewp/live/wp-content/uploads/sites/28/2013/10/morrissey130913w1.jpg\">Penguin Classic</a>) and his even worse attempt at fiction, <i>List Of The Lost</i>. (<i>List</i> is so bad that it won an award for “worst sex scene” and yes, we are required per Jeff’s promise on the podcast to inflict it upon you <a href=\"http://www.telegraph.co.uk/content/dam/books/morrisseylist-large.jpg\">here</a>).</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=Roe9-DlhXzY\" target=\"_blank\">Heaven Knows I’m Miserable Now</a>” (A-side of single, 1984); “<a href=\"https://www.youtube.com/watch?v=OztC_7nkAd8\" target=\"_blank\">How Soon Is Now?</a>” (B-side of “William, It Was Really Nothing,” 1984); “<a href=\"https://www.youtube.com/watch?v=-T8R_VDTOYQ\" target=\"_blank\">Please, Please, Please Let Me Get What I Want</a>” (B-side of “William It Was Really Nothing,” 1984); “<a href=\"https://www.youtube.com/watch?v=7vxrDBFsMl0\">London</a>” (B-side of “Shoplifters Of The World Unite,” 1987); “<a href=\"https://www.youtube.com/watch?v=2SdhP2pLvD8\" target=\"_blank\">These Things Take Time <span>(live at the BBC June 26th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=ADj_YlTkRiY\" target=\"_blank\">Oscillate Wildly</a>” (B-side of “How Soon Is Now?,” 1985); “<a href=\"https://www.youtube.com/watch?v=Z0Y6UJ6AGmM\">This Night Has Opened My Eyes <span>(live at the BBC September 14th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=wQvGXNmKe2o\" target=\"_blank\">Back To The Old House <span>(live at the BBC September 14th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984)</p>\n<p><span><b>The Smiths Go Rockabilly (?!) on <i>Meat Is Murder<br />\n</i></b></span>Yes the lamentably stupid title track (people: Morrissey <i>moos</i>) would make all but the most devoted vegan run directly to Ruth’s Chris and order a juicy rare steak, but Michael and Scot both contend that The Smiths’ proper sophomore album <i>Meat Is Murder</i> is actually their most underrated record. Jeff really isn’t into the “behold, I am now Scotty Moore!” rockabilly trip that Johnny Marr is suddenly on with tracks like “Rusholme Ruffians” and “Shakespeare’s Sister,” but Scot has high praise for the puckish insouciance of “Nowhere Fast.” Much more to Jeff’s taste is the shimmering depression of “That Joke Isn’t Funny Anymore” and the child abuse dance epic “Barbarism Begins At Home,” which is surely playing on repeat somewhere in Hell’s Discotheque. What everyone agrees on is that “The Headmaster Ritual” — written about, and no this is not a joke, Morrissey’s hatred of high school gym class — features one of the best guitar riffs Johnny Marr ever wrote. All agree that “Meat Is Murder” is the stupidest song ever written by anyone in the history of modern recorded music.</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=eQTc4GolJt4\" target=\"_blank\">The Headmaster Ritual</a>” (<i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=SrUeAm1VMmo\">Barbarism Begins At Home <span>(live March 18th, 1985)</span></a>” (previously unreleased, originally from <i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=1nPT64U6X40\" target=\"_blank\">That Joke Isn’t Funny Anymore</a>” (<i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=nJS6F6S3b5s\" target=\"_blank\">Nowhere Fast</a>” (<i>Meat Is Murder</i>, 1985);</p>\n<p><span><b>The Smiths Commit Regicide: <i>The Queen Is Dead<br />\n</i></b></span>Before the gang gets to The Smiths’ most famous record, Jeff insists on stopping to recognize the greatness of their finest and most emblematic B-side: “Rubber Ring.” This is a song by Morrissey both about the songs he listened to as a child, and also self-consciously about how he realizes future generations will regard The Smiths themselves. Observant, warm-hearted, and catchy as heck, it explains nearly as well as any single song they ever recorded why this band has a cult surrounding them.</p>\n<p>But all that is prelude to <i>The Queen Is Dead</i>, which to this day remains the band’s most beloved album. Jeff states outright that the first four songs on <i>Queen </i>are actually garbage (he feels someone is pouring soil on his head every time he has to sit through “I Know It’s Over”) but “Cemetry Gates” may just be the single greatest thing they ever did and the rest of the album miraculously maintains that level, even the inevitable rockabilly number. (Seriously, “Vicar In A Tutu” is actually a good song.) Morrissey’s humor is in full flower here: he knocks on his own plagiarism issues with “Cemetry Gates,” commits majestic self-martyrdom on “Bigmouth Strikes Again,” and somehow ejects himself from his own home on “There Is A Light That Never Goes Out.” Michael and Jeff wonder how people could have ever misunderstood the winsome, open-hearted humor of “There Is A Light” — double-decker buses and ten-ton trucks aside, this is a song about being transported by the heights and depths of romantic emotion that still manages to undercut its own self-seriousness. And then the LP ends with an extended fat joke.</p>\n<p>The gang quickly surveys the four post-<i>Queen</i> singles the band released in 1986 and 1987, as they were working their way towards their swan-song. Everyone agrees that the highlight is the epochal “”Panic,” a song inspired by Morrissey’s appalled reaction to the BBC Radio 1 announcer who segued from announcing the Chernobyl meltdown to Wham’s new big hit single “I’m Your Man.” With Aztec Camera’s Craig Gannon on second guitar and a riff nicked from T. Rex, “Panic” somehow manages to end with a children’s choir singing alongside Morrissey about the urgent need to lynch all DJs, yet still sounds like a glorious triumph. Michael unpacks the suspect racial undertones of “Panic” with reference to some of Morrissey’s later solo provocations, and Scot singles out “Half A Person” as the great late Smiths B-side.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=3baT8twPM9s\" target=\"_blank\">Rubber Ring</a>“/”<a href=\"https://www.youtube.com/watch?v=LtTPhcpures\" target=\"_blank\">Asleep</a>” (B-side of “The Boy With The Thorn In His Side,” 1985); “<a href=\"https://www.youtube.com/watch?v=D5cZ-oLVJzY\" target=\"_blank\">Cemetry Gates</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=XW1Riwvr9SU\" target=\"_blank\">Bigmouth Strikes Again</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=4WPZMhFa84U\" target=\"_blank\">There Is A Light That Never Goes Out</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=uBuFyyw7mP8\" target=\"_blank\">Some Girls Are Bigger Than Others <span>(live December 12th, 1986)</span></a>” (B-side of “I Started Something I Couldn’t Finish,” 1987); “<a href=\"https://www.youtube.com/watch?v=XUGJjlkbDjQ\" target=\"_blank\">Panic</a>” (A-side of single, 1986); “<a href=\"https://www.youtube.com/watch?v=SvbuLtncmtw\" target=\"_blank\">Speedway</a>” <span>[Morrissey]</span> (<i>Vauxhall & I</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=ABemQIEhnEE\" target=\"_blank\">Half A Person</a>” (B-side of “Shoplifters Of The World Unite,” 1987)</p>\n<p><span><b>To the Madhouse with Them: <i>Strangeways Here We Come</i> Ends The Smiths’ Career<br />\n</b></span>Jeff loves <i>The Smiths</i>. Fans and critics adore <i>The Queen Is Dead</i>. But Morrissey and Marr insist, to this day, that The Smiths’ greatest achievement was their swan-song <i>Strangeways, Here We Come</i>. Are they blinkered or do they have a point? Jeff isn’t buying it, though he of course adores the wry humor of “Girlfriend In A Coma” (which also has the Spectorian virtue, as Michael observed earlier, of saying everything it needs to say in two minutes then going home). The standout track for Jeff is the exact opposite of “Girlfriend”: the messiest and most musically emotive song they ever recorded in “Death Of A Disco Dancer.” For all of Morrissey’s later attempts at political and social comment, this is the most brutally concise he ever got: “Love peace and harmony?/Very nice, very nice, very nice…but maybe in the next world.” Michael also praises the power pop of “Stop Me If You Think You’ve Heard This One Before” and the skiffle shuffle of “Unhappy Birthday” (though he finds material like “Death At One’s Elbow” to be disturbingly generic) and Scot concludes the discussion by saluting Morrissey’s jealous valediction to Marr, “I Won’t Share You.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=wy8mEOhSk0s\" target=\"_blank\">Girlfriend In A Coma</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=zqnFUVCoIL0\" target=\"_blank\">Death Of A Disco Dancer</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=QTqFdaVGRew\" target=\"_blank\">Stop Me If You Think You’ve Heard This One Before</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=f0qh7wHw3Jk\" target=\"_blank\">Unhappy Birthday</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=pgpfTP6EB-Q\" target=\"_blank\">I Won’t Share You</a>” (<i>Strangeways, Here We Come</i>, 1987)</p>\n<p><span><b>Finale<br />\n</b></span>Michael, Scot and Jeff each pick their two key albums and five key tracks by The Smiths.</p>\n",
  "pubDate": "Mon, 13 Nov 2017 12:00:20 +0000",
  "author": "studio@nationalreview.com (National Review)",
  "link": "https://www.nationalreview.com/media/political-beats",
  "content:encoded": "<p>Scot and Jeff talk to Michael C. Moynihan about The Smiths</p>\n<p><b>Introducing the Band<br />\n</b>Your hosts Scot Bertram (<a href=\"https://twitter.com/ScotBertram\" target=\"_blank\">@ScotBertram</a>) and Jeff Blehar (<a href=\"https://twitter.com/EsotericCD\" target=\"_blank\">@EsotericCD</a>) with guest Michael Moynihan, correspondent for Vice News Tonight on HBO and member of <a href=\"http://wethefifth.com/\" target=\"_blank\">the Fifth Column podcast</a>, Follow him on Twitter at <a href=\"https://twitter.com/mcmoynihan\" target=\"_blank\">@mcmoynihan</a> and read his past work both <a href=\"https://www.thedailybeast.com/author/michael-moynihan\" target=\"_blank\">here</a> and <a href=\"https://reason.com/people/michael-c-moynihan/articles\" target=\"_blank\">here</a>.</p>\n<p><span><b>Michael’s Musical Pick: The Smiths<br />\n</b></span>“Is it wrong not to always be glad?” This is the question Jeff poses as the gang launches into Lucky #13: the long-awaited blockbuster Political Beats tribute to The Smiths, legendarily reputed as one of the ’80s most literately mopey bands. (Jeff also pays tribute to <a href=\"https://www.youtube.com/watch?v=XQR78U6zvGI\" target=\"_blank\">a classic <i>Mystery Science Theater 3000</i> bit</a> in passing.) But Michael is immediately at pains to argue with The Smiths-as-miserabilists rap, and he explains that one of the reasons he loves them like no other band in the pantheon is Morrissey’s remarkable wit. Michael talks about getting into music as a kid, discovering postpunk in 1987, quickly finding his way to Newbury Comics in Boston and acquainting himself with the pride of Manchester: The Smiths. Like many a budding Smiths fanatic from the late ’80s and early ’90s, this involved a copy of <i>The Queen Is Dead</i> and an older brother questioning his heterosexuality. The rest is history, including Michael relocating temporarily to England and imbibing the mythos firsthand.</p>\n<p>Jeff’s intro to the band came later: college and a chance encounter with an eccentric friend who refused to lend her Smiths CDs to him because she valued them like other people value family heirlooms. Jeff emphasizes his love not only of Morrissey’s literate, playful lyrics, but actually elevates Johnny Marr’s contribution above it: even if only by a 51-49 margin, Jeff argues, this was Marr’s band, and his love of the eternal verities of melody, production, arrangement, and rock and pop are what make nearly every Smiths track from their beginning right up until the end worth hearing.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=k30XeJNAbt4\" target=\"_blank\">The Queen Is Dead</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=M661HAkr_Dk\" target=\"_blank\">William, It Was Really Nothing</a>” (A-side of single, 1984); “<a href=\"https://www.youtube.com/watch?v=8qCpYMKhj34\" target=\"_blank\">Rusholme Ruffians (alternate version)</a>” (unreleased, originally from <i>Meat Is Murder</i>, 1985)</p>\n<p><span><b>Morrissey meets Marr: The Formation of The Smiths and the Troubled Debut Album<br />\n</b></span>For an album as hailed as <i>The Smiths</i> (1984) is, it had an exceedingly troubled genesis and to this day gets mixed reviews from hardcore fans. The story goes thus: Johnny Marr (guitars, music) introduces himself to local scenester Stephen Morrissey (vocals, lyrics) and says they should form a band. Andy Rourke (bass) and Mike Joyce (drums) are then inducted into this inchoate group and the so-called “Smiths” record a single in a local studio on spec: without a recording contract in hand, but confident enough in their talent to pay out-of-pocket and send it around to various labels in search of a record deal. The name of the label that bit was Rough Trade; the name of the song is their legendary debut single “Hand In Glove.” But the obligatory album follow-up was a much bigger problem: after recording a full version of the debut LP with Teardrop Explodes guitarist Troy Tate producing, The Smiths scrapped it and re-recorded the entire thing from scratch with John Porter.</p>\n<p>And nobody in the gang can agree on its merits! Scot grants Jeff’s point that the Tate version of “Reel Around The Fountain” is magisterial, but he thinks this is the <i>worst</i> of The Smiths’ four proper studio LPs. Jeff thinks it’s their <i>best</i> studio LP, even better than <i>The Queen Is Dead</i>, and explains why in detail<i>. </i>Michael is in the middle: he loathes “The Hand That Rocks The Cradle” with eloquent passion, but praises the obscure B-sides from this era like “Accept Yourself,” “Wonderful Woman” and “Jeane.” How deep does the rabbit-hole go? This deep: Michael spends time praising <i>Sandie Shaw’s</i> (Smiths-produced) covers of “I Don’t Owe You Anything” and “Jeane” (and Jeff agrees)! Michael also calls out Andy Rourke’s follow-the-bouncing-ball bassline on “Pretty Girls Make Graves” and laughs about the song’s conceit as a Beach Boys number gone horribly wrong. He then spends time discussing his personal experiences with Rourke, and the cosmic unfairness of his lack of appreciation (including a depressing story about watching Rourke open for a Smiths cover band where <i>some other guy was pretending to be Andy Rourke</i>).</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=K6uEwpCdV3U\" target=\"_blank\">Hand In Glove</a>” (A-side of single, 1983; <i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=OYYZFx7_DS8\" target=\"_blank\">This Charming Man</a>” (A-side of single, 1983); “<a href=\"https://www.youtube.com/watch?v=VH5BSkVQLsw\" target=\"_blank\">What Difference Does It Make?</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=V04bUY5Kl8w\" target=\"_blank\">Reel Around The Fountain</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=TWvG-QZNsJk\" target=\"_blank\">Still Ill</a>” (<i>The Smiths, </i>1984); “<a href=\"https://www.youtube.com/watch?v=UZYf3-9LtlQ\" target=\"_blank\">You’ve Got Everything Now <span>(live at the BBC June 26th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=VZpmVgpRh9A\" target=\"_blank\">Suffer Little Children</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=azNq-XaaS9Q\" target=\"_blank\">The Hand That Rocks The Cradle</a>” (<i>The Smiths</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=lt1YqCpLoYY\" target=\"_blank\">Wonderful Woman</a>” (B-side of “This Charming Man,” 1983); “<a href=\"https://www.youtube.com/watch?v=csn0e27Wp54\">Jeane</a>” (B-side of “This Charming Man,” 1983); “<a href=\"https://www.youtube.com/watch?v=r_Ql8HglIDE\" target=\"_blank\">Pretty Girls Make Graves</a>” (<i>The Smiths</i>, 1984);</p>\n<p><span><b>The Smiths as the Last Great Non-Album Singles Band; <i>Hatful Of Hollow </i>and Smiths Compilations in General<br />\n</b></span>No discussion of The Smiths is complete if all you consider are their formal studio albums; this was one of the all-time great non-album-single acts of the rock era, and Jeff argues that they share the sad distinction with New Order of being the <i>last</i> great one. The gang has a hearty chuckle over the gloriously funny, self-parodying lyrics of “Heaven Knows I’m Miserable Now” and salute Andy Rourke’s lovely bass work, then ponder whether “William It Was Really Nothing” (with its two B-sides “Please Please Please Let Me Get What I Want” and “How Soon Is Now?”) is the greatest non-album single ever released during the 1980s. Michael takes a contrarian turn by insisting that he’s actually rather bored by “How Soon Is Now?” — the most famous Smiths song in the United States — but come on, now.</p>\n<p>This inevitably leads to a long and loving discussion of The Smiths’ adventures in repackaging. Few bands are better known for their sheer compilatory fury (especially given the relatively small overall discography) than The Smiths, but it actually makes sense given how nearly a third of their output was never released on an album. Jeff lays his cards down and declares <i>Hatful Of Hollow</i> (1984) to be the single greatest Smiths album ever released, even though it’s not even really an album: it’s essentially a revision of the debut LP and its various associated session recordings using impressively muscular, raw BBC takes in place of the overproduced studio versions. Add in all those great 1984 singles A’s & B’s, and in Jeff”s opinion you get the best value-for-money proposition in the band’s entire catalogue. Michael is a <i>Louder Than Bombs</i> (1987) man, which makes sense given that this was the USA’s (later) answer to <i>Hatful </i>and thus the one he grew up with: a sprawling 2LP set collecting a slew of non-album singles, B-sides, and obscurities.</p>\n<p>As the gang is talking about the wonderful miniatures of The Smiths’ B-sides and BBC sessions, Michael takes the opportunity to point out how terrible Morrissey is when working in longer form. Particular attention is paid to the self-indulgence of his autobiography (which he insisted on having released as a <a href=\"http://keyassets.timeincuk.net/inspirewp/live/wp-content/uploads/sites/28/2013/10/morrissey130913w1.jpg\">Penguin Classic</a>) and his even worse attempt at fiction, <i>List Of The Lost</i>. (<i>List</i> is so bad that it won an award for “worst sex scene” and yes, we are required per Jeff’s promise on the podcast to inflict it upon you <a href=\"http://www.telegraph.co.uk/content/dam/books/morrisseylist-large.jpg\">here</a>).</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=Roe9-DlhXzY\" target=\"_blank\">Heaven Knows I’m Miserable Now</a>” (A-side of single, 1984); “<a href=\"https://www.youtube.com/watch?v=OztC_7nkAd8\" target=\"_blank\">How Soon Is Now?</a>” (B-side of “William, It Was Really Nothing,” 1984); “<a href=\"https://www.youtube.com/watch?v=-T8R_VDTOYQ\" target=\"_blank\">Please, Please, Please Let Me Get What I Want</a>” (B-side of “William It Was Really Nothing,” 1984); “<a href=\"https://www.youtube.com/watch?v=7vxrDBFsMl0\">London</a>” (B-side of “Shoplifters Of The World Unite,” 1987); “<a href=\"https://www.youtube.com/watch?v=2SdhP2pLvD8\" target=\"_blank\">These Things Take Time <span>(live at the BBC June 26th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=ADj_YlTkRiY\" target=\"_blank\">Oscillate Wildly</a>” (B-side of “How Soon Is Now?,” 1985); “<a href=\"https://www.youtube.com/watch?v=Z0Y6UJ6AGmM\">This Night Has Opened My Eyes <span>(live at the BBC September 14th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984); “<a href=\"https://www.youtube.com/watch?v=wQvGXNmKe2o\" target=\"_blank\">Back To The Old House <span>(live at the BBC September 14th, 1983)</span></a>” (<i>Hatful Of Hollow</i>, 1984)</p>\n<p><span><b>The Smiths Go Rockabilly (?!) on <i>Meat Is Murder<br />\n</i></b></span>Yes the lamentably stupid title track (people: Morrissey <i>moos</i>) would make all but the most devoted vegan run directly to Ruth’s Chris and order a juicy rare steak, but Michael and Scot both contend that The Smiths’ proper sophomore album <i>Meat Is Murder</i> is actually their most underrated record. Jeff really isn’t into the “behold, I am now Scotty Moore!” rockabilly trip that Johnny Marr is suddenly on with tracks like “Rusholme Ruffians” and “Shakespeare’s Sister,” but Scot has high praise for the puckish insouciance of “Nowhere Fast.” Much more to Jeff’s taste is the shimmering depression of “That Joke Isn’t Funny Anymore” and the child abuse dance epic “Barbarism Begins At Home,” which is surely playing on repeat somewhere in Hell’s Discotheque. What everyone agrees on is that “The Headmaster Ritual” — written about, and no this is not a joke, Morrissey’s hatred of high school gym class — features one of the best guitar riffs Johnny Marr ever wrote. All agree that “Meat Is Murder” is the stupidest song ever written by anyone in the history of modern recorded music.</p>\n<p>“<a href=\"https://www.youtube.com/watch?v=eQTc4GolJt4\" target=\"_blank\">The Headmaster Ritual</a>” (<i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=SrUeAm1VMmo\">Barbarism Begins At Home <span>(live March 18th, 1985)</span></a>” (previously unreleased, originally from <i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=1nPT64U6X40\" target=\"_blank\">That Joke Isn’t Funny Anymore</a>” (<i>Meat Is Murder</i>, 1985); “<a href=\"https://www.youtube.com/watch?v=nJS6F6S3b5s\" target=\"_blank\">Nowhere Fast</a>” (<i>Meat Is Murder</i>, 1985);</p>\n<p><span><b>The Smiths Commit Regicide: <i>The Queen Is Dead<br />\n</i></b></span>Before the gang gets to The Smiths’ most famous record, Jeff insists on stopping to recognize the greatness of their finest and most emblematic B-side: “Rubber Ring.” This is a song by Morrissey both about the songs he listened to as a child, and also self-consciously about how he realizes future generations will regard The Smiths themselves. Observant, warm-hearted, and catchy as heck, it explains nearly as well as any single song they ever recorded why this band has a cult surrounding them.</p>\n<p>But all that is prelude to <i>The Queen Is Dead</i>, which to this day remains the band’s most beloved album. Jeff states outright that the first four songs on <i>Queen </i>are actually garbage (he feels someone is pouring soil on his head every time he has to sit through “I Know It’s Over”) but “Cemetry Gates” may just be the single greatest thing they ever did and the rest of the album miraculously maintains that level, even the inevitable rockabilly number. (Seriously, “Vicar In A Tutu” is actually a good song.) Morrissey’s humor is in full flower here: he knocks on his own plagiarism issues with “Cemetry Gates,” commits majestic self-martyrdom on “Bigmouth Strikes Again,” and somehow ejects himself from his own home on “There Is A Light That Never Goes Out.” Michael and Jeff wonder how people could have ever misunderstood the winsome, open-hearted humor of “There Is A Light” — double-decker buses and ten-ton trucks aside, this is a song about being transported by the heights and depths of romantic emotion that still manages to undercut its own self-seriousness. And then the LP ends with an extended fat joke.</p>\n<p>The gang quickly surveys the four post-<i>Queen</i> singles the band released in 1986 and 1987, as they were working their way towards their swan-song. Everyone agrees that the highlight is the epochal “”Panic,” a song inspired by Morrissey’s appalled reaction to the BBC Radio 1 announcer who segued from announcing the Chernobyl meltdown to Wham’s new big hit single “I’m Your Man.” With Aztec Camera’s Craig Gannon on second guitar and a riff nicked from T. Rex, “Panic” somehow manages to end with a children’s choir singing alongside Morrissey about the urgent need to lynch all DJs, yet still sounds like a glorious triumph. Michael unpacks the suspect racial undertones of “Panic” with reference to some of Morrissey’s later solo provocations, and Scot singles out “Half A Person” as the great late Smiths B-side.</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=3baT8twPM9s\" target=\"_blank\">Rubber Ring</a>“/”<a href=\"https://www.youtube.com/watch?v=LtTPhcpures\" target=\"_blank\">Asleep</a>” (B-side of “The Boy With The Thorn In His Side,” 1985); “<a href=\"https://www.youtube.com/watch?v=D5cZ-oLVJzY\" target=\"_blank\">Cemetry Gates</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=XW1Riwvr9SU\" target=\"_blank\">Bigmouth Strikes Again</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=4WPZMhFa84U\" target=\"_blank\">There Is A Light That Never Goes Out</a>” (<i>The Queen Is Dead</i>, 1986); “<a href=\"https://www.youtube.com/watch?v=uBuFyyw7mP8\" target=\"_blank\">Some Girls Are Bigger Than Others <span>(live December 12th, 1986)</span></a>” (B-side of “I Started Something I Couldn’t Finish,” 1987); “<a href=\"https://www.youtube.com/watch?v=XUGJjlkbDjQ\" target=\"_blank\">Panic</a>” (A-side of single, 1986); “<a href=\"https://www.youtube.com/watch?v=SvbuLtncmtw\" target=\"_blank\">Speedway</a>” <span>[Morrissey]</span> (<i>Vauxhall & I</i>, 1994); “<a href=\"https://www.youtube.com/watch?v=ABemQIEhnEE\" target=\"_blank\">Half A Person</a>” (B-side of “Shoplifters Of The World Unite,” 1987)</p>\n<p><span><b>To the Madhouse with Them: <i>Strangeways Here We Come</i> Ends The Smiths’ Career<br />\n</b></span>Jeff loves <i>The Smiths</i>. Fans and critics adore <i>The Queen Is Dead</i>. But Morrissey and Marr insist, to this day, that The Smiths’ greatest achievement was their swan-song <i>Strangeways, Here We Come</i>. Are they blinkered or do they have a point? Jeff isn’t buying it, though he of course adores the wry humor of “Girlfriend In A Coma” (which also has the Spectorian virtue, as Michael observed earlier, of saying everything it needs to say in two minutes then going home). The standout track for Jeff is the exact opposite of “Girlfriend”: the messiest and most musically emotive song they ever recorded in “Death Of A Disco Dancer.” For all of Morrissey’s later attempts at political and social comment, this is the most brutally concise he ever got: “Love peace and harmony?/Very nice, very nice, very nice…but maybe in the next world.” Michael also praises the power pop of “Stop Me If You Think You’ve Heard This One Before” and the skiffle shuffle of “Unhappy Birthday” (though he finds material like “Death At One’s Elbow” to be disturbingly generic) and Scot concludes the discussion by saluting Morrissey’s jealous valediction to Marr, “I Won’t Share You.”</p>\n<p><u>KEY TRACKS</u>: “<a href=\"https://www.youtube.com/watch?v=wy8mEOhSk0s\" target=\"_blank\">Girlfriend In A Coma</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=zqnFUVCoIL0\" target=\"_blank\">Death Of A Disco Dancer</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=QTqFdaVGRew\" target=\"_blank\">Stop Me If You Think You’ve Heard This One Before</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=f0qh7wHw3Jk\" target=\"_blank\">Unhappy Birthday</a>” (<i>Strangeways, Here We Come</i>, 1987); “<a href=\"https://www.youtube.com/watch?v=pgpfTP6EB-Q\" target=\"_blank\">I Won’t Share You</a>” (<i>Strangeways, Here We Come</i>, 1987)</p>\n<p><span><b>Finale<br />\n</b></span>Michael, Scot and Jeff each pick their two key albums and five key tracks by The Smiths.</p>\n",
  "enclosure": "",
  "itunes:title": "Episode 13: Michael C. Moynihan / The Smiths",
  "itunes:author": "National Review",
  "itunes:duration": "02:07:02",
  "itunes:summary": "Scot and Jeff talk to Michael C. Moynihan about The Smiths.",
  "itunes:subtitle": "Scot and Jeff talk to Michael C. Moynihan about The Smiths.",
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "itunes:episode": 13
}