{
  "title": "Episode 60: The Full Monty Backstage - Body Image and Gender Differences",
  "pubDate": "Tue, 17 Jun 2008 13:00:29 +0000",
  "guid": "episode-60-the-full-monty-backstage-body-image",
  "link": "http://www.thepsychfiles.com/2008/06/17/episode-60-the-full-monty-backstage-body-image-and-gender-differences/",
  "itunes:image": "",
  "description": "The Full Monty: maybe you've seen the movie or the musical, but what is it like backstage?  What are the actors thinking?  What would you be thinking if you had to take your clothes off in front of an audience?  Would it make a difference if you were a man or a woman?  How so?  This week I take a look at the Full Monty and issues like body image and gender.  I interview the cast and I think you'll find their views very interesting.  Join me as I go backstage and explore the psychological and societal issues brought up by The Full Monty musical.",
  "content:encoded": "The Full Monty: maybe you've seen the movie or the musical, but what is it like backstage?  What are the actors thinking?  What would you be thinking if you had to take your clothes off in front of an audience?  Would it make a difference if you were a man or a woman?  How so?  This week I take a look at the Full Monty and issues like body image and gender.  I interview the cast and I think you'll find their views very interesting.  Join me as I go backstage and explore the psychological and societal issues brought up by The Full Monty musical.",
  "enclosure": "",
  "itunes:duration": "36:48",
  "itunes:explicit": false,
  "itunes:keywords": "the,image,Full,Body,monty,gender",
  "itunes:subtitle": "The Full Monty: maybe you've seen the movie or the musical, but what is it like backstage? What are the actors thinking? Join me as I go backstage and explore the psychological and societal issues brought up by The Full Monty musical.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "The Full Monty: maybe you've seen the movie or the musical, but what is it like backstage? What are the actors thinking? What would you be thinking if you had to take your clothes off in front of an audience? Would it make a difference if you were a man or a woman? How so? This week I take a look at the Full Monty and issues like body image and gender. I interview the cast and I think you'll find their views very interesting. Join me as I go backstage and explore the psychological and societal issues brought up by The Full Monty musical."
}