{
  "title": "Paul Pelosi released from hospital",
  "link": "https://www.rt.com/news/565930-paul-pelosi-released-hospital/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565930-paul-pelosi-released-hospital/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636487e620302731705b1605.jpg\" /> Paul Pelosi, the husband of the US House speaker, was released from the hospital nearly a week after he was attacked inside his own home <br/><a href=\"https://www.rt.com/news/565930-paul-pelosi-released-hospital/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The husband of the US House speaker was treated for skull fractures after a brutal hammer attack</strong></p>\n            \n                        \n            <p>Paul Pelosi has been discharged from the hospital nearly a week after an intruder broke into his home and attacked him with a hammer, delivering blows to his head, hands, and arm. The 82-year-old is now recovering at home after undergoing surgery.</p>\n<p><strong></strong><em>&ldquo;Paul remains under doctors&rsquo; care as he continues to progress on a long recovery process and convalescence,&rdquo;</em> the office of his wife, US House Speaker Nancy Pelosi, said in a <a href=\"https://www.speaker.gov/newsroom/11322-3\" target=\"_blank\" rel=\"noopener noreferrer\">statement</a> on Thursday. <em>&ldquo;He is now home surrounded by his family who request privacy.&rdquo;</em></p>\n<p><strong></strong>The elderly man came under <a href=\"https://www.rt.com/news/565522-pelosi-speaker-home-attacked/\" target=\"_blank\" rel=\"noopener noreferrer\">attack</a> last Friday after David DePape, 42, entered the Pelosis&rsquo; San Francisco residence searching for the House speaker, according to the FBI. Investigators say DePape planned to take the lawmaker hostage, but ultimately assaulted her husband when he did not find her, as she was in Washington, DC at the time.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/636042132030275b5a617feb.jpg\" alt=\"Police tape is seen in front of the home of US House Speaker Nancy Pelosi in San Francisco, California, October 28, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565701-nancy-pelosi-attacker-canadian/\">Pelosi attacker faces 50 years in prison</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Police recovered plastic zip ties, rope, a roll of tape, a hammer, and multiple types of gloves from the scene, and DePape <a href=\"https://archive.ph/WuCiM\" target=\"_blank\" rel=\"noopener noreferrer\">reportedly</a> told responding officers that he was on a <em>&ldquo;suicide mission&rdquo;</em> to kidnap the House speaker. Despite repeatedly striking Paul Pelosi in the head with a hammer, he also claimed he <em>&ldquo;didn't really want to hurt&rdquo;</em> the man.</p>\n<p><strong></strong>The attack left Pelosi with a fractured skull, for which he required surgery, as well as injuries to his right arm and both of his hands. He managed to speak to police before he was brought to the hospital, however, saying DePape appeared in his bedroom around 2:30am demanding to speak with his wife. Pelosi was able to call 911 after the break-in, but was found struggling with the suspect when officers arrived.</p>\n<p><strong></strong>DePape now faces a series of state and federal charges, including attempted murder, attempted kidnapping, and an assault on the family member of a US official, according to prosecutors. The Department of Homeland Security has <a href=\"https://www.cnn.com/2022/11/03/politics/david-depape-paul-pelosi-attack/index.html\" target=\"_blank\" rel=\"noopener noreferrer\">confirmed</a> reports that DePape, a Canadian national, had been in the country illegally for several years, though his immigration status is unlikely to affect his current case, as deportations typically only occur after criminal matters are resolved.</p>\n<p><strong></strong>DePape entered a not guilty plea for all state-level charges during a hearing on Tuesday, but has yet to appear in federal court.</p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 03:38:46 +0000",
  "dc:creator": "RT"
}