{
  "title": "Ambiguous loss and the “myth of closure,” with Pauline Boss, PhD",
  "itunes:title": "Ambiguous loss and the “myth of closure,” with Pauline Boss, PhD",
  "pubDate": "Wed, 09 Mar 2022 11:30:00 +0000",
  "guid": "ec18b819-b58f-4777-8e19-196b9588c5c5",
  "link": "http://sopapa.libsyn.com/ambiguous-loss-and-the-myth-of-closure-with-pauline-boss-phd",
  "itunes:image": "",
  "description": "<p>March 11 marks two years since the World Health Organization declared COVID-19 a pandemic. With another variant waning, many people are hoping, yet again, to close the book on COVID and move on. But what if there’s a different way to think about life after loss? Pauline Boss, PhD, author of “The Myth of Closure: Ambiguous Loss in a Time of Pandemic and Change,” talks about what we have learned about grief, resilience and moving on after two years of pandemic life.<br /> <br /> Links<br /> <br /> <a href=\"https://www.ambiguousloss.com\">Pauline Boss, PhD</a><br /> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "content:encoded": "<p>March 11 marks two years since the World Health Organization declared COVID-19 a pandemic. With another variant waning, many people are hoping, yet again, to close the book on COVID and move on. But what if there’s a different way to think about life after loss? Pauline Boss, PhD, author of “The Myth of Closure: Ambiguous Loss in a Time of Pandemic and Change,” talks about what we have learned about grief, resilience and moving on after two years of pandemic life.  Links  <a href=\"https://www.ambiguousloss.com\">Pauline Boss, PhD</a> <a href= \"https://www.apa.org/news/podcasts/speaking-of-psychology\">Speaking of Psychology Home Page</a></p>",
  "enclosure": "",
  "itunes:duration": "29:08",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "March 11 marks two years since the World Health Organization declared COVID-19 a pandemic. With another variant waning, many people are hoping, yet again, to close the book on COVID and move on. But what if there’s a different way to think about...",
  "itunes:episode": 181,
  "itunes:episodeType": "full"
}