{
  "title": "Der Tag - Überflieger oder Pannenminister - Wieviel Substanz steckt in Robert Habeck?",
  "link": "https://www.deutschlandfunk.de/07-09-2021-habecks-gestoppter-hoehenflug-dlf-c5680519-100.html",
  "description": "<img src=\"https://assets.deutschlandfunk.de/6ce2e15c-7808-494d-9368-b6e4a0166654/2400x1350.jpg?t=1662480815966\" alt=\"Robert Habeck (Bündnis 90/Die Grünen), Bundesminister für Wirtschaft und Klimaschutz, gibt in der Bundespressekonferenz die Ergebnisse des Stresstests zum Weiterbetrieb von Atomkraftwerken bekannt. Beim Stresstest sollten die Auswirkungen der angespannten Lage auf den Energiemärkten auf die Sicherheit der Stromversorgung untersucht werden. Auf der Grundlage soll die Entscheidung über einen möglichen Weiterbetrieb der letzten drei Atomkraftwerke in Deutschland über das Jahresende hinaus getroffen werden.\" title=\"Robert Habeck (Bündnis 90/Die Grünen), Bundesminister für Wirtschaft und Klimaschutz, gibt in der Bundespressekonferenz die Ergebnisse des Stresstests zum Weiterbetrieb von Atomkraftwerken bekannt. Beim Stresstest sollten die Auswirkungen der angespannten Lage auf den Energiemärkten auf die Sicherheit der Stromversorgung untersucht werden. Auf der Grundlage soll die Entscheidung über einen möglichen Weiterbetrieb der letzten drei Atomkraftwerke in Deutschland über das Jahresende hinaus getroffen werden.\"\n                    width=\"144\" height=\"81\" border=\"0\" align=\"left\" hspace=\"4\" vspace=\"4\"/>Die Gasumlage, die AKW-Entscheidung und ein verunglücktes Interview – wenigen Wochen ist Robert Habeck vom heimlichen Kanzler zum „Sicherheitsrisiko“ für die Bundesregierung geworden. Susanne Gaschke, Welt-Journalistin und Habeck-Biografin erklärt, warum sie die aktuelle Bewertung von Habeck ungerecht findet.<br clear=\"all\"/><br/>Von Philipp May<br/><a title=\"Direkter Link zur Audiodatei\" href=\"https://podcast-mp3.dradio.de/podcast/2022/09/07/07092021_habecks_gestoppter_hoehenflug_dlf_20220907_1700_c5680519.mp3\">Direkter Link zur Audiodatei</a><br/><p><br/></p>",
  "guid": "https://podcast-mp3.dradio.de/podcast/2022/09/07/07092021_habecks_gestoppter_hoehenflug_dlf_20220907_1700_c5680519.mp3",
  "pubDate": "Wed, 07 Sep 2022 17:00:00 +0200",
  "enclosure": "",
  "itunes:author": "Von Philipp May",
  "itunes:duration": "25:39"
}