{
  "title": "The Age of Mass Migration and the 1920 Border Closure with Leah Boustan",
  "pubDate": "Sat, 21 Dec 2019 02:01:17 +0000",
  "guid": "92a631d7-aff1-41b2-9efc-f38f29d62780",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP137Boustan_EDR.mp3",
  "itunes:image": "",
  "description": "<p>Today's guest is <a href=\"https://twitter.com/leah_boustan\" target=\"_blank\" rel=\"noopener\">Leah Boustan</a> of Princeton University. Our discussion centers around her recent working paper, <a href=\"https://www.nber.org/papers/w26536\" target=\"_blank\" rel= \"noopener\">\"The Effects of Immigration on the Economy: Lessons from the 1920s Border Closure.\"</a></p> <blockquote>In the 1920s, the United States substantially reduced immigrant entry by imposing country-specific quotas. We compare local labor markets with more or less exposure to the national quotas due to differences in initial immigrant settlement. A puzzle emerges: the earnings of existing US-born workers declined after the border closure, despite the loss of immigrant labor supply. We find that more skilled US-born workers – along with unrestricted immigrants from Mexico and Canada – moved into affected urban areas, completely replacing European immigrants. By contrast, the loss of immigrant workers encouraged farmers to shift toward capital-intensive agriculture and discouraged entry from unrestricted workers.</blockquote> <p>We also discuss her broader body of work on the age of mass migration. At the peak of this era, the United States had a foreign-born population of 15%. Today, after a century of restricted immigration, the United States foreign-born population has only just returned to 15%.</p> <p>It's a fascinating discussion with special relevance to today's debates about immigration.</p> <hr />",
  "content:encoded": "<p>Today's guest is <a href=\"https://twitter.com/leah_boustan\" target=\"_blank\" rel=\"noopener\">Leah Boustan</a> of Princeton University. Our discussion centers around her recent working paper, <a href=\"https://www.nber.org/papers/w26536\" target=\"_blank\" rel= \"noopener\">\"The Effects of Immigration on the Economy: Lessons from the 1920s Border Closure.\"</a></p> In the 1920s, the United States substantially reduced immigrant entry by imposing country-specific quotas. We compare local labor markets with more or less exposure to the national quotas due to differences in initial immigrant settlement. A puzzle emerges: the earnings of existing US-born workers declined after the border closure, despite the loss of immigrant labor supply. We find that more skilled US-born workers – along with unrestricted immigrants from Mexico and Canada – moved into affected urban areas, completely replacing European immigrants. By contrast, the loss of immigrant workers encouraged farmers to shift toward capital-intensive agriculture and discouraged entry from unrestricted workers. <p>We also discuss her broader body of work on the age of mass migration. At the peak of this era, the United States had a foreign-born population of 15%. Today, after a century of restricted immigration, the United States foreign-born population has only just returned to 15%.</p> <p>It's a fascinating discussion with special relevance to today's debates about immigration.</p> ",
  "enclosure": "",
  "itunes:duration": "52:25",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Today's guest is  of Princeton University. Our discussion centers around her recent working paper,  In the 1920s, the United States substantially reduced immigrant entry by imposing country-specific quotas. We compare local labor markets with more or...",
  "itunes:episode": 137,
  "itunes:episodeType": "full"
}