{
  "title": "Episode 143: &#8220;Summer in the City&#8221; by the Lovin&#8217; Spoonful",
  "link": "https://500songs.com/podcast/episode-143-summer-in-the-city-by-the-lovin-spoonful/",
  "pubDate": "Mon, 07 Feb 2022 03:29:55 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/?post_type=podcast&#038;p=1029",
  "description": "Episode 143 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Summer in the City’”, and at the short but productive career of the Lovin' Spoonful.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/62219654\">on \"The Sun Ain't Gonna Shine Any More\" by the Walker Brothers</a> and the strange career of Scott Walker.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-143-summer-in-the-city/\">Mixcloud</a>.\n\n<a href=\"https://amzn.to/3GvVIJ1\">This box set</a> contains all four studio albums by the Lovin' Spoonful, plus the one album by \"The Lovin' Spoonful featuring Joe Butler\", while <a href=\"https://amzn.to/3HzREsn\">this CD</a> contains their two film soundtracks (mostly inessential instrumental filler, apart from \"Darling Be Home Soon\")\n\nInformation about harmonicas and harmonicists comes from <a href=\"https://amzn.to/3gr0BZ4\"><em>Harmonicas, Harps, and Heavy Breathers</em> by Kim Field.</a>\n\nThere are only three books about the Lovin' Spoonful, but all are worth reading.<a href=\"https://amzn.to/3HJRsH2\"> <em>Do You Believe in Magic?</em> by Simon Wordsworth</a> is a good biography of the band, while his <a href=\"https://amzn.to/3GJFsEx\"><em>The Magic's in the Music</em></a> is a scrapbook of press cuttings and reminiscences. Meanwhile Steve Boone's<a href=\"https://amzn.to/3sEYjeX\"> <em>Hotter Than a Match Head: My Life on the Run with the Lovin' Spoonful </em></a>has rather more discussion of the actual music than is normal in a musician's autobiography.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLet's talk about the harmonica for a while. The harmonica is an instrument that has not shown up a huge amount in the podcast, but which was used in a fair bit of the music we've covered. We've heard it for example on records by Bo Diddley:\n\n[Excerpt: Bo Diddley, \"I'm a Man\"]\n\nand by Bob Dylan:\n\n[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]\n\nand the Rolling Stones:\n\n[Excerpt: The Rolling Stones, \"Little Red Rooster\"]\n\nIn most folk and blues contexts, the harmonicas used are what is known as a diatonic harmonica, and these are what most people think of when they think of harmonicas at all. Diatonic harmonicas have the notes of a single key in them, and if you want to play a note in another key, you have to do interesting tricks with the shape of your mouth to bend the note.\n\nThere's another type of harmonica, though, the chromatic harmonica. We've heard that a time or two as well, like on \"Love Me Do\" by the Beatles:\n\n[Excerpt: The Beatles, \"Love Me Do\"]\n\nChromatic harmonicas have sixteen holes, rather than the diatonic harmonica's ten, and they also have a slide which you can press to raise the note by a semitone, meaning you can play far more notes than on a diatonic harmonica -- but they're also physically harder to play, requiring a different kind of breathing to pull off playing one successfully. They're so different that John Lennon would distinguish between the two instruments -- he'd describe a chromatic harmonica as a harmonica, but a diatonic harmonica he would call a harp, like blues musicians often did:\n\n[Excerpt: The Beatles, \"Love These Goon Shows\"]\n\nWhile the chromatic harmonica isn't a particularly popular instrument in rock music, it is one that has had some success in other fields. There have been some jazz and light-orchestral musicians who have become famous playing the instrument, like the jazz musician Max Geldray, who played in those Goon Shows the Beatles loved so much:\n\n[Excerpt: Max Geldray, \"C-Jam Blues\"]\n\nAnd in the middle of the twentieth century there were a few musicians who succeeded in making the harmonica into an instrument that was actually respected in serious classical music. By far the most famous of these was Larry Adler, who became almost synonymous with the instrument in the popular consciousness, and who reworked many famous pieces of music for the instrument:\n\n[Excerpt: Larry Adler, \"Rhapsody in Blue\"]\n\nBut while Adler was the most famous classical harmonicist of his generation, he was not generally considered the best by other musicians. That was, rather, a man named John Sebastian. Sebastian, who chose to take his middle name as a surname partly to Anglicise his name but also, it seems, at least in part as tribute to Johann Sebastian Bach (which incidentally now makes it really, really difficult to search for copies of his masterwork \"John Sebastian Plays Bach\", as Internet searches uniformly think you're searching just for the composer...) started out like almost all harmonica players as an amateur playing popular music.\n\nBut he quickly got very, very, good, and by his teens he was already teaching other children, including at a summer camp run by Albert Hoxie, a musician and entrepreneur who was basically single-handedly responsible for the boom in harmonica sales in the 1920s and 1930s, by starting up youth harmonica orchestras -- dozens or even hundreds of kids, all playing harmonica together, in a semi-militaristic youth organisation something like the scouts, but with harmonicas instead of woggles and knots.\n\nHoxie's group and the various organisations copying it led to there being over a hundred and fifty harmonica orchestras in Chicago alone, and in LA in the twenties and thirties a total of more than a hundred thousand children passed through harmonica orchestras inspired by Hoxie.\n\nHoxie's youth orchestras were largely responsible for the popularity of the harmonica as a cheap instrument for young people, and thus for its later popularity in the folk and blues worlds. That was only boosted in the Second World War by the American Federation of Musicians recording ban, which we talked about in the early episodes of the podcast -- harmonicas had never been thought of as a serious instrument, and so most professional harmonica players were not members of the AFM, but were considered variety performers and were part of the American Guild of Variety Artists, along with singers, ukulele players, and musical saw players. Of course, the war did also create a problem, because the best harmonicas were made in Germany by the Hohner company, but soon a lot of American companies started making cheap harmonicas to fill the gap in the market.\n\nThere's a reason the cliche of the GI in a war film playing a harmonica in the trenches exists, and it's largely because of Hoxie. And Hoxie was based in Philadelphia, where John Sebastian lived as a kid, and he mentored the young player, who soon became a semi-professional performer.\n\nSebastian's father was a rich banker, and discouraged him from becoming a full-time musician -- the plan was that after university, Sebastian would become a diplomat. But as part of his preparation for that role, he was sent to spend a couple of years studying at the universities of Rome and Florence, learning about Italian culture.\n\nOn the boat back, though, he started talking to two other passengers, who turned out to be the legendary Broadway songwriting team Rodgers and Hart, the writers of such classic songs as \"Blue Moon\" and \"My Funny Valentine\":\n\n[Excerpt: Ella Fitzgerald, \"My Funny Valentine\"]\n\nSebastian talked to his new friends, and told them that he was feeling torn between being a musician and being in the foreign service like his father wanted. They both told him that in their experience some people were just born to be artists, and that those people would never actually find happiness doing anything else. He took their advice, and decided he was going to become a full-time harmonica player.\n\nHe started out playing in nightclubs, initially playing jazz and swing, but only while he built up a repertoire of classical music. He would rehearse with a pianist for three hours every day, and would spend the rest of his time finding classical works, especially baroque ones, and adapting them for the harmonica. As he later said “I discovered sonatas by Telemann, Veracini, Bach, Handel, Vivaldi, Hasse, Marcello, Purcell, and many others, which were written to be played on violin, flute, oboe, musette, even bagpipes... The composer seemed to be challenging each instrument to create the embellishments and ornaments to suit its particular voice. . . . I set about choosing works from this treasure trove that would best speak through my instrument.”\n\nSoon his nightclub repertoire was made up entirely of these classical pieces, and he was making records like John Sebastian Plays Bach:\n\n[Excerpt: John Sebastian, \"Flute Sonata in B Minor BWV1030 (J.S. Bach)\"]\n\nAnd while Sebastian was largely a lover of baroque music above all other forms, he realised that he would have to persuade new composers to write new pieces for the instrument should he ever hope for it to have any kind of reputation as a concert instrument, so he persuaded contemporary composers to write pieces like George Kleinsinger's \"Street Corner Concerto\", which Sebastian premiered with the New York Philharmonic:\n\n[Excerpt: John Sebastian, \"Street Corner Concerto\"]\n\nHe became the first harmonica player to play an entirely classical repertoire, and regarded as the greatest player of his instrument in the world. The oboe player Jay S Harrison once wrote of seeing him perform \"to accomplish with success a program of Mr. Sebastian’s scope is nothing short of wizardry. . . . He has vast technical facility, a bulging range of colors, and his intentions are ever musical and sophisticated. In his hands the harmonica is no toy, no simple gadget for the dispensing of homespun tunes. Each single number of the evening was whittled, rounded, polished, and poised. . . . Mr. Sebastian’s playing is uncanny.\"\n\nSebastian came from a rich background, and he managed to earn enough as a classical musician to live the lifestyle of a rich artistic Bohemian. During the forties and fifties he lived in Greenwich Village with his family -- apart from a four-year period living in Rome from 1951 to 55 -- and Eleanor Roosevelt was a neighbour, while Vivian Vance, who played Ethel Mertz on I Love Lucy, was the godmother of his eldest son.\n\nBut while Sebastian's playing was entirely classical, he was interested in a wider variety of music. When he would tour Europe, he would often return having learned European folk songs, and while he was living in Greenwich Village he would often be visited by people like Burl Ives, Woody Guthrie, and other folk singers living in the area.\n\nAnd that early influence rubbed off on Sebastian's son, John Benson Sebastian, although young John gave up trying to learn the harmonica the first time he tried, because he didn't want to be following too closely in his father's footsteps. Sebastian junior did, though, take up the guitar, inspired by the first wave rock and rollers he was listening to on Alan Freed's show, and he would later play the harmonica, though the diatonic harmonica rather than the chromatic.\n\nIn case you haven't already figured it out, John Benson Sebastian, rather than his father, is a principal focus of this episode, and so to avoid confusion, from this point on, when I refer to \"John Sebastian\" or \"Sebastian\" without any qualifiers, I'm referring to the younger man. When I refer to \"John Sebastian Sr\" I'm talking about the father.\n\nBut it was John Sebastian Sr's connections, in particular to the Bohemian folk and blues scenes, which gave his more famous son his first connection to that world of his own, when Sebastian Sr appeared in a TV show, in November 1960, put together by Robert Herridge, a TV writer and producer who was most famous for his drama series but who had also put together documentaries on both classical music and jazz, including the classic performance documentary The Sound of Jazz.\n\nHerridge's show featured both Sebastian Sr and the country-blues player Lightnin' Hopkins:\n\n[Excerpt: Lightnin' Hopkins, \"Blues in the Bottle\"]\n\nHopkins was one of many country-blues players whose career was having a second wind after his discovery by the folk music scene. He'd been recording for fourteen years, putting out hundreds of records, but had barely performed outside Houston until 1959, when the folkies had picked up on his work, and in October 1960 he had been invited to play Carnegie Hall, performing with Pete Seeger and Joan Baez.\n\nYoung John Sebastian had come along with his dad to see the TV show be recorded, and had an almost Damascene conversion -- he'd already heard Hopkins' recordings, but had never seen anything like his live performances. He was at that time attending a private boarding school, Blair Academy, and his roommate at the school also had his own apartment, where Sebastian would sometimes stay. Soon Lightnin' Hopkins was staying there as well, as somewhere he could live rent-free while he was in New York.\n\nSebastian started following Hopkins around and learning everything he could, being allowed by the older man to carry his guitar and buy him gin, though the two never became close. But eventually, Hopkins would occasionally allow Sebastian to play with him when he played at people's houses, which he did on occasion. Sebastian became someone that Hopkins trusted enough that when he was performing on a bill with someone else whose accompanist wasn't able to make the gig and Sebastian put himself forward, Hopkins agreed that Sebastian would be a suitable accompanist for the evening.\n\nThe singer he accompanied that evening was a performer named Valentine Pringle, who was a protege of Harry Belafonte, and who had a similar kind of sound to Paul Robeson. Sebastian soon became Pringle's regular accompanist, and played on his first album, I Hear America Singing, which was also the first record on which the great trumpet player Hugh Masakela played. Sadly, Paul Robeson style vocals were so out of fashion by that point that that album has never, as far as I can tell, been issued in a digital format, and hasn't even been uploaded to YouTube.  But this excerpt from a later recording by Pringle should give you some idea of the kind of thing he was doing:\n\n[Excerpt: Valentine Pringle, \"Go 'Way From My Window\"]\n\nAfter these experiences, Sebastian started regularly going to shows at Greenwich Village folk clubs, encouraged by his parents -- he had an advantage over his peers because he'd grown up in the area and had artistic parents, and so he was able to have a great deal of freedom that other people in their teens weren't. In particular, he would always look out for any performances by the great country blues performer Mississippi John Hurt.\n\nHurt had made a few recordings for Okeh records in 1928, including an early version of \"Stagger Lee\", titled \"Stack O'Lee\":\n\n[Excerpt: Mississippi John Hurt, \"Stack O'Lee Blues\"]\n\nBut those records had been unsuccessful, and he'd carried on working on a farm. and not performed other than in his tiny home town of Avalon, Mississippi, for decades. But then in 1952, a couple of his tracks had been included on the Harry Smith Anthology, and as a result he'd come to the attention of the folk and blues scholar community. They'd tried tracking him down, but been unable to until in the early sixties one of them had discovered a track on one of Hurt's records, \"Avalon Blues\", and in 1963, thirty-five years after he'd recorded six flop singles, Mississippi John Hurt became a minor star, playing the Newport Folk Festival and appearing on the Tonight Show.\n\nBy this time, Sebastian was a fairly well-known figure in Greenwich Village, and he had become quite a virtuoso on the harmonica himself, and would walk around the city wearing a holster-belt containing harmonicas in a variety of different keys. Sebastian became a huge fan of Hurt, and would go and see him perform whenever Hurt was in New York. He soon found himself first jamming backstage with Hurt, and then performing with him on stage for the last two weeks of a residency. He was particularly impressed with what he called Hurt's positive attitude in his music -- something that Sebastian would emulate in his own songwriting.\n\nSebastian was soon invited to join a jug band, called the Even Dozen Jug Band. Jug band music was a style of music that first became popular in the 1920s, and had many of the same musical elements as the music later known as skiffle. It was played on a mixture of standard musical instruments -- usually portable, \"folky\" ones like guitar and harmonica -- and improvised homemade instruments, like the spoons, the washboard, and comb and paper. The reason they're called jug bands is because they would involve someone blowing into a jug to make a noise that sounded a bit like a horn -- much like the coffee pot groups we talked about way back in episode six. The music was often hokum music, and incorporated elements of what we'd now call blues, vaudeville, and country music, though at the time those genres were nothing like as distinct as they're considered today:\n\n[Excerpt: Cincinnati Jug Band, \"Newport Blues\"]\n\nThe Even Dozen Jug Band actually ended up having thirteen members, and it had a rather remarkable lineup. The leader was Stefan Grossman, later regarded as one of the greatest fingerpicking guitarists in America, and someone who will be coming up in other contexts in future episodes I'm sure, and they also featured David Grisman, a mandolin player who would later play with the Grateful Dead among many others;  Steve Katz, who would go on to be a founder member of Blood, Sweat and Tears and produce records for Lou Reed; Maria D'Amato, who under her married name Maria Muldaur would go on to have a huge hit with \"Midnight at the Oasis\"; and Joshua Rifkin, who would later go on to become one of the most important scholars of Bach's music of the latter half of the twentieth century, but who is best known for his recordings of Scott Joplin's piano rags, which more or less single-handedly revived Joplin's music from obscurity and created the ragtime revival of the 1970s:\n\n[Excerpt: Joshua Rifkin, \"Maple Leaf Rag\"]\n\nUnfortunately, despite the many talents involved, a band as big as that was uneconomical to keep together, and the Even Dozen Jug Band only played four shows together -- though those four shows were, as Muldaur later remembered, \"Carnegie Hall twice, the Hootenanny television show and some church\". The group did, though, make an album for Elektra records, produced by Paul Rothchild. Indeed, it was Rothchild who was the impetus for the group forming -- he wanted to produce a record of a jug band, and had told Grossman that if he got one together, he'd record it:\n\n[Excerpt: The Even Dozen Jug Band, \"On the Road Again\"]\n\nOn that album, Sebastian wasn't actually credited as John Sebastian -- because he was playing harmonica on the album, and his father was such a famous harmonica player, he thought it better if he was credited by his middle name, so he was John Benson for this one album.\n\nThe Even Dozen Jug Band split up after only a few months, with most of the band more interested in returning to university than becoming professional musicians, but Sebastian remained in touch with Rothchild, as they both shared an interest in the drug culture, and Rothchild started using him on sessions for other artists on Elektra, which was rapidly becoming one of the biggest labels for the nascent counterculture.\n\nThe first record the two worked together on after the Even Dozen Jug Band was sparked by a casual conversation. Vince Martin and Fred Neil saw Sebastian walking down the street wearing his harmonica holster, and were intrigued and asked him if he played. Soon he and his friend Felix Pappalardi were accompanying Martin and Neil on stage, and the two of them were recording as the duo's accompanists:\n\n[Excerpt: Vince Martin and Fred Neil, \"Tear Down the Walls\"]\n\nWe've mentioned Neil before, but if you don't remember him, he was one of the people around whom the whole Greenwich Village scene formed -- he was the MC and organiser of bills for many of the folk shows of the time, but he's now best known for writing the songs \"Everybody's Talkin'\", recorded famously by Harry Nilsson, and \"The Dolphins\", recorded by Tim Buckley.\n\nOn the Martin and Neil album, Tear Down The Walls, as well as playing harmonica, Sebastian acted essentially as uncredited co-producer with Rothchild, but Martin and Neil soon stopped recording for Elektra.\n\nBut in the meantime, Sebastian had met the most important musical collaborator he would ever have, and this is the start of something that will become a minor trend in the next few years, of important musical collaborations happening because of people being introduced by Cass Elliot.\n\nCass Elliot had been a singer in a folk group called the Big 3 -- not the same group as the Merseybeat group -- with Tim Rose, and the man who would be her first husband, Jim Hendricks (not the more famous guitarist of a similar name):\n\n[Excerpt: Cass Elliot and the Big 3, \"The Banjo Song\"]\n\nThe Big 3 had split up when Elliot and Hendricks had got married, and the two married members had been looking around for other musicians to perform with, when coincidentally another group they knew also split up.\n\nThe Halifax Three were a Canadian group who had originally started out as The Colonials, with a lineup of Denny Doherty, Pat LaCroix and Richard Byrne. Byrne didn't turn up for a gig, and a homeless guitar player, Zal Yanovsky, who would hang around the club the group were playing at, stepped in. Doherty and LaCroix, much to Yanovsky's objections, insisted he bathe and have a haircut, but soon the newly-renamed Halifax Three were playing Carnegie Hall and recording for Epic Records:\n\n[Excerpt: The Halifax Three, \"When I First Came to This Island\"]\n\nBut then a plane they were in crash-landed, and the group took that as a sign that they should split up. So they did, and Doherty and Yanovsky continued as a duo, until they hooked up with Hendricks and Elliot and formed a new group, the Mugwumps. A name which may be familiar if you recognise one of the hits of a group that Doherty and Elliot were in later:\n\n[Excerpt: The Mamas and the Papas, \"Creeque Alley\"]\n\nBut we're skipping ahead a bit there.\n\nCass Elliot was one of those few people in the music industry about whom it is impossible to find anyone with a bad word to say, and she was friendly with basically everyone, and particularly good at matching people up with each other. And on February the 7th 1964, she invited John Sebastian over to watch the Beatles' first performance on the Ed Sullivan Show. Like everyone in America, he was captivated by the performance:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on the Ed Sullivan Show)\"]\n\nBut Yanovsky was also there, and the two played guitar together for a bit, before retreating to opposite sides of the room. And then Elliot spent several hours as a go-between, going to each man and telling him how much the other loved and admired his playing and wanted to play more with him.\n\nSebastian joined the Mugwumps for a while, becoming one of the two main instrumentalists with Yanovsky, as the group pivoted from performing folk music to performing Beatles-inspired rock. But the group's management team, Bob Cavallo and Roy Silver, who weren't particularly musical people, and whose main client was the comedian Bill Cosby, got annoyed at Sebastian, because he and Yanovsky were getting on *too* well musically -- they were trading blues licks on stage, rather than sticking to the rather pedestrian arrangements that the group was meant to be performing -- and so Silver fired Sebastian fired from the group.\n\nWhen the Mugwumps recorded their one album, Sebastian had to sit in the control room while his former bandmates recorded with session musicians, who he thought were nowhere near up to his standard:\n\n[Excerpt: The Mugwumps, \"Searchin'\"]\n\nBy the time that album was released, the Mugwumps had already split up. Sebastian had continued working as a session musician for Elektra, including playing on the album The Blues Project, which featured white Greenwich Village folk musicians like Eric Von Schmidt, Dave Van Ronk, and Spider John Koerner playing their versions of old blues records, including this track by Geoff Muldaur, which features Sebastian on harmonica and \"Bob Landy\" on piano -- a fairly blatant pseudonym:\n\n[Excerpt: Geoff Muldaur, \"Downtown Blues\"]\n\nSebastian also played rhythm guitar and harmonica on the demos that became a big part of Tim Hardin's first album -- and his fourth, when the record company released the remaining demos. Sebastian doesn't appear to be on the orchestrated ballads that made Hardin's name -- songs like \"Reason to Believe\" and \"Misty Roses\" -- but he is on much of the more blues-oriented material, which while it's not anything like as powerful as Hardin's greatest songs, made up a large part of his repertoire:\n\n[Excerpt: Tim Hardin, \"Ain't Gonna Do Without\"]\n\nErik Jacobsen, the producer of Hardin's records, was impressed enough by Sebastian that he got Sebastian to record lead vocals, for a studio group consisting of Sebastian, Felix Pappalardi, Jerry Yester and Henry Diltz of the Modern Folk Quartet, and a bass singer whose name nobody could later remember. The group, under the name \"Pooh and the Heffalumps\", recorded two Beach Boys knockoffs, \"Lady Godiva\" and \"Rooty Toot\", the latter written by Sebastian, though he would later be embarrassed by it and claim it was by his cousin:\n\n[Excerpt: Pooh and the Heffalumps, \"Rooty Toot\"]\n\nAfter that, Jacobsen became convinced that Sebastian should form a group to exploit his potential as a lead singer and songwriter. By this point, the Mugwumps had split up, and their management team had also split, with Silver taking Bill Cosby and Cavallo taking the Mugwumps, and so Sebastian was able to work with Yanovsky, and the putative group could be managed by Cavallo.\n\nBut Sebastian and Yanovsky needed a rhythm section. And Erik Jacobsen knew a band that might know some people.\n\nJacobsen was a fan of a Beatles soundalike group called the Sellouts, who were playing Greenwich Village and who were co-managed by Herb Cohen, the manager of the Modern Folk Quartet (who, as we heard a couple of episodes ago, would soon go on to be the manager of the Mothers of Invention). The Sellouts were ultra-professional by the standards  of rock groups of the time -- they even had a tape echo machine that they used on stage to give them a unique sound -- and they had cut a couple of tracks with Jacobsen producing, though I've not been able to track down copies of them.\n\nTheir leader Skip Boone, had started out playing guitar in a band called the Blue Suedes, and had played in 1958 on a record by their lead singer Arthur Osborne:\n\n[Excerpt: Arthur Osborne, \"Hey Ruby\"]\n\nSkip Boone's brother Steve in his autobiography says that that was produced by Chet Atkins for RCA, but it was actually released on Brunswick records.\n\nIn the early sixties, Skip Boone joined a band called the Kingsmen -- not the same one as the band that recorded \"Louie Louie\" -- playing lead guitar with his brother Steve on rhythm, a singer called Sonny Bottari, a saxophone player named King Charles, bass player Clay Sonier, and drummer Joe Butler. Sometimes Butler would get up front and sing, and then another drummer, Jan Buchner, would sit in in his place. Soon Steve Boone would replace Bonier as the bass player, but the Kingsmen had no success, and split up. From the ashes of the Kingsmen had formed the Sellouts, Skip Boone, Jerry Angus, Marshall O'Connell, and Joe Butler, who had switched from playing \"Peppermint Twist\" to playing \"I Want to Hold Your Hand\" in February 1964.\n\nMeanwhile Steve Boone went on a trip to Europe before starting at university in New York, where he hooked up again with Butler, and it was Butler who introduced him to Sebastian and Yanovsky. Sebastian and Yanovsky had been going to see the Sellouts at the behest of Jacobsen, and they'd been asking if they knew anyone else who could play that kind of material. Skip Boone had mentioned his little brother, and as soon as they met him, even before they first played together, they knew from his appearance that he would be the right bass player for them.\n\nSo now they had at least the basis for a band. They hadn't played together, but Erik Jacobsen was an experienced record producer and Cavallo an experienced manager. They just needed to do some rehearsals and get a drummer, and a record contract was more or less guaranteed. Boone suggested Jan Buchner, the backup drummer from the Kingsmen, and he joined them for rehearsals.\n\nIt was during these early rehearsals that Boone got to play on his first real record, other than some unreleased demos the Kingsmen had made. John Sebastian got a call from that \"Bob Landy\" we mentioned earlier, asking if he'd play bass on a session. Boone tagged along, because he was a fan, and when Sebastian couldn't get the parts down for some songs, he suggested that Boone, as an actual bass player, take over:\n\n[Excerpt: Bob Dylan, \"Maggie's Farm\"]\n\nBut the new group needed a name, of course. It was John Sebastian who came up with the name they eventually chose, The Lovin' Spoonful, though Boone was a bit hesitant about it at first, worrying that it might be a reference to heroin -- Boone was from a very conservative, military, background, and knew little of drug culture and didn't at that time make much of a distinction between cannabis and heroin, though he'd started using the former -- but Sebastian was insistent. The phrase actually referred to coffee -- the name came from \"Coffee Blues\" by Sebastian's old idol Mississippi John Hurt – or at least Hurt always *said* it was about coffee, though in live performance he apparently made it clear that it was about cunnilingus:\n\n[Excerpt: Mississippi John Hurt, \"Coffee Blues\"]\n\nTheir first show, at the Night Owl Club, was recorded, and there was even an attempt to release it as a CD in the 1990s, but it was left unreleased and as far as I can tell wasn't even leaked. There have been several explanations for this, but perhaps the most accurate one is just the comment from the manager of the club, who came up to the group after their two sets and told them “Hey, I don’t know how to break this to you, but you guys suck.”\n\nThere were apparently three different problems. They were underrehearsed -- which could be fixed with rehearsal -- they were playing too loud and hurting the patrons' ears -- which could be fixed by turning down the amps -- and their drummer didn't look right, was six years older than the rest of the group, and was playing in an out-of-date fifties style that wasn't suitable for the music they were playing.\n\nThat was solved by sacking Buchner. By this point Joe Butler had left the Sellouts, and while Herb Cohen was interested in managing him as a singer, he was willing to join this new group at least for the moment.\n\nBy now the group were all more-or-less permanent residents at the Albert Hotel, which was more or less a doss-house where underemployed musicians would stay, and which had its own rehearsal rooms. As well as the Spoonful, Cass Elliot and Denny Doherty lived there, as did the Paul Butterfield Blues Band.\n\nJoe Butler quickly fit into the group, and soon they were recording what became their first single, produced by Jacobsen, an original of Sebastian's called \"Do You Believe in Magic?\", with Sebastian on autoharp and vocals, Yanovsky on lead guitar and backing vocals, Boone on bass, Butler on drums, and Jerry Yester adding piano and backing vocals:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nFor a long time, the group couldn't get a deal -- the record companies all liked the song, but said that unless the group were English they couldn't sell them at the moment. Then Phil Spector walked into the Night Owl Cafe, where the new lineup of the group had become popular, and tried to sign them up. But they turned him down -- they wanted Erik Jacobsen to produce them; they were a team. Spector's interest caused other labels to be interested, and the group very nearly signed to Elektra. But again, signing to Elektra would have meant being produced by Rothchild, and also Elektra were an album label who didn't at that time have any hit single acts, and the group knew they had hit single potential. They did record a few tracks for Elektra to stick on a blues compilation, but they knew that Elektra wouldn't be their real home.\n\nEventually the group signed with Charley Koppelman and Don Rubin, who had started out as songwriters themselves, working for Don Kirshner. When Kirshner's organisation had been sold to Columbia, Koppelman and Rubin had gone along and ended up working for Columbia as executives. They'd then worked for Morris Levy at Roulette Records, before forming their own publishing and record company. Rather than put out records themselves, they had a deal to license records to Kama Sutra Records, who in turn had a distribution deal with MGM Records.\n\nKoppelman and Rubin were willing to take the group and their manager and producer as a package deal, and they released the group's demo of \"Do You Believe In Magic?\" unchanged as their first single:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nThe single reached the top ten, and the group were soon in the studio cutting their first album, also titled Do You Believe In Magic?\n\nThe album was a mix of songs that were part of the standard Greenwich Village folkie repertoire -- songs like Mississippi John Hurt's \"Blues in the Bottle\" and Fred Neil's \"The Other Side of This Life\" -- and a couple more originals.\n\nThe group's second single was the first song that Steve Boone had co-written. It was inspired by a date he'd gone on with the photographer Nurit Wilde, who sadly for him didn't go on a second date, and who would later be the mother of Mike Nesmith's son Jason, but who he was very impressed by. He thought of her when he came up with the line \"you didn't have to be so nice, I would have liked you anyway\", and he and Sebastian finished up a song that became another top ten hit for the group:\n\n[Excerpt: (The Good Time Music of) The Lovin' Spoonful, \"You Didn't Have to Be So Nice\"]\n\nShortly after that song was recorded, but before it was released, the group were called into Columbia TV with an intriguing proposition. Bert Schneider and Bob Rafelson, two young TV producers, were looking at producing a TV show inspired by A Hard Day's Night, and were looking for a band to perform in it. Would the Lovin' Spoonful be up for it?\n\nThey were interested at first, but Boone and Sebastian weren't sure they wanted to be actors, and also it would involve the group changing its name. They'd already made a name for themselves as the Lovin' Spoonful, did they really want to be the Monkees instead? They passed on the idea.\n\nInstead, they went on a tour of the deep South as the support act to the Supremes, a pairing that they didn't feel made much sense, but which did at least allow them to watch the Supremes and the Funk Brothers every night. Sebastian was inspired by the straight four-on-the-floor beat of the Holland-Dozier-Holland repertoire, and came up with his own variation on it, though as this was the Lovin' Spoonful the end result didn't sound very Motown at all:\n\n[Excerpt: The Lovin' Spoonful, \"Daydream\"]\n\nIt was only after the track was recorded that Yanovsky pointed out to Sebastian that he'd unconsciously copied part of the melody of the old standard \"Got a Date With an Angel\":\n\n[Excerpt: Al Bowlly, \"Got a Date With an Angel\"]\n\n\"Daydream\" became the group's third top ten hit in a row, but it caused some problems for the group. The first was Kama Sutra's advertising campaign for the record, which had the words \"Lovin' Spoonful Daydream\", with the initials emphasised. While the group were drug users, they weren't particularly interested in being promoted for that rather than their music, and had strong words with the label.\n\nThe other problem came with the Beach Boys. The group were supporting the Beach Boys on a tour in spring of 1966, when \"Daydream\" came out and became a hit, and they got on with all the band members except Mike Love, who they definitely did not get on with. Almost fifty years later, in his autobiography, Steve Boone would have nothing bad to say about the Wilson brothers, but calls Love \"an obnoxious, boorish braggart\", a \"marginally talented hack\" and worse, so it's safe to say that Love wasn't his favourite person in the world.\n\nUnfortunately, when \"Daydream\" hit the top ten, one of the promoters of the tour decided to bill the Lovin' Spoonful above the Beach Boys, and this upset Love, who understandably thought that his group, who were much better known and had much more hits, should be the headliners. If this had been any of the other Beach Boys, there would have been no problem, but because it was Love, who the Lovin' Spoonful despised, they decided that they were going to fight for top billing, and the managers had to get involved. Eventually it was agreed that the two groups would alternate the top spot on the bill for the rest of the tour.\n\n\"Daydream\" eventually reached number two on the charts (and number one on Cashbox) and also became the group's first hit in the UK, reaching number two here as well, and leading to the group playing a short UK tour. During that tour, they had a similar argument over billing with Mick Jagger as they'd had with Mike Love, this time over who was headlining on an appearance on Top of the Pops, and the group came to the same assessment of Jagger as they had of Love. The performance went OK, though, despite them being so stoned on hash given them by the wealthy socialite Tara Browne that Sebastian had to be woken up seconds before he started playing.\n\nThey also played the Marquee Club -- Boone notes in his autobiography that he wasn't impressed by the club when he went to see it the day before their date there, because some nobody named David Bowie was playing there. But in the audience that day were George Harrison, John Lennon, Eric Clapton, Steve Winwood, Spencer Davis, and Brian Jones, most of whom partied with the group afterwards.\n\nThe Lovin' Spoonful made a big impression on Lennon in particular, who put \"Daydream\" and \"Do You Believe in Magic\" in his jukebox at home, and who soon took to wearing glasses in the same round, wiry, style as the ones that Sebastian wore. They also influenced Paul McCartney, who wasn't at that gig, but who soon wrote this, inspired by \"Daydream\":\n\n[Excerpt: The Beatles, \"Good Day Sunshine\"]\n\nUnfortunately, this was more or less the high point of the group's career.\n\nShortly after that brief UK tour, Zal Yanovsky and Steve Boone went to a party where they were given some cannabis -- and they were almost immediately stopped by the police, subjected to an illegal search of their vehicle, and arrested.\n\nThey would probably have been able to get away with this -- after all, it was an illegal search, even though of course the police didn't admit to that -- were it not for the fact that Yanovsky was a Canadian citizen, and he could be deported and barred from ever re-entering the US just for being arrested.\n\nThis was the first major drug bust of a rock and roll group, and there was no precedent for the group, their managers, their label or their lawyers to deal with this. And so they agreed to something they would regret for the rest of their lives. In return for being let off, Boone and Yanovsky agreed to take an undercover police officer to a party and introduce him to some of their friends as someone they knew in the record business, so he would be able to arrest one of the bigger dealers.\n\nThis was, of course, something they knew was a despicable thing to do, throwing friends under the bus to save themselves, but they were young men and under a lot of pressure, and they hoped that it wouldn't actually lead to any arrests. And for almost a year, there were no serious consequences, although both Boone and Yanovsky were shaken up by the event, and Yanovsky's behaviour, which had always been erratic, became much, much worse.\n\nBut for the moment, the group remained very successful. After \"Daydream\", an album track from their first album, \"Did You Ever Have to Make Up Your Mind?\" had been released as a stopgap single, and that went to number two as well. And right before the arrest, the group had been working on what would be an even bigger hit.\n\nThe initial idea for \"Summer in the City\" actually came from John Sebastian's fourteen-year-old brother Mark, who'd written a bossa nova song called \"It's a Different World\". The song was, by all accounts, the kind of thing that a fourteen-year-old boy writes, but part of it had potential, and John Sebastian took that part -- giving his brother full credit -- and turned it into the chorus of a new song:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nTo this, Sebastian added a new verse, inspired by a riff the session player Artie Schroeck had been playing while the group recorded their songs for the Woody Allen film What's Up Tiger Lily, creating a tenser, darker, verse to go with his younger brother's chorus:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nIn the studio, Steve Boone came up with the instrumental arrangement, which started with drums, organ, electric piano, and guitar, and then proceeded to bass, autoharp, guitar, and percussion overdubs. The drum sound on the record was particularly powerful thanks to the engineer Roy Halee, who worked on most of Simon & Garfunkel's records. Halee put a mic at the top of a stairwell, a giant loudspeaker at the bottom, and used the stairwell as an echo chamber for the drum part. He would later use a similar technique on Simon and Garfunkel's \"The Boxer\".\n\nThe track still needed another section though, and Boone suggested an instrumental part, which led to him getting an equal songwriting credit with the Sebastian brothers. His instrumental piano break was inspired by Gershwin, and the group topped it off with overdubbed city noises:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nThe track went to number one, becoming the group's only number one record, and it was the last track on what is by far their best album, Hums of the Lovin' Spoonful. That album produced two more top ten hits for the group, \"Nashville Cats\", a tribute to Nashville session players (though John Sebastian seems to have thought that Sun Records was a Nashville, rather than a Memphis, label), and the rather lovely \"Rain on the Roof\":\n\n[Excerpt: The Lovin' Spoonful, \"Rain on the Roof\"]\n\nBut that song caused friction with the group, because it was written about Sebastian's relationship with his wife who the other members of the band despised. They also felt that the songs he was writing about their relationship were giving the group a wimpy image, and wanted to make more rockers like \"Summer in the City\" -- some of them had been receiving homophobic abuse for making such soft-sounding music.\n\nThe group were also starting to resent Sebastian for other reasons. In a recent contract renegotiation, a \"key member\" clause had been put into the group's record contract, which stated that Sebastian, as far as the label was concerned, was the only important member of the group. While that didn't affect decision-making in the group, it did let the group know that if the other members did anything to upset Sebastian, he was able to take his ball away with him, and even just that potential affected the way the group thought about each other.\n\nAll these factors came into play with a song called \"Darling Be Home Soon\", which was a soft ballad that Sebastian had written about his wife, and which was written for another film soundtrack -- this time for a film by a new director named Francis Ford Coppola. When the other band members came in to play on the soundtrack, including that track, they found that rather than being allowed to improvise and come up with their own parts as they had previously, they had to play pre-written parts to fit with the orchestration. Yanovsky in particular was annoyed by the simple part he had to play, and when the group appeared on the Ed Sullivan show to promote the record, he mugged, danced erratically, and mimed along mocking the lyrics as Sebastian sang.\n\nThe song -- one of Sebastian's very best -- made a perfectly respectable number fifteen, but it was the group's first record not to make the top ten:\n\n[Excerpt: The Lovin' Spoonful, \"Darling Be Home Soon\"]\n\nAnd then to make matters worse, the news got out that someone had been arrested as a result of Boone and Yanovsky's efforts to get themselves out of trouble the year before. This was greeted with horror by the counterculture, and soon mimeographed newsletters and articles in the underground papers were calling the group part of the establishment, and calling for a general boycott of the group -- if you bought their records, attended their concerts, or had sex with any of the band members, you were a traitor.\n\nYanovsky and Boone had both been in a bad way mentally since the bust, but Yanovsky was far worse, and was making trouble for the other members in all sorts of ways. The group decided to fire Yanovsky, and brought in Jerry Yester to replace him, giving him a severance package that ironically meant that he ended up seeing more money from the group's records than the rest of them, as their records were later bought up by a variety of shell companies that passed through the hands of Morris Levy among others, and so from the late sixties through the early nineties the group never got any royalties.\n\nFor a while, this seemed to benefit everyone. Yanovsky had money, and his friendship with the group members was repaired. He released a solo single, arranged by Jack Nitzsche, which just missed the top one hundred:\n\n[Excerpt: Zal Yanovsky, \"Just as Long as You're Here\"]\n\nThat song was written by the Bonner and Gordon songwriting team who were also writing hits for the Turtles at this time, and who were signed to Koppelman and Rubin's company.\n\nThe extent to which Yanovsky's friendship with his ex-bandmates was repaired by his firing was shown by the fact that Jerry Yester, his replacement in the group, co-produced his one solo album, Alive and Well in Argentina, an odd mixture of comedy tracks, psychedelia, and tributes to the country music he loved. His instrumental version of Floyd Cramer's \"Last Date\" is fairly listenable -- Cramer's piano playing was a big influence on Yanovsky's guitar -- but his version of George Jones' \"From Brown to Blue\" makes it very clear that Zal Yanovsky was no George Jones:\n\n[Excerpt: Zal Yanovsky, \"From Brown to Blue\"]\n\nYanovsky then quit music, and went into the restaurant business.\n\nThe Lovin' Spoonful, meanwhile, made one further album, but the damage had been done. Everything Playing is actually a solid album, though not as good as the album before, and it produced three top forty hits, but the highest-charting was \"Six O'Clock\", which only made number eighteen, and the album itself made a pitiful one hundred and eighteen on the charts. The song on the album that in retrospect has had the most impact was the rather lovely \"Younger Generation\", which Sebastian later sang at Woodstock:\n\n[Excerpt: John Sebastian, \"Younger Generation (Live at Woodstock)\"]\n\nBut at Woodstock he performed that alone, because by then he'd quit the group.\n\nBoone, Butler, and Yester decided to continue, with Butler singing lead, and recorded a single, \"Never Going Back\", produced by Yester's old bandmate from the Modern Folk Quartet Chip Douglas, who had since become a successful producer for the Monkees and the Turtles, and written by John Stewart of the Kingston Trio, who had written \"Daydream Believer\" for the Monkees, but the record only made number seventy-eight on the charts:\n\n[Excerpt: The Lovin' Spoonful featuring Joe Butler, \"Never Going Back\"]\n\nThat was followed by an album by \"The Lovin' Spoonful Featuring Joe Butler\", Revelation: Revolution 69, a solo album by Butler in all but name -- Boone claims not to have played on it, and Butler is the only one featured on the cover, which shows a naked Butler being chased by a naked woman with a lion in front of them covering the naughty bits. The biggest hit other than \"Never Going Back\" from the album was \"Me About You\", a Bonner and Gordon song which only made number ninety-one:\n\n[Excerpt: The Lovin' Spoonful Featuring Joe Butler, \"Me About You\"]\n\nJohn Sebastian went on to have a moderately successful solo career -- as well as his appearance at Woodstock, he released several solo albums, guested on harmonica on records by the Doors, Crosby, Stills, Nash, and Young and others, and had a solo number one hit in 1976 with \"Welcome Back\", the theme song from the TV show Welcome Back, Kotter:\n\n[Excerpt: John Sebastian, \"Welcome Back\"]\n\nSebastian continues to perform, though he's had throat problems for several decades that mean he can't sing many of the songs he's best known for.\n\nThe original members of the Lovin' Spoonful reunited for two performances -- an appearance in Paul Simon's film One Trick Pony in 1980, and a rather disastrous induction into the Rock and Roll Hall of Fame in 2000. Zal Yanovsky died of a heart attack in 2002.\n\nThe remaining band members remained friendly, and Boone, Butler, and Yester reunited as the Lovin' Spoonful in 1991, initially with Yester's brother Jim, who had played in The Association, latterly with other members. One of those other members in the 1990s was Yester's daughter Lena, who became Boone's fourth wife (and is as far as I can discover still married to him). Yester, Boone, and Butler continued touring together as the Lovin' Spoonful until 2017, when Jerry Yester was arrested on thirty counts of child pornography possession, and was immediately sacked from the group.\n\nThe other two carried on, and the three surviving original members reunited on stage for a performance at one of the Wild Honey Orchestra's benefit concerts in LA in 2020, though that was just a one-off performance, not a full-blown reunion.\n\nIt was also the last Lovin' Spoonful performance to date, as that was in February 2020, but Steve Boone has performed with John Sebastian's most recent project, John Sebastian's Jug Band Village, a tribute to the Greenwich Village folk scene the group originally formed in, and the two played together most recently in December 2021. The three surviving original members of the group all seem to be content with their legacy, doing work they enjoy, and basically friendly, which is more than can be said for most of their contemporaries, and which is perhaps appropriate for a band whose main songwriter had been inspired, more than anything else, to make music with a positive attitude.",
  "itunes:subtitle": "Episode 143 of A History of Rock Music in Five Hundred Songs looks at “Summer in the City’”, and at the short but productive career of the Lovin Spoonful.  Click the full post to read liner notes, links to more information, and a transcript of the episod",
  "itunes:episodeType": "full",
  "itunes:episode": 143,
  "content:encoded": "Episode 143 of <em>A History of Rock Music in Five Hundred Songs</em> looks at “Summer in the City’”, and at the short but productive career of the Lovin' Spoonful.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, <a href=\"https://www.patreon.com/posts/62219654\">on \"The Sun Ain't Gonna Shine Any More\" by the Walker Brothers</a> and the strange career of Scott Walker.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at <a href=\"http://www.podnose.com/jaffa-cakes-for-proust\">http://www.podnose.com/jaffa-cakes-for-proust</a> and <a href=\"http://sitcomclub.com/\">http://sitcomclub.com/</a>\n\n\n\n<strong>Resources</strong>\n\nAs usual, all the songs excerpted in the podcast can be heard in full at <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-143-summer-in-the-city/\">Mixcloud</a>.\n\n<a href=\"https://amzn.to/3GvVIJ1\">This box set</a> contains all four studio albums by the Lovin' Spoonful, plus the one album by \"The Lovin' Spoonful featuring Joe Butler\", while <a href=\"https://amzn.to/3HzREsn\">this CD</a> contains their two film soundtracks (mostly inessential instrumental filler, apart from \"Darling Be Home Soon\")\n\nInformation about harmonicas and harmonicists comes from <a href=\"https://amzn.to/3gr0BZ4\"><em>Harmonicas, Harps, and Heavy Breathers</em> by Kim Field.</a>\n\nThere are only three books about the Lovin' Spoonful, but all are worth reading.<a href=\"https://amzn.to/3HJRsH2\"> <em>Do You Believe in Magic?</em> by Simon Wordsworth</a> is a good biography of the band, while his <a href=\"https://amzn.to/3GJFsEx\"><em>The Magic's in the Music</em></a> is a scrapbook of press cuttings and reminiscences. Meanwhile Steve Boone's<a href=\"https://amzn.to/3sEYjeX\"> <em>Hotter Than a Match Head: My Life on the Run with the Lovin' Spoonful </em></a>has rather more discussion of the actual music than is normal in a musician's autobiography.\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of <a href=\"http://patreon.com/join/andrewhickey\">my backers on Patreon</a>. Why not join them?\n\n<strong>Transcript</strong>\n\nLet's talk about the harmonica for a while. The harmonica is an instrument that has not shown up a huge amount in the podcast, but which was used in a fair bit of the music we've covered. We've heard it for example on records by Bo Diddley:\n\n[Excerpt: Bo Diddley, \"I'm a Man\"]\n\nand by Bob Dylan:\n\n[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]\n\nand the Rolling Stones:\n\n[Excerpt: The Rolling Stones, \"Little Red Rooster\"]\n\nIn most folk and blues contexts, the harmonicas used are what is known as a diatonic harmonica, and these are what most people think of when they think of harmonicas at all. Diatonic harmonicas have the notes of a single key in them, and if you want to play a note in another key, you have to do interesting tricks with the shape of your mouth to bend the note.\n\nThere's another type of harmonica, though, the chromatic harmonica. We've heard that a time or two as well, like on \"Love Me Do\" by the Beatles:\n\n[Excerpt: The Beatles, \"Love Me Do\"]\n\nChromatic harmonicas have sixteen holes, rather than the diatonic harmonica's ten, and they also have a slide which you can press to raise the note by a semitone, meaning you can play far more notes than on a diatonic harmonica -- but they're also physically harder to play, requiring a different kind of breathing to pull off playing one successfully. They're so different that John Lennon would distinguish between the two instruments -- he'd describe a chromatic harmonica as a harmonica, but a diatonic harmonica he would call a harp, like blues musicians often did:\n\n[Excerpt: The Beatles, \"Love These Goon Shows\"]\n\nWhile the chromatic harmonica isn't a particularly popular instrument in rock music, it is one that has had some success in other fields. There have been some jazz and light-orchestral musicians who have become famous playing the instrument, like the jazz musician Max Geldray, who played in those Goon Shows the Beatles loved so much:\n\n[Excerpt: Max Geldray, \"C-Jam Blues\"]\n\nAnd in the middle of the twentieth century there were a few musicians who succeeded in making the harmonica into an instrument that was actually respected in serious classical music. By far the most famous of these was Larry Adler, who became almost synonymous with the instrument in the popular consciousness, and who reworked many famous pieces of music for the instrument:\n\n[Excerpt: Larry Adler, \"Rhapsody in Blue\"]\n\nBut while Adler was the most famous classical harmonicist of his generation, he was not generally considered the best by other musicians. That was, rather, a man named John Sebastian. Sebastian, who chose to take his middle name as a surname partly to Anglicise his name but also, it seems, at least in part as tribute to Johann Sebastian Bach (which incidentally now makes it really, really difficult to search for copies of his masterwork \"John Sebastian Plays Bach\", as Internet searches uniformly think you're searching just for the composer...) started out like almost all harmonica players as an amateur playing popular music.\n\nBut he quickly got very, very, good, and by his teens he was already teaching other children, including at a summer camp run by Albert Hoxie, a musician and entrepreneur who was basically single-handedly responsible for the boom in harmonica sales in the 1920s and 1930s, by starting up youth harmonica orchestras -- dozens or even hundreds of kids, all playing harmonica together, in a semi-militaristic youth organisation something like the scouts, but with harmonicas instead of woggles and knots.\n\nHoxie's group and the various organisations copying it led to there being over a hundred and fifty harmonica orchestras in Chicago alone, and in LA in the twenties and thirties a total of more than a hundred thousand children passed through harmonica orchestras inspired by Hoxie.\n\nHoxie's youth orchestras were largely responsible for the popularity of the harmonica as a cheap instrument for young people, and thus for its later popularity in the folk and blues worlds. That was only boosted in the Second World War by the American Federation of Musicians recording ban, which we talked about in the early episodes of the podcast -- harmonicas had never been thought of as a serious instrument, and so most professional harmonica players were not members of the AFM, but were considered variety performers and were part of the American Guild of Variety Artists, along with singers, ukulele players, and musical saw players. Of course, the war did also create a problem, because the best harmonicas were made in Germany by the Hohner company, but soon a lot of American companies started making cheap harmonicas to fill the gap in the market.\n\nThere's a reason the cliche of the GI in a war film playing a harmonica in the trenches exists, and it's largely because of Hoxie. And Hoxie was based in Philadelphia, where John Sebastian lived as a kid, and he mentored the young player, who soon became a semi-professional performer.\n\nSebastian's father was a rich banker, and discouraged him from becoming a full-time musician -- the plan was that after university, Sebastian would become a diplomat. But as part of his preparation for that role, he was sent to spend a couple of years studying at the universities of Rome and Florence, learning about Italian culture.\n\nOn the boat back, though, he started talking to two other passengers, who turned out to be the legendary Broadway songwriting team Rodgers and Hart, the writers of such classic songs as \"Blue Moon\" and \"My Funny Valentine\":\n\n[Excerpt: Ella Fitzgerald, \"My Funny Valentine\"]\n\nSebastian talked to his new friends, and told them that he was feeling torn between being a musician and being in the foreign service like his father wanted. They both told him that in their experience some people were just born to be artists, and that those people would never actually find happiness doing anything else. He took their advice, and decided he was going to become a full-time harmonica player.\n\nHe started out playing in nightclubs, initially playing jazz and swing, but only while he built up a repertoire of classical music. He would rehearse with a pianist for three hours every day, and would spend the rest of his time finding classical works, especially baroque ones, and adapting them for the harmonica. As he later said “I discovered sonatas by Telemann, Veracini, Bach, Handel, Vivaldi, Hasse, Marcello, Purcell, and many others, which were written to be played on violin, flute, oboe, musette, even bagpipes... The composer seemed to be challenging each instrument to create the embellishments and ornaments to suit its particular voice. . . . I set about choosing works from this treasure trove that would best speak through my instrument.”\n\nSoon his nightclub repertoire was made up entirely of these classical pieces, and he was making records like John Sebastian Plays Bach:\n\n[Excerpt: John Sebastian, \"Flute Sonata in B Minor BWV1030 (J.S. Bach)\"]\n\nAnd while Sebastian was largely a lover of baroque music above all other forms, he realised that he would have to persuade new composers to write new pieces for the instrument should he ever hope for it to have any kind of reputation as a concert instrument, so he persuaded contemporary composers to write pieces like George Kleinsinger's \"Street Corner Concerto\", which Sebastian premiered with the New York Philharmonic:\n\n[Excerpt: John Sebastian, \"Street Corner Concerto\"]\n\nHe became the first harmonica player to play an entirely classical repertoire, and regarded as the greatest player of his instrument in the world. The oboe player Jay S Harrison once wrote of seeing him perform \"to accomplish with success a program of Mr. Sebastian’s scope is nothing short of wizardry. . . . He has vast technical facility, a bulging range of colors, and his intentions are ever musical and sophisticated. In his hands the harmonica is no toy, no simple gadget for the dispensing of homespun tunes. Each single number of the evening was whittled, rounded, polished, and poised. . . . Mr. Sebastian’s playing is uncanny.\"\n\nSebastian came from a rich background, and he managed to earn enough as a classical musician to live the lifestyle of a rich artistic Bohemian. During the forties and fifties he lived in Greenwich Village with his family -- apart from a four-year period living in Rome from 1951 to 55 -- and Eleanor Roosevelt was a neighbour, while Vivian Vance, who played Ethel Mertz on I Love Lucy, was the godmother of his eldest son.\n\nBut while Sebastian's playing was entirely classical, he was interested in a wider variety of music. When he would tour Europe, he would often return having learned European folk songs, and while he was living in Greenwich Village he would often be visited by people like Burl Ives, Woody Guthrie, and other folk singers living in the area.\n\nAnd that early influence rubbed off on Sebastian's son, John Benson Sebastian, although young John gave up trying to learn the harmonica the first time he tried, because he didn't want to be following too closely in his father's footsteps. Sebastian junior did, though, take up the guitar, inspired by the first wave rock and rollers he was listening to on Alan Freed's show, and he would later play the harmonica, though the diatonic harmonica rather than the chromatic.\n\nIn case you haven't already figured it out, John Benson Sebastian, rather than his father, is a principal focus of this episode, and so to avoid confusion, from this point on, when I refer to \"John Sebastian\" or \"Sebastian\" without any qualifiers, I'm referring to the younger man. When I refer to \"John Sebastian Sr\" I'm talking about the father.\n\nBut it was John Sebastian Sr's connections, in particular to the Bohemian folk and blues scenes, which gave his more famous son his first connection to that world of his own, when Sebastian Sr appeared in a TV show, in November 1960, put together by Robert Herridge, a TV writer and producer who was most famous for his drama series but who had also put together documentaries on both classical music and jazz, including the classic performance documentary The Sound of Jazz.\n\nHerridge's show featured both Sebastian Sr and the country-blues player Lightnin' Hopkins:\n\n[Excerpt: Lightnin' Hopkins, \"Blues in the Bottle\"]\n\nHopkins was one of many country-blues players whose career was having a second wind after his discovery by the folk music scene. He'd been recording for fourteen years, putting out hundreds of records, but had barely performed outside Houston until 1959, when the folkies had picked up on his work, and in October 1960 he had been invited to play Carnegie Hall, performing with Pete Seeger and Joan Baez.\n\nYoung John Sebastian had come along with his dad to see the TV show be recorded, and had an almost Damascene conversion -- he'd already heard Hopkins' recordings, but had never seen anything like his live performances. He was at that time attending a private boarding school, Blair Academy, and his roommate at the school also had his own apartment, where Sebastian would sometimes stay. Soon Lightnin' Hopkins was staying there as well, as somewhere he could live rent-free while he was in New York.\n\nSebastian started following Hopkins around and learning everything he could, being allowed by the older man to carry his guitar and buy him gin, though the two never became close. But eventually, Hopkins would occasionally allow Sebastian to play with him when he played at people's houses, which he did on occasion. Sebastian became someone that Hopkins trusted enough that when he was performing on a bill with someone else whose accompanist wasn't able to make the gig and Sebastian put himself forward, Hopkins agreed that Sebastian would be a suitable accompanist for the evening.\n\nThe singer he accompanied that evening was a performer named Valentine Pringle, who was a protege of Harry Belafonte, and who had a similar kind of sound to Paul Robeson. Sebastian soon became Pringle's regular accompanist, and played on his first album, I Hear America Singing, which was also the first record on which the great trumpet player Hugh Masakela played. Sadly, Paul Robeson style vocals were so out of fashion by that point that that album has never, as far as I can tell, been issued in a digital format, and hasn't even been uploaded to YouTube.  But this excerpt from a later recording by Pringle should give you some idea of the kind of thing he was doing:\n\n[Excerpt: Valentine Pringle, \"Go 'Way From My Window\"]\n\nAfter these experiences, Sebastian started regularly going to shows at Greenwich Village folk clubs, encouraged by his parents -- he had an advantage over his peers because he'd grown up in the area and had artistic parents, and so he was able to have a great deal of freedom that other people in their teens weren't. In particular, he would always look out for any performances by the great country blues performer Mississippi John Hurt.\n\nHurt had made a few recordings for Okeh records in 1928, including an early version of \"Stagger Lee\", titled \"Stack O'Lee\":\n\n[Excerpt: Mississippi John Hurt, \"Stack O'Lee Blues\"]\n\nBut those records had been unsuccessful, and he'd carried on working on a farm. and not performed other than in his tiny home town of Avalon, Mississippi, for decades. But then in 1952, a couple of his tracks had been included on the Harry Smith Anthology, and as a result he'd come to the attention of the folk and blues scholar community. They'd tried tracking him down, but been unable to until in the early sixties one of them had discovered a track on one of Hurt's records, \"Avalon Blues\", and in 1963, thirty-five years after he'd recorded six flop singles, Mississippi John Hurt became a minor star, playing the Newport Folk Festival and appearing on the Tonight Show.\n\nBy this time, Sebastian was a fairly well-known figure in Greenwich Village, and he had become quite a virtuoso on the harmonica himself, and would walk around the city wearing a holster-belt containing harmonicas in a variety of different keys. Sebastian became a huge fan of Hurt, and would go and see him perform whenever Hurt was in New York. He soon found himself first jamming backstage with Hurt, and then performing with him on stage for the last two weeks of a residency. He was particularly impressed with what he called Hurt's positive attitude in his music -- something that Sebastian would emulate in his own songwriting.\n\nSebastian was soon invited to join a jug band, called the Even Dozen Jug Band. Jug band music was a style of music that first became popular in the 1920s, and had many of the same musical elements as the music later known as skiffle. It was played on a mixture of standard musical instruments -- usually portable, \"folky\" ones like guitar and harmonica -- and improvised homemade instruments, like the spoons, the washboard, and comb and paper. The reason they're called jug bands is because they would involve someone blowing into a jug to make a noise that sounded a bit like a horn -- much like the coffee pot groups we talked about way back in episode six. The music was often hokum music, and incorporated elements of what we'd now call blues, vaudeville, and country music, though at the time those genres were nothing like as distinct as they're considered today:\n\n[Excerpt: Cincinnati Jug Band, \"Newport Blues\"]\n\nThe Even Dozen Jug Band actually ended up having thirteen members, and it had a rather remarkable lineup. The leader was Stefan Grossman, later regarded as one of the greatest fingerpicking guitarists in America, and someone who will be coming up in other contexts in future episodes I'm sure, and they also featured David Grisman, a mandolin player who would later play with the Grateful Dead among many others;  Steve Katz, who would go on to be a founder member of Blood, Sweat and Tears and produce records for Lou Reed; Maria D'Amato, who under her married name Maria Muldaur would go on to have a huge hit with \"Midnight at the Oasis\"; and Joshua Rifkin, who would later go on to become one of the most important scholars of Bach's music of the latter half of the twentieth century, but who is best known for his recordings of Scott Joplin's piano rags, which more or less single-handedly revived Joplin's music from obscurity and created the ragtime revival of the 1970s:\n\n[Excerpt: Joshua Rifkin, \"Maple Leaf Rag\"]\n\nUnfortunately, despite the many talents involved, a band as big as that was uneconomical to keep together, and the Even Dozen Jug Band only played four shows together -- though those four shows were, as Muldaur later remembered, \"Carnegie Hall twice, the Hootenanny television show and some church\". The group did, though, make an album for Elektra records, produced by Paul Rothchild. Indeed, it was Rothchild who was the impetus for the group forming -- he wanted to produce a record of a jug band, and had told Grossman that if he got one together, he'd record it:\n\n[Excerpt: The Even Dozen Jug Band, \"On the Road Again\"]\n\nOn that album, Sebastian wasn't actually credited as John Sebastian -- because he was playing harmonica on the album, and his father was such a famous harmonica player, he thought it better if he was credited by his middle name, so he was John Benson for this one album.\n\nThe Even Dozen Jug Band split up after only a few months, with most of the band more interested in returning to university than becoming professional musicians, but Sebastian remained in touch with Rothchild, as they both shared an interest in the drug culture, and Rothchild started using him on sessions for other artists on Elektra, which was rapidly becoming one of the biggest labels for the nascent counterculture.\n\nThe first record the two worked together on after the Even Dozen Jug Band was sparked by a casual conversation. Vince Martin and Fred Neil saw Sebastian walking down the street wearing his harmonica holster, and were intrigued and asked him if he played. Soon he and his friend Felix Pappalardi were accompanying Martin and Neil on stage, and the two of them were recording as the duo's accompanists:\n\n[Excerpt: Vince Martin and Fred Neil, \"Tear Down the Walls\"]\n\nWe've mentioned Neil before, but if you don't remember him, he was one of the people around whom the whole Greenwich Village scene formed -- he was the MC and organiser of bills for many of the folk shows of the time, but he's now best known for writing the songs \"Everybody's Talkin'\", recorded famously by Harry Nilsson, and \"The Dolphins\", recorded by Tim Buckley.\n\nOn the Martin and Neil album, Tear Down The Walls, as well as playing harmonica, Sebastian acted essentially as uncredited co-producer with Rothchild, but Martin and Neil soon stopped recording for Elektra.\n\nBut in the meantime, Sebastian had met the most important musical collaborator he would ever have, and this is the start of something that will become a minor trend in the next few years, of important musical collaborations happening because of people being introduced by Cass Elliot.\n\nCass Elliot had been a singer in a folk group called the Big 3 -- not the same group as the Merseybeat group -- with Tim Rose, and the man who would be her first husband, Jim Hendricks (not the more famous guitarist of a similar name):\n\n[Excerpt: Cass Elliot and the Big 3, \"The Banjo Song\"]\n\nThe Big 3 had split up when Elliot and Hendricks had got married, and the two married members had been looking around for other musicians to perform with, when coincidentally another group they knew also split up.\n\nThe Halifax Three were a Canadian group who had originally started out as The Colonials, with a lineup of Denny Doherty, Pat LaCroix and Richard Byrne. Byrne didn't turn up for a gig, and a homeless guitar player, Zal Yanovsky, who would hang around the club the group were playing at, stepped in. Doherty and LaCroix, much to Yanovsky's objections, insisted he bathe and have a haircut, but soon the newly-renamed Halifax Three were playing Carnegie Hall and recording for Epic Records:\n\n[Excerpt: The Halifax Three, \"When I First Came to This Island\"]\n\nBut then a plane they were in crash-landed, and the group took that as a sign that they should split up. So they did, and Doherty and Yanovsky continued as a duo, until they hooked up with Hendricks and Elliot and formed a new group, the Mugwumps. A name which may be familiar if you recognise one of the hits of a group that Doherty and Elliot were in later:\n\n[Excerpt: The Mamas and the Papas, \"Creeque Alley\"]\n\nBut we're skipping ahead a bit there.\n\nCass Elliot was one of those few people in the music industry about whom it is impossible to find anyone with a bad word to say, and she was friendly with basically everyone, and particularly good at matching people up with each other. And on February the 7th 1964, she invited John Sebastian over to watch the Beatles' first performance on the Ed Sullivan Show. Like everyone in America, he was captivated by the performance:\n\n[Excerpt: The Beatles, \"I Want to Hold Your Hand (live on the Ed Sullivan Show)\"]\n\nBut Yanovsky was also there, and the two played guitar together for a bit, before retreating to opposite sides of the room. And then Elliot spent several hours as a go-between, going to each man and telling him how much the other loved and admired his playing and wanted to play more with him.\n\nSebastian joined the Mugwumps for a while, becoming one of the two main instrumentalists with Yanovsky, as the group pivoted from performing folk music to performing Beatles-inspired rock. But the group's management team, Bob Cavallo and Roy Silver, who weren't particularly musical people, and whose main client was the comedian Bill Cosby, got annoyed at Sebastian, because he and Yanovsky were getting on *too* well musically -- they were trading blues licks on stage, rather than sticking to the rather pedestrian arrangements that the group was meant to be performing -- and so Silver fired Sebastian fired from the group.\n\nWhen the Mugwumps recorded their one album, Sebastian had to sit in the control room while his former bandmates recorded with session musicians, who he thought were nowhere near up to his standard:\n\n[Excerpt: The Mugwumps, \"Searchin'\"]\n\nBy the time that album was released, the Mugwumps had already split up. Sebastian had continued working as a session musician for Elektra, including playing on the album The Blues Project, which featured white Greenwich Village folk musicians like Eric Von Schmidt, Dave Van Ronk, and Spider John Koerner playing their versions of old blues records, including this track by Geoff Muldaur, which features Sebastian on harmonica and \"Bob Landy\" on piano -- a fairly blatant pseudonym:\n\n[Excerpt: Geoff Muldaur, \"Downtown Blues\"]\n\nSebastian also played rhythm guitar and harmonica on the demos that became a big part of Tim Hardin's first album -- and his fourth, when the record company released the remaining demos. Sebastian doesn't appear to be on the orchestrated ballads that made Hardin's name -- songs like \"Reason to Believe\" and \"Misty Roses\" -- but he is on much of the more blues-oriented material, which while it's not anything like as powerful as Hardin's greatest songs, made up a large part of his repertoire:\n\n[Excerpt: Tim Hardin, \"Ain't Gonna Do Without\"]\n\nErik Jacobsen, the producer of Hardin's records, was impressed enough by Sebastian that he got Sebastian to record lead vocals, for a studio group consisting of Sebastian, Felix Pappalardi, Jerry Yester and Henry Diltz of the Modern Folk Quartet, and a bass singer whose name nobody could later remember. The group, under the name \"Pooh and the Heffalumps\", recorded two Beach Boys knockoffs, \"Lady Godiva\" and \"Rooty Toot\", the latter written by Sebastian, though he would later be embarrassed by it and claim it was by his cousin:\n\n[Excerpt: Pooh and the Heffalumps, \"Rooty Toot\"]\n\nAfter that, Jacobsen became convinced that Sebastian should form a group to exploit his potential as a lead singer and songwriter. By this point, the Mugwumps had split up, and their management team had also split, with Silver taking Bill Cosby and Cavallo taking the Mugwumps, and so Sebastian was able to work with Yanovsky, and the putative group could be managed by Cavallo.\n\nBut Sebastian and Yanovsky needed a rhythm section. And Erik Jacobsen knew a band that might know some people.\n\nJacobsen was a fan of a Beatles soundalike group called the Sellouts, who were playing Greenwich Village and who were co-managed by Herb Cohen, the manager of the Modern Folk Quartet (who, as we heard a couple of episodes ago, would soon go on to be the manager of the Mothers of Invention). The Sellouts were ultra-professional by the standards  of rock groups of the time -- they even had a tape echo machine that they used on stage to give them a unique sound -- and they had cut a couple of tracks with Jacobsen producing, though I've not been able to track down copies of them.\n\nTheir leader Skip Boone, had started out playing guitar in a band called the Blue Suedes, and had played in 1958 on a record by their lead singer Arthur Osborne:\n\n[Excerpt: Arthur Osborne, \"Hey Ruby\"]\n\nSkip Boone's brother Steve in his autobiography says that that was produced by Chet Atkins for RCA, but it was actually released on Brunswick records.\n\nIn the early sixties, Skip Boone joined a band called the Kingsmen -- not the same one as the band that recorded \"Louie Louie\" -- playing lead guitar with his brother Steve on rhythm, a singer called Sonny Bottari, a saxophone player named King Charles, bass player Clay Sonier, and drummer Joe Butler. Sometimes Butler would get up front and sing, and then another drummer, Jan Buchner, would sit in in his place. Soon Steve Boone would replace Bonier as the bass player, but the Kingsmen had no success, and split up. From the ashes of the Kingsmen had formed the Sellouts, Skip Boone, Jerry Angus, Marshall O'Connell, and Joe Butler, who had switched from playing \"Peppermint Twist\" to playing \"I Want to Hold Your Hand\" in February 1964.\n\nMeanwhile Steve Boone went on a trip to Europe before starting at university in New York, where he hooked up again with Butler, and it was Butler who introduced him to Sebastian and Yanovsky. Sebastian and Yanovsky had been going to see the Sellouts at the behest of Jacobsen, and they'd been asking if they knew anyone else who could play that kind of material. Skip Boone had mentioned his little brother, and as soon as they met him, even before they first played together, they knew from his appearance that he would be the right bass player for them.\n\nSo now they had at least the basis for a band. They hadn't played together, but Erik Jacobsen was an experienced record producer and Cavallo an experienced manager. They just needed to do some rehearsals and get a drummer, and a record contract was more or less guaranteed. Boone suggested Jan Buchner, the backup drummer from the Kingsmen, and he joined them for rehearsals.\n\nIt was during these early rehearsals that Boone got to play on his first real record, other than some unreleased demos the Kingsmen had made. John Sebastian got a call from that \"Bob Landy\" we mentioned earlier, asking if he'd play bass on a session. Boone tagged along, because he was a fan, and when Sebastian couldn't get the parts down for some songs, he suggested that Boone, as an actual bass player, take over:\n\n[Excerpt: Bob Dylan, \"Maggie's Farm\"]\n\nBut the new group needed a name, of course. It was John Sebastian who came up with the name they eventually chose, The Lovin' Spoonful, though Boone was a bit hesitant about it at first, worrying that it might be a reference to heroin -- Boone was from a very conservative, military, background, and knew little of drug culture and didn't at that time make much of a distinction between cannabis and heroin, though he'd started using the former -- but Sebastian was insistent. The phrase actually referred to coffee -- the name came from \"Coffee Blues\" by Sebastian's old idol Mississippi John Hurt – or at least Hurt always *said* it was about coffee, though in live performance he apparently made it clear that it was about cunnilingus:\n\n[Excerpt: Mississippi John Hurt, \"Coffee Blues\"]\n\nTheir first show, at the Night Owl Club, was recorded, and there was even an attempt to release it as a CD in the 1990s, but it was left unreleased and as far as I can tell wasn't even leaked. There have been several explanations for this, but perhaps the most accurate one is just the comment from the manager of the club, who came up to the group after their two sets and told them “Hey, I don’t know how to break this to you, but you guys suck.”\n\nThere were apparently three different problems. They were underrehearsed -- which could be fixed with rehearsal -- they were playing too loud and hurting the patrons' ears -- which could be fixed by turning down the amps -- and their drummer didn't look right, was six years older than the rest of the group, and was playing in an out-of-date fifties style that wasn't suitable for the music they were playing.\n\nThat was solved by sacking Buchner. By this point Joe Butler had left the Sellouts, and while Herb Cohen was interested in managing him as a singer, he was willing to join this new group at least for the moment.\n\nBy now the group were all more-or-less permanent residents at the Albert Hotel, which was more or less a doss-house where underemployed musicians would stay, and which had its own rehearsal rooms. As well as the Spoonful, Cass Elliot and Denny Doherty lived there, as did the Paul Butterfield Blues Band.\n\nJoe Butler quickly fit into the group, and soon they were recording what became their first single, produced by Jacobsen, an original of Sebastian's called \"Do You Believe in Magic?\", with Sebastian on autoharp and vocals, Yanovsky on lead guitar and backing vocals, Boone on bass, Butler on drums, and Jerry Yester adding piano and backing vocals:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nFor a long time, the group couldn't get a deal -- the record companies all liked the song, but said that unless the group were English they couldn't sell them at the moment. Then Phil Spector walked into the Night Owl Cafe, where the new lineup of the group had become popular, and tried to sign them up. But they turned him down -- they wanted Erik Jacobsen to produce them; they were a team. Spector's interest caused other labels to be interested, and the group very nearly signed to Elektra. But again, signing to Elektra would have meant being produced by Rothchild, and also Elektra were an album label who didn't at that time have any hit single acts, and the group knew they had hit single potential. They did record a few tracks for Elektra to stick on a blues compilation, but they knew that Elektra wouldn't be their real home.\n\nEventually the group signed with Charley Koppelman and Don Rubin, who had started out as songwriters themselves, working for Don Kirshner. When Kirshner's organisation had been sold to Columbia, Koppelman and Rubin had gone along and ended up working for Columbia as executives. They'd then worked for Morris Levy at Roulette Records, before forming their own publishing and record company. Rather than put out records themselves, they had a deal to license records to Kama Sutra Records, who in turn had a distribution deal with MGM Records.\n\nKoppelman and Rubin were willing to take the group and their manager and producer as a package deal, and they released the group's demo of \"Do You Believe In Magic?\" unchanged as their first single:\n\n[Excerpt: The Lovin' Spoonful, \"Do You Believe in Magic?\"]\n\nThe single reached the top ten, and the group were soon in the studio cutting their first album, also titled Do You Believe In Magic?\n\nThe album was a mix of songs that were part of the standard Greenwich Village folkie repertoire -- songs like Mississippi John Hurt's \"Blues in the Bottle\" and Fred Neil's \"The Other Side of This Life\" -- and a couple more originals.\n\nThe group's second single was the first song that Steve Boone had co-written. It was inspired by a date he'd gone on with the photographer Nurit Wilde, who sadly for him didn't go on a second date, and who would later be the mother of Mike Nesmith's son Jason, but who he was very impressed by. He thought of her when he came up with the line \"you didn't have to be so nice, I would have liked you anyway\", and he and Sebastian finished up a song that became another top ten hit for the group:\n\n[Excerpt: (The Good Time Music of) The Lovin' Spoonful, \"You Didn't Have to Be So Nice\"]\n\nShortly after that song was recorded, but before it was released, the group were called into Columbia TV with an intriguing proposition. Bert Schneider and Bob Rafelson, two young TV producers, were looking at producing a TV show inspired by A Hard Day's Night, and were looking for a band to perform in it. Would the Lovin' Spoonful be up for it?\n\nThey were interested at first, but Boone and Sebastian weren't sure they wanted to be actors, and also it would involve the group changing its name. They'd already made a name for themselves as the Lovin' Spoonful, did they really want to be the Monkees instead? They passed on the idea.\n\nInstead, they went on a tour of the deep South as the support act to the Supremes, a pairing that they didn't feel made much sense, but which did at least allow them to watch the Supremes and the Funk Brothers every night. Sebastian was inspired by the straight four-on-the-floor beat of the Holland-Dozier-Holland repertoire, and came up with his own variation on it, though as this was the Lovin' Spoonful the end result didn't sound very Motown at all:\n\n[Excerpt: The Lovin' Spoonful, \"Daydream\"]\n\nIt was only after the track was recorded that Yanovsky pointed out to Sebastian that he'd unconsciously copied part of the melody of the old standard \"Got a Date With an Angel\":\n\n[Excerpt: Al Bowlly, \"Got a Date With an Angel\"]\n\n\"Daydream\" became the group's third top ten hit in a row, but it caused some problems for the group. The first was Kama Sutra's advertising campaign for the record, which had the words \"Lovin' Spoonful Daydream\", with the initials emphasised. While the group were drug users, they weren't particularly interested in being promoted for that rather than their music, and had strong words with the label.\n\nThe other problem came with the Beach Boys. The group were supporting the Beach Boys on a tour in spring of 1966, when \"Daydream\" came out and became a hit, and they got on with all the band members except Mike Love, who they definitely did not get on with. Almost fifty years later, in his autobiography, Steve Boone would have nothing bad to say about the Wilson brothers, but calls Love \"an obnoxious, boorish braggart\", a \"marginally talented hack\" and worse, so it's safe to say that Love wasn't his favourite person in the world.\n\nUnfortunately, when \"Daydream\" hit the top ten, one of the promoters of the tour decided to bill the Lovin' Spoonful above the Beach Boys, and this upset Love, who understandably thought that his group, who were much better known and had much more hits, should be the headliners. If this had been any of the other Beach Boys, there would have been no problem, but because it was Love, who the Lovin' Spoonful despised, they decided that they were going to fight for top billing, and the managers had to get involved. Eventually it was agreed that the two groups would alternate the top spot on the bill for the rest of the tour.\n\n\"Daydream\" eventually reached number two on the charts (and number one on Cashbox) and also became the group's first hit in the UK, reaching number two here as well, and leading to the group playing a short UK tour. During that tour, they had a similar argument over billing with Mick Jagger as they'd had with Mike Love, this time over who was headlining on an appearance on Top of the Pops, and the group came to the same assessment of Jagger as they had of Love. The performance went OK, though, despite them being so stoned on hash given them by the wealthy socialite Tara Browne that Sebastian had to be woken up seconds before he started playing.\n\nThey also played the Marquee Club -- Boone notes in his autobiography that he wasn't impressed by the club when he went to see it the day before their date there, because some nobody named David Bowie was playing there. But in the audience that day were George Harrison, John Lennon, Eric Clapton, Steve Winwood, Spencer Davis, and Brian Jones, most of whom partied with the group afterwards.\n\nThe Lovin' Spoonful made a big impression on Lennon in particular, who put \"Daydream\" and \"Do You Believe in Magic\" in his jukebox at home, and who soon took to wearing glasses in the same round, wiry, style as the ones that Sebastian wore. They also influenced Paul McCartney, who wasn't at that gig, but who soon wrote this, inspired by \"Daydream\":\n\n[Excerpt: The Beatles, \"Good Day Sunshine\"]\n\nUnfortunately, this was more or less the high point of the group's career.\n\nShortly after that brief UK tour, Zal Yanovsky and Steve Boone went to a party where they were given some cannabis -- and they were almost immediately stopped by the police, subjected to an illegal search of their vehicle, and arrested.\n\nThey would probably have been able to get away with this -- after all, it was an illegal search, even though of course the police didn't admit to that -- were it not for the fact that Yanovsky was a Canadian citizen, and he could be deported and barred from ever re-entering the US just for being arrested.\n\nThis was the first major drug bust of a rock and roll group, and there was no precedent for the group, their managers, their label or their lawyers to deal with this. And so they agreed to something they would regret for the rest of their lives. In return for being let off, Boone and Yanovsky agreed to take an undercover police officer to a party and introduce him to some of their friends as someone they knew in the record business, so he would be able to arrest one of the bigger dealers.\n\nThis was, of course, something they knew was a despicable thing to do, throwing friends under the bus to save themselves, but they were young men and under a lot of pressure, and they hoped that it wouldn't actually lead to any arrests. And for almost a year, there were no serious consequences, although both Boone and Yanovsky were shaken up by the event, and Yanovsky's behaviour, which had always been erratic, became much, much worse.\n\nBut for the moment, the group remained very successful. After \"Daydream\", an album track from their first album, \"Did You Ever Have to Make Up Your Mind?\" had been released as a stopgap single, and that went to number two as well. And right before the arrest, the group had been working on what would be an even bigger hit.\n\nThe initial idea for \"Summer in the City\" actually came from John Sebastian's fourteen-year-old brother Mark, who'd written a bossa nova song called \"It's a Different World\". The song was, by all accounts, the kind of thing that a fourteen-year-old boy writes, but part of it had potential, and John Sebastian took that part -- giving his brother full credit -- and turned it into the chorus of a new song:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nTo this, Sebastian added a new verse, inspired by a riff the session player Artie Schroeck had been playing while the group recorded their songs for the Woody Allen film What's Up Tiger Lily, creating a tenser, darker, verse to go with his younger brother's chorus:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nIn the studio, Steve Boone came up with the instrumental arrangement, which started with drums, organ, electric piano, and guitar, and then proceeded to bass, autoharp, guitar, and percussion overdubs. The drum sound on the record was particularly powerful thanks to the engineer Roy Halee, who worked on most of Simon & Garfunkel's records. Halee put a mic at the top of a stairwell, a giant loudspeaker at the bottom, and used the stairwell as an echo chamber for the drum part. He would later use a similar technique on Simon and Garfunkel's \"The Boxer\".\n\nThe track still needed another section though, and Boone suggested an instrumental part, which led to him getting an equal songwriting credit with the Sebastian brothers. His instrumental piano break was inspired by Gershwin, and the group topped it off with overdubbed city noises:\n\n[Excerpt: The Lovin' Spoonful, \"Summer in the City\"]\n\nThe track went to number one, becoming the group's only number one record, and it was the last track on what is by far their best album, Hums of the Lovin' Spoonful. That album produced two more top ten hits for the group, \"Nashville Cats\", a tribute to Nashville session players (though John Sebastian seems to have thought that Sun Records was a Nashville, rather than a Memphis, label), and the rather lovely \"Rain on the Roof\":\n\n[Excerpt: The Lovin' Spoonful, \"Rain on the Roof\"]\n\nBut that song caused friction with the group, because it was written about Sebastian's relationship with his wife who the other members of the band despised. They also felt that the songs he was writing about their relationship were giving the group a wimpy image, and wanted to make more rockers like \"Summer in the City\" -- some of them had been receiving homophobic abuse for making such soft-sounding music.\n\nThe group were also starting to resent Sebastian for other reasons. In a recent contract renegotiation, a \"key member\" clause had been put into the group's record contract, which stated that Sebastian, as far as the label was concerned, was the only important member of the group. While that didn't affect decision-making in the group, it did let the group know that if the other members did anything to upset Sebastian, he was able to take his ball away with him, and even just that potential affected the way the group thought about each other.\n\nAll these factors came into play with a song called \"Darling Be Home Soon\", which was a soft ballad that Sebastian had written about his wife, and which was written for another film soundtrack -- this time for a film by a new director named Francis Ford Coppola. When the other band members came in to play on the soundtrack, including that track, they found that rather than being allowed to improvise and come up with their own parts as they had previously, they had to play pre-written parts to fit with the orchestration. Yanovsky in particular was annoyed by the simple part he had to play, and when the group appeared on the Ed Sullivan show to promote the record, he mugged, danced erratically, and mimed along mocking the lyrics as Sebastian sang.\n\nThe song -- one of Sebastian's very best -- made a perfectly respectable number fifteen, but it was the group's first record not to make the top ten:\n\n[Excerpt: The Lovin' Spoonful, \"Darling Be Home Soon\"]\n\nAnd then to make matters worse, the news got out that someone had been arrested as a result of Boone and Yanovsky's efforts to get themselves out of trouble the year before. This was greeted with horror by the counterculture, and soon mimeographed newsletters and articles in the underground papers were calling the group part of the establishment, and calling for a general boycott of the group -- if you bought their records, attended their concerts, or had sex with any of the band members, you were a traitor.\n\nYanovsky and Boone had both been in a bad way mentally since the bust, but Yanovsky was far worse, and was making trouble for the other members in all sorts of ways. The group decided to fire Yanovsky, and brought in Jerry Yester to replace him, giving him a severance package that ironically meant that he ended up seeing more money from the group's records than the rest of them, as their records were later bought up by a variety of shell companies that passed through the hands of Morris Levy among others, and so from the late sixties through the early nineties the group never got any royalties.\n\nFor a while, this seemed to benefit everyone. Yanovsky had money, and his friendship with the group members was repaired. He released a solo single, arranged by Jack Nitzsche, which just missed the top one hundred:\n\n[Excerpt: Zal Yanovsky, \"Just as Long as You're Here\"]\n\nThat song was written by the Bonner and Gordon songwriting team who were also writing hits for the Turtles at this time, and who were signed to Koppelman and Rubin's company.\n\nThe extent to which Yanovsky's friendship with his ex-bandmates was repaired by his firing was shown by the fact that Jerry Yester, his replacement in the group, co-produced his one solo album, Alive and Well in Argentina, an odd mixture of comedy tracks, psychedelia, and tributes to the country music he loved. His instrumental version of Floyd Cramer's \"Last Date\" is fairly listenable -- Cramer's piano playing was a big influence on Yanovsky's guitar -- but his version of George Jones' \"From Brown to Blue\" makes it very clear that Zal Yanovsky was no George Jones:\n\n[Excerpt: Zal Yanovsky, \"From Brown to Blue\"]\n\nYanovsky then quit music, and went into the restaurant business.\n\nThe Lovin' Spoonful, meanwhile, made one further album, but the damage had been done. Everything Playing is actually a solid album, though not as good as the album before, and it produced three top forty hits, but the highest-charting was \"Six O'Clock\", which only made number eighteen, and the album itself made a pitiful one hundred and eighteen on the charts. The song on the album that in retrospect has had the most impact was the rather lovely \"Younger Generation\", which Sebastian later sang at Woodstock:\n\n[Excerpt: John Sebastian, \"Younger Generation (Live at Woodstock)\"]\n\nBut at Woodstock he performed that alone, because by then he'd quit the group.\n\nBoone, Butler, and Yester decided to continue, with Butler singing lead, and recorded a single, \"Never Going Back\", produced by Yester's old bandmate from the Modern Folk Quartet Chip Douglas, who had since become a successful producer for the Monkees and the Turtles, and written by John Stewart of the Kingston Trio, who had written \"Daydream Believer\" for the Monkees, but the record only made number seventy-eight on the charts:\n\n[Excerpt: The Lovin' Spoonful featuring Joe Butler, \"Never Going Back\"]\n\nThat was followed by an album by \"The Lovin' Spoonful Featuring Joe Butler\", Revelation: Revolution 69, a solo album by Butler in all but name -- Boone claims not to have played on it, and Butler is the only one featured on the cover, which shows a naked Butler being chased by a naked woman with a lion in front of them covering the naughty bits. The biggest hit other than \"Never Going Back\" from the album was \"Me About You\", a Bonner and Gordon song which only made number ninety-one:\n\n[Excerpt: The Lovin' Spoonful Featuring Joe Butler, \"Me About You\"]\n\nJohn Sebastian went on to have a moderately successful solo career -- as well as his appearance at Woodstock, he released several solo albums, guested on harmonica on records by the Doors, Crosby, Stills, Nash, and Young and others, and had a solo number one hit in 1976 with \"Welcome Back\", the theme song from the TV show Welcome Back, Kotter:\n\n[Excerpt: John Sebastian, \"Welcome Back\"]\n\nSebastian continues to perform, though he's had throat problems for several decades that mean he can't sing many of the songs he's best known for.\n\nThe original members of the Lovin' Spoonful reunited for two performances -- an appearance in Paul Simon's film One Trick Pony in 1980, and a rather disastrous induction into the Rock and Roll Hall of Fame in 2000. Zal Yanovsky died of a heart attack in 2002.\n\nThe remaining band members remained friendly, and Boone, Butler, and Yester reunited as the Lovin' Spoonful in 1991, initially with Yester's brother Jim, who had played in The Association, latterly with other members. One of those other members in the 1990s was Yester's daughter Lena, who became Boone's fourth wife (and is as far as I can discover still married to him). Yester, Boone, and Butler continued touring together as the Lovin' Spoonful until 2017, when Jerry Yester was arrested on thirty counts of child pornography possession, and was immediately sacked from the group.\n\nThe other two carried on, and the three surviving original members reunited on stage for a performance at one of the Wild Honey Orchestra's benefit concerts in LA in 2020, though that was just a one-off performance, not a full-blown reunion.\n\nIt was also the last Lovin' Spoonful performance to date, as that was in February 2020, but Steve Boone has performed with John Sebastian's most recent project, John Sebastian's Jug Band Village, a tribute to the Greenwich Village folk scene the group originally formed in, and the two played together most recently in December 2021. The three surviving original members of the group all seem to be content with their legacy, doing work they enjoy, and basically friendly, which is more than can be said for most of their contemporaries, and which is perhaps appropriate for a band whose main songwriter had been inspired, more than anything else, to make music with a positive attitude.",
  "enclosure": "",
  "itunes:summary": "Episode 143 of A History of Rock Music in Five Hundred Songs looks at “Summer in the City’”, and at the short but productive career of the Lovin' Spoonful.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"The Sun Ain't Gonna Shine Any More\" by the Walker Brothers and the strange career of Scott Walker.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nThis box set contains all four studio albums by the Lovin' Spoonful, plus the one album by \"The Lovin' Spoonful featuring Joe Butler\", while this CD contains their two film soundtracks (mostly inessential instrumental filler, apart from \"Darling Be Home Soon\")\n\nInformation about harmonicas and harmonicists comes from Harmonicas, Harps, and Heavy Breathers by Kim Field.\n\nThere are only three books about the Lovin' Spoonful, but all are worth reading. Do You Believe in Magic? by Simon Wordsworth is a good biography of the band, while his The Magic's in the Music is a scrapbook of press cuttings and reminiscences. Meanwhile Steve Boone's Hotter Than a Match Head: My Life on the Run with the Lovin' Spoonful has rather more discussion of the actual music than is normal in a musician's autobiography.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nLet's talk about the harmonica for a while. The harmonica is an instrument that has not shown up a huge amount in the podcast, but which was used in a fair bit of the music we've covered. We've heard it for example on records by Bo Diddley:\n\n[Excerpt: Bo Diddley, \"I'm a Man\"]\n\nand by Bob Dylan:\n\n[Excerpt: Bob Dylan, \"Blowin' in the Wind\"]\n\nand the Rolling Stones:\n\n[Excerpt: The Rolling Stones, \"Little Red Rooster\"]\n\nIn most folk and blues contexts, the harmonicas used are what is known as a diatonic harmonica, and these are what most people think of when they think of harmonicas at all. Diatonic harmonicas have the notes of a single key in them, and if you want to play a note in another key, you have to do interesting tricks with the shape of your mouth to bend the note.\n\nThere's another type of harmonica, though, the chromatic harmonica. We've heard that a time or two as well, like on \"Love Me Do\" by the Beatles:\n\n[Excerpt: The Beatles, \"Love Me Do\"]\n\nChromatic harmonicas have sixteen holes, rather than the diatonic harmonica's ten, and they also have a slide which you can press to raise the note by a semitone, meaning you can play far more notes than on a diatonic harmonica -- but they're also physically harder to play, requiring a different kind of breathing to pull off playing one successfully. They're so different that John Lennon would distinguish between the two instruments -- he'd describe a chromatic harmonica as a harmonica, but a diatonic harmonica he would call a harp, like blues musicians often did:\n\n[Excerpt: The Beatles, \"Love These Goon Shows\"]\n\nWhile the chromatic harmonica isn't a particularly popular instrument in rock music, it is one that has had some success in other fields. There have been some jazz and light-orchestral musicians who have become famous playing the instrument, like the jazz musician Max Geldray, who played in those Goon Shows the Beatles loved so much:\n\n[Excerpt: Max Geldray, \"C-Jam Blues\"]\n\nAnd in the middle of the twentieth century there were a few musicians who succeeded in making the harmonica into an instrument that was actually respected in serious classical music. By far the most famous of these was Larry Adler, who became almost synonymous with the instrument in the popular consciousness, and who reworked many famous pieces of music for the ins",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Episode 143 of A History of Rock Music in Five Hundred Songs looks at “Summer in the City’”, and at the short but productive career of the Lovin' Spoonful.  Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\nPatreon backers also have a ten-minute bonus episode available, on \"The Sun Ain't Gonna Shine Any More\" by the Walker Brothers and the strange career of Scott Walker.\n\nTilt Araiza has assisted invaluably by doing a first-pass edit, and will hopefully be doing so from now on. Check out Tilt’s irregular podcasts at http://www.podnose.com/jaffa-cakes-for-proust and http://sitcomclub.com/\n\n\n\nResources\n\nAs usual, all the songs excerpted in the podcast can be heard in full at Mixcloud.\n\nThis box set contains all four studio albums by the Lovin' Spoonful, plus the one album by \"The Lovin' Spoonful featuring Joe Butler\", while this CD contains their two film soundtracks (mostly inessential instrumental filler, apart from \"Darling Be Home ",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}