{
  "title": "Breaking through the mucus barrier",
  "link": "https://news.mit.edu/2022/protein-drugs-gi-tract-0928",
  "description": "A capsule that tunnels through mucus in the GI tract could be used to orally administer large protein drugs such as insulin.",
  "pubDate": "Wed, 28 Sep 2022 14:00:00 -0400",
  "guid": "https://news.mit.edu/2022/protein-drugs-gi-tract-0928",
  "dc:creator": "Anne Trafton | MIT News Office",
  "content:encoded": "<p>One reason that it’s so difficult to deliver large protein drugs orally is that these drugs can’t pass through the mucus barrier that lines the digestive tract. This means that insulin and most other “biologic drugs” — drugs consisting of proteins or nucleic acids — have to be injected or administered in a hospital.&nbsp;</p>\n\n<p></p>\n\n<p>A new drug capsule developed at MIT may one day be able to replace those injections. The capsule has a robotic cap that spins and tunnels through the mucus barrier when it reaches the small intestine, allowing drugs carried by the capsule to pass into cells lining the intestine.</p>\n\n<p></p>\n\n<p>“By displacing the mucus, we can maximize the dispersion of the drug within a local area and enhance the absorption of both small molecules and macromolecules,” says Giovanni Traverso, the Karl van Tassel Career Development Assistant Professor of Mechanical Engineering at MIT and a gastroenterologist at Brigham and Women’s Hospital.</p>\n\n<p></p>\n\n<p>In a study appearing today in <em>Science Robotics</em>, the researchers demonstrated that they could use this approach to deliver insulin as well as vancomycin, an antibiotic peptide that currently has to be injected.</p>\n\n<p></p>\n\n<p>Shriya Srinivasan, a research affiliate at MIT’s Koch Institute for Integrative Cancer Research and a junior fellow at the Society of Fellows at Harvard University, is the lead author of the study.</p>\n\n<p></p>\n\n<p><strong>Tunneling through</strong></p>\n\n<p></p>\n\n<p>For several years, Traverso’s lab has been developing strategies to deliver protein drugs such as insulin orally. This is a difficult task because protein drugs tend to be broken down in acidic environment of the digestive tract, and they also have difficulty penetrating the mucus barrier that lines the tract.</p>\n\n<p></p>\n\n<p>To overcome those obstacles, Srinivasan came up with the idea of creating a protective capsule that includes a mechanism that can tunnel through mucus, just as tunnel boring machines drill into soil and rock.</p>\n\n<p></p>\n\n<p>“I thought that if we could tunnel through the mucus, then we could deposit the drug directly on the epithelium,” she says. “The idea is that you would ingest this capsule and the outer layer would dissolve in the digestive tract, exposing all these features that start to churn through the mucus and clear it.”</p>\n\n<p></p>\n\n<p>The “RoboCap” capsule, which is about the size of a multivitamin, carries its drug payload in a small reservoir at one end and carries the tunnelling features in its main body and surface. The capsule is coated with gelatin that can be tuned to dissolve at a specific pH.</p>\n\n<p></p>\n\n<p>When the coating dissolves, the change in pH triggers a tiny motor inside the RoboCap capsule to start spinning. This motion helps the capsule to tunnel into the mucus and displace it. The capsule is also coated with small studs that brush mucus away, similar to the action of a toothbrush.</p>\n\n<p></p>\n\n<p>The spinning motion also helps to erode the compartment that carries the drug, which is gradually released into the digestive tract.</p>\n\n<p></p>\n\n<p>“What the RoboCap does is transiently displace the initial mucus barrier and then enhance absorption by maximizing the dispersion of the drug locally,” Traverso says. “By combining all of these elements, we’re really maximizing our capacity to provide the optimal situation for the drug to be absorbed.”</p>\n\n<p></p>\n\n<p><strong>Enhanced delivery</strong></p>\n\n<p></p>\n\n<p>In tests in animals, the researchers used this capsule to deliver either insulin or vancomycin, a large peptide antibiotic that is used to treat a broad range of infections, including skin infections as well as infections affecting orthopedic implants. With the capsule, the researchers found that they could deliver 20 to 40 times more drug than a similar capsule without the tunneling mechanism.</p>\n\n<p></p>\n\n<p>Once the drug is released from the capsule, the capsule itself passes through the digestive tract on its own. The researchers found no sign of inflammation or irritation in the digestive tract after the capsule passed through, and they also observed that the mucus layer reforms within a few hours after being displaced by the capsule.</p>\n\n<p></p>\n\n<p>Another approach that some researchers have used to enhance oral delivery of drugs is to give them along with additional drugs that help them cross through the intestinal tissue. However, these enhancers often only work with certain drugs. Because the MIT team’s new approach relies solely on mechanical disruptions to the mucus barrier, it could potentially be applied to a broader set of drugs, Traverso says.</p>\n\n<p></p>\n\n<p>“Some of the chemical enhancers preferentially work with certain drug molecules,” he says. “Using mechanical methods of administration can potentially enable more drugs to have enhanced absorption.”</p>\n\n<p></p>\n\n<p>While the capsule used in this study released its payload in the small intestine, it could also be used to target the stomach or colon by changing the pH at which the gelatin coating dissolves. The researchers also plan to explore the possibility of delivering other protein drugs such as GLP1 receptor agonist, which is sometimes used to treat type 2 diabetes. The capsules could also be used to deliver topical drugs to treat ulcerative colitis and other inflammatory conditions by maximizing the local concentration of the drugs in the tissue to help treat the inflammation.</p>\n\n<p></p>\n\n<p>The research was funded, in part, by the National Institutes of Health and MIT’s Department of Mechanical Engineering.</p>\n\n<p></p>\n\n<p>Other authors of the paper include Amro Alshareef, Alexandria Hwang, Ziliang Kang, Johannes Kuosmanen, Keiko Ishida, Joshua Jenkins, Sabrina Liu, Wiam Abdalla Mohammed Madani, Jochen Lennerz, Alison Hayward, Josh Morimoto, Nina Fitzgerald, and Robert Langer.</p>",
  "media:content": {
    "media:description": "A new drug capsule developed at MIT can help large proteins such as insulin and small-molecule drugs be absorbed in the digestive tract.",
    "media:credit": "Image: Felice Frankel"
  },
  "category": [
    "Research",
    "Mechanical engineering",
    "Drug delivery",
    "Medicine",
    "Robotics",
    "Koch Institute",
    "School of Engineering",
    "National Institutes of Health (NIH)"
  ]
}