{
  "id": "yt:video:68he-aPAVfs",
  "yt:videoId": "68he-aPAVfs",
  "yt:channelId": "UCs8o1mdWAfefJkdBg632_tg",
  "title": "A Great Story Should Feel Like A Roller Coaster Ride - Margaret Kerrison",
  "link": "",
  "author": {
    "name": "Film Courage",
    "uri": "https://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg"
  },
  "published": "2022-10-24T00:00:03+00:00",
  "updated": "2022-10-24T02:29:18+00:00",
  "media:group": {
    "media:title": "A Great Story Should Feel Like A Roller Coaster Ride - Margaret Kerrison",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "BUY THE BOOK - IMMERSIVE STORYTELLING FOR REAL AND IMAGINED WORLDS: A Writer’s Guide\nhttps://amzn.to/3osNHOx\n\nBorn in Indonesia and raised in Singapore, Margaret Kerrison received her Master of Fine Arts degree in Screenwriting from the University of Southern California School of Cinematic Arts. Her career spans television, film, digital media, games, brand storytelling, location-based entertainment, and immersive experiences. She has worked as a Story Lead, Story Consultant, and Writer for multiple projects around the world, including Star Wars: Galaxy’s Edge, Star Wars: Launch Bay, Star Wars: Galactic Starcruiser, Avengers Campus, Guardians of the Galaxy: Cosmic Rewind, National Geographic HQ, and the NASA Kennedy Space Center Visitor Complex’s Journey to Mars: Explorers Wanted. She was the writer for five projects that won Themed Entertainment Association (THEA) Awards. She has appeared in the Disney+ series Behind the Attraction, the Freeform television special Star Wars: Galaxy‘s Edge – Adventure Awaits, and the online educational program Imagineering in a Box. She was a Disney Imagineer from 2014-2021. She is currently a Sr. Experiential Creative Lead at Airbnb. Immersive Storytelling for Real and Imagined Worlds – A Writer’s Guide is her first book.\n\nCONNECT WITH MARGARET KERRISON\nhttps://www.margaretkerrison.com\nhttps://www.imdb.com/name/nm2519839\n\nRELATED VIDEOS\nHow To Engage The Audience Immediately - https://youtu.be/LxXsxG7BGEE\nWhat Is Immersive Storytelling? - https://youtu.be/J4abGQYyfUw\nOne Way To Create Twists And Turns In A Screenplay - https://youtu.be/RyTKltZPLyI\nHow To Create Suspense In A Screenplay - https://youtu.be/HpPyTdBnypM\nA Screenwriter Who Doesn’t Do This Will Write A Boring Story - https://youtu.be/MKcqpk0oLQ0\n\nMORE MICHAEL WIESE PRODUCTIONS AUTHORS\nhttps://mwp.com\n\n(Affiliates)\n►WE USE THIS CAMERA (B&H) – https://buff.ly/3rWqrra\n►WE USE THIS EDITING PROGRAM (ADOBE) – https://goo.gl/56LnpM\n►WE USE THIS SOUND RECORDER (AMAZON) – http://amzn.to/2tbFlM9\n►WRITERS, TRY FINAL DRAFT FREE FOR 30-DAYS! (FINAL DRAFT) - http://ow.ly/Gz4w30rDSKt\n\nBOOKS WE RECOMMEND\nhttps://buff.ly/3o0oE5o\n\nSUPPORT FILM COURAGE BY BECOMING A MEMBER\nhttps://www.youtube.com/channel/UCs8o1mdWAfefJkdBg632_tg/join\n\nCONNECT WITH FILM COURAGE\nhttp://www.FilmCourage.com\nhttp://twitter.com/#!/FilmCourage\nhttps://www.facebook.com/filmcourage\nhttps://www.instagram.com/filmcourage\nhttp://filmcourage.tumblr.com\nhttp://pinterest.com/filmcourage\n\nSUBSCRIBE TO THE FILM COURAGE YOUTUBE CHANNEL\nhttp://bit.ly/18DPN37\n\nLISTEN TO THE FILM COURAGE PODCAST\nhttps://soundcloud.com/filmcourage-com\n\nStuff we use:\n\nLENS - Most people ask us what camera we use, no one ever asks about the lens which filmmakers always tell us is more important.  This lens was a big investment for us and one we wish we could have made sooner.  Started using this lens at the end of 2013 - http://amzn.to/2tbtmOq\n\nAUDIO \n\nRode VideoMic Pro  - The Rode mic helps us capture our backup audio.  It also helps us sync up our audio in post http://amzn.to/2t1n2hx\n\nAudio Recorder - If we had to do it all over again, this is probably the first item we would have bought - http://amzn.to/2tbFlM9\n\nLIGHTS - Although we like to use as much natural light as we can, we often enhance the lighting with this small portable light.  We have two of them and they have saved us a number of times - http://amzn.to/2u5UnHv\n\nCOMPUTER - Our favorite computer, we each have one and have used various models since 2010 - http://amzn.to/2t1M67Z\n\nEDITING - We upgraded our editing suite this year and we’re glad we did!  This has improved our workflow and the quality of our work.  Having new software also helps when we have a problem, it’s easy to search and find a solution - https://goo.gl/56LnpM\n\n*These are affiliate links, by using them you can help support this channel.\n\n#film #movies #story",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}