{
  "title": "Episode 4: &#8220;Choo Choo Ch&#8217;Boogie&#8221; by Louis Jordan",
  "link": "https://500songs.com/podcast/choo-choo-chboogie-by-louis-jordan/",
  "pubDate": "Mon, 29 Oct 2018 00:00:00 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/choo-choo-chboogie-by-louis-jordan/",
  "description": "Welcome to episode four of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Louis Jordan and \"Choo Choo Ch'Boogie\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-4-choo-choo-chboogie/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nLouis Jordan's music is now in the public domain, so there are many different compilations available, of different levels of quality. <a href=\"https://amzn.to/2CMn2FF\">This four-CD set</a> is very cheap and has most of the classic tracks on. And here's <a href=\"https://amzn.to/2CKQhc2\">a similarly-priced collection of Chick Webb</a>.\n\nThere aren't many books on Louis Jordan as an individual, and most of the information here comes from books on other musicians, but <a href=\"https://amzn.to/2zbmYMp\">this one</a> is probably worth your while if you want to investigate more.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book&nbsp;<a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a>\n\n<strong>Transcript</strong>\n\nWe've spent a lot of time in 1938 in this podcast, haven't we? First there was Flying Home, first recorded in 1939, but where we had to talk about events from 1938. Then we had \"Roll 'Em Pete\", recorded in 1938. And \"Ida Red\", recorded in 1938. 1938 is apparently the real year zero for rock and roll -- whether you come at it from the direction of blues and boogie, or jazz, or country and western music, 1938 ends up being the place where you start. Eighty years ago this year.\n\nAnd 1938 is also the year that one man made his solo debut, and basically put together all the pieces of rock and roll in one place.\n\nIf you've seen the Marx Brothers film <em>A Day At The Races</em> -- well, OK, if you've <em>not</em> seen <em>A Day At The Races</em>, you really should, because while it's not the best film the Marx Brothers ever made, it's still a good Marx Brothers film, and it'll brighten up your day immensely to watch it, so go and watch that, and then come back and listen to the rest of this. And if you haven't watched all their earlier films, watch those too. Except <em>The Cocoanuts</em>, you can skip that one. Go on. I can wait.\n\nOK, now you've definitely seen the Marx Brothers film <em>A Day At The Races</em>, so you'll remember the dance sequence where Ivie Anderson sings \"All God's Chillun Got Rhythm\", and the amazing dancers in that scene.\n\n[Ivy Anderson \"All God's Chillun Got Rhythm\"]\n\nThat's a dance called the Lindy Hop -- you might remember that as the dance the \"booglie wooglie piggy\" did in a song we excerpted in episode two, it was named after Charles Lindbergh, the famous airman and Nazi sympathiser -- and the people dancing it are Whitey's Lindy Hoppers. And they were responsible for a controversy, on the night of Benny Goodman's first Carnegie Hall concert -- the one we talked about in episode one -- that is still talked about in jazz eighty years later.\n\n[Chick Webb \"Stompin' At The Savoy\"]\n\nThat's \"Stompin' at the Savoy\" by Chick Webb, one of the most famous swing recordings ever, though it was later recorded by Benny Goodman in an even more fanmus version. The Savoy Ballroom was where Whitey's Lindy Hoppers used to dance -- there was an entire corner of the ballroom set off for them, even though the rest of the floor was for the other dancers. The Savoy was where the Lindy Hop was invented, and it was <em>the</em> place to dance, because it was where Chick Webb, the real king of swing played.\n\nWe've seen a few kings of swing so far -- Benny Goodman was the person most associated with the name, and he had the name longest. A few people called Bob Wills that, too, though he mostly billed himself as the king of <em>Western</em> swing. But Chick Webb was the person who deserved the title more than anyone else. He was a small man, who'd contracted tuberculosis of the spine as a child, and he'd taken up the drums as a kind of therapy. He'd been playing professionally since he was eleven, and by the time he was thirty he was leading what was, bar none, the best swing band in New York for dancing. People called him the King of Swing before Goodman, and his band was an absolute force of nature when it came to getting people to do the Lindy Hop. Benny Goodman admired Webb's band enough that he bought the band's arrangements and used them himself -- all of the Goodman band's biggest crowd-pleasers, at least the ones that weren't arrangements he'd bought off Fletcher Henderson, he bought from Edgar Sampson, the saxophone player who did most of Webb's arrangements. Sampson is the one who wrote \"Stompin' at the Savoy\", which we just heard.\n\nThere was a rivalry there -- Goodman's band was bigger in every sense, but Webb's band was more popular with those who knew the real deal when they heard it. And in 1937, the Savoy hosted a cutting contest between Webb's Savoy Orchestra and Goodman's band.\n\nA cutting contest was a tradition that came from the world of stride piano players -- the same world that boogie woogie music grew out of. One musician would play his best (and it usually was a \"his\" -- this was a very macho musical world) and then a second would try to top him -- playing something faster, or more inventive, or more exciting, often a reworking of the song the first one had played -- and then the first would take another turn and try to get better than the second had. They'd keep going, each trying to outdo the other, until a crowd decided that one or the other was the winner.\n\nAnd that 1937 cutting contest was a big event. The Savoy had two bandstands, so they would have one band start as soon as the other one finished, so people could dance all night. Chick Webb's band set up on one stage, Goodman's on another. Four thousand dancers crowded the inside of the ballroom, and despite a police cordon outside to keep trouble down, another five thousand people outside tried to hear what was happening.\n\nAnd Chick Webb's band won, absolutely. Gene Krupa, Goodman's drummer (one of the true greats of jazz drumming himself) later said \"I'll never forget that night. Webb cut me to ribbons!\"\n\nAnd that just was the most famous of many, many cutting contests that Chick Webb's band won. The only time Chick Webb ever definitely lost a cutting contest was against Duke Ellington, but everyone knew that Chick Webb and Duke Ellington weren't really trying to do the same kind of thing, and anyway, there's no shame at all in losing to Duke Ellington.\n\nCount Basie, though, was a different matter. He <em>was</em> trying to do the same kind of thing as Chick Webb, and he was doing it well. And on the night of Benny Goodman's Carnegie Hall concert, Webb and Basie were going to engage in their own cutting contest after hours. For all that the Goodman Carnegie Hall show was important -- and it was -- the real jazz fans knew that this after-show party was going to be the place to be. Basie had already played the Carnegie hHall show, guesting with Goodman's band, as had Basie's tenor sax player Lester Young, but here they were going to get to show off what they could do with their own band.\n\nBasie's band was on top form at that time, with his new vocalists Jimmy Rushing, a great blues shouter, and Billie Holiday, who was just then becoming a star. Chick Webb had a couple of good vocalists too, though -- his new teenage singer, Ella Fitzgerald, in particular, was already one of the great singers.\n\n[Chick Webb – Ella]\n\nAnd everyone was in the audience. Goodman's band, Mildred Bailey, Ivie Anderson (who we heard before in that Marx Brothers clip), Red Norvo the vibraphone player, Duke Ellington. Every musician who mattered in the jazz scene was there to see if Basie could beat Chick Webb.\n\nAnd… there was a dispute about it, one which was never really resolved in Webb's lifetime.\n\nBecause Webb won -- everyone agreed, when it came to a vote of the audience, Webb's band did win, though it was a fairly close decision. Again, the only band to ever beat Chick Webb was Duke Ellington.\n\nBut everyone also agreed that Basie's band had got people dancing more. A <em>lot</em> more.\n\nWhat nobody realised at the time was that Whitey's Lindy Hoppers had gone on strike. Chick Webb had misheard a discussion between a couple of the dancers about how good the Basie band was going to be that night, assumed that they were saying Basie was going to be better than him, and got into a huff. Webb said \"I don't give a good Goddam what those raggedy Lindy Hoppers think or say. Who needs 'em? As far as I'm concerned they can all go to hell. And their Mammies too.\"\n\nAfter this provocation, Whitey issued an ultimatum to his Lindy Hoppers. That night, they were only going to dance to Basie, and not to Webb. So even though most of the audience preferred Webb's band, every time they played a song all the best dancers, the ones who had an entire quarter or so of the ballroom to themselves to do their most exciting and visual dances, all sat down, and it looked like the Webb band just weren't exciting the crowd as much as the Basie band.\n\nOf course, the Basie band <em>were</em> good that night, as well. When you've got the 1938 Count Basie band, with Jimmy Rushing and Billie Holiday singing, you're going to get a good show. Oh, and they persuaded Duke Ellington to come up and play a piano solo -- and then all the band joined in with him, unrehearsed and unprompted.\n\nBut despite all that, Webb's band still beat them in the audience vote.\n\n<em>That's</em> how good Webb's band were, and it's also how good his two big stars were. One of those stars, Ella Fitzgerald, we've already mentioned, but the other one was an alto sax player who also took the male lead vocals – we heard him singing with Ella earlier. This sax player did a lot of the frontman job for Webb's band and was so important to the band in those years that, allegedly, some people thought <em>he</em> was Chick Webb. That man was Louis Jordan.\n\n[Chick Webb I Can't Dance I Got Ants In My Pants]\n\nLouis Jordan was a good sax player, but what he really was was a <em>performer</em>. He was someone who could absolutely sell a song, with wit and humour and a general sense of hipness that could possibly be matched at that time only by Cab Calloway and Slim Gaillard, and Jordan was a better musician than either of them. He was charming, and funny, and tuneful, and good looking, and he knew it.\n\nHe knew it so well, in fact, that shortly after that show, he started making plans -- he thought that he and Ella were the two important ones in the Webb band, and he planned to form his own band, and take her, and much of the rest of the band with him. Webb found out and fired Jordan, and Ella and most of the band remained loyal to Webb.\n\nIn fact, sadly, Jordan would have had what he wanted sooner rather than later anyway. Chick Webb's disability had been affecting him more, and he was only continuing to perform because he felt he owed it to his musicians -- he would often pass out after a show, literally unable to do anything else. He died, aged thirty-four, in June 1939, and Ella Fitzgerald became the leader of his band, though like many big bands it eventually broke up in the mid-forties.\n\nSo if Jordan had held on for another few months, he would have had a good chance at being the leader of the Louis Jordan and Ella Fitzgerald band, and history would have been very different. As it was, instead, he formed a much smaller group, the Elks Rendez-vous Band, made up of members of Jesse Stone's band (you'll remember him from episode two, he wrote \"Shake, Rattle, and Roll\"). And on December 20, 1938 -- ten days before \"Roll 'Em Pete\" -- Louis Jordan and his Elks Rendez-vous Band went into the studio for the first time, to record \"Honey in the Bee Ball\" and \"Barnacle Bill the Sailor\".\n\n[excerpt of \"Honey in the Bee Ball\"]\n\nShortly after that, they changed their name to Louis Jordan and his Tympany Five.\n\nBefore we talk about them more, I want to briefly talk about someone else who worked with Jordan. I want to talk about Milt Gabler. Gabler is someone we'll be seeing a lot of in this story, and he's someone who already had an influence on it, but here's where he becomes important.\n\nYou see, even before his influence on rock and roll, Gabler had made one important contribution to music. He had started out as the owner of a little record shop, and he had a massive passion for good jazz music -- and so did his customers. And many of those customers had wanted to get hold of old records, now out of print. So in 1935 Gabler started his own record label, and licensed those out of print recordings by people like Bix Beiderbecke and Bessie Smith, becoming the owner of the very first ever reissue record label. His labels pioneered things like putting a full list of all the musicians on a record on the label -- the kind of thing that real music obsessives cared far more about than executives who only wanted to make money.\n\nAfter he had some success with that, he branched out into making new records, on a new label, Commodore. That would have stayed a minor label, but for one thing.\n\nIn 1939, one of his regular customers, Billie Holiday, had a problem. She'd been performing a new song which she really wanted to record, but her current label, Columbia, wasn't interested. That song was too political even for her producer, John Hammond -- the man who, you will remember from previous episodes, persuaded Benny Goodman to integrate his band and who put on shows that same year sponsored by the Communist Party. But the song was too political, and too inflammatory, even for him. The song, which became Billie Holiday's best-known performance, was \"Strange Fruit\", and it was about lynching.\n\n[insert section of Strange Fruit here].\n\nBillie Holiday could not get her label to put that track out, under any circumstances. But she knew Milt Gabler might do it -- he'd been recording several small group tracks with Lester Young, who was Holiday's colleague and friend in the Basie band. As Gabler was a friend of hers, and as he was politically left-leaning himself, he eventually negotiated a special deal with Columbia, Holiday's label, that he could produce her for one session and put out a single recording by her, on Commodore.\n\nThat recording sold over a million copies, and became arguably the most important recording in music history. In December 1999, Time Magazine called it the \"song of the century\". And in 2017, when the black singer Rebecca Ferguson was invited to play at Donald Trump's inauguration, she agreed on one condition -- that the song she performed could be \"Strange Fruit\". She was disinvited.\n\nAs a result of \"Strange Fruit\"'s success, Milt Gabler was headhunted away from his own label, and became a staff producer at Decca records in 1941. There he was responsible for producing many of the greatest records of the forties -- not least that famous Lionel Hampton version of \"Flying Home\" we looked at towards the end of episode one -- and he began a long collaboration with Louis Jordan -- remember him? This is a story about Louis Jordan.\n\nJordan's new band had a sound unlike anything else of the time -- Clarence \"Gatemouth\" Brown later claimed that Jordan had most of the responsibility for the decline of the big bands, saying \"He could play just as good and just as loud with five as 17. And it was cheaper.\"\n\nAnd while we've talked before about a whole raft of economic and social reasons for the decline of the big bands, there was a lot of truth in that statement -- while there were sometimes actually as many as seven or eight members of the Tympany Five, the original lineup was just Jordan plus one trumpet, one sax, piano, bass, and drums, and yet their recordings did sound almost as full as many of the bigger bands.\n\nThe style they were playing in was a style that later became known as \"jump band\" music, and it was a style that owed a lot to Lionel Hampton's band, and to Count Basie. This is a style of music that's based on simple chord changes -- usually blues changes. And it's based on the concept of the riff.\n\nWe haven't really talked much about the idea of riffs yet in this series, but they're absolutely crucial to almost all popular music from the twentieth century. A riff is, in its conception, fairly straight forward. It's an instrumental phrase that gets repeated over and over. It can act as the backbone to a song, but it can also be the basis for variation and improvisation -- when you \"riff on\" something, you're coming up with endless variations and permutations of it.\n\nRiffs were important in swing music -- generally they were a sort of back-and-forth in those. You'd have the saxophones play the riff, and then the trumpets and trombones repeat it after them. But swing wasn't just about riffs -- with a big orchestra, you had to have layers and stuff for all the musicians to do.\n\nIn jump band music, on the other hand, you strip everything back. The track becomes about the riff, the solos, and the vocal if there is one, and that's it. You play that riff over the simplest possible changes, you play it to a rhythm that will get everyone dancing -- often a boogie rhythm -- and you make everything about the energy of the performance.\n\nJordan's band did that, and they combined it with Jordan's own unique stage personality. Jordan, remember, had been the male singer in a band whose female singer was Ella Fitzgerald. You don't keep a job like that very long if you're not good.\n\nNow, Jordan wasn't good in the same way as Ella was -- <em>no-one</em> was good in the same way as Ella Fitzgerald -- but what he was very good at was putting personality into his vocals. One thing we haven't talked much about yet in this series is the way that there was a whole tradition of jive singing which dates back at least to the 1920s and Cab Calloway:\n\n[excerpt from \"Reefer Man\"]\n\nJive singers weren't usually technically great, but they had <em>personality</em>. They were hip, and they often used made up words of their own. They were clever, and funny, and sophisticated, and they were often singing about the underworld or drug use or prostitution or other such disreputable concepts -- when they weren't just singing nonsense words like Slim Gaillard anyway.\n\n[Excerpt of \"Flat Foot Floogie\"]\n\nAnd Louis Jordan was very much in the mould of singers like Gaillard or Calloway or Fats Waller, all of whom we could easily do episodes on here if we were going far enough back into rock's prehistory. But Jordan is the way that that stream became part of the rhythm of rock music.\n\nMost of Jordan's songs were written by Jordan himself, although he's not the credited writer on many of them -- rather, his then-wife, Fleecie Moore, is credited for contractual reasons. Jordan and Moore later split up after multiple separate occasions where she stabbed him, but she retained credit on the songs. So, for example, she's credited on \"Caldonia\", which is a perfect example of Jordan's comedy jump band style.\n\n[Louis Jordan: Caldonia]\n\n\"Choo Choo Ch'Boogie,\" Jordan's biggest hit, was slightly different. From early 1943 -- just after Gabler started producing his records -- Jordan had been having occasional crossover hits on the country charts. These days, his music sounds to us clearly like it's blues or R&B -- in fact he's basically the archetype of a jump blues musician -- but remember how we've talked about Western Swing using so many swing and boogie elements? If you were making boogie music then, you were likely to appeal to the same audience that was listening to Bob Wills, just as much as you were to the audience that was listening to Big Joe Turner.\n\nAnd because of this crossover success, Jordan started recording occasional songs that were originally aimed at the white country market. \"Choo Choo Ch'Boogie\" was co-written by Gabler, but the other songwriters were pure country and western writers -- Denver Darling, one of the writers, was a hillbilly singer who recorded songs such as \"My Little Buckaroo\", \"I've Just Gotta Be A Cowboy\" and \"Ding Dong Polka\", while the other writer, Vaughn Horton, wrote \"Dixie Cannonball\" and \"Muleskinner Blues\".\n\nSo \"Choo Choo Ch' Boogie\" was, in conception, a hillbilly boogie, but in Louis Jordan's hands, it was almost the archetypal rhythm and blues song:\n\n[insert section of Choo Choo Ch'Boogie here]\n\nYou can hear from that how much it resembles the Bob Wills music we heard last week -- and how the song itself would fit absolutely into the genre of Western Swing. There's only really the lack of a fiddle or steel guitar to distinguish the styles. But you can also hear the horn-driven pulse, and the hip vocals, that characterise rhythm and blues. Those internal rhymes and slangy lyrics -- \"take me right back to the track, Jack\" -- come straight from the jive school of vocals, even though it's a country and western song.\n\nIf there's any truth at all to the claim that rock and roll was the mixing of country and western music with rhythm and blues, this is as good a point as any to say \"this is where rock and roll really started\". Essentially every musician in the early rock and roll period was, to a greater or lesser extent, copying the style of Louis Jordan's 1940s records. And indeed \"Choo Choo Ch' Boogie\" was later covered by another act Milt Gabler produced -- an act who, more than any other, based their style on Jordan's. But we'll come to Bill Haley and his Comets in a few episodes time.\n\nFor now, we want to listen to the way that jump band music sounds. This is not music that sounds like it's a small band. That sounds like a full horn section, but you'll notice that during the sax solo the other horns just punch in a little, rather than playing a full pad under it -- the arrangement is stripped back to the basics, to what's necessary. This is a punchy track, and it's a track that makes you want to dance.\n\n[sax solo excerpt]\n\nAnd this is music that, because it's so stripped down, relies on vocal personality more than other kinds. This is why Louis Jordan was able to make a success of this -- his jive singing style gives the music all the character that in the larger bands would be conveyed by other instruments.\n\nBut also, notice the lyrics -- \"the rhythm of the clickety clack\". It's that backbeat again, the one we've been talking about. And the lyrics here are all about that rhythm, but also about the rhythm of the steam trains.\n\nThat mechanical steam train rhythm is one of the key influences in blues, rhythm and blues, and rock and roll -- rock and roll started at almost exactly the point that America changed from being a train culture to being a car culture, and over the coming weeks we'll see that transition happen in the music. By the 1960s people would be singing \"Nobody cares about the railroads any more\" or about \"the last of the good old fashioned steam powered trains\", but in the 1940s and early fifties the train still meant freedom, still meant escape, and even once that had vanished from people's minds, it was still enshrined in the chug of the backbeat, in the choo choo ch'boogie.\n\nAnd so next week we'll be talking a lot more about the impact of trains in rock and roll, as we take our final look at the Carnegie Hall concerts of 1938…\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it,&nbsp;<a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "itunes:subtitle": "Welcome to episode four of&nbsp;A History of Rock Music in Five Hundred Songs. Today were looking at Louis Jordan and Choo Choo ChBoogie\n\n\n\nResources\n\nAs always, Ive created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in t",
  "itunes:keywords": "Benny Goodman,Bill Haley,Billie Holiday,Cab Calloway,Carnegie Hall,Chick Webb,Communist Party,Count Basie,Ella Fitzgerald,hillbilly boogie,Jesse Stone,John Hammond,jump bands,Lindy hop,Louis Jordan,Marx Brothers,Milt Gabler,riffs,Savoy Ballroom,swing",
  "itunes:episodeType": "full",
  "itunes:episode": 4,
  "content:encoded": "Welcome to episode four of&nbsp;<em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Louis Jordan and \"Choo Choo Ch'Boogie\"\n\n\n\n<strong>Resources</strong>\n\nAs always, I've created a&nbsp;<a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-4-choo-choo-chboogie/\">Mixcloud streaming playlist</a>&nbsp;with full versions of all the songs in the episode.\n\nLouis Jordan's music is now in the public domain, so there are many different compilations available, of different levels of quality. <a href=\"https://amzn.to/2CMn2FF\">This four-CD set</a> is very cheap and has most of the classic tracks on. And here's <a href=\"https://amzn.to/2CKQhc2\">a similarly-priced collection of Chick Webb</a>.\n\nThere aren't many books on Louis Jordan as an individual, and most of the information here comes from books on other musicians, but <a href=\"https://amzn.to/2zbmYMp\">this one</a> is probably worth your while if you want to investigate more.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book&nbsp;<a href=\"https://amzn.to/2OS4iaN\">\"Before Elvis\" by Larry Birnbaum.</a>\n\n<strong>Transcript</strong>\n\nWe've spent a lot of time in 1938 in this podcast, haven't we? First there was Flying Home, first recorded in 1939, but where we had to talk about events from 1938. Then we had \"Roll 'Em Pete\", recorded in 1938. And \"Ida Red\", recorded in 1938. 1938 is apparently the real year zero for rock and roll -- whether you come at it from the direction of blues and boogie, or jazz, or country and western music, 1938 ends up being the place where you start. Eighty years ago this year.\n\nAnd 1938 is also the year that one man made his solo debut, and basically put together all the pieces of rock and roll in one place.\n\nIf you've seen the Marx Brothers film <em>A Day At The Races</em> -- well, OK, if you've <em>not</em> seen <em>A Day At The Races</em>, you really should, because while it's not the best film the Marx Brothers ever made, it's still a good Marx Brothers film, and it'll brighten up your day immensely to watch it, so go and watch that, and then come back and listen to the rest of this. And if you haven't watched all their earlier films, watch those too. Except <em>The Cocoanuts</em>, you can skip that one. Go on. I can wait.\n\nOK, now you've definitely seen the Marx Brothers film <em>A Day At The Races</em>, so you'll remember the dance sequence where Ivie Anderson sings \"All God's Chillun Got Rhythm\", and the amazing dancers in that scene.\n\n[Ivy Anderson \"All God's Chillun Got Rhythm\"]\n\nThat's a dance called the Lindy Hop -- you might remember that as the dance the \"booglie wooglie piggy\" did in a song we excerpted in episode two, it was named after Charles Lindbergh, the famous airman and Nazi sympathiser -- and the people dancing it are Whitey's Lindy Hoppers. And they were responsible for a controversy, on the night of Benny Goodman's first Carnegie Hall concert -- the one we talked about in episode one -- that is still talked about in jazz eighty years later.\n\n[Chick Webb \"Stompin' At The Savoy\"]\n\nThat's \"Stompin' at the Savoy\" by Chick Webb, one of the most famous swing recordings ever, though it was later recorded by Benny Goodman in an even more fanmus version. The Savoy Ballroom was where Whitey's Lindy Hoppers used to dance -- there was an entire corner of the ballroom set off for them, even though the rest of the floor was for the other dancers. The Savoy was where the Lindy Hop was invented, and it was <em>the</em> place to dance, because it was where Chick Webb, the real king of swing played.\n\nWe've seen a few kings of swing so far -- Benny Goodman was the person most associated with the name, and he had the name longest. A few people called Bob Wills that, too, though he mostly billed himself as the king of <em>Western</em> swing. But Chick Webb was the person who deserved the title more than anyone else. He was a small man, who'd contracted tuberculosis of the spine as a child, and he'd taken up the drums as a kind of therapy. He'd been playing professionally since he was eleven, and by the time he was thirty he was leading what was, bar none, the best swing band in New York for dancing. People called him the King of Swing before Goodman, and his band was an absolute force of nature when it came to getting people to do the Lindy Hop. Benny Goodman admired Webb's band enough that he bought the band's arrangements and used them himself -- all of the Goodman band's biggest crowd-pleasers, at least the ones that weren't arrangements he'd bought off Fletcher Henderson, he bought from Edgar Sampson, the saxophone player who did most of Webb's arrangements. Sampson is the one who wrote \"Stompin' at the Savoy\", which we just heard.\n\nThere was a rivalry there -- Goodman's band was bigger in every sense, but Webb's band was more popular with those who knew the real deal when they heard it. And in 1937, the Savoy hosted a cutting contest between Webb's Savoy Orchestra and Goodman's band.\n\nA cutting contest was a tradition that came from the world of stride piano players -- the same world that boogie woogie music grew out of. One musician would play his best (and it usually was a \"his\" -- this was a very macho musical world) and then a second would try to top him -- playing something faster, or more inventive, or more exciting, often a reworking of the song the first one had played -- and then the first would take another turn and try to get better than the second had. They'd keep going, each trying to outdo the other, until a crowd decided that one or the other was the winner.\n\nAnd that 1937 cutting contest was a big event. The Savoy had two bandstands, so they would have one band start as soon as the other one finished, so people could dance all night. Chick Webb's band set up on one stage, Goodman's on another. Four thousand dancers crowded the inside of the ballroom, and despite a police cordon outside to keep trouble down, another five thousand people outside tried to hear what was happening.\n\nAnd Chick Webb's band won, absolutely. Gene Krupa, Goodman's drummer (one of the true greats of jazz drumming himself) later said \"I'll never forget that night. Webb cut me to ribbons!\"\n\nAnd that just was the most famous of many, many cutting contests that Chick Webb's band won. The only time Chick Webb ever definitely lost a cutting contest was against Duke Ellington, but everyone knew that Chick Webb and Duke Ellington weren't really trying to do the same kind of thing, and anyway, there's no shame at all in losing to Duke Ellington.\n\nCount Basie, though, was a different matter. He <em>was</em> trying to do the same kind of thing as Chick Webb, and he was doing it well. And on the night of Benny Goodman's Carnegie Hall concert, Webb and Basie were going to engage in their own cutting contest after hours. For all that the Goodman Carnegie Hall show was important -- and it was -- the real jazz fans knew that this after-show party was going to be the place to be. Basie had already played the Carnegie hHall show, guesting with Goodman's band, as had Basie's tenor sax player Lester Young, but here they were going to get to show off what they could do with their own band.\n\nBasie's band was on top form at that time, with his new vocalists Jimmy Rushing, a great blues shouter, and Billie Holiday, who was just then becoming a star. Chick Webb had a couple of good vocalists too, though -- his new teenage singer, Ella Fitzgerald, in particular, was already one of the great singers.\n\n[Chick Webb – Ella]\n\nAnd everyone was in the audience. Goodman's band, Mildred Bailey, Ivie Anderson (who we heard before in that Marx Brothers clip), Red Norvo the vibraphone player, Duke Ellington. Every musician who mattered in the jazz scene was there to see if Basie could beat Chick Webb.\n\nAnd… there was a dispute about it, one which was never really resolved in Webb's lifetime.\n\nBecause Webb won -- everyone agreed, when it came to a vote of the audience, Webb's band did win, though it was a fairly close decision. Again, the only band to ever beat Chick Webb was Duke Ellington.\n\nBut everyone also agreed that Basie's band had got people dancing more. A <em>lot</em> more.\n\nWhat nobody realised at the time was that Whitey's Lindy Hoppers had gone on strike. Chick Webb had misheard a discussion between a couple of the dancers about how good the Basie band was going to be that night, assumed that they were saying Basie was going to be better than him, and got into a huff. Webb said \"I don't give a good Goddam what those raggedy Lindy Hoppers think or say. Who needs 'em? As far as I'm concerned they can all go to hell. And their Mammies too.\"\n\nAfter this provocation, Whitey issued an ultimatum to his Lindy Hoppers. That night, they were only going to dance to Basie, and not to Webb. So even though most of the audience preferred Webb's band, every time they played a song all the best dancers, the ones who had an entire quarter or so of the ballroom to themselves to do their most exciting and visual dances, all sat down, and it looked like the Webb band just weren't exciting the crowd as much as the Basie band.\n\nOf course, the Basie band <em>were</em> good that night, as well. When you've got the 1938 Count Basie band, with Jimmy Rushing and Billie Holiday singing, you're going to get a good show. Oh, and they persuaded Duke Ellington to come up and play a piano solo -- and then all the band joined in with him, unrehearsed and unprompted.\n\nBut despite all that, Webb's band still beat them in the audience vote.\n\n<em>That's</em> how good Webb's band were, and it's also how good his two big stars were. One of those stars, Ella Fitzgerald, we've already mentioned, but the other one was an alto sax player who also took the male lead vocals – we heard him singing with Ella earlier. This sax player did a lot of the frontman job for Webb's band and was so important to the band in those years that, allegedly, some people thought <em>he</em> was Chick Webb. That man was Louis Jordan.\n\n[Chick Webb I Can't Dance I Got Ants In My Pants]\n\nLouis Jordan was a good sax player, but what he really was was a <em>performer</em>. He was someone who could absolutely sell a song, with wit and humour and a general sense of hipness that could possibly be matched at that time only by Cab Calloway and Slim Gaillard, and Jordan was a better musician than either of them. He was charming, and funny, and tuneful, and good looking, and he knew it.\n\nHe knew it so well, in fact, that shortly after that show, he started making plans -- he thought that he and Ella were the two important ones in the Webb band, and he planned to form his own band, and take her, and much of the rest of the band with him. Webb found out and fired Jordan, and Ella and most of the band remained loyal to Webb.\n\nIn fact, sadly, Jordan would have had what he wanted sooner rather than later anyway. Chick Webb's disability had been affecting him more, and he was only continuing to perform because he felt he owed it to his musicians -- he would often pass out after a show, literally unable to do anything else. He died, aged thirty-four, in June 1939, and Ella Fitzgerald became the leader of his band, though like many big bands it eventually broke up in the mid-forties.\n\nSo if Jordan had held on for another few months, he would have had a good chance at being the leader of the Louis Jordan and Ella Fitzgerald band, and history would have been very different. As it was, instead, he formed a much smaller group, the Elks Rendez-vous Band, made up of members of Jesse Stone's band (you'll remember him from episode two, he wrote \"Shake, Rattle, and Roll\"). And on December 20, 1938 -- ten days before \"Roll 'Em Pete\" -- Louis Jordan and his Elks Rendez-vous Band went into the studio for the first time, to record \"Honey in the Bee Ball\" and \"Barnacle Bill the Sailor\".\n\n[excerpt of \"Honey in the Bee Ball\"]\n\nShortly after that, they changed their name to Louis Jordan and his Tympany Five.\n\nBefore we talk about them more, I want to briefly talk about someone else who worked with Jordan. I want to talk about Milt Gabler. Gabler is someone we'll be seeing a lot of in this story, and he's someone who already had an influence on it, but here's where he becomes important.\n\nYou see, even before his influence on rock and roll, Gabler had made one important contribution to music. He had started out as the owner of a little record shop, and he had a massive passion for good jazz music -- and so did his customers. And many of those customers had wanted to get hold of old records, now out of print. So in 1935 Gabler started his own record label, and licensed those out of print recordings by people like Bix Beiderbecke and Bessie Smith, becoming the owner of the very first ever reissue record label. His labels pioneered things like putting a full list of all the musicians on a record on the label -- the kind of thing that real music obsessives cared far more about than executives who only wanted to make money.\n\nAfter he had some success with that, he branched out into making new records, on a new label, Commodore. That would have stayed a minor label, but for one thing.\n\nIn 1939, one of his regular customers, Billie Holiday, had a problem. She'd been performing a new song which she really wanted to record, but her current label, Columbia, wasn't interested. That song was too political even for her producer, John Hammond -- the man who, you will remember from previous episodes, persuaded Benny Goodman to integrate his band and who put on shows that same year sponsored by the Communist Party. But the song was too political, and too inflammatory, even for him. The song, which became Billie Holiday's best-known performance, was \"Strange Fruit\", and it was about lynching.\n\n[insert section of Strange Fruit here].\n\nBillie Holiday could not get her label to put that track out, under any circumstances. But she knew Milt Gabler might do it -- he'd been recording several small group tracks with Lester Young, who was Holiday's colleague and friend in the Basie band. As Gabler was a friend of hers, and as he was politically left-leaning himself, he eventually negotiated a special deal with Columbia, Holiday's label, that he could produce her for one session and put out a single recording by her, on Commodore.\n\nThat recording sold over a million copies, and became arguably the most important recording in music history. In December 1999, Time Magazine called it the \"song of the century\". And in 2017, when the black singer Rebecca Ferguson was invited to play at Donald Trump's inauguration, she agreed on one condition -- that the song she performed could be \"Strange Fruit\". She was disinvited.\n\nAs a result of \"Strange Fruit\"'s success, Milt Gabler was headhunted away from his own label, and became a staff producer at Decca records in 1941. There he was responsible for producing many of the greatest records of the forties -- not least that famous Lionel Hampton version of \"Flying Home\" we looked at towards the end of episode one -- and he began a long collaboration with Louis Jordan -- remember him? This is a story about Louis Jordan.\n\nJordan's new band had a sound unlike anything else of the time -- Clarence \"Gatemouth\" Brown later claimed that Jordan had most of the responsibility for the decline of the big bands, saying \"He could play just as good and just as loud with five as 17. And it was cheaper.\"\n\nAnd while we've talked before about a whole raft of economic and social reasons for the decline of the big bands, there was a lot of truth in that statement -- while there were sometimes actually as many as seven or eight members of the Tympany Five, the original lineup was just Jordan plus one trumpet, one sax, piano, bass, and drums, and yet their recordings did sound almost as full as many of the bigger bands.\n\nThe style they were playing in was a style that later became known as \"jump band\" music, and it was a style that owed a lot to Lionel Hampton's band, and to Count Basie. This is a style of music that's based on simple chord changes -- usually blues changes. And it's based on the concept of the riff.\n\nWe haven't really talked much about the idea of riffs yet in this series, but they're absolutely crucial to almost all popular music from the twentieth century. A riff is, in its conception, fairly straight forward. It's an instrumental phrase that gets repeated over and over. It can act as the backbone to a song, but it can also be the basis for variation and improvisation -- when you \"riff on\" something, you're coming up with endless variations and permutations of it.\n\nRiffs were important in swing music -- generally they were a sort of back-and-forth in those. You'd have the saxophones play the riff, and then the trumpets and trombones repeat it after them. But swing wasn't just about riffs -- with a big orchestra, you had to have layers and stuff for all the musicians to do.\n\nIn jump band music, on the other hand, you strip everything back. The track becomes about the riff, the solos, and the vocal if there is one, and that's it. You play that riff over the simplest possible changes, you play it to a rhythm that will get everyone dancing -- often a boogie rhythm -- and you make everything about the energy of the performance.\n\nJordan's band did that, and they combined it with Jordan's own unique stage personality. Jordan, remember, had been the male singer in a band whose female singer was Ella Fitzgerald. You don't keep a job like that very long if you're not good.\n\nNow, Jordan wasn't good in the same way as Ella was -- <em>no-one</em> was good in the same way as Ella Fitzgerald -- but what he was very good at was putting personality into his vocals. One thing we haven't talked much about yet in this series is the way that there was a whole tradition of jive singing which dates back at least to the 1920s and Cab Calloway:\n\n[excerpt from \"Reefer Man\"]\n\nJive singers weren't usually technically great, but they had <em>personality</em>. They were hip, and they often used made up words of their own. They were clever, and funny, and sophisticated, and they were often singing about the underworld or drug use or prostitution or other such disreputable concepts -- when they weren't just singing nonsense words like Slim Gaillard anyway.\n\n[Excerpt of \"Flat Foot Floogie\"]\n\nAnd Louis Jordan was very much in the mould of singers like Gaillard or Calloway or Fats Waller, all of whom we could easily do episodes on here if we were going far enough back into rock's prehistory. But Jordan is the way that that stream became part of the rhythm of rock music.\n\nMost of Jordan's songs were written by Jordan himself, although he's not the credited writer on many of them -- rather, his then-wife, Fleecie Moore, is credited for contractual reasons. Jordan and Moore later split up after multiple separate occasions where she stabbed him, but she retained credit on the songs. So, for example, she's credited on \"Caldonia\", which is a perfect example of Jordan's comedy jump band style.\n\n[Louis Jordan: Caldonia]\n\n\"Choo Choo Ch'Boogie,\" Jordan's biggest hit, was slightly different. From early 1943 -- just after Gabler started producing his records -- Jordan had been having occasional crossover hits on the country charts. These days, his music sounds to us clearly like it's blues or R&B -- in fact he's basically the archetype of a jump blues musician -- but remember how we've talked about Western Swing using so many swing and boogie elements? If you were making boogie music then, you were likely to appeal to the same audience that was listening to Bob Wills, just as much as you were to the audience that was listening to Big Joe Turner.\n\nAnd because of this crossover success, Jordan started recording occasional songs that were originally aimed at the white country market. \"Choo Choo Ch'Boogie\" was co-written by Gabler, but the other songwriters were pure country and western writers -- Denver Darling, one of the writers, was a hillbilly singer who recorded songs such as \"My Little Buckaroo\", \"I've Just Gotta Be A Cowboy\" and \"Ding Dong Polka\", while the other writer, Vaughn Horton, wrote \"Dixie Cannonball\" and \"Muleskinner Blues\".\n\nSo \"Choo Choo Ch' Boogie\" was, in conception, a hillbilly boogie, but in Louis Jordan's hands, it was almost the archetypal rhythm and blues song:\n\n[insert section of Choo Choo Ch'Boogie here]\n\nYou can hear from that how much it resembles the Bob Wills music we heard last week -- and how the song itself would fit absolutely into the genre of Western Swing. There's only really the lack of a fiddle or steel guitar to distinguish the styles. But you can also hear the horn-driven pulse, and the hip vocals, that characterise rhythm and blues. Those internal rhymes and slangy lyrics -- \"take me right back to the track, Jack\" -- come straight from the jive school of vocals, even though it's a country and western song.\n\nIf there's any truth at all to the claim that rock and roll was the mixing of country and western music with rhythm and blues, this is as good a point as any to say \"this is where rock and roll really started\". Essentially every musician in the early rock and roll period was, to a greater or lesser extent, copying the style of Louis Jordan's 1940s records. And indeed \"Choo Choo Ch' Boogie\" was later covered by another act Milt Gabler produced -- an act who, more than any other, based their style on Jordan's. But we'll come to Bill Haley and his Comets in a few episodes time.\n\nFor now, we want to listen to the way that jump band music sounds. This is not music that sounds like it's a small band. That sounds like a full horn section, but you'll notice that during the sax solo the other horns just punch in a little, rather than playing a full pad under it -- the arrangement is stripped back to the basics, to what's necessary. This is a punchy track, and it's a track that makes you want to dance.\n\n[sax solo excerpt]\n\nAnd this is music that, because it's so stripped down, relies on vocal personality more than other kinds. This is why Louis Jordan was able to make a success of this -- his jive singing style gives the music all the character that in the larger bands would be conveyed by other instruments.\n\nBut also, notice the lyrics -- \"the rhythm of the clickety clack\". It's that backbeat again, the one we've been talking about. And the lyrics here are all about that rhythm, but also about the rhythm of the steam trains.\n\nThat mechanical steam train rhythm is one of the key influences in blues, rhythm and blues, and rock and roll -- rock and roll started at almost exactly the point that America changed from being a train culture to being a car culture, and over the coming weeks we'll see that transition happen in the music. By the 1960s people would be singing \"Nobody cares about the railroads any more\" or about \"the last of the good old fashioned steam powered trains\", but in the 1940s and early fifties the train still meant freedom, still meant escape, and even once that had vanished from people's minds, it was still enshrined in the chug of the backbeat, in the choo choo ch'boogie.\n\nAnd so next week we'll be talking a lot more about the impact of trains in rock and roll, as we take our final look at the Carnegie Hall concerts of 1938…\n\n<strong>Patreon</strong>\nAs always, this podcast only exists because of the donations of my backers on Patreon. If you enjoy it,&nbsp;<a href=\"http://patreon.com/andrewhickey\">why not join them</a>?",
  "enclosure": "",
  "itunes:summary": "Welcome to episode four of&nbsp;A History of Rock Music in Five Hundred Songs. Today we're looking at Louis Jordan and \"Choo Choo Ch'Boogie\"\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nLouis Jordan's music is now in the public domain, so there are many different compilations available, of different levels of quality. This four-CD set is very cheap and has most of the classic tracks on. And here's a similarly-priced collection of Chick Webb.\n\nThere aren't many books on Louis Jordan as an individual, and most of the information here comes from books on other musicians, but this one is probably worth your while if you want to investigate more.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book&nbsp;\"Before Elvis\" by Larry Birnbaum.\n\nTranscript\n\nWe've spent a lot of time in 1938 in this podcast, haven't we? First there was Flying Home, first recorded in 1939, but where we had to talk about events from 1938. Then we had \"Roll 'Em Pete\", recorded in 1938. And \"Ida Red\", recorded in 1938. 1938 is apparently the real year zero for rock and roll -- whether you come at it from the direction of blues and boogie, or jazz, or country and western music, 1938 ends up being the place where you start. Eighty years ago this year.\n\nAnd 1938 is also the year that one man made his solo debut, and basically put together all the pieces of rock and roll in one place.\n\nIf you've seen the Marx Brothers film A Day At The Races -- well, OK, if you've not seen A Day At The Races, you really should, because while it's not the best film the Marx Brothers ever made, it's still a good Marx Brothers film, and it'll brighten up your day immensely to watch it, so go and watch that, and then come back and listen to the rest of this. And if you haven't watched all their earlier films, watch those too. Except The Cocoanuts, you can skip that one. Go on. I can wait.\n\nOK, now you've definitely seen the Marx Brothers film A Day At The Races, so you'll remember the dance sequence where Ivie Anderson sings \"All God's Chillun Got Rhythm\", and the amazing dancers in that scene.\n\n[Ivy Anderson \"All God's Chillun Got Rhythm\"]\n\nThat's a dance called the Lindy Hop -- you might remember that as the dance the \"booglie wooglie piggy\" did in a song we excerpted in episode two, it was named after Charles Lindbergh, the famous airman and Nazi sympathiser -- and the people dancing it are Whitey's Lindy Hoppers. And they were responsible for a controversy, on the night of Benny Goodman's first Carnegie Hall concert -- the one we talked about in episode one -- that is still talked about in jazz eighty years later.\n\n[Chick Webb \"Stompin' At The Savoy\"]\n\nThat's \"Stompin' at the Savoy\" by Chick Webb, one of the most famous swing recordings ever, though it was later recorded by Benny Goodman in an even more fanmus version. The Savoy Ballroom was where Whitey's Lindy Hoppers used to dance -- there was an entire corner of the ballroom set off for them, even though the rest of the floor was for the other dancers. The Savoy was where the Lindy Hop was invented, and it was the place to dance, because it was where Chick Webb, the real king of swing played.\n\nWe've seen a few kings of swing so far -- Benny Goodman was the person most associated with the name, and he had the name longest. A few people called Bob Wills that, too, though he mostly billed himself as the king of Western swing. But Chick Webb was the person who deserved the title more than anyone else. He was a small man, who'd contracted tuberculosis of the spine as a child, and he'd taken up the drums as a kind of therapy. He'd been playing professionally since he was eleven, and by the time he was thirty he was leading what was, bar none, the best swing band in New York for dancing. People called him the King of Swing before Goodman, and his band was an absolute force of nature when it came to getting people to do the ",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode four of&nbsp;A History of Rock Music in Five Hundred Songs. Today we're looking at Louis Jordan and \"Choo Choo Ch'Boogie\"\n\n\n\nResources\n\nAs always, I've created a&nbsp;Mixcloud streaming playlist&nbsp;with full versions of all the songs in the episode.\n\nLouis Jordan's music is now in the public domain, so there are many different compilations available, of different levels of quality. This four-CD set is very cheap and has most of the classic tracks on. And here's a similarly-priced collection of Chick Webb.\n\nThere aren't many books on Louis Jordan as an individual, and most of the information here comes from books on other musicians, but this one is probably worth your while if you want to investigate more.\n\nAnd for all the episodes on pre-1954 music, one invaluable source is the book&nbsp;\"Before Elvis\" by Larry Birnbaum.\n\nTranscript\n\nWe've spent a lot of time in 1938 in this podcast, haven't we? First there was Flying Home, first recorded in 1939, but where we had",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}