{
  "title": "Bing Releases Intelligent Question-Answering Feature to 100+ Languages ",
  "link": "https://blogs.bing.com/search-quality-insights/october-2020/Bing-Releases-Intelligent-Question-Answering-Feature-to-100-Languages",
  "pubDate": "Thu, 01 Oct 2020 09:00:05 -0700",
  "dc:creator": "Bing Team",
  "category": [
    "AI",
    "artificial intelligence",
    "Bing",
    "cross-lingual model",
    "deep learning",
    "multi-lingual",
    "question answering",
    "universalization"
  ],
  "guid": "860038c5-a822-4fc3-8ab0-56cfb208e463",
  "description": "Intelligent question-answering is one of the most useful and delightful features of search. As a user, you ask a question (e.g., &ldquo;<a href=\"https://www.bing.com/search?q=what+are+the+benefits+of+eating+apricots&go=Search&qs=ds&form=QBRE&mkt=en-us\" target=\"_blank\">what are the benefits of eating apricots</a>&rdquo;) and can get the answer directly (e.g., info about health and nutrition benefits of apricots) at the top of the page without further need to search for relevant content by yourself. Recently, Bing expanded its intelligent question-answering feature to more than 100 languages, making AI and Bing itself more inclusive and accessible. What is amazing is this is achieved by using a language agnostic approach. In other words, the AI model generating the intelligent question-answering in Urdu is the same one generating the intelligent question-answering in Romanian.&nbsp;",
  "content:encoded": "Intelligent question-answering is one of the most useful and delightful features of search. As a user, you ask a question (e.g., &ldquo;<a href=\"https://www.bing.com/search?q=what+are+the+benefits+of+eating+apricots&go=Search&qs=ds&form=QBRE&mkt=en-us\" target=\"_blank\">what are the benefits of eating apricots</a>&rdquo;) and can get the answer directly (e.g., info about health and nutrition benefits of apricots) at the top of the page without further need to search for relevant content by yourself. The feature aims to direct users to the most concise and precise answers from web documents, thus saving users time and efforts.&nbsp;&nbsp;<br />\n<br />\nEnglish-language question answering from web has been enabled on Bing for several years, and another dozen of languages, like French and German, have been added within the last year. But our work isn&rsquo;t done - there are thousands of languages in the world! Not all of them have rich enough web content to derive good answers, but for those that do, uses of those spoken languages deserve the same useful, delightful, time-saving experience.<br />\n<br />\nRecently, Bing expanded its intelligent question-answering feature to more than 100 languages, making AI and Bing itself more inclusive and accessible. What is amazing is this is achieved by using a language agnostic approach. In other words, the AI model generating the intelligent question-answering in Urdu is the same one generating the intelligent question-answering in Romanian.&nbsp; Here are some examples of this experience in various languages (if you speak a language other than English, feel free to give it a try, but be reminded to <a href=\"https://www.wikihow.com/Change-Your-Browser%27s-Language\" target=\"_blank\">set your browser to the relevant language</a>):<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/Picture3.gif\" /><br />\n<br />\nHere are search results in different languages for &ldquo;what are the benefits of eating apricots&rdquo;:<br />\nExample 1 &ndash; { <a href=\"https://www.bing.com/search?q=what+are+the+benefits+of+eating+apricots&go=Search&qs=ds&form=QBRE&mkt=en-us\" target=\"_blank\">what are the benefits of eating apricots</a> }<br />\nExample 2 &ndash; { <a href=\"https://www.bing.com/search?q=hva%20er%20fordelene%20med%20%C3%A5%20spise%20aprikoser&mkt=nb-no\" target=\"_blank\">hva er fordelene med å spise aprikoser</a> }<br />\nExample 3 &ndash; { <a href=\"https://www.bing.com/search?q=%D0%BA%D0%B0%D0%BA%D0%B8%D0%B5%20%D0%B2%D0%B8%D1%82%D0%B0%D0%BC%D0%B8%D0%BD%D1%8B%20%D0%B5%D1%81%D1%82%D1%8C%20%D0%B2%20%D0%B0%D0%B1%D1%80%D0%B8%D0%BA%D0%BE%D1%81%D0%B5&mkt=ru-ru\" target=\"_blank\">какие витамины есть в абрикосе</a> }<br />\nExample 4 &ndash; { <a href=\"https://www.bing.com/search?q=kay%C4%B1s%C4%B1+yemenin+faydalar%C4%B1+nelerdir&go=Search&qs=ds&form=QBRE&mkt=tr-tr\" target=\"_blank\">kayısı yemenin faydaları nelerdir</a> }<br />\nExample 5 &ndash; { <a href=\"https://www.bing.com/search?q=%D8%AE%D9%88%D8%A8%D8%A7%D9%86%DB%8C%20%DA%A9%DA%BE%D8%A7%D9%86%DB%92%20%DA%A9%DB%92%20%DA%A9%DB%8C%D8%A7%20%D9%81%D9%88%D8%A7%D8%A6%D8%AF%20%DB%81%DB%8C%DA%BA%D8%9F&mkt=fr-fr\" target=\"_blank\">خوبانی کھانے کے کیا فوائد ہیں؟</a> }<br />\nExample 6 &ndash; { <a href=\"https://www.bing.com/search?q=%E0%B0%A8%E0%B1%87%E0%B0%B0%E0%B1%87%E0%B0%A1%E0%B1%81%20%E0%B0%AA%E0%B0%82%E0%B0%A1%E0%B1%81%20%E0%B0%A4%E0%B0%BF%E0%B0%A8%E0%B0%A1%E0%B0%82%20%E0%B0%B5%E0%B0%B2%E0%B1%8D%E0%B0%B2%20%E0%B0%95%E0%B0%B2%E0%B0%BF%E0%B0%97%E0%B1%87%20%E0%B0%AA%E0%B1%8D%E0%B0%B0%E0%B0%AF%E0%B1%8B%E0%B0%9C%E0%B0%A8%E0%B0%BE%E0%B0%B2%E0%B1%81%20%E0%B0%8F%E0%B0%AE%E0%B0%BF%E0%B0%9F%E0%B0%BF&mkt=fr-fr\" target=\"_blank\">నేరేడు పండు తినడం వల్ల కలిగే ప్రయోజనాలు ఏమిటి</a> }<br />\n&nbsp;<br />\nThe magic behind this language agnostic experience is the advanced universal deep pretrained models for natural language understanding and the combination of real-time and near real-time GPU model inference to scale question-answering to markets all around the world.<br />\n&nbsp;\n<h4>Universal Deep Models for 100+ Languages</h4>\n<br />\nRecently, multilingual pre-trained models such as <a href=\"https://github.com/google-research/bert/blob/master/multilingual.md\" target=\"_blank\">M-BERT</a>, <a href=\"https://www.microsoft.com/en-us/research/publication/unicoder-a-universal-language-encoder-by-pre-training-with-multiple-cross-lingual-tasks/\" target=\"_blank\">Unicoder</a>, <a href=\"https://arxiv.org/pdf/1911.02116\" target=\"_blank\">XLM-Roberta</a> and Turing Universal Language Representation model (powered by Microsoft latest cross-lingual innovation <a href=\"https://arxiv.org/pdf/2007.07834\" target=\"_blank\">InfoXLM</a>) have been developed to learn multilingual language representations by leveraging large-scale multilingual corpuses for cross-lingual pre-training. Those powerful multilingual models are capable of zero-shot or few-shot cross-lingual transferring capabilities. However, when shipping the models to 100 languages, the performance on low resource languages may still have a big gap with rich resource languages (such as English). To further close the gap, a series of cross-lingual techniques have been developed such as task/domain adaption, user feedback-based question answering, data augmentation, etc. Powered by these SOTA cross lingual technologies, our question answering system becomes truly language agnostic.<br />\n&nbsp;\n<h4>Serving Universal Models at Scale&nbsp;&nbsp;</h4>\n<br />\nUniversal models are difficult to serve at web search scale because common approaches to reduce model complexity like distillation can lead to lower quality results. This is especially problematic for question-answering where precision is essential to ensure a positive user experience. However, without reducing model complexity, real-time model inference can take longer than would be acceptable for search engines where users expect fast results.<br />\n<br />\nTo address this serving challenge, we augmented our existing real-time question-answering models with a near real-time inference system. This system efficiently runs sophisticated universal models that would typically be too slow for users to generate high quality answers. These answers will be immediately available the next time a similar question is asked.&nbsp; By combining both instantaneous and near real-time model inference, we&rsquo;re able to provide more users with direct answers to their questions in the languages they speak.&nbsp;<br />\n&nbsp;\n<h4>Summary</h4>\n<br />\nWe successfully scaled Bing intelligent question-answering feature to over 100 languages and 200 regions in the world. Existing language understanding techniques and platform evolution have made a big break-through for more natural and language agnostic searching experience. We do believe there is still space to continue to improve answers to users&rsquo; questions, so stay tuned as there is more innovation to come.<br />\n<br />\nBeyond question-answering, Bing and Microsoft researchers released <a href=\"https://www.microsoft.com/en-us/research/blog/xglue-expanding-cross-lingual-understanding-and-generation-with-tasks-from-real-world-scenarios/\" target=\"_blank\">XGLUE</a> cross lingual benchmark, which aims to help the research community further advance language-agnostic models and make AI systems more inclusive.<br />\n<br />\nPlease give Bing intelligent question-answering a try with your language and region setting. We would love to hear your feedback or suggestions! You can give feedback by using either the thumbs up/down button below the answers or the feedback button in the bottom right corner of the search results page.<br />\n<br />\n<img alt=\"\" src=\"https://blogs.bing.com/BingBlogs/media/SearchQualityInsights/2020/Picture4.png\" /><br />\n&nbsp;"
}