{
  "title": "Cooperative Motions and Topology-Driven Dynamical Arrest in Prime Knots. (arXiv:2211.01605v1 [cond-mat.soft])",
  "link": "http://arxiv.org/abs/2211.01605",
  "description": "<p>Knots are entangled structures that cannot be untangled without a cut.\nTopological stability of knots is one of the many examples of their important\nproperties that can be used in information storage and transfer. Knot dynamics\nis important for understanding general principles of entanglement as knots\nprovide an isolated system where tangles are highly controlled and easily\nmanipulated. To unravel the dynamics of these entangled topological objects,\nthe first step is to identify the dominant motions that are uniquely guided by\nknot structure and its complexity. We identify and classify motions into three\nmain groups -- orthogonal, aligned, and mixed motions, which often act in\nunison, orchestrating the complex dynamics of knots. The balance between these\nmotions is what creates an identifiable signature for every knot. As knot\ncomplexity increases, the carefully orchestrated dynamics is gradually\nsilenced, eventually reaching a state of topologically driven dynamical arrest.\nDepending on their complexity, knots undergo a transition from nearly\nstochastic motions to either non-random or even quasiperiodic dynamics before\nculminating in dynamical arrest. Here, we show for the first time that\nconnectivity alone can lead to a topology-driven dynamical arrest in knots of\nhigh complexity. Unexpectedly, we noticed that some knots undergo cooperative\nmotions as they reach higher complexity, uniquely modulating conformational\npatterns of a given knot. Together, these findings demonstrate a link between\ntopology and dynamics, presenting applications to nanoscale materials.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Park_H/0/1/0/all/0/1\">Hyo Jung Park</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Lappala_A/0/1/0/all/0/1\">Anna Lappala</a>"
}