{
  "title": "Demographics of the M-star Multiple Population in the Orion Nebula Cluster. (arXiv:2211.01897v1 [astro-ph.GA])",
  "link": "http://arxiv.org/abs/2211.01897",
  "description": "<p>We present updated results constraining multiplicity demographics for the\nstellar population of the Orion Nebula Cluster (ONC, a high-mass, high-density\nstar-forming region), across primary masses 0.08-0.7M$_{\\odot}$. Our study\nutilizes archival Hubble Space Telescope data obtained with the Advanced Camera\nfor Surveys using multiple filters (GO-10246). Previous multiplicity surveys in\nlow-mass, low-density associations like Taurus identify an excess of companions\nto low-mass stars roughly twice that of the Galactic field and find the mass\nratio distribution consistent with the field. Previously, we found the\ncompanion frequency to low-mass stars in the ONC is consistent with the\nGalactic field over mass ratios=0.6-1.0 and projected separations=30-160au,\nwithout placing constraints on the mass ratio distribution. In this study, we\ninvestigate the companion population of the ONC with a double point-spread\nfunction (PSF) fitting algorithm sensitive to separations larger than 10au\n(0.025\") using empirical PSF models. We identified 44 companions (14 new), and\nwith a Bayesian analysis, estimate the companion frequency to low-mass stars in\nthe ONC =0.13$^{+0.05}_{-0.03}$ and the power law fit index to the mass ratio\ndistribution =2.08$^{+1.03}_{-0.85}$ over all mass ratios and projected\nseparations of 10-200au. We find the companion frequency in the ONC is\nconsistent with the Galactic field population, likely from high transient\nstellar density states, and a probability of 0.002 that it is consistent with\nthat of Taurus. We also find the ONC mass ratio distribution is consistent with\nthe field and Taurus, potentially indicative of its primordial nature, a direct\noutcome of the star formation process.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/astro-ph/1/au:+Furio_M/0/1/0/all/0/1\">Matthew De Furio</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Liu_C/0/1/0/all/0/1\">Christopher Liu</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Meyer_M/0/1/0/all/0/1\">Michael R. Meyer</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Reiter_M/0/1/0/all/0/1\">Megan Reiter</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Kraus_A/0/1/0/all/0/1\">Adam Kraus</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Dupuy_T/0/1/0/all/0/1\">Trent Dupuy</a>, <a href=\"http://arxiv.org/find/astro-ph/1/au:+Monnier_J/0/1/0/all/0/1\">John Monnier</a>"
}