{
  "title": "548: Will There Ever Be Another Harry Potter-Level Book Series?",
  "link": "https://audioboom.com/posts/8022345",
  "itunes:episode": 548,
  "itunes:title": "Will There Ever Be Another Harry Potter-Level Book Series?",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4714,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>After the <em>Potter</em> series proved to be successful, there was the <em>Twilight Series</em>. Next came <em>The Hunger Games</em>. And then came <em>Divergent</em>! Each series was marketed as \"the NEXT <em>Harry Potter</em>.\" But, they weren't really as successful as <em>Harry Potter</em> at all! On this special episode of MuggleCast, the hosts dive deep into what makes the tale of a boy wizard so enduring, and how the other series just didn't measure up in terms of financial success OR staying-power. We also compare HP to <em>Star Wars</em> and discuss what the two series have in common. It's another great episode this week, be sure to listen at your leisure!<br>\n<br>\n\n</div>\n<ul>\n<li>MuggleCast is <a href=\"https://www.tiktok.com/@mugglecast\">now on TikTok</a> with the username @MuggleCast! Be sure to follow us there and enjoy all the fun content we've got coming.</li>\n<li>This week's Main Discussion: Why the so-called \"Next Harry Potter\" hasn't happened yet.</li>\n<li>Andrew, Eric, Laura and Micah discuss what made <em>Harry Potter</em> so special. From the story beats to the complexity of the mystery, we dive deep into what we love and what inevitably translated to the publishers' bottom line.</li>\n<li>Strong themes in the HP series? We think we spot a few that hit home! And being rewarded for catching references and foreshadowing really felt like a present to us as readers.</li>\n<li>HP fans were <strong>feverish</strong> for new Harry! That's just something that cannot be said about some other series.</li>\n<li>The hosts talk <em>Twilight</em> by Stephenie Meyer. Andrew and Laura even had a <a href=\"https://www.digitalpodcast.com/feeds/27197-imprint-the-twilight-podcast\">Twilight podcast</a> back in the day!</li>\n<li>Were <em>The Hunger Games</em> and the <em>Divergent</em> series simply too dystopian for readers to love?</li>\n<li>Another example of a franchise that may live forever is <em>Star Wars</em>. What do that and HP have in common from a storytelling perspective?</li>\n<li>Did <em>Star Wars'</em> opening up its canon to multiple creators allow it to flourish, and what lessons can Warner Bros. learn there regarding HP?</li>\n<li>The hosts compare the success of the Marvel Cinematic Universe and wonder aloud if \"the next <em>Harry Potter</em>\" will even be a book at all.</li>\n<li>Finally, are older Millennials going to be the ones to spot the next HP, or will the younger generation determine what the next candidate is?</li>\n<li>Quizzitch: In <em>Divergent</em>, the hero Tris is eligible to join 3 factions. Which faction does she join, and for bonus points, what are the 3 she has to choose from?  <a href=\"https://mugglecast.com/quizzitch/\">Submit your answer</a>! </li>\n<li>This week's episode is sponsored by BetterHelp (Go to <a href=\"http://www.betterhelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off your first month) and HelloFresh (Get up to 16 free meals by going to <a href=\"http://www.HelloFresh.com/muggle16\">HelloFresh.com/muggle16</a> and using code muggle16)</li>\n</ul>\n",
  "pubDate": "Tue, 01 Feb 2022 10:00:00 +0000",
  "guid": "tag:audioboom.com,2022-01-31:/posts/8022345",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}