{
  "title": "Saved by the Cell: How South Africa Is Bridging the Digital Divide",
  "link": "https://www.aei.org/technology-and-innovation/saved-by-the-cell-how-south-africa-is-bridging-the-digital-divide/",
  "dc:creator": "Matthew Glavish",
  "pubDate": "Thu, 27 Oct 2022 10:00:00 +0000",
  "category": [
    "Technology and Innovation",
    "Telecommunications",
    "broadband",
    "consumers",
    "internet",
    "Regulation",
    "South Africa",
    "subsidies",
    "Telecommunications regulatory policy"
  ],
  "guid": "https://www.aei.org/?p=1008663759",
  "description": "<p>As the United States contemplates the distribution of $65 billion of federal funding to address broadband access and usage divides, let’s take some time to consider what is occurring in South Africa to address the same questions and how that might inform US policy and regulation. South Africa demonstrates some of the broadest economic, social, [&#8230;]</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/saved-by-the-cell-how-south-africa-is-bridging-the-digital-divide/\">Saved by the Cell: How South Africa Is Bridging the Digital Divide</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n",
  "content:encoded": "\n<p>As the United States contemplates the <a href=\"https://www.congress.gov/bill/117th-congress/house-bill/3684/text\" target=\"_blank\" rel=\"noreferrer noopener\">distribution</a> of $65 billion of federal funding to address broadband access and usage divides, let’s take some time to consider what is occurring in South Africa to address the same questions and how that might inform US policy and regulation.</p>\n\n\n\n<p>South Africa demonstrates some of the broadest economic, social, and broadband divides in the world. The millions living in cosmopolitan cities such as Cape Town, Johannesburg, and Pretoria lead very different lives than those living in abject poverty in urban townships like Khayelitsha and rural enclaves like Phuthaditjhaba or Bushbuckridge. Yet this diversity has proved a boon for mobile-phone product variety.</p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" width=\"4608\" height=\"3456\" src=\"https://www.aei.org/wp-content/uploads/2022/10/Cellphone-Bill-Stock-Photo.jpeg?x91208\" alt=\"\" class=\"wp-image-1008663760\"/><figcaption>via Adobe open commons</figcaption></figure>\n\n\n\n<p>South Africa is a world leader in the <a href=\"https://www.statista.com/statistics/1074422/prepaid-vs-post-paid-mobile-cellular-voice-subscriptions-in-south-africa/\" target=\"_blank\" rel=\"noreferrer noopener\">provision of prepaid cellular subscriptions</a>—having first brought them to market before other countries. These connections amounted in 2021 to over 84 percent of more <a href=\"https://prepaid-data-sim-card.fandom.com/wiki/South_Africa\" target=\"_blank\" rel=\"noreferrer noopener\">than 90 million connections</a>. Prepaid subscriptions offer significant flexibility for consumers with constrained and irregular incomes—in the same way as coin-in-the-slot electricity meters were commonly used in low-income areas in the pre-Thatcher United Kingdom. Freedom from restrictive contract terms allows consumers to purchase voice minutes and data when needed and without penalty. </p>\n\n\n\n<p>Furthermore, data is sold by the three main network operators in a huge variety of bundles, both in terms of volume and time. Packages range from 25 megabytes to 100 gigabytes and beyond. Data can be bought for use within the hour, one day (up to midnight), week, month, 90 days, six months, a year, or even longer. At least one operator offers night packages, valid from 1:00–7:00 a.m., at significant discounts compared to all-day data, allowing consumers to take advantage of otherwise idle off-peak capacity. Unused data can often be rolled over or passed to another account on the same network. To prevent unexpected billing, network operators are required to send notices to customers as the data depletes and must obtain an opt-in from subscribers to continue charging for the services. Out-of-bundle fees cannot be charged without first obtaining consent from the subscriber.</p>\n\n\n\n<p>This vast range of products and consumer protection measures overseen by the <a href=\"https://www.icasa.org.za/\" target=\"_blank\" rel=\"noreferrer noopener\">Independent Communications Authority of South Africa</a> (ICASA) has enabled all South African consumers—especially those in the most precarious financial positions—to participate as best they can in the digital economy. This does not mean that divides don’t exist; operators have just made the threshold for participation much lower. And while there may still be <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0308596122000209\" target=\"_blank\" rel=\"noreferrer noopener\">concerns</a> about South Africa’s price levels, ICASA has endeavored to provide a set of rules that provide certainty and confidence for consumers to purchase services as needed. </p>\n\n\n\n<p>These features of the South African cellular market provide food for thought for United States policymakers and regulators addressing the connectivity of low-income consumers in urban environments. Rather than focusing on the provision of subsidized connections with tightly prescribed, postpaid provisions, perhaps there is some benefit in relaxing these minimum provisions and allowing creative prepaid bundles to emerge. Providing consumers with prepaid vouchers to buy the services that best meet their needs will encourage this form of product innovation by operators.</p>\n\n\n\n<p>However, as we testified recently in a <a href=\"https://www.icasa.org.za/legislation-and-regulations/regulations-underway/end-user-and-subscriber-service-charter-amendment-regulations\" target=\"_blank\" rel=\"noreferrer noopener\">hearing</a> at ICASA, there may be one more consumer protection measure for consideration that will enhance consumer welfare, especially for consumers with low data volume usage. Typically, operators record and bill for data usage in <a href=\"https://journals.sagepub.com/doi/full/10.1177/1094670519895581\" target=\"_blank\" rel=\"noreferrer noopener\">predetermined increments</a>, say 10 or 100 kilobytes (KB). Consumers using 51 KB and 58 KB will both be debited for using 60 KB. This is similar to the practice previously observed in voice calls, where calls were billed in increments of two minutes. Such practices lead to systematic overbilling of consumers—something ill afforded by the most cost-conscious consumers. For consumers accessing data for small, short bursts of activity, these overcharges can potentially mount up, leading to higher effective charges than for consumers who consume data in larger chunks.</p>\n\n\n\n<p>In the late 2000s, regulators placed considerable <a href=\"https://www.icasa.org.za/legislation-and-regulations/regulations-underway/end-user-and-subscriber-service-charter-amendment-regulations\" target=\"_blank\" rel=\"noreferrer noopener\">pressure</a> on operators to replace the two-minute billing increment with one-minute increments, reflecting the number of seconds a call used. Nowadays, call times are recorded sometimes even to fractions of a second for decrements from bundle allowances. But what is occurring with data? <a href=\"https://journals.sagepub.com/doi/full/10.1177/1094670519895581\" target=\"_blank\" rel=\"noreferrer noopener\">Evidence</a> from Germany suggests that the minimum billing increment is increasing, with the share of operators using a 100 KB minimum growing from 27 percent to 36 percent between 2008 and 2014. This is likely leading to significant overbilling for low-volume consumers.</p>\n\n\n\n<p>We suggest that all telecommunications regulators—in both developed and developing countries—consider the extent to which data usage schedules are influencing billing in their jurisdictions. The United States should also consider enabling more options when it comes to cell phones and mobile data in its broadband plans. Not doing so is likely harming those least able to afford data in the first place and only widens the divide.</p>\n\n\n<div class=\"related-items shortcode \"><p><strong>See also:  </strong><a href=\"https://www.aei.org/technology-and-innovation/will-banning-data-caps-be-a-win-for-us-consumers/\">Will Banning “Data Caps” Be a Win for US Consumers?</a> | <a href=\"https://www.aei.org/technology-and-innovation/the-innovation-implications-of-mandated-data-siloing-and-sharing/\">The Innovation Implications of Mandated Data Siloing and Sharing</a> | <a href=\"https://www.aei.org/technology-and-innovation/usage-based-broadband-tariffs-closing-digital-divides-with-pricing-competition/\">Usage-based Broadband Tariffs: Closing Digital Divides with Pricing Competition</a> | <a href=\"https://www.aei.org/technology-and-innovation/dont-call-them-data-caps-a-deep-dive-on-usage-based-broadband-pricing/\">Don’t Call Them Data Caps: A Deep Dive on Usage-based Broadband Pricing</a></p></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.aei.org/technology-and-innovation/saved-by-the-cell-how-south-africa-is-bridging-the-digital-divide/\">Saved by the Cell: How South Africa Is Bridging the Digital Divide</a> appeared first on <a rel=\"nofollow\" href=\"https://www.aei.org\">American Enterprise Institute - AEI</a>.</p>\n"
}