{
  "title": "S5 Ep47: Deep Focus: Striving for research excellence with Horizon Europe",
  "link": "https://audioboom.com/posts/7279367",
  "itunes:episode": 47,
  "itunes:title": "Deep Focus: Striving for research excellence with Horizon Europe",
  "itunes:season": 5,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 972,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>The European Union's next framework programme for innovation and research - 'FP9', better known as Horizon Europe - will run from 2021 to 2027. With the rise of China as an increasingly direct competitor with the EU and the US, this will be a vital period.</div>\n<div> </div>\n<div>Bruegel senior fellow Reinhilde Veugelers, together with Michael Baltensperger, has produced an analysis for the European Parliament's Committee on Industry, Research and Energy. The research paper, on which Reinhilde elaborates in this episode of the Deep Focus podcast, looks at what needs to be prioritised in the next framework programme in order to maintain and improve Europe's position as a leader in this increasingly competitive field.</div>\n<div> </div>\n<div>For further reading we recommend the paper in question, '<a href=\"http://bruegel.org/2019/05/europe-the-global-centre-for-excellent-research/\">Europe – the global centre for excellent research</a>', as well as Reinhilde Veugeler's previous Bruegel Policy Contribution, '<a href=\"http://bruegel.org/2018/04/are-european-firms-falling-behind-in-the-global-corporate-research-race/\">Are European firms falling behind in the global corporate research race?</a>'</div>\n",
  "itunes:summary": "In this episode of 'The Sound of Economics', Reinhilde Veugelers speaks about her recent Bruegel paper, requested by the European Parliament, on using public resources to improve the EU's potential to be a global centre of excellence for research in the next decade.",
  "pubDate": "Tue, 04 Jun 2019 08:31:29 +0000",
  "guid": "tag:audioboom.com,2019-06-04:/posts/7279367",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}