{
  "title": "Episode 94: How Do You Learn to Act Like a Woman or like a Man?",
  "pubDate": "Tue, 19 May 2009 01:44:07 +0000",
  "guid": "episode-94-how-do-you-learn-to-act-like-a-woman-o",
  "link": "http://www.thepsychfiles.com/2009/05/18/episode-94-how-do-you-learn-to-act-like-a-manwoman-gender-identity-and-gender-scripts/",
  "itunes:image": "",
  "description": "How do we learn to act in what are called gender appropriate ways?  How did you learn to act like a girl and then a woman? Or like a boy and then like a man?  Did you experience either penis envy or womb envy?  Did this happen as a result of what Freud would call an oedipal complex or perhaps does our tendency to behave in stereotypical masculine and feminine ways come about more simply as a result of watching other males and females in your family, among your friends and on TV?  In this episode of The Psych Files we look at the interesting and complex issue of gender identity.",
  "content:encoded": "How do we learn to act in what are called gender appropriate ways?  How did you learn to act like a girl and then a woman? Or like a boy and then like a man?  Did you experience either penis envy or womb envy?  Did this happen as a result of what Freud would call an oedipal complex or perhaps does our tendency to behave in stereotypical masculine and feminine ways come about more simply as a result of watching other males and females in your family, among your friends and on TV?  In this episode of The Psych Files we look at the interesting and complex issue of gender identity.",
  "enclosure": "",
  "itunes:duration": "26:16",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,psychology,lecture,freud,gender",
  "itunes:subtitle": "How do we learn to act in what are called gender appropriate ways? How did you learn to act like a girl and then a woman? In this episode of The Psych Files we look at the interesting and complex issue of gender identity.",
  "author": "Michael.Britt@ThePsychFiles.com (Michael Britt)",
  "itunes:author": "Michael Britt",
  "itunes:summary": "How do we learn to act in what are called gender appropriate ways? How did you learn to act like a girl and then a woman? Or like a boy and then like a man? Did you experience either penis envy or womb envy? Did this happen as a result of what Freud would call an oedipal complex or perhaps does our tendency to behave in stereotypical masculine and feminine ways come about more simply as a result of watching other males and females in your family, among your friends and on TV? In this episode of The Psych Files we look at the interesting and complex issue of gender identity."
}