{
  "title": "A Primer on Decision Making with Uncertainty",
  "link": "",
  "published": "2020-08-25T00:00:00+00:00",
  "updated": "2020-08-25T00:00:00+00:00",
  "id": "http://inverseprobability.com/2020/08/25/a-primer-on-decision-making-with-uncertainty",
  "content": "<p><em>From 4th April 2020 I became involved in the\n<a href=\"http://rs-delve.github.io/\">Royal Society DELVE Initiative</a>.  The\nfollowing piece was co-written with other DELVE members (but in\npersonal capacities) as an aide to understanding the different nature\nof policy decision making that’s required when there is uncertainty\nabout the science. It was originally written in April, but published\non Peter Diggles web page at end of August.</em></p>\n\n<p>The current coronavirus epidemic has broad to very public attention the frequent need for\npolicy decisions, most dramatically the announcement of the UK government’s lockdown\nrestrictions on 23 March 2020, to be made quickly, and on the basis of incomplete\ninformation.</p>\n\n<p>The government and the general public receive scientific advice related to the coronavirus\nfrom a range of sources. One of these is the Royal Society’s DELVE initiative, whose\nparticular focus on data-driven methods (as opposed to modelling, which provides another\nvery important perspective). An immediate difficulty with providing such advice is that there\nis a great deal that we do not know about the virus and how it is transmitted, and the kind of\ninformation we would like takes a long time to obtain, especially if one wishes to apply the\nusual standards of scientific rigour. But the virus will not wait for us, so governments are\nforced to make decisions despite many important facts being unknown. This situation is\nknown as ‘finite horizon’ – there is a fixed time after which if you have not acted, then the\ndecision is effectively made for you.</p>\n\n<p>What constitutes good scientific advice when there is a finite horizon? With complete\ninformation, one can offer a cost-benefit analysis of the various options between which the\ngovernment must choose. But when the information is only partial, probability comes into the\npicture, and this becomes a risk-benefit analysis.</p>\n\n<p>This can be illustrated with a simple example. Suppose you are on holiday and you visit an\nisland. At the end of the day you need to catch a ferry back to your hotel, which leaves at\naround 11pm, but you are not quite sure of the precise time. You are running a bit late, and\nas you arrive at the terminal, you see that a ferry is just about to leave. You do not speak the\nlanguage and do not have time to check whether it is the right ferry.</p>\n\n<p>One part of deciding what to do will be to weigh up the costs and benefits of the possible\noutcomes. If you do not get on the ferry, you will probably spend the night on the island, so\nyou will consider what that would be like: whether it would be safe, whether there is\nanywhere to stay, etc. If you do get on the ferry, then you may end up back at your hotel,\nwhich is the ideal outcome, but you may perhaps be taken somewhere else, where you will\narrive, late at night, not speaking the language.</p>\n\n<p>Another part of the decision is assessing probabilities. For instance, if there are very few\nferries, then you may judge that it is likely that the departing ferry is the right one, but if there\nare many, then you will be less sure. This assessment will have an important effect on your\ndecision: the more likely the ferry is to be the right one, the lower the risk of ending up in the\nwrong place, and therefore the more sensible it is to jump on.</p>\n\n<p>DELVE comprises a highly diverse group of experts from public health, epidemiology,\neconomics, immunology, mathematics, statistics, machine learning and psychology. The\ngroup aims to offer the best policy advice it can, on the time frames where that advice is \nuseful. Its reports assimilate evidence from these different fields and advise on the\nimplications of this evidence for policy-making’. Where scientific consensus is available it\ncan give this advice on the basis of that consensus. But where there is no consensus, it can\nstill offer advice based on our best understanding of the outcomes of any interventions that\nmight be made. Often those outcomes will be uncertain: in such situations we try to assess\nthe risks of the interventions and the likelihood of potential benefits, in order to offer the best\npossible advice given the evidence we have.</p>\n\n<p>For example, DELVE recently reported on the use of face masks, concluding that more\nwidespread face mask use can help reduce the risk of onward transmission from\nasymptomatic individuals and could play an important role in situations where physical\ndistancing is not practical. The scientific evidence that this would make a significant\ndifference to transmission rates is by no means conclusive, but neither is the scientific\nevidence that it would not make a significant difference. DELVE judged that there was a\nreasonable probability that masks would make a difference. For example, if they reduce the\ntransmission rate, then they could potentially reduce the length of the lockdown, and each\nday of the lockdown is estimated to cost £2.4bn. On that basis, despite the uncertainties, we\nfelt confident in our advice.</p>\n\n<p>A few general points are worth bearing in mind.</p>\n\n<ol>\n  <li>\n    <p>It may be that as decisions-makers accumulate more evidence, they will come to\nrealize that another decision is better: given how rapidly the evidence is changing, it\nis important to be flexible and ready to change our minds.</p>\n  </li>\n  <li>\n    <p>In some situations maintaining the status quo until more evidence accumulates is a\ngood default decision. But in an emergency such as the current pandemic, inaction\ncan have serious adverse consequences, so its risks and potential benefits should be\nassessed along with those of possible interventions.</p>\n  </li>\n  <li>\n    <p>While science has a very important part to play in decision-making, important aspects\nof decision-making are not scientific. For instance, science may be able to tell us that\nthere is approximately a 1% chance of a certain catastrophe occurring, but science\nalone cannot determine how much money it would be worth spending on\ninterventions to reduce that chance to 0.5%.</p>\n  </li>\n</ol>\n\n<p>In summary, because there are many uncertainties associated with the situation in which we\nfind ourselves, we will often have to make decisions in the absence of a scientific\nconsensus. That need not prevent us from making good decisions. We should look at the\nevidence in order to assess the probabilities of the possible outcomes of any intervention\nand the likely costs and benefits of those outcomes. This will not always make the decisions\neasy, but it will give them a much better foundation.</p>\n\n<p>Note. The authors are members of the DELVE Working Group, but are writing in their\npersonal capacity. A good starting point for further reading is a blog-post by LSE Economists\nMatteo Galizzi, Benno Guenther, Maddie Quinlan and Jet Sanders:\n<a href=\"https://coronavirusandtheeconomy.com/question/risk-time-covid-19-what-do-we-know-andnot-know\">https://coronavirusandtheeconomy.com/question/risk-time-covid-19-what-do-we-know-andnot-know</a></p>",
  "author": {
    "name": "{\"given\"=>\"Peter\", \"family\"=>\"Diggle\", \"url\"=>\"https://www.lancaster.ac.uk/staff/diggle/\"}"
  },
  "summary": "From 4th April 2020 I became involved in the Royal Society DELVE Initiative. The following piece was co-written with other DELVE members (but in personal capacities) as an aide to understanding the different nature of policy decision making that’s required when there is uncertainty about the science. It was originally written in April, but published on Peter Diggles web page at end of August."
}