{
  "title": "#437: The Voldeport (OOTP Chapter 5, The Order of the Phoenix)",
  "link": "https://audioboom.com/posts/7389649",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 4731,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Pottermore is NO MORE! We reflect on all the hype that surrounded its launch and re-sort ourselves with the new virtual Sorting Hat!</li>\n<li>Chapter-by-Chapter continues with Harry Potter and the Order of the Phoenix Chapter 5, The Order of the Phoenix</li>\n<li>Seven Word Summary: Harry asks Sirius about Voldemort’s return loudly</li>\n<li>No. 12 Grimmauld place belongs to Sirius. We debate using his home as Order headquarters!</li>\n<li>Harry and Sirius compare summers and both blame Dumbledore for their current situation. </li>\n<li>Does Molly overreact to Fred and George’s coming of age? What was Molly like back in the day when she was first legally able to use magic?</li>\n<li>Slip of the knife... Death Omen #2 for Sirius!</li>\n<li>Molly doesn’t approve of Mundungus Fletcher and honestly, do we? Does Dumbledore pick Order members like he does Hogwarts professors?</li>\n<li>Sirius, Molly and The Battle of What's Best for Harry</li>\n<li>Sirius encourages Harry to ask about Voldemort. What do we make of his behavior?</li>\n<li>At this point in the story, which characters best reflect parental figures for Harry?</li>\n<li>The Voldemort Report offers a great lay of the land.</li>\n<li>The Order is not well positioned to spread the word of Voldemort’s return!</li>\n<li>What is the weapon? Was this misleading at all to us as readers? Is the prophecy truly a weapon?</li>\n<li>We Connect The Threads, give our MVPs of the Week and Rename the Chapter</li>\n<li>Quizzitch: The Black family tapestry reads “The Most Noble and Ancient House of Black,” but what is written directly beneath that line?</li>\n<li>Don't forget to come see us next week at <a href=\"http://www.leakycon.com/boston\">LeakyCon Boston</a>! Friday, October 11: Podcasting with Potter;  Saturday, October 12: Name That Character / LeakyMug Challenge; Sunday, October 13: MuggleCast Live with Chris Rankin</li>\n<li>We're also hosting a MuggleCast Meetup on Saturday, October 12 at Hopsters Brewing Company from 5-7 pm!</li>\n<li>\n<a href=\"http://www.patreon.com/mugglecast\">Become a member of our community</a> today on Patreon and receive awesome, magical benefits!</li>\n<li>This week's episode is brought to you by Quip, an amazing electric tooth brush at an affordable price! Go to <a href=\"http://www.GetQuip.com/Muggle\">GetQuip.com/Muggle</a> to get your first refill FREE!</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 07 Oct 2019 16:31:18 +0000",
  "guid": "tag:audioboom.com,2019-10-07:/posts/7389649",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}