{
  "title": "When to stop learning from Singapore: data, surveillance and Australian business",
  "link": "https://www.newmandala.org/when-to-stop-learning-from-singapore-data-surveillance-and-australian-business/",
  "dc:creator": "Hallam Stevens",
  "pubDate": "Wed, 02 Nov 2022 23:59:52 +0000",
  "category": [
    "AcademiaSG",
    "Singapore"
  ],
  "guid": "https://www.newmandala.org/?p=60223",
  "description": "<p>More data means more risk., and a system focused on control is not—it turns out—one that is particularly nimble or responsive.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/when-to-stop-learning-from-singapore-data-surveillance-and-australian-business/\">When to stop learning from Singapore: data, surveillance and Australian business</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>When the personal data of ten million Australians was compromised in a <a href=\"https://www.theguardian.com/business/2022/sep/22/customers-personal-data-stolen-as-optus-suffers-massive-cyber-attack\">cyberattack on Optus</a> in late September, many people were looking for someone to blame. Most fingers were pointed at <a href=\"https://www.theaustralian.com.au/nation/optus-to-blame-home-affairs-minister-claire-oneil-lays-blame-squarely-at-telco/news-story/1281ec0a0a9476da0bd6216d04c9db38\">Optus itself</a> or the <a href=\"https://www.theguardian.com/australia-news/live/2022/sep/28/australia-politics-live-anti-corruption-bill-mark-dreyfus-petrol-excise-tax-anthony-albanese-optus-data-hack-cyber-security?filterKeyEvents=false&page=with:block-6333ee428f08ef7e8107bb1d#block-6333ee428f08ef7e8107bb1d\">lack of adequate government protections</a> against such transgressions.</p>\n<p>A <a href=\"https://www.afr.com/companies/telecommunications/optus-opaque-singapore-owner-faces-scrutiny-over-hacking-attack-20220930-p5bm5u\">few commentators</a> noted the connections between Optus and Singapore, drawing attention both to the city state’s surveillance of its own citizens and the government’s prominent role in corporations like Singtel (Optus’s owner). “Profits are maximized, dissent is minimized,” wrote <a href=\"https://insidestory.org.au/singapore-swivel/\">Eric Ellis in <em>Inside Story</em></a>. Despite such worries, Australia is seeking to deepen its partnerships with Singapore. <a href=\"https://www.pm.gov.au/media/australia-singapore-annual-leaders-meeting-joint-statement\">Meetings</a> between Prime Ministers Anthony Albanese and Lee Hsien Loong took place recently in Canberra with the aim of renewing their Comprehensive Strategic Partnership.</p>\n<p>There are certainly connections between Singapore government surveillance and the operations the of Singapore government’s elaborate network of corporations and wealth funds (what Ellis calls “Singapore Inc.”). But these are perhaps deeper and more significant than Ellis allows. Certainly, tighter control over citizens—at home or abroad—does make for “efficient” corporate operations. But surveillance is not merely a nasty side-effect of Singapore’s quest for profits. Rather, surveillance is the <em>product itself</em>.</p>\n<p>For forty years, Singapore has promoted itself as a high-tech state and hawked its technological prowess to its Asian neighbours. What was on offer—presented through a complex array of state-owned enterprises and intermediaries—was never just technology and technological expertise, but rather a whole set of connected legal, financial, and political mechanisms for managing society. The “Singapore model” was an array of tools for creating a high-tech society replete with the social and political orders for controlling it.</p>\n<p>Singapore’s <a href=\"https://eresources.nlb.gov.sg/infopedia/articles/SIP_553_2004-12-31.html\">Jurong Town Corporation</a> (JTC), established in 1968 to manage Singapore first industrial estate, began constructing and managing Singapore-style technology and industrial parks overseas in the 1980s, including in <a href=\"http://www.batamindoindustrial.com/#/home\">Indonesia</a>, Vietnam, Thailand, and the <a href=\"https://en.wikipedia.org/wiki/Suzhou_Industrial_Park\">People’s Republic of China</a>. JTC built the infrastructure and the buildings, but it also managed licensing, intellectual property, training and recruitment of workers, housing, and recreation facilities. Tight control of workers was a critical component of this model. Singapore was selling a “plug and play” system for high tech industry and business.</p>\n<p>As China gradually opened its markets, it was particularly receptive to Singaporean ideas. In 1992 the architect of Chinese reforms, Deng Xiaoping, argued that China should “<a href=\"https://www.nytimes.com/1992/08/09/weekinreview/the-world-china-sees-singapore-as-a-model-for-progress.html\">learn from the experience</a>” of Singapore. Others in the Communist Party worried aloud that China’s first flirtations with economic liberalization had “<a href=\"https://eresources.nlb.gov.sg/newspapers/Digitised/Article/biztimes19940224-1.2.42\">been achieved at the expense of social order</a>.” The Singapore model offered a more suitable balance between “<a href=\"https://eresources.nlb.gov.sg/newspapers/Digitised/Article/biztimes19940224-1.2.42\">economic growth and social cohesion</a>.” In other words, Singapore offered pathways to economic success that did not require social or political liberalization.</p>\n<p>During the 1990s, Singtel presided (as <a href=\"https://eresources.nlb.gov.sg/infopedia/articles/SIP_1610_2011-03-21.html\">Telecoms</a> initially, before its privatization), first over a homegrown electronic network known as <a href=\"https://infrastructureasia.net/#chapters\">“Teleview”</a> and later over the careful and controlled rollout of access to the Internet on the island. Through that process, the government found mechanisms—<a href=\"https://nuspress.nus.edu.sg/products/freedom-from-the-press\">including selective censorship and targeted persecution of transgressors</a>—for limiting the threats associated with cyberspace. Singapore Inc. is selling not just technology, but also a set of social and political structures to govern a technological society, Singapore style.</p>\n<p>In support of these efforts, Singapore has also provided extensive training in social and political management. Since the 1992, <a href=\"https://www.ntu.edu.sg/\">Nanyang Technological University</a> has run a version of the so-called “<a href=\"https://www.routledge.com/The-Political-Economy-of-Transnational-Governance-China-and-Southeast-Asia/Liu/p/book/9780367608804\">mayor’s class</a>,” educating thousands of mid-level Chinese communist party officials on Singapore’s approach to public administration, urban development, social management, rule of law, and legal systems. Educating close to 1400 Chinese cadres between 1992 and 2016, the “mayor’s class” represented a significant “export” of Singapore’s style of social planning and management into the People’s Republic of China.</p>\n<p>The development of this model has continued in the last decade. Singapore’s plans for developing itself into a <a href=\"https://www.smartnation.gov.sg/\">smart city</a> are also envisaged as a set of social as well as technological transformations. For the island nation, a smart city involves sensors, smart electricity grids, and a digital economy, but also a “digital society” that entails a national digital identity system, a tech-savvy workforce, and an entire digital district (called <a href=\"https://www.smartnation.gov.sg/initiatives/strategic-national-projects/punggolst\">Punggol Smart Town</a>, to be designed and operated by JTC). This combined techno-social utopia, Singapore hopes, can be sold as a package to other nations or cities hoping to “smartify” their urban spaces. The <a href=\"https://www.smartnation.gov.sg/about-smart-nation/transforming-singapore\">ASEAN Smart Cities network</a>—stretching from Makassar to Mandalay—provides Singapore a “unique opportunity to quickly leverage opportunities from rapid urbanisation.”<em class=\"help-text\"> \n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/lgbtquiet-silence-does-not-mean-consent/\">\n\t\t\t\t\t<img width=\"293\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2022/07/Pink_Dot_2014_Singapore/3475401312.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/lgbtquiet-silence-does-not-mean-consent/\">LGBTQuiet? Silence does not mean consent</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>That silence is chosen as a form of contestation in Singapore suggests there is a larger population desiring, ready for and calling for change.</p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/terri/\">Terri Teo</a>\n\t\t\t\t\n\t\t\t\t\t15 July, 2022\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t</em></p>\n<p>Australia’s alignments and partnerships with Singapore—knowingly or not—are buying into this model. Of course, Optus’s entry into Australia in 2001 did not import that model wholesale. But there are other domains in which public and private partnerships are leading Australia further down this path. The <a href=\"https://www.dfat.gov.au/trade/services-and-digital-trade/australia-singapore-digital-economy-agreement-summary-key-outcomes\">Australia-Singapore Digital Economy Agreement</a>, for example – which came into effect in December 2020 – included provisions for bilateral cooperation on cross-border data flows, digital trade facilitation, digital standards, FinTech and RegTech, personal data protection, digital identity, and open government data. Singapore’s approach to many of these technological domains has reflected its top-down governance. Its <a href=\"https://firstmonday.org/ojs/index.php/fm/article/view/9851\">government open data platform</a> is heavily selective and tightly curated in ways that align with existing state narratives.</p>\n<p>Singapore’s successes with COVID-19 control during the global pandemic also had Australia looking toward the Little Red Dot. In the wake of the failures in the Australian quarantine system, the idea was mooted that Australia would use <a href=\"https://www.smh.com.au/politics/federal/australia-and-singapore-plan-for-travel-bubble-and-quarantine-hub-by-july-20210312-p57a57.html\">Singapore as a sort of quarantine waystation</a>. Travellers to Australia would be able to serve their quarantine period under the watchful eye of the Singapore regime before entering Australia. This outsourcing of surveillance never came into operation. But it again suggests that what Singapore is really selling is social control with the Shangri-La.</p>\n<p>Ultimately, the problem with Singapore’s style of techno-social governance may be that it just doesn’t work very well. This may be especially true outside the tightly controlled spaces of Singapore itself. Within the vast cities and countryside of China, the effectiveness of applying the “<a href=\"https://www.routledge.com/Chinas-Singapore-Model-and-Authoritarian-Learning/Ortmann-Thompson/p/book/9781032400358\">holy scriptures</a>” from Singapore has been questioned. But even in Singapore, the state’s management of technology has recently come under scrutiny. In July 2018, SingHealth—a conglomerate of state-run health institutions—suffered a <a href=\"https://en.wikipedia.org/wiki/2018_SingHealth_data_breach\">massive data breach</a> that released the personal information of 1.5 million patients (almost 30% of the entire population, including the Prime Minister). <a href=\"https://www.itnews.asia/news/singapore-public-sector-saw-178-data-breaches-in-2021-583428\">A series of smaller data breaches</a> involving government agencies followed. During the COVID-19 pandemic, too, the <a href=\"https://www.bbc.com/news/world-asia-55541001\">government’s missteps</a> in the rollout of its contact-tracing app left many Singaporeans wondering whether the state was quite as trustworthy as it had once seemed. Singapore’s TraceTogether collected <a href=\"https://www.academia.sg/academic-views/wearables-and-privacy/\">massive amounts of personal data</a> (at great public expense) with little to show for it in terms of public health benefit.</p>\n<p>There is, of course, no absolute guarantee of data privacy under any regime. But there are some aspects of the Singapore model that may make it particularly vulnerable. First, the orientation towards intensive management and control generates and stores a great deal of personal data, often in centralized repositories. We might think of this as the opposite to the European model under the <a href=\"https://gdpr-info.eu/\">GDPR</a> (General Data Protection Regulation), where the collection and retention of data must be lean and expressly justified. More data means more risk. Second, the Singapore model has not proved particularly adaptable or <a href=\"https://www.theguardian.com/business/2022/oct/10/singtel-confirms-2020-data-breach-after-cyber-attack-on-optus\">able to learn from its mistakes</a>. A system focused on control is not—it turns out—one that is particularly nimble or responsive.</p>\n<p>As Australia continues to broaden and deepen its partnerships with Singapore we need to ask whether the island’s success is a product worthy of import. The practices of surveillance and control are built deeply into Singapore’s technological fabric. Despite the pervasiveness of <a href=\"https://en.wikipedia.org/wiki/Surveillance_capitalism\">surveillance capitalism</a>, this isn’t the way it has to be. Nations such as <a href=\"https://www.wired.co.uk/article/global-neighbourhoods-digital-democracy\">Taiwan</a>, <a href=\"https://www.newyorker.com/magazine/2017/12/18/estonia-the-digital-republic\">Estonia</a> or <a href=\"https://tekno.dk/?lang=en\">Denmark</a> offer alternative “smart,” digital futures premised on democratic deliberation and trust. Whatever moral or political qualms we may have about Singapore’s approach, the recent Singtel/Optus breaches also suggest that this path to technological governance may not be well attuned to the digital age.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/when-to-stop-learning-from-singapore-data-surveillance-and-australian-business/\">When to stop learning from Singapore: data, surveillance and Australian business</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}