{
  "id": "yt:video:Rju2g-sExng",
  "yt:videoId": "Rju2g-sExng",
  "yt:channelId": "UCrlZs71h3mTR45FgQNINfrg",
  "title": "What are complex numbers? | Essence of complex analysis #2",
  "link": "",
  "author": {
    "name": "Mathemaniac",
    "uri": "https://www.youtube.com/channel/UCrlZs71h3mTR45FgQNINfrg"
  },
  "published": "2021-08-18T14:00:09+00:00",
  "updated": "2022-06-05T18:07:10+00:00",
  "media:group": {
    "media:title": "What are complex numbers? | Essence of complex analysis #2",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "A complete guide to the basics of complex numbers. Feel free to pause and catch a breath if you feel like it - it's meant to be a crash course!\n\nComplex numbers are useful in basically all sorts of applications, because even in the real world, making things complex sometimes, oxymoronically, makes things simpler. This is the basis for a lot of physical applications, like circuit analysis, as well as slightly more far-fetched like Fourier analysis or Laplace transforms. Even for pure mathematicians, this is very useful due to its algebraic closure, and the beautiful world of complex analysis. As said before in the previous video, complex analysis is an extremely powerful tool that everyone should be excited about!\n\nThis video will cover basically all of the topics you will ever learn in a normal course in complex numbers, or things considered basics in complex analysis, namely, Cartesian and polar ways of representation, Euler's formula and identity, the different operations of complex numbers, including complex exponentiation like i^i, de Moivre's theorem helping us find nth root of any complex numbers and so on. Even if you know a lot about complex numbers, maybe the proofs of Euler's formula is something that you might not have seen, or just maybe use this as a refresher! This video also touches on the argument issue, which could naturally lead to branch cuts, but this will be postponed to the next video.\n\nThis is a part of a video series on complex analysis. Next video is going to be about visualising complex functions, and of course, the messy stuff about it, like the branch points and branch cuts. Don't forget to subscribe with the bell icon on so that you can be notified of my new uploads in the series!\n\nVideo chapters:\n00:00 Sarcastic and serious introductions\n01:32 1.1 Complex plane - Cartesian way\n02:47 1.2 Complex plane - Polar way (Intro)\n03:25 1.3 Arguments about arguments\n04:57 1.4 Interconversion \n07:48 2.1 Euler's formula - classic proof\n09:22 2.2 Euler's formula - 2nd proof\n13:03 3.1 Operations - addition/subtraction\n14:12 3.2 Operations - multiplication\n16:06 3.3 Operations - conjugation\n17:45 3.4 Operations - division\n19:23 3.5 Operations - exponentiation\n20:11 3.6 Operations - logarithm\n21:50 3.7 Operations - sine/cosine\n23:56 4.1 de Moivre's theorem - intro\n24:49 4.2 de Moivre's theorem - nth roots\n28:53 4.3 de Moivre's theorem - Euler's formula 3rd proof\n31:12 Outro\n\nMusic used:\nAsher Fulero - Beseeched\nAakash Gandhi - Kiss the Sky\nAsher Fulero - Night Snow\nAsher Fulero - Renunciation\nAsher Fulero - Unrequited\n\nAll obtained from YouTube audio library.\n\nTHINGS MENTIONED AND FURTHER READING/WATCHING:\nhttps://www.youtube.com/watch?v=v0YEaeIClKY (3Blue1Brown video on the second proof)\nhttps://youtu.be/xowA7Z5aee0 (My video on pi calculation)\nhttps://en.wikipedia.org/wiki/Gelfond%E2%80%93Schneider_theorem (Gelfond-Schneider theorem: why e^(-pi/2) is transcendental)\nhttps://www.youtube.com/watch?v=N-KXStupwsc (Mathologer video on cubic formula)\nhttps://en.wikipedia.org/wiki/Cubic_equation (Cubic equation)\nhttps://brilliant.org/wiki/de-moivres-theorem/ (More uses of de Moivre’s theorem; not sponsored)\nhttps://www.youtube.com/watch?v=-dhHrg-KbJ0 (Mathologer video on the final proof of Euler’s formula)\nhttps://en.wikipedia.org/wiki/Brahmagupta%E2%80%93Fibonacci_identity (Originally wanted to put this in, but don’t know where to put it, so: a nice application of complex numbers)\n\nOther than commenting on the video, you are very welcome to fill in a Google form linked below, which helps me make better videos by catering for your math levels:\nhttps://forms.gle/QJ29hocF9uQAyZyH6\n\nIf you want to know more interesting Mathematics, stay tuned for the next video!\n\nSUBSCRIBE and see you in the next video!\n\nIf you are wondering how I made all these videos, even though it is stylistically similar to 3Blue1Brown, I don't use his animation engine Manim, but I will probably reveal how I did it in a potential subscriber milestone, so do subscribe!\n\nSocial media:\n\nFacebook: https://www.facebook.com/mathemaniacyt\nInstagram: https://www.instagram.com/_mathemaniac_/\nTwitter: https://twitter.com/mathemaniacyt\nPatreon: https://www.patreon.com/mathemaniac (support if you want to and can afford to!)\n\nFor my contact email, check my About page on a PC.\n\nSee you next time!",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}