{
  "itunes:episodeType": "full",
  "itunes:title": "How to Help a Strong-Willed Child Listen (Without Wounding His Spirit)",
  "title": "How to Help a Strong-Willed Child Listen (Without Wounding His Spirit)",
  "itunes:author": "JLML Press",
  "itunes:subtitle": "A parent describes her 4-year-old son as energeti…",
  "itunes:summary": "A parent describes her 4-year-old son as energetic, independent and strong-willed. While she appreciates her son’s enthusiasm, she struggles to reign him in and finds herself yelling, \"You're not listening!\"  She says they often take nature walks with friends and he inevitably runs ahead at an unsafe distance. She feels overwhelmed, especially when they are out with other parents “that have high expectations for behavior.\" She hopes Janet can offer a way to help her son listen, but “without killing his free spirit.”\n\nFor more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. \n\nJanet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).\n\nAdvertising Inquiries: https://redcircle.com/brands\n\nPrivacy & Opt-Out: https://redcircle.com/privacy",
  "description": "<p>A parent describes her 4-year-old son as energetic, independent and strong-willed. While she appreciates her son’s enthusiasm, she struggles to reign him in and finds herself yelling, \"You're not listening!\" She says they often take nature walks with friends and he inevitably runs ahead at an unsafe distance. She feels overwhelmed, especially when they are out with other parents “that have high expectations for behavior.\" She hopes Janet can offer a way to help her son listen, but “without killing his free spirit.” </p><p>For more advice on common parenting issues, please check out Janet's best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes & Noble and Apple Books. </p><p>Janet's exclusive audio series \"Sessions\" is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "content:encoded": "<p>A parent describes her 4-year-old son as energetic, independent and strong-willed. While she appreciates her son’s enthusiasm, she struggles to reign him in and finds herself yelling, &#34;You&#39;re not listening!&#34; She says they often take nature walks with friends and he inevitably runs ahead at an unsafe distance. She feels overwhelmed, especially when they are out with other parents “that have high expectations for behavior.&#34; She hopes Janet can offer a way to help her son listen, but “without killing his free spirit.” </p><p>For more advice on common parenting issues, please check out Janet&#39;s best-selling books on Audible, FREE with a 30-day trial membership if you use this link: adbl.co/2OBVztZ. </p><p>Paperbacks and e-books are also available at Amazon, Google Play, Barnes &amp; Noble and Apple Books. </p><p>Janet&#39;s exclusive audio series &#34;Sessions&#34; is available for download. This is a collection of recorded one-on-one consultations with parents discussing their most immediate and pressing concerns (www.SessionsAudio.com).</p><br/><br/>Advertising Inquiries: <a href='https://redcircle.com/brands'>https://redcircle.com/brands</a><br/><br/>Privacy & Opt-Out: <a href='https://redcircle.com/privacy'>https://redcircle.com/privacy</a>",
  "enclosure": "",
  "guid": "tag:soundcloud,2010:tracks/773957719",
  "link": "https://soundcloud.com/janet-lansbury/how-to-help-a-strong-willed-child-listen-without-wounding-his-spirit",
  "pubDate": "Tue, 10 Mar 2020 21:53:42 &#43;0000",
  "itunes:image": "",
  "itunes:duration": 1239,
  "itunes:explicit": "no"
}