{
  "id": "yt:video:_5xle0NYFFE",
  "yt:videoId": "_5xle0NYFFE",
  "yt:channelId": "UC0uTPqBCFIpZxlz_Lv1tk_g",
  "title": "Philosophy: loss, entitlement, and presence",
  "link": "",
  "author": {
    "name": "Protesilaos Stavrou",
    "uri": "https://www.youtube.com/channel/UC0uTPqBCFIpZxlz_Lv1tk_g"
  },
  "published": "2022-10-17T16:54:20+00:00",
  "updated": "2022-10-18T10:33:52+00:00",
  "media:group": {
    "media:title": "Philosophy: loss, entitlement, and presence",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Find all my publications on my website: https://protesilaos.com.\n\n* * *\n\nThanks to Dmitry Matveyev for the 500 EUR donation that allowed me to buy the smartphone (Samsung A53) and selfie stick that I use to record these videos in the great outdoors.\n\n* * *\n\nIn this entry, I walked in the mountains and talked about developing the right attitude for dealing with matters we do not control.  The main points:\n\n- A story of mine about remaining open to new experiences after misfortune strikes.\n- You do not control all the factors.  If you assume the blame, you imply that you do control those factors.\n- If you think you are a god, you will always overestimate your abilities.  You will then desire to achieve that which you cannot.  The disconnect will make you suffer.\n- An explanation of non-ownership with specific examples.\n- Elaboration on the bad habit of dithering, delaying, and postponing.  You think you control time, again overestimating yourself.\n- Overthinking and overanalysing is to your detriment.  Fundamentally, you make the mistake of assuming that the perfect is attainable.\n- Thinking that the perfect is attainable means that you expect your actions to be perfect.  But to act is to do so in imperfect circumstances, with incomplete knowledge.\n- To act is to perform a leap of faith.  There is faith in acting.\n- More examples that tie it all together.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}