{
  "id": "https://bibleinoneyear.org/en/youth/227",
  "title": "Day 227: No Sloppy Living",
  "description": "Psalm 97:1,10–12, 2 Chronicles 2:1,5, 1 Corinthians 9:19–27, 10:12–13.  All human beings are servants – to God, to yourself or to someone or something else In the passages for today, we see the importance of worshipping and serving the one true God with all of our hearts and beings – giving everything we have got – no sloppy living",
  "pubDate": "Mon, 15 Aug 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/227/",
  "itunes:duration": "14:46",
  "guid": "enyouth15082022-227",
  "length": 886.02,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 227: No Sloppy Living",
  "itunes:subtitle": "Psalm 97:1,10–12, 2 Chronicles 2:1,5, 1 Corinthians 9:19–27, 10:12–13.  All human beings are servants – to God, to yourself or to someone or something else In the passages for today, we see the importance of worshipping and serving the one true God with all of our hearts and beings – giving everything we have got – no sloppy living",
  "itunes:summary": "I love to play sport. I have never been particularly good at it, but I enjoy it enormously. Not many of the guys I played squash with played at a very high standard; it was all very friendly and relaxed and yet we were very competitive! Even the level we played at required ‘strict training’. I had to train and play regularly. It is one of the reasons I try to be careful about what I eat and how much sleep I get.\nThe apostle Paul writes, ‘You’ve all been to the stadium and seen the athletes race. Everyone runs; one wins. Run to win. All good athletes train hard. They do it for a gold medal that tarnishes and fades. You’re after one that’s gold eternally’ (1 Corinthians 9:24–25, MSG).\nIf those who compete at sport go into strict training in order to achieve something that ‘will not last’, how much more should we go into ‘strict training’ in our moral and spiritual life in order to ‘get a crown that will last for ever’ (v.25).\nPaul writes, ‘I don’t know about you, but I’m running hard for the finish line. I’m giving it everything I’ve got. No sloppy living for me! I’m staying alert and in top condition’ (v.26, MSG). Worshipping and serving God is Paul’s aim and ambition in life. He wants to do it to the very best of his ability. He wants to give it everything he’s got. He is going for gold.\nWorship and service are very closely connected (the same Greek word latreuo is used for both). All human beings are worshippers. You either worship the one true God, or someone or something else. All human beings are servants – to God, to yourself or to someone or something else.\nIn the passages for today, we see the importance of worshipping and serving the one true God with all of our hearts and beings – giving everything we have got – no sloppy living.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 592
}