{
  "title": "TU119: For the Love of Men, Rethinking Masculinity with Liz Plank",
  "link": "https://therapistuncensored.com/episodes/tu119-for-the-love-of-men-rethinking-masculinity-with-liz-plank/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu119-for-the-love-of-men-rethinking-masculinity-with-liz-plank",
  "pubDate": "Wed, 08 Apr 2020 14:00:00 +0000",
  "guid": "http://7317a440-f4de-4a06-9417-3aface7497cc",
  "description": "It isn&#039;t a war between the genders, it&#039;s a war between those interested in freedom of individual expression and equality, and those wedded to and defending the patriarchal script.",
  "enclosure": "",
  "itunes:subtitle": "Mindful masculinity allows us each to define ourselves rather than being told who we are supposed to be.",
  "itunes:summary": "It isn&apos;t a war between the genders, it&apos;s a war between those interested in freedom of individual expression and equality, and those wedded to and defending the patriarchal script.“I measure activism based on impact... .” - Liz PlankIn this episode, co-host Sue Marriott speaks with Liz Plank, one of the worlds most powerful and influential voices for gender and policy.<br />\n<br />\n<br />\nWho is Liz Plank?Liz Plank is an award-winning journalist and senior producer at Vox Media. Her TedxTalk, How to Be a Man: A Woman&apos;s Guide inspired her first book,   (https://amzn.to/3acOB8l)  where she “offers a smart, insightful, and deeply-researched guide for what we&apos;re all going to do about toxic masculinity. For both women looking to guide the men in their lives and men who want to do better and just don’t know how.”<br />\n<br />\n<br />\nMediaite&apos;s Most Influential in New Media<br />\n<br />\n<br />\n50 Most Influential Women by Marie Claire<br />\n<br />\n<br />\nForbes&apos; 30 Under 30 in Media<br />\n<br />\n<br />\nEpisode 119 Show Notes:Why do we need more storytelling around men?More progress regarding issues around domestic & sexual violence if men were more involved in the conversation.<br />\n<br />\n<br />\nHuman rights are not a finite resource and when there is more equality, the better it is for everyone.<br />\n<br />\n<br />\nOpen the conversation for men to talk about masculinity and what it means to be a man because they do not feel safe doing so.<br />\n<br />\n<br />\nHaving an empathic conversation about feminism that includes all genders, a movement that benefits the whole society.<br />\n<br />\n<br />\nRewriting Gender RolesThe lack of conversations regarding masculinity between men.<br />\n<br />\n<br />\nFollowing gender roles based on societal pressures and family development.<br />\n<br />\n<br />\nExploring historical and cultural examples of how gender roles change and vary to give men permission to explore their identity.<br />\n<br />\n<br />\nA shift in the younger generation being accepting of gender fluidity.<br />\n<br />\n<br />\nWhat It Means To Be A ManIdentifying as a provider when many jobs traditionally done by men are disappearing or moving overseas.<br />\n<br />\n<br />\nStarting to have the opportunity to have an identity outside of their career.<br />\n<br />\n<br />\nHave both genders shoulder the emotional burden and do the work to heal.<br />\n<br />\n<br />\nNarcissism & Toxic MasculinityThere is a higher percentage of narcissism in men.<br />\n<br />\n<br />\nHave more female leadership represented in entertainment & media to provide an understanding of female complexity.<br />\n<br />\n<br />\nEducationEncouraging curriculum that teaches anti-violence, anti-sexual assault, verbal consent, emotional intelligence, and interpersonal relationships.<br />\n<br />\n<br />\nA universal understanding that we all experience similar emotions and social anxiety so we can all advocate for each other.<br />\n<br />\n<br />\nLiz&apos;s Influence:Wanting to measure her activism based on impact.<br />\n<br />\n<br />\nWanting everyone to feel welcome to this conversation on masculinity and help men go through their emotional labor.<br />\n<br />\n<br />\nContinue to open the conversation for men of influence to discuss masculinity openly.<br />\n<br />\n<br />\nMasculinity Influence:Brad Pitt speaking openly about masculinity to give others permission to do the same.<br />\n<br />\n<br />\nTim Ferriss expressing that external performance is not where \"success\" is and inner work is the harder challenge but more important.<br />\n<br />\n<br />\nLiz’s Recommendations:<br />\n<br />\n<br />\nThe Will to Change: Men, Masculinity, and Love by Bell Hooks (https://www.amazon.com/Will-Change-Men-Masculinity-Love/dp/0743456084) <br />\n<br />\n<br />\nThomas Page McBee (https://www.amazon.com/Thomas-Page-McBee/e/B00NDEXD5Y%3Fref=dbs_a_mng_rwt_scns_share) <br />\n<br />",
  "itunes:author": "Ann Kelley PhD & Sue Marriott LCSW, CGP",
  "itunes:image": "",
  "itunes:season": 4,
  "itunes:episode": 119,
  "itunes:title": "Rethinking Masculinity:  For the Love of Men with Liz Plank",
  "itunes:duration": "49:32"
}