{
  "title": "On the Benefit of Dual-domain Denoising in a Self-supervised Low-dose CT Setting. (arXiv:2211.01111v2 [eess.IV] UPDATED)",
  "link": "http://arxiv.org/abs/2211.01111",
  "description": "<p>Computed tomography (CT) is routinely used for three-dimensional non-invasive\nimaging. Numerous data-driven image denoising algorithms were proposed to\nrestore image quality in low-dose acquisitions. However, considerably less\nresearch investigates methods already intervening in the raw detector data due\nto limited access to suitable projection data or correct reconstruction\nalgorithms. In this work, we present an end-to-end trainable CT reconstruction\npipeline that contains denoising operators in both the projection and the image\ndomain and that are optimized simultaneously without requiring ground-truth\nhigh-dose CT data. Our experiments demonstrate that including an additional\nprojection denoising operator improved the overall denoising performance by\n82.4-94.1%/12.5-41.7% (PSNR/SSIM) on abdomen CT and 1.5-2.9%/0.4-0.5%\n(PSNR/SSIM) on XRM data relative to the low-dose baseline. We make our entire\nhelical CT reconstruction framework publicly available that contains a raw\nprojection rebinning step to render helical projection data suitable for\ndifferentiable fan-beam reconstruction operators and end-to-end learning.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/eess/1/au:+Wagner_F/0/1/0/all/0/1\">Fabian Wagner</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Thies_M/0/1/0/all/0/1\">Mareike Thies</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Pfaff_L/0/1/0/all/0/1\">Laura Pfaff</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Aust_O/0/1/0/all/0/1\">Oliver Aust</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Pechmann_S/0/1/0/all/0/1\">Sabrina Pechmann</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Weidner_D/0/1/0/all/0/1\">Daniela Weidner</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Maul_N/0/1/0/all/0/1\">Noah Maul</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Rohleder_M/0/1/0/all/0/1\">Maximilian Rohleder</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Gu_M/0/1/0/all/0/1\">Mingxuan Gu</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Utz_J/0/1/0/all/0/1\">Jonas Utz</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Denzinger_F/0/1/0/all/0/1\">Felix Denzinger</a>, <a href=\"http://arxiv.org/find/eess/1/au:+Maier_A/0/1/0/all/0/1\">Andreas Maier</a>"
}