{
  "id": "yt:video:EXouzHZ2778",
  "yt:videoId": "EXouzHZ2778",
  "yt:channelId": "UCiZVMOinTQGb8HQu53VbV4Q",
  "title": "Mortal Kombat Vs DC Universe All Cutscenes (Full Game Movie) 4K UHD",
  "link": "",
  "author": {
    "name": "Gamer's Little Playground",
    "uri": "https://www.youtube.com/channel/UCiZVMOinTQGb8HQu53VbV4Q"
  },
  "published": "2022-11-04T18:07:28+00:00",
  "updated": "2022-11-04T18:07:29+00:00",
  "media:group": {
    "media:title": "Mortal Kombat Vs DC Universe All Cutscenes (Full Game Movie) 4K UHD",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "GOTHAM KNIGHTS FULL MOVIE: https://www.youtube.com/watch?v=w4xShUOxrDU\n🔔 Remember to Subscribe and hit the bell! 🔔\n\n\n🌟 DESCRIPTION🌟\n\nAfter Shao Kahn's invasion of Earthrealm is halted by Raiden's forces of light, Raiden blasts and sends Kahn through a portal. At exactly the same time on Earth, Superman stops Darkseid's Apokoliptian invasion by blasting Darkseid with his heat vision as he enters a boom tube. These acts do not destroy either of them, but merge them into Dark Kahn, and causes the DC and Mortal Kombat universes to merge. As this happens, the characters' abilities fluctuate, causing violent \"rage\" outbreaks that are actually the feelings of Dark Kahn being infused in the characters from afar. Because of this, certain characters gain either strength or vulnerability. This allows for such things as the possibility of Superman being defeated due to his vulnerability to magic, and giving the Joker the ability to fight skilled martial artists such as his nemesis Batman and Deathstroke. With each world thinking that the other is responsible for the merger, they fight each other until only one fighter from each side remains: Raiden and Superman. In the final battle, the two fight while Dark Kahn feeds on their rage. Both realizing that neither is working with Dark Kahn, Raiden and Superman overcome their rage for each other and defeat their fused enemy, restoring the two worlds to their normal separation. While everyone else has been sent to their original universe, Darkseid and Shao Kahn have been switched and are both rendered powerless. In the end, they both face eternal imprisonment in the other's universe; Darkseid is restrained in the Netherrealm, while Shao Kahn is trapped in the Phantom Zone.\n\nMortal Kombat Vs DC Universe All Cutscenes (Full Game Movie) 4K UHD includes the full story, ending and final boss of the game. The game was played, recorded and edited by Gamer’s Little Playground team. We recorded the game in 4K 60FPS on the PS3 emulator RPCS3. In short, the video includes the full game, ending and all story related scenes. The video includes the ending, full story, all cutscenes, final boss, all bosses, no commentary, all missions and all cinematics.\n_________________________________\n\n\n🛍  STORE  🛍 \n\nAwesome Shirts and Merch Here: https://www.glpstore.shop/ \n\n_________________________________\n\n🎥 MOVIE LIBRARY 🎥\n\nGame Movies in 4K and 2K.\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmRMPVtnAKZitfRGmQ2OGYoZ\n\nOur Recent Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmQOpPYEoDelidg4A3SciA-B\n\nA-D Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmRGd0tq8bezyN0QFHHtnoEe\n\nE-K Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmTi2NRYbW8Y8eMdQzxfkOfr\n\nL-R Game Movies \nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmSHy85leC3rx5-E8BwpOgZM\n\nS-Z Game Movies\nhttps://www.youtube.com/playlist?list=PL1cvljv8vQmSdCiQvhet-r0Cj31KdLvE_\n\n_________________________________\n\n📱 SOCIAL MEDIAS 📱\n\n► DISCORD: https://discord.gg/heZNbvGEvb\n► Facebook: http://facebook.com/gLpLayground\n► Twitter: http://twitter.com/GLP_Mike\n► Instagram: http://instagram.com/GLP_Mike\n► Instagram: https://www.instagram.com/mysterymrr/\n► Outro Song: https://www.youtube.com/watch?v=G2OhfdEDZ3k\n\n_________________________________\n\n📋 HASHTAGS 📋",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}