{
  "title": "Fifth (and Final) Annual Update",
  "link": "https://www.madfientist.com/fifth-year-of-freedom/",
  "comments": "https://www.madfientist.com/fifth-year-of-freedom/#comments",
  "dc:creator": "The Mad Fientist",
  "pubDate": "Fri, 20 Aug 2021 08:00:35 +0000",
  "category": [
    "FIRE (Financial Independence / Retire Early)",
    "Interviews"
  ],
  "guid": "https://www.madfientist.com/?p=7208",
  "description": "<p class=\"lead\">It's been five years since I left my full-time job so here's my fifth (and final) annual update on post-FI life!</p>\n<p class=\"more-link-p\"><a class=\"btn btn-danger\" href=\"https://www.madfientist.com/fifth-year-of-freedom/\">Read more &#8594;</a></p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/fifth-year-of-freedom/\">Fifth (and Final) Annual Update</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "content:encoded": "\n<p>If you&#8217;ve followed me for a while, you&#8217;ll know that I&#8217;ve released an annual update every year since <a href=\"https://www.madfientist.com/time-has-finally-come/\" target=\"_blank\" rel=\"noopener\">I quit my job</a>.</p>\n\n\n\n<p>It&#8217;s now been five years since I stopped working so this is my fifth (and final) annual update.</p>\n<p>Why is it my final one?</p>\n\n\n\n<p>I explain in today&#8217;s short episode&#8230;</p>\n\n\n<h2>Listen Now</h2><div style='padding:20px'><audio class=\"wp-audio-shortcode\" id=\"audio-7208-5\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://traffic.libsyn.com/secure/madfientist/fifth-year-of-freedom.mp3?_=5\" /><a href=\"https://traffic.libsyn.com/secure/madfientist/fifth-year-of-freedom.mp3\">https://traffic.libsyn.com/secure/madfientist/fifth-year-of-freedom.mp3</a></audio></div><ul><li>Listen on <a href='https://open.spotify.com/show/5AjnvxZb6ZScoI6KCV0hxo' target='_blank'>Spotify</a> or <a href='https://www.madfientist.com/go/itunes/' target='_blank'>Apple Podcasts</a></li><li>Download MP3 by right-clicking <a href='https://traffic.libsyn.com/secure/madfientist/fifth-year-of-freedom.mp3' target='_blank' rel='nofollow'>here</a></li></ul>\n\n\n\n<h2>Highlights</h2>\n\n\n\n<ul>\n<li>How the pandemic highlighted the power of having savings</li>\n<li>Why FI is the ultimate shock absorber and cheat code</li>\n<li>The reasons this annual update will be my last</li>\n<li>What to do when money is no longer a source of motivation</li>\n<li>Why &#8220;Lean FIRE&#8221; may be a bad idea</li>\n<li>Warren Buffet&#8217;s plan for leaving money to his kids (and why it may change your FI target)</li>\n</ul>\n\n\n\n<h2>Show Links</h2>\n\n\n\n<ul>\n<li><a href=\"https://www.madfientist.com/first-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">First Year of Freedom</a></li>\n<li><a href=\"https://www.madfientist.com/second-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">Second Year of Freedom</a></li>\n<li><a href=\"https://www.madfientist.com/third-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">Third Year of Freedom</a></li>\n<li><a href=\"https://www.madfientist.com/fourth-year-of-freedom/\" target=\"_blank\" rel=\"noopener\">Fourth Year of Freedom</a></li>\n<li><a href=\"https://www.madfientist.com/album/\" target=\"_blank\" rel=\"noopener\">The Album</a></li>\n<li><a href=\"https://www.madfientist.com/ultralearning-experiment-results/\" target=\"_blank\" rel=\"noopener\">8 Key Lessons from the Ultralearning Experiment</a></li>\n<li><a href=\"https://www.madfientist.com/ramit-sethi-interview/\" target=\"_blank\" rel=\"noopener\">Episode with Ramit Sethi</a></li>\n</ul>\n\n\n\n<h2>Full Transcript</h2>\n\n<div class=\"transcript\">\n<strong>Mad Fientist:</strong> Hey what&#8217;s up everybody, it&#8217;s the Mad Fientist. Welcome to the Financial Independence Podcast.  \n<br/><br/>\nSorry it&#8217;s been a while since my last episode but after being trapped in Scotland for 15 months because of the pandemic, I was finally able to make it back to the States and I just decided to take a few months off so I could focus on spending a lot of quality time with the family that I had been missing over the past year.  \n<br/><br/>\nSo since it&#8217;s been a while, I just have a short episode today to get back into the swing of things.  \n<br/><br/>\nIf you&#8217;ve listened to the show before you know that every year on my anniversary of leaving work I&#8217;ve posted either a podcast or an article about some of the things that I&#8217;ve learned over the past year and this is actually my fifth one so that means five years ago, on August 1st, was the last day I went into a normal job and I really can&#8217;t believe it&#8217;s been five years but it has so this is my five year update and I actually think it&#8217;s gonna be my last and I&#8217;ll explain more as this episode continues on but yeah, I really don&#8217;t feel like I&#8217;m gonna do any more of these annual updates so rather than ramble on let&#8217;s just dive into everything that I learned over the past year of post-FI life!\n<br/><br/>\nSo let&#8217;s start with the good stuff&#8230;so the pandemic has just highlighted how valuable having savings is and yeah, FI savings is obviously great because you don&#8217;t have to work at all but even some amount of savings just to give you the power to do other things is so important.\n<br/><br/>\nSo many times over the last year, it&#8217;s been apparent that just how valuable that is&#8230;from Jill not having to work when she felt like it was unsafe to do so, to not really having to go inside anywhere for any reason at all and being able to just isolate properly when necessary, to just coming back from our travels to the States and having to quarantine for 10 days in the UK&#8230;that would have been extremely stressful if we were juggling full-time jobs or had some places we needed to be but we were able to just roll with it and be like, okay we just have to stay hunkered down for 10 days and it&#8217;s not fun but it&#8217;s not a huge deal.  So this past year, more than any other, just really highlighted how valuable that is and I actually just came across a quote that perfectly sums it up and it was on the Planing our Pennies&#8217; blog, and it was Mrs. PoP&#8217;s last article, and in it she said, &#8220;There&#8217;s no downside to having a high net worth&#8230;it acts like a giant shock absorber that smooths over life&#8217;s bumps and after a while it feels like life is a game and you&#8217;ve discovered the mother of all cheat codes.&#8221; That quote to me is just perfect because the giant shock absorber that smooths over life&#8217;s bumps, I think is the perfect way to describe that feeling of having a nice chunk of savings in the bank over the last year.  As you know, the world has been so uncertain and everything&#8217;s a bit weird and scary and just having that financial peace of mind to know that you can roll with the punches and you can get over some of these hurdles that are unexpected and it just takes so much stress and anxiety away that&#8230;you know, when I was a teenager, what if my car breaks down?  I don&#8217;t want to spend $500&#8230;that would use up all my money if I had to fix a car problem or if anything else broke that I wasn&#8217;t expecting and the more you build up the less stressed you get about these unexpected things that do happen in life and this past year just highlighted how important that is for my mental well-being&#8230;just to know that there&#8217;s there&#8217;s enough there and you can deal with things that happen and life&#8217;s bumps are going to be a lot more smoothed out because, as Mrs. PoP said, you have this giant shock absorber that can make any bumps you do face a lot smoother and easier to deal with.\n<br/><br/>\nMoving on to the absolute best thing that happened over the past year is that I finally released the album that I had been wanting to write my entire adult life.  And this was the whole reason I wanted to achieve FI in the first place, actually.  I thought it was my job that was getting in the way of me doing this and I thought I&#8217;d have to save up enough so that I would never have to work again in order to devote the proper time to actually achieve this big goal of mine and it turned out that I didn&#8217;t actually need to do that because the thing that was holding me back all these years of trying to achieve this is wasn&#8217;t my job, because I had plenty of spare time that I could have used towards working towards it.  It was actually a lot of mental hang-ups I had about trying to pursue it, because I was worried I&#8217;d fail, and so I probably could have actually done it when I had a job, but it did take achieving FI, and then a global pandemic to lock me inside for a year, to do it.\n<br/><br/>\nBut I actually did it and it is by far the thing that I&#8217;m most proud of and if you&#8217;ve listened to it, you know it&#8217;s not going to win a Grammy or be on the radio or anything like that but it was the thing that I really wanted to accomplish more than any other and it was definitely the most difficult thing that I&#8217;ve tried to do so the fact that I was able to actually do it after all these years of not being able to, and not really believing I&#8217;d ever be able to was just a huge personal accomplishment for me and is something that i&#8217;m really proud of and I look forward to writing the next one because I&#8217;ll hopefully be in a completely different mindset than I was leading up to this one and now that I know I can do it, then i&#8217;m expecting this next one&#8217;s going to be a lot more fun to make.  So I&#8217;m really looking forward to that but since this was the whole reason I wanted to achieve FI in the first place, that&#8217;s why I don&#8217;t think I&#8217;m going to do any more of these annual updates because every other annual update that I&#8217;ve given has sort of been revolving around me trying to get to this goal because that was like the end of my FI journey so now that I&#8217;ve done that, it doesn&#8217;t make sense to do any more annual updates because now it&#8217;s just a case of just living life as anyone is living life.  And the money equation is solved, and I was able to accomplish the thing that I wanted FI to lead to so any other future updates&#8230;I just don&#8217;t see the point of them really because it doesn&#8217;t have much to do with achieving FI in my eyes.  So it makes sense to just end on this high note and this will be the the final annual update.\n<br/><br/>\nSince I&#8217;m talking about the album, I just want to thank all of you guys out there who pre-ordered it and made the release week of the album even more exciting and that is because you guys helped me actually get onto the Billboard charts, which is ridiculous, especially considering the type of music it is and has no business being anywhere near the charts, so just want to thank you so much for that because it made it even more exciting than it was to begin with.  And even though nothing really came from being on the charts for one week, it just adds to the ridiculousness of my adult life so far.  I still smile anytime that I think about it so thank you for the support, it really meant a lot to me.  And if you haven&#8217;t checked out the album yet then you can go to madfientist.com/album and there&#8217;s a Spotify QR code that you can open up Spotify on your phone and do the search-by-image feature and then it&#8217;ll just pop up the album or you can just enter your email address and I will send you an email with all the links to the album and also tell you where I did end up on the chart for that amazing week way back in February.  And while you&#8217;re there in Spotify or Apple Music or wherever you listen to music, if you could follow me there, that would be great because that&#8217;s hopefully where a lot more activity is going to be happening over the next couple years.\n<br/><br/>\nSo those were the really positive things over the last years that are FIRE related.  \n<br/><br/>\nOne of the things that still is a challenge for me that i&#8217;m working through is losing money as a motivating factor.  I&#8217;ve written about this in the past, and I&#8217;ve maybe even talked about it on podcast, but for someone like me who has been focused on money for as long as I can remember and has been trying to you know reach FI and do all these saving goals, money has been a huge motivating factor in my decisions.  So from studying hard in high school, to what I majored in in college to what jobs I chose and everything.  And now, when money isn&#8217;t as important or more money isn&#8217;t as important&#8230;losing that as a source of motivation has been really interesting and I&#8217;m still not exactly sure I&#8217;ve come to grips with it and it&#8217;s almost made me rethink what I recommend for other people because I think being motivated by earning money is a positive thing and&#8230;I just came across a quote from Warren Buffett recently and it&#8217;s actually a quote about how he intends to leave money to his children and the quote is, he plans to leave them enough money so that they can do anything but not so much that they could do nothing and one I think that&#8217;s a great way to think about how much money you leave your kids but it also made me reflect on where I&#8217;m at now and, like I said, there&#8217;s no really motivation to earn more money and even though I&#8217;m incredibly lucky to be in that position, it still comes with complications because technically, yeah I don&#8217;t have to do anything but a lot of things in life come when you&#8217;re being forced to do something maybe you don&#8217;t exactly want to do, like for instance, going into work&#8230;yeah, it&#8217;s not great but you get this forced socialization that you may not have had and you&#8217;re interacting with people that are outside your social circle that may be difficult at times but it is also really rewarding and&#8230;to go back to the album, right now I could potentially promote it a lot more, which would then maybe get me signed to an indie label, which would then open up a lot of doors for fun music festivals to perform at, and things like that.  But since I don&#8217;t have money motivating me to reach out to the labels or get myself out there on social media or do any of these not-fun things in the short term, then I&#8217;m potentially missing out on a lot more fun in the long term so so that Buffett quote really made me think about FIRE in a new light and it made me think maybe the ideal savings goal to save enough so that all your essential expenses are covered and then continue working to fund your discretionary expenses.  So to go back to the Buffett quote, that would allow you to do anything, because you could technically survive by leaving your job and doing whatever you wanted to at that stage, so you could do anything at that point but it&#8217;s not really enough to allow you to do nothing.  Because you could get by and survive but there would be absolutely no fun in your life, which you wouldn&#8217;t want to continue for very long, so maybe that&#8217;s a good sweet spot&#8230;to save up enough so that all your essential expenses are covered so you can eat and you can have shelter and you can be warm and all the things that are essential for survival, so that then frees you up to do anything you want with your life but it&#8217;s not enough that you get comfortable and you do nothing.  And that may be a good sweet spot for motivation but on the flip side, most of the really great benefits that I talked about at the beginning of the episode&#8230;feeling like you can handle anything that comes to you and not having the stress and anxiety about future bumps in the road and all those things&#8230;those only really started to come into effect when we felt like we had more than enough.  So i&#8217;m not exactly sure what my conclusion is on this because on one hand, I feel like Fat FIRE is the way to go in in the sense that having more than enough and knowing that you&#8217;re gonna be okay no matter what comes around in the next few years or whatever, I think that is really valuable.  But then on the other hand, losing money as a motivation is difficult because then you don&#8217;t have to do things and I think maybe you miss out on things just because in the short term, they may be a little uncomfortable and since you don&#8217;t have to do these uncomfortable things, you don&#8217;t but then you&#8217;re potentially missing out on some long-term benefits.\n<br/><br/>\nSo I&#8217;m not exactly sure where I fall on this but I think that maybe Lean FIRE is something to avoid because you don&#8217;t get either in that sense so you&#8217;re you&#8217;re not feeling like you have so much extra that you can handle whatever comes at you in the future years but you have enough that you don&#8217;t really have that money motivation to continue doing things.   So I&#8217;d be interested to hear your thoughts on this but at least in my really early days thinking about this topic, I&#8217;m thinking maybe Lean FIRE is probably not the way to go and maybe one of those other two bookends is a better goal for your FI savings.  But again, this is really early days in my thinking on this so i&#8217;d be interested to hear your opinions on it so head to madfientist.com/episode61 and leave a comment because i&#8217;d be interested to hear what you think about it.\n<br/><br/>\nContinuing on from the having more than enough idea, I&#8217;m trying to also think about my spending and trying to deprogram my frugality in a sense, because as I discussed with Ramit Sethi on the podcast interview I had with him, I know that I&#8217;m a bit too extreme in that sense.  And now that the market has recovered and finances are looking good, I know that I don&#8217;t need to be that frugal with things and I know that there&#8217;s potentially ways I can increase my spending that are not wasteful, because i&#8217;ll never be wasteful with money, but at least I can start thinking about ways to use my money in a positive and beneficial way, so that&#8217;s definitely something I plan to either write about more or maybe get Ramit back on the show to talk about more because I i feel like that&#8217;s a common problem with people like me, who are naturally frugal or have a frugal upbringing, sort of trying to deprogram some of that when it&#8217;s no longer necessary to be that extreme in your frugality.  So stay tuned for a deeper dive into that topic and if that&#8217;s something that you&#8217;re interested in, subscribe to the email list, which is definitely the best way to stay up to date with this stuff now because i&#8217;m posting even more sporadically than I used to in the past because i&#8217;m obviously working a lot more on the music project.  So if you&#8217;re wanting to just get updated whenever a new post or podcast comes out, just head to madfientist.com/advice and you can put your email address in there and you&#8217;ll get a pdf of all the great advice I&#8217;ve received on the Financial Independence Podcast from my guests over the years.  And if you want to check out the past four years of my annual updates I will link to all of those in the show notes of this episode so you can go to madfientist.com/episode61 and from there you&#8217;ll find all the other episodes and articles about everything that I learned in my previous four years of FI.\n<br/><br/>\nSo that was a short but sweet one today.  I have some other interviews coming up that I&#8217;ll be publishing soon but I hope you&#8217;re all doing well out there hopefully you&#8217;ve been able to meet up with your friends and family that you hadn&#8217;t seen for a while.  Anyway, thanks a lot for listening and I&#8217;ll see in the next one!\n</div>\n\n\n\n\n<h2>Related Post</h2><div><a href='https://www.madfientist.com/fourth-year-of-freedom/' target='_blank'><div class='post_card'><div class='post_card_text'><h3 style='color:#399da8;'>Valuable Lessons from My Fourth Year of Freedom</h3><p class='post_card_excerpt'>It's been 4 years since I left my job and what a crazy year it's been!  Here's what I learned from the last year of post-FI life (and the COVID crisis)</p></div><div class='post_card_image'><img src='https://www.madfientist.com/wp-content/uploads/2020/08/fourth-year-of-freedom.jpg' style='border-radius:7px;'/></div></div></a></div>\n<p>The post <a rel=\"nofollow\" href=\"https://www.madfientist.com/fifth-year-of-freedom/\">Fifth (and Final) Annual Update</a> appeared first on <a rel=\"nofollow\" href=\"https://www.madfientist.com\">Mad Fientist</a>.</p>\n",
  "wfw:commentRss": "https://www.madfientist.com/fifth-year-of-freedom/feed/",
  "slash:comments": 53,
  "enclosure": ""
}