{
  "title": "EPISODE 27 Jack Johnson (Part 2): The Fight",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 07 Dec 2017 18:00:00 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2017/12/7/episode-27-jack-johnson-part-2-the-fight",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5a29758df9619a6c89adb2ad",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1512667560156-SRCLJZ4R0M0JNGW6ML7P/image-asset.jpeg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"\" data-load=\"false\" data-image-id=\"5a2979a60d9297d59bf5d2af\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1512667560156-SRCLJZ4R0M0JNGW6ML7P/image-asset.jpeg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“And it was fast cars and whiskey<br>Long legged girls and fun<br>I had everything that money could bring<br>And I took it all with a gun”</em><br>—&nbsp;from the song <em>I’ve Never Picked Cotton</em></p><p class=\"\"><em>“Johnson did not care. He had no use for the bourgeois values of thrift and respectability.”</em>&nbsp;—Randy Roberts </p><p class=\"\"><em>“You don’t catch Jim Jeffries losing to a colored man.”</em>&nbsp;— Jim Jeffries</p><p class=\"\"><em>“Quite conceivably there had never been a more important athletic event in American history.”</em> — Randy Roberts&nbsp;</p><p class=\"\"><em>“Even those who have an absurdly exaggerated horror of prize fighting as a ‘brutal’ sport should gently warm in their sensitive minds a little hope that the white man may not lose, while the rest of us will wait in open anxiety the news that he has licked the—well, since it must be in print, let us say the negro, even though it is not the first word that comes to the tongue’s tip.” —</em> New York Times</p><p class=\"\">By 1900, the federal government had long abandoned Reconstruction, and white supremacy was returning to the South with a vengeance. Jim Crow was in full swing. Segregation was the law of the land. And Fifty years before Jackie Robinson challenged segregation in baseball, there was Jack Johnson.&nbsp;</p><p class=\"\">Lynching was a weekly event. Any black man in the South not acting subservient could find himself dangling from a tree. Even African American leaders like Booker T. Washington preached that accepting segregation, keeping one’s head down, and working hard were the best options for black people.</p><p class=\"\">Jack Johnson clearly didn’t get the memo.</p><p class=\"\">At this time when simply looking a white man in the eyes, or talking to a white woman, could get one lynched, Jack Johnson made a living beating the hell out of white men in the ring. Living defiantly as if prejudice didn’t exist—he felt—was the best way to defeat racism.&nbsp;</p><p class=\"\">It would be easy to mistake Jack Johnson’s story simply as a tale of standing up to racism. It’s about that—sure. But it’s also about a lot more. Because as much Jack Johnson stared down white supremacy, he also battled those black people who insisted that he behaved like a hard-working, God-fearing role model. But JJ wasn’t about to trade a cage for another. He wouldn’t be anyone’s puppet. He would have no master telling him how to live—not white ones, but no black ones either. His story is the tale of a man who, in spite of a time and place that would not allow it, was on a defiant quest to be free, and live life on his own terms.&nbsp;</p><p class=\"\">In this episode:</p><ul data-rte-list=\"default\"><li><p class=\"\">Public Enemy Number One</p></li><li><p class=\"\">At home in the integrated criminal underworld</p></li><li><p class=\"\">Ladies and fast cars</p></li><li><p class=\"\">Jack Johnson’s intellectual side</p></li><li><p class=\"\">The Great White Hope</p></li><li><p class=\"\">Knocking out and befriending Stanley “The Assassin” Ketchel</p></li><li><p class=\"\">“I am going into this fight for the sole purpose of proving that a white man is better than a negro.” Jim Jeffries</p></li><li><p class=\"\">Why the Governor of California prohibited the fight</p></li><li><p class=\"\">Death threats and attempted poisonings</p></li><li><p class=\"\">Jack Johnson’s eerie calm under pressure <br>A spectator: “He’ll kill you, Jack.”<br>Jack Johnson: “That’s what they all say.”</p></li><li><p class=\"\">The verbal fight with Jim Corbett</p></li><li><p class=\"\">Triumph and riots in over 50 cities</p></li></ul><p class=\"\">This episode is sponsored by <a href=\"http://www.flaviar.com/exclusive\">Flaviar</a>, the world’s largest online club of spirits enthusiasts. Members get a themed tasting box that let you try different spirits before buying a full sized bottle, and access to their Vault which holds a selection of rare and hard to find spirits available to members only. Please, check them out and use the coupon code HISTORY at checkout.&nbsp;</p><p class=\"\">This episode is sponsored by <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a> For less than $ 10 per meal, Blue Apron delivers straight to your door seasonal recipes along with pre-portioned ingredients to make delicious, home-cooked meals. Get your first three meals free—with free shipping—by going to <a href=\"http://www.blueapron.com/onfire\">www.blueapron.com/onfire</a>&nbsp;</p><p class=\"\">A big thank you for the support to the podcast <em>How It Began: A History of the Modern World</em> by Brad Harris. Brad holds a PhD in history from Stanford University and is the host of a great new podcast focusing the most important scientific, technological and cultural advancements in history. So, please check out his podcast and his website <a href=\"https://howitbegan.com/\">https://howitbegan.com/</a>&nbsp;</p><p class=\"\">Please, also show some love to my regular sponsors by shopping for supplements, special foods, clothing and exercise equipment at <a href=\"http://www.onnit.com/history\">http://www.onnit.com/history</a> and receive a 10% discount.&nbsp;</p><p class=\"\">And if you are in the market for backpacks, computer bags and other hemp gear, check out my favorites at <a href=\"http://www.dsgear.com\">http://www.dsgear.com</a>&nbsp;</p><p class=\"\">PATREON NEWS: I have just started a Patreon account!!!! If you feel in a generous mood, please, check it out at <a href=\"http://www.patreon.com/historyonfire\">www.patreon.com/historyonfire</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>. Thank you to Onnit, Datsusara, Float Clinic, Shaman’s Simple Solutions, War Fuel, Proven Nutrition, and Fight Chix for sponsoring her for her first MMA fight. If you’d like to check out Fight Chix merchandise, you can get a 20% discount by going to <a href=\"http://www.fightchix.com/\">http://www.fightchix.com/</a> and entering the code Fire20 upon checkout.</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "itunes:author": "Daniele Bolelli",
  "itunes:explicit": "no",
  "itunes:duration": "2:04:48",
  "itunes:image": "",
  "itunes:season": 1,
  "itunes:episode": 27,
  "itunes:title": "EPISODE 27 Jack Johnson (Part 2): The Fight",
  "itunes:episodeType": "full",
  "enclosure": "",
  "media:content": {
    "media:title": "EPISODE 27 Jack Johnson (Part 2): The Fight"
  }
}