{
  "title": "“Let the land be”: culture, heritage, and economic development in Melaka",
  "link": "https://www.newmandala.org/let-the-land-be-culture-heritage-and-economic-development-in-melaka/",
  "dc:creator": "Julia Merican",
  "pubDate": "Fri, 28 Oct 2022 03:48:08 +0000",
  "category": "Malaysia",
  "guid": "https://www.newmandala.org/?p=60157",
  "description": "<p>Lacking faith in public and private institutions the Kristang community is taking matters in its own hands.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/let-the-land-be-culture-heritage-and-economic-development-in-melaka/\">“Let the land be”: culture, heritage, and economic development in Melaka</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n",
  "content:encoded": "<p>“The sea will always take back what you take from the sea.”</p>\n<p>We are sitting in the veranda of a house on Texeira Road in Melaka’s Portuguese Settlement, listening to a presentation by Frits, a Dutch activist who has lived in Malaysia for 25 years. A dangerously low ceiling fan is swinging above the heads of an assortment of people, many of them in turquoise polo t-shirts emblazoned with the logo of a bumbling tapir.</p>\n<p>Following our in-depth case study on the <a href=\"https://www.brimonitor.org/case-studies/melaka-gateway/\">Melaka Gateway</a>, an integrated seashore development venture aiming to build the largest private marina in Southeast Asia through land reclamation, we are here to listen to the stories of Melakans who have borne the brunt of the project’s pitfalls. This is the first informal gathering of the Fresh Air, Clean Water initiative, a collaborative effort between the Portuguese Settlement’s Kristang community and the Malaysian Nature Society to amend the environmental damages wrought upon their land and sea.</p>\n<p>Located in Ujong Pasir, a few kilometres from Melaka’s city centre, the Portuguese Settlement is a rare bastion of present-day Catholicism in Malaysia, as well as a unique symbiosis of the nation’s colonial past. A relic of both <a href=\"https://www.academia.edu/28914157/Language_Maintenance_or_Language_Shift_in_the_Portuguese_Settlement_of_Melaka_in_Malaysia?from=cover_page\">the Portuguese reign of Melaka in 1511 and the Dutch takeover in 1641</a>, the settlement was officially established by two Catholic priests in 1933, under the state’s succeeding British rule. It remains home to around <a href=\"https://www.malaysianow.com/multimedia/2021/11/18/life-in-melakas-portuguese-settlement\">1,500 members</a> of Malaysia’s ethnic Eurasian community of Portuguese-Dutch, Malay, Indian and Chinese descent, all of whom speak a Melakan-Portuguese creole known as <a href=\"https://rightnow.org.au/opinion-3/unique-community-put-pressure-development/\"><em>Papia Kristang</em></a>, which has been <a href=\"https://www.endangeredlanguages.com/lang/1459\">declared an endangered language</a>.</p>\n<p>As one of the countries that has supported <a href=\"https://www.newmandala.org/future-xis-belt-road-intiative/\">the BRI</a> land and maritime network strategy since its conceptualisation and been keen to hop onto <a href=\"https://www.newmandala.org/chinese-investment-in-southeast-asia-2005-2019-patterns-and-significance/\">China’s investment programme</a>, Malaysia has seen a huge influx of Chinese-backed infrastructure projects over the last decade, among them, the Melaka Gateway.</p>\n<p>The project was inaugurated in 2014. Three years later, its private local developer, KAJ Development (KAJD), signed an agreement with three Chinese state-owned enterprises to invest in and develop <a href=\"https://www.iseas.edu.sg/images/pdf/ISEAS_Perspective_2019_78.pdf\">three of the project’s islands</a>. Although the Melaka Gateway has since tried to distance itself from any direct association with Beijing’s initiative—the official project website has now removed its statement that its development plan “aligns with the principles of [the BRI] as strategized by China”—it has not been entirely successful at shaking off the yoke that it once welcomed so warmly. The project is still largely referred to as one of Malaysia’s chief Belt and Road projects, a moniker bequeathed upon its conception by China’s Minister of Transport, who named it <a href=\"https://www.forbes.com/sites/wadeshepard/2020/01/31/inside-the-belt-and-roads-premier-white-elephant-melaka-gateway/\">“the forefront flagship in support of the One Belt, One Road Initiative initiated by the People’s Republic of China”</a>.</p>\n<p>Intending to reinstate Melaka’s reputation as a key port of call for trade, the Gateway’s design incorporated the development of four islands: two of them reclaimed, one existing, and one an extension from the shore into the sea. The islands are collectively intended to be a tourism and entertainment hub, with a theme park and esplanade, a financial centre, a seaport for liquid cargo, and a maritime industrial park.</p>\n<p>After a series of legal disputes, the project was terminated in 2021 by the state government. In 2022, however, it was inexplicably revived and returned to its private developer in what the Melaka state government chose only to call an <a href=\"https://www.thestar.com.my/news/nation/2022/03/09/melaka-gateway-project-goes-back-to-developer\">amicable solution</a>.</p>\n<p>Frits is sharing a presentation of Melaka’s land reclamation videos that have been captured by his drone. The footage shows flecks of land that have been reclaimed along the coast of Melaka from 1995 up until today. Land reclamation, he tells us, is the process of creating new land from bodies of water by filling dredgers with sand and dumping them on the sites again and again. He tells us that it is possible to successfully reclaim land, but it has to be well-maintained. “Every high tide, seawater comes in and mixes with the sand, and at low tide, the sand is pulled back out. This happens 24/7, 365 days a year,” he remarks. “The sea takes back what you take from the sea.”</p>\n<p>The Melaka Gateway is situated close to the Portuguese Settlement, and the project’s struggle to contend with its slew of associated environmental issues has had a cataclysmic effect on the Kristang community. There has been vocal opposition towards the project’s implementation: in 2018, more than 200 settlement <a href=\"https://www.theedgemarkets.com/article/portuguese-folk-protest-against-melaka-gateway-project-coffins\">residents protested outside KAJD’s headquarters</a>, some of them lying in coffins while others threw sand over them to symbolise the effect of the project’s reclamation activities on their livelihoods. A primary concern among residents has been the Melaka Gateway’s failure to comply with a critical infrastructural prerequisite: a 750-metre channel that will separate the project site from the settlement’s coast. As it stands, this channel is only 200 metres long, which increases the volume of silt and mud on the settlement’s shoreline. Already, this has caused an increase of flash floods in the area, and a marked decrease in marine life due to the water’s increased turbidity. Martin Theseira, a stalwart Portuguese community activist and our host for this event, tells us that he hasn’t seen any small shrimp—locally known as <em>udang geragau</em>—inland in Melaka for almost a decade. “As this is a seafaring community, cutting off the Portuguese Settlement’s access to the sea is cutting off their lifeline,” he tells us. “For the developers, it’s a matter of profit. For us, it’s a matter of survival.”</p>\n<p>We learn from Frits and Martin that poor management is an overarching problem with all land reclamation projects in Melaka. In projects that pre-date the Gateway, there was little separation between the reclaimed land and the mainland, meaning that the new land would have its own below-surface water infrastructure that collided with that of the existing land. This is why flash floods are rampant in Melaka, because when it rains heavily inland, water cannot flow out easily.</p>\n<p>A key issue with the Melaka Gateway in particular, however, is the project’s dire lack of an updated environmental impact assessment (EIA). “An EIA has a lifespan of five years, but in 2014, KAJ Development used an EIA from 1998.” He reminds us that any EIA is incomplete without a social impact assessment (SIA) and the lesser-known heritage impact assessment (HIA), both of which are dependent on the specific communities that projects affect. “Melaka is historical, but these projects are driven by greed. Where is the consideration of the state’s heritage and cultural history?”</p>\n<p>Martin tells us that he has done drone studies with Frits and sent them to local parliament, to no avail. “There have been no plans to conduct follow-up visits to the project sites from the government,” Frits says. “The worst part is that nobody cares. There is no one to lodge a complaint to.” He also points out the paradox of creating a marina while destroying the sea. “The pictures of the blue water promised in the Melaka Gateway’s photographs will not be a reality, because the silt from the river is so polluted.”</p>\n<p>On a walk around the settlement later, Martin shows us the reality of the situation. As far as the eye can see, the water is brown and caked with mud; closer to the shore, there is a dead fish floating belly-up in the dregs of silt-stained weeds. It is a terrible sight.</p>\n<p>When they cast their nets, the Portuguese fishing community often drag up branches and construction waste that tear through their equipment. What they earn is not enough to pay for these damages. “The amount of loss in resources is huge,” Martin says. “There is no proper monitoring of the situation by the authorities. The welfare of our fishermen communities must be taken into consideration in these infrastructure projects. They don’t want to be compensated; they want to continue with their livelihoods.” <em class=\"help-text\">\n\t<div class=\"post alignleft\">\n\t\t<div class=\"post-image\">\n\t\t\t<span class=\"post-label\">\n\t\t\t\tRelated\t\t\t</span>\n\t\t\t\n\t\t\t\t\t\t\t<a href=\"https://www.newmandala.org/civil-society-in-the-mekong-what-can-we-learn-from-environmental-struggles/\">\n\t\t\t\t\t<img width=\"276\" height=\"184\" src=\"http://www.newmandala.org/wp-content/uploads/cache/2022/08/P1180758_cropped/3645296265.jpg\" class=\" wp-post-image\" alt=\"\" loading=\"lazy\" />\t\t\t\t</a>\n\t\t\t\t\t</div><!-- /.post-image -->\n\t\n\t\t<h3 class=\"post-title\">\n\t\t\t<a href=\"https://www.newmandala.org/civil-society-in-the-mekong-what-can-we-learn-from-environmental-struggles/\">Civil society in the Mekong: What can we learn from environmental struggles?</a>\n\t\t</h3><!-- /.post-title -->\n\t\t\n\t\t\t\t<div class=\"post-entry\">\n\t\t\t<p>As political space contracts, the role for informal networks or coalitions expands. </p>\n\t\t</div><!-- /.post-entry -->\n\t\n\t\t<div class=\"post-actions\">\n\t\t\t<div class=\"post-meta\">\n\t\t\t\t<p>\n\t\t\t\t\t\t<a class=\"post-author\" href=\"https://www.newmandala.org/author/rupture/\">The Rupture Project</a>\n\t\t\t\t\n\t\t\t\t\t16 August, 2022\t\t\t\t</p>\n\t\t\t</div><!-- /.post-meta -->\n\t\t</div><!-- /.post-actions -->\n\t</div><!-- /.post -->\n\t</em></p>\n<p>The discussion we are attending is focused on implementing nature-based solutions to the environmental damage that has already been wrought. With disappearing faith in the public and private institutions that have failed to put them into consideration, the Kristang community is taking matters into their own hands. This is where their collaboration with the Malaysian Nature Society (MNS) comes in.</p>\n<p>In October 2021 and July 2022, MNS conducted two reviews of the site to see how to bring seawater back to the jetty. Their initial idea was to redirect waterways by bringing water in and blocking certain areas to deepen the channel through natural means. However, after Martin and Frits shared their insights about the low tides in these areas, MNS has now had to change plans. “We cannot force nature anymore,” a representative tells us.</p>\n<p>The Fresh Air, Clean Water initiative is now adapting that initial idea to make use of nature-based solutions to address some key issues. As this is their first joint event, they discuss their plans to build a dam at the edge of the waterway to study the movement of the sediment. MNS representatives stress the importance of studying what is happening in the currents in these areas, and then adjusting the structure as needed. Their plan is to build a dam to the drain, make a channel in its centre, and connect that channel to the drain to bring out the dirt. Although a modest solution facilitated by a small fund, it requires the commitment of a number of communities, including the Kristang community, the nationwide arms of the Malaysian Nature Society, as well as Melakan youth volunteers.</p>\n<p>Another solution the initiative puts forward is to create mangroves or wetland areas that would be a source of ecotourism. Standing in direct contrast to the Ferris wheels and high-rise buildings put forward by the Melaka Gateway, this idea is a sustainable approach to tourism in the state, and one that feels far more in line with Melaka’s reputation as a UNESCO World Heritage urban centre. In another conversation with Martin and a member of the Democratic Action Party, YB Khoo Poay Tiong, who has publicly questioned the economic viability of the Melaka Gateway on multiple occasions, we hear that Melaka has a large number of emptying shop-lots, or “ghost towns”. YB Khoo mentions that all the Melakan government’s statements about the sizable economic gains these projects will usher in—which was the prime reason for the Melaka Gateway’s sudden rejuvenation—are merely <em>cakap kosong</em>, empty promises. “They never state the exact breakdown of where these economic gains will come from,” YB Khoo tells us. “The viability of these projects isn’t properly thought through. If they really wanted all these people to come to visit the Melaka Gateway, the city would be crammed beyond its capacity. How would that work?”</p>\n<p>The idea for bringing the mangroves back in a controlled manner, Martin tells us, is also because they are breeding grounds for seafood, which could help to improve the local food supply and support the livelihoods of the settlement’s fishermen. “Of course, this needs to be designed properly with the community,” he emphasises, for too many mangroves would potentially block the sea breeze.</p>\n<p>What is lost in the name of economic development, then? Culture, heritage, a symbiotic existence with one’s environment. Martin is keen to stress that the Portuguese community are not against the concept of modernisation, but they are against thoughtless infrastructure projects that are carried out at the expense of communities. “Anyone can call up the government for concessions to reclaim land, and these are being granted without proper consideration or environmental planning,” he laments. “What is happening? What is the purpose of such indiscriminate reclamation? What are you trying to build? Development must not be at the expense of any community, especially this community, which is struggling to survive. Let the sea be the sea. Let the land be.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://www.newmandala.org/let-the-land-be-culture-heritage-and-economic-development-in-melaka/\">“Let the land be”: culture, heritage, and economic development in Melaka</a> appeared first on <a rel=\"nofollow\" href=\"https://www.newmandala.org\">New Mandala</a>.</p>\n"
}