{
  "title": "#490: Why Johnny Depp Left Fantastic Beasts, and Who Should Play Grindelwald Now",
  "link": "https://audioboom.com/posts/7725878",
  "enclosure": "",
  "media:content": "",
  "itunes:duration": 3228,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<ul>\n<li>Thanksgiving is all about family; join us for a Weasley Family-themed Quizzitch Live on Sunday, November 22nd!</li>\n<li>Breaking News: Johnny Depp is OUT as Grindelwald! Warner Bros <a href=\"https://www.bbc.com/news/entertainment-arts-54846285\">reportedly asked</a> Johnny to leave the role.</li>\n<li>Andrew breaks down what happened and details a chain of events.</li>\n<li>Why is this happening now, and why didn't it happen sooner?</li>\n<li>WB gave him the professional courtesy of stepping down with dignity, but was Johnny Depp actually fired?</li>\n<li>Is <em>Fantastic Beasts</em> a doomed series? Is it a sinking ship of controversy? Is it <em>cursed</em>?</li>\n<li>Hosts read listener-submitted casting suggestions for a new Grindelwald, and we present our own suggestions!</li>\n<li>Would Colin Farrell come back as Graves/Grindelwald, and would that make sense?</li>\n<li>Will Grindelwald's appearance be worked into the plot of future films? And will this still be 5-part series?</li>\n<li>Guess That Book returns! Can the hosts correctly guess what Harry Potter book that four out-of-context audio clips are from?</li>\n<li>Quizzitch: Actor Jamie Campbell Bower starred alongside Johnny Depp in what film before <em>FB2</em>?</li>\n<li>Chicken Soup For The MuggleCast Soul</li>\n<li>This week's episode is sponsored by BetterHelp (visit <a href=\"http://www.BetterHelp.com/mugglecast\">BetterHelp.com/mugglecast</a> for 10% off), <a href=\"http://www.usualwines.com\">UsualWines</a> (Use our discount code 'mugglecast' for $8 off and your first wine on us!), and ThirdLove (Visit <a href=\"http://www.ThirdLove.com/mugglecast\">ThirdLove.com/mugglecast</a> for 10% off your first purchase).</li>\n<li>Support us on Patreon and receive magical benefits, like Bonus MuggleCast! And, participate in our magical Holiday gift exchange.</li>\n</ul>\n<div><br>\n</div>\n",
  "pubDate": "Mon, 09 Nov 2020 17:31:38 +0000",
  "guid": "tag:audioboom.com,2020-11-09:/posts/7725878",
  "itunes:author": "Harry Potter",
  "dc:creator": "Harry Potter",
  "media:rights": ""
}