{
  "title": "Hydration of a side-chain-free n-type semiconducting ladder polymer driven by electrochemical doping. (arXiv:2211.01517v1 [cond-mat.mtrl-sci])",
  "link": "http://arxiv.org/abs/2211.01517",
  "description": "<p>We study the organic electrochemical transistors (OECTs) performance of the\nladder polymer, poly(benzimidazobenzophenanthroline) (BBL) in an attempt to\nbetter understand how an apparently hydrophobic side-chain-free polymer is able\nto operate as an OECT with favorable redox kinetics in an aqueous environment.\nWe examine two BBLs of different molecular masses from different sources. Both\nBBLs show significant film swelling during the initial reduction step. By\ncombining electrochemical quartz crystal microbalance (eQCM) gravimetry,\nin-operando atomic force microscopy (AFM), and both ex-situ and in-operando\ngrazing incidence wide-angle x-ray scattering (GIWAXS), we provide a detailed\nstructural picture of the electrochemical charge injection process in BBL in\nthe absence of any hydrophilic side-chains. Compared with ex-situ measurements,\nin-operando GIWAXS shows both more swelling upon electrochemical doping than\nhas previously been recognized, and less contraction upon dedoping. The data\nshow that BBL films undergo an irreversible hydration driven by the initial\nelectrochemical doping cycle with significant water retention and lamellar\nexpansion that persists across subsequent oxidation/reduction cycles. This\nswelling creates a hydrophilic environment that facilitates the subsequent fast\nhydrated ion transport in the absence of the hydrophilic side-chains used in\nmany other polymer systems. Due to its rigid ladder backbone and absence of\nhydrophilic side-chains, the primary BBL water uptake does not significantly\ndegrade the crystalline order, and the original dehydrated, unswelled state can\nbe recovered after drying. The combination of doping induced hydrophilicity and\nrobust crystalline order leads to efficient ionic transport and good stability.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Guo_J/0/1/0/all/0/1\">Jiajie Guo</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Flagg_L/0/1/0/all/0/1\">Lucas Q. Flagg</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Tran_D/0/1/0/all/0/1\">Duyen K. Tran</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Chen_S/0/1/0/all/0/1\">Shinya E. Chen</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Li_R/0/1/0/all/0/1\">Ruipeng Li</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Kolhe_N/0/1/0/all/0/1\">Nagesh B. Kolhe</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Giridharagopal_R/0/1/0/all/0/1\">Rajiv Giridharagopal</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Jenekhe_S/0/1/0/all/0/1\">Samson A. Jenekhe</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Richter_L/0/1/0/all/0/1\">Lee J. Richter</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ginger_D/0/1/0/all/0/1\">David S. Ginger</a>"
}