{
  "title": "Proud Ignorance and the Possibility of a Free Society",
  "description": "<p>There is, of course, as Elon Musk suggested, some probability that the aggression against Mr. Pelosi covers some yet unknown reality (Kurtis Lee, “<a href=\"https://www.nytimes.com/2022/10/30/business/musk-tweets-hillary-clinton-pelosi-husband.html\" target=\"_blank\" rel=\"noopener\">Elon Musk, in a Tweet, Shares Link From Site Known to Publish False News</a>,” <em>New York Times</em>, October 30, 2022):</p>\n<blockquote><p>In a reply to Mrs. Clinton’s tweet, Mr. Musk wrote, “There is a tiny possibility there might be more to this story than meets the eye” and then shared a link to an article in the Santa Monica Observer. The article alleges that Mr. Pelosi was drunk and in a fight with a male prostitute.</p></blockquote>\n<p>To explore that possibility, though, one should not look at individuals and websites known for inventing facts or accepting them only if they fit with their muddled ideology and implausible beliefs; one should not rely on sources that have demonstrated a lack of rational methodology in the search for the truth.</p>\n<p>If we believe the <em>NYT</em> story, Mr. Musk, who later deleted his post, is not himself totally immune to that defect:</p>\n<blockquote><p>A 2021 editorial in The Los Angeles Times about websites that “masquerade as legitimate local newspapers” noted that the Santa Monica Observer, “owned by onetime City Council candidate David Ganezer, is notorious for publishing false news.” In 2016, for example, the publication advanced a claim that Mrs. Clinton had died and that a body double was sent to debate the Republican presidential nominee, Donald J. Trump.</p></blockquote>\n<p>But anybody not used to the discipline of research can be easily fooled by doubtful sources.</p>\n<p>A good story by Robby Soave in <em>Reason</em> gives an idea of how Donald Trump himself thinks (“<a href=\"https://reason.com/2022/11/02/paul-pelosi-david-depape-conspiracy-attack-hammer/?utm_medium=email\" target=\"_blank\" rel=\"noopener\">The Paul Pelosi Conspiracy Theories Are an Embarrassment for the Right</a>,” November 2, 2022). Besides lending credence to the gay prostitute theory, Trump repeated another &#8220;alternative fact&#8221; that seems to have been invented:</p>\n<blockquote><p>You know, probably, you and I are better off not talking about it. The glass, it seems, was broken from the inside to the out and, you know, so, it wasn&#8217;t a break in, it was a break out.</p></blockquote>\n<p>The &#8220;it seems,&#8221; uncharacteristic of Trump&#8217;s intuitive certainties, looks contradicted by the rest of the sentence.</p>\n<p>The rise of the Internet and especially of the social media has revealed a disturbing fact: how ignorant is part of the general public and how easily they fall into <a href=\"https://www.econlib.org/political-economy-of-the-alex-joneses/\" target=\"_blank\" rel=\"noopener\">implausible theories</a>&#8212;that Sandy Hook was a government-organized hoax, that the 2020 election was stolen, etc. <a href=\"https://www.econlib.org/sokal-iii-another-hit-at-woke-nonsense/\" target=\"_blank\" rel=\"noopener\">The woke</a> are not better and generally don’t have the excuse of lacking education&#8212;although perhaps “<a href=\"https://www.econlib.org/archives/2018/01/ice_is_not_ice.html\" target=\"_blank\" rel=\"noopener\">education</a>” should be put in scare quotes. One can, I think, be knowledgeable and intellectually honest on the either side of the orthodox left-right divide; but this is not the current state of the public debate.</p>\n<p>Suddenly, with the Internet and the social media, the proud ignorant have become able, at near zero cost, to express their muddled intuitions for the whole wide world to see. The big difference is this near zero cost. The idea of charging a price for an efficient access to social networks may be part of the (privatly evolved) solution; perhaps charging much more than Musc suggests for Twitter would be even better. The higher the price, the fewer the number of individuals who think that echoing implausible stories is worth it; they will go back to their TV sets or their video games. To be clear: these individuals are respectable as long as they don&#8217;t use their proud ignorance to impose their preferences and values on others by force.</p>\n<p>Where does the proud ignorance displayed by both the woke crowd and the conspiracy theorists leave the Enlightenment promises of popular education, the perfectibility of mankind, and the possibility of a free society? On that challenging question, it is useful to read James Buchanan’s small book, <em>Why I, Too, Am Not a Conservative </em>(or, as a poor substitute, <a href=\"https://www.cato.org/regulation/spring-2022/past-enlightenment-thinker\" target=\"_blank\" rel=\"noopener\">my <em>Regulation</em> review</a>).</p>\n(4 COMMENTS)",
  "link": "https://www.econlib.org/proud-ignorance-and-the-possibility-of-a-free-society/",
  "guid": "https://www.econlib.org/proud-ignorance-and-the-possibility-of-a-free-society/",
  "category": [
    "Political Economy",
    "Donald Trump",
    "Elon Musk",
    "truth",
    "woke"
  ],
  "pubDate": "Sat, 05 Nov 2022 15:50:10 +0000"
}