{
  "title": "FBI ‘rotted at its core’ – Republican lawmakers",
  "link": "https://www.rt.com/news/565977-fbi-corruption-report/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/565977-fbi-corruption-report/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/63658a492030277b8f48b26c.jpg\" /> US Republican lawmakers say the FBI has been corrupted by politicized bureaucracy and a ‘woke, leftist agenda’ <br/><a href=\"https://www.rt.com/news/565977-fbi-corruption-report/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>The agency has been politicized, corrupting America’s top law enforcement entity, a GOP report has claimed</strong></p>\n            \n                        \n            <p>America is no longer a country where citizens are afforded equal justice under the law, as guaranteed by their Constitution, because the nation&rsquo;s top law enforcement agency has been corrupted by politicized leadership and a <em>&ldquo;woke, leftist agenda&rdquo;</em> being imposed from the top, Republican lawmakers have claimed.</p>\n<p>The allegations were contained in a <a href=\"https://www.scribd.com/document/605112786/Hjc-Staff-FBI-Report#download&from_embed\" target=\"_blank\" rel=\"noopener noreferrer\">1,050-page report</a> released on Friday by Republican members of the House Judiciary Committee. The report, which was based on information gathered from 14 FBI whistleblowers who came forward to expose a pattern of misconduct, argued that the agency was <em>&ldquo;rotted at its core.&rdquo;</em></p>\n<p><em>&ldquo;Quite simply, the problem &mdash; the rot within the FBI &mdash; festers in and proceeds from Washington,&rdquo;</em> the report said. <em>&ldquo;The FBI and its parent agency, the Justice Department, have become political institutions.&rdquo;</em></p>\n<p>The <a href=\"https://twitter.com/JudiciaryGOP/status/1588489830505525252\" target=\"_blank\" rel=\"noopener noreferrer\">report</a> detailed such abuses as a secret partnership in which the FBI receives private information on conservative users from Facebook, without seeking their consent or going though the legal processes that would normally be required to tap such data.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.09/thumbnail/6334673c20302702474496de.jpg\" alt=\"FILE PHOTO.\" />\n            <figcaption><a href=\"https://www.rt.com/news/563670-big-brother-watches-your-messages/\">Be careful what you post: How Facebook and the US government have united against Americans with the 'wrong' views</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>Whistleblowers also alleged that the FBI <em>&ldquo;looked the other way&rdquo;</em>&nbsp;after dozens of attacks against anti-abortion groups, even as the agency sent heavily armed teams of officers to arrest pro-life activists at their homes for alleged violations of selectively enforced crimes.</p>\n<p>Parents who spoke out at school board meetings over controversial policies were targeted by investigators as alleged terrorists.</p>\n<p>At the same time, former FBI official Timothy Thibault <em>&ldquo;shut down&rdquo;</em> a probe into the overseas business dealings of President Joe Biden&rsquo;s son, Hunter Biden, and attempted to keep the case from being reopened, the report said. Thibault openly displayed his political bias in social media posts that included his official title.</p>\n<p><em>&ldquo;America&rsquo;s not America if you have a Justice Department that treats people differently under the law,&rdquo;</em> Representative Jim Jordan, the ranking member of the House Judiciary Committee, told Fox News on Friday. <em>&ldquo;It&rsquo;s supposed to be equal treatment under the law. That&rsquo;s not happening, and we know it&rsquo;s not happening because 14 brave FBI agents came to us as whistleblowers and told us what exactly is going on here.&rdquo;</em></p>\n<p>The report also accused the FBI of inflating statistics on domestic extremism to help fuel a narrative promoted by President Joe Biden&rsquo;s administration. FBI employees who have conservative views are being purged from the agency, it claims.</p>\n\n            \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/562538-bannon-fbi-raids-trump-supporters/\">\n            <span>READ MORE: </span>Ex-Trump advisor labels FBI 'jackbooted gestapo'\n        </a>\n    </p>\n\n    \n\n<p>Republicans argued that the FBI was plagued by a <em>&ldquo;systemic culture of unaccountability,&rdquo;</em> as well as &ldquo;<em>rampant corruption, manipulation and abuse.&rdquo;</em> The agency&rsquo;s shift toward <em>&ldquo;political meddling&rdquo;</em> has allegedly pulled resources away from legitimate law enforcement duties. For instance, one whistleblower claimed that he was told after the January 2021 US Capitol riot that child sex-abuse cases were <em>&ldquo;no longer an FBI priority and should be referred to local law enforcement agencies.&rdquo;</em></p>",
  "enclosure": "",
  "pubDate": "Fri, 04 Nov 2022 22:04:08 +0000",
  "dc:creator": "RT"
}