{
  "id": "tag:blogger.com,1999:blog-4446292666398344382.post-4639167713802155481",
  "published": "2016-04-06T20:27:00.000-07:00",
  "updated": "2016-07-05T09:07:32.447-07:00",
  "category": "",
  "title": "Thoughts on reviewing",
  "content": "During ICML reviews I noticed that my personal take on reviewing is becoming increasingly distinct from my peers.  Personally, I want to go to a conference and come away with renewed creativity and productivity.  Thus, I like works that are thought provoking, groundbreaking, or particularly innovative; even if the execution is a bit off.  However, I suspect most reviewers feel that accepting a paper is a validation of the quality and potential impact of the work.  There's no right answer here, as far as I can tell.  Certainly great work should be accepted and presented, but the problem is, there really isn't that much of it per unit time.  Therefore, like a producer on a Brittany Spears album, we are faced with the problem of filling in the rest of the material.  The validation mindset leads to the bulk of accepted papers being extremely well executed marginal improvements.  It would be nice if the mix were tilted more towards the riskier novel papers.<br /><br />The validation mindset leads to reviews that are reminiscent of food critic reviews.  That might sound objectionable, given that food quality is subjective and science is about objective truth: but the <a href=\"http://blog.mrtz.org/2014/12/15/the-nips-experiment.html\">nips review experiment</a> suggests that the ability of reviewers to objectively recognize the greatness of a paper is subjectively overrated.  Psychologists attempting to &ldquo;measure&rdquo; mental phenomena have struggled formally with the question of <a href=\"https://en.wikipedia.org/wiki/Classical_test_theory\">&ldquo;what is a measurement&rdquo;</a> and lack of <a href=\"https://en.wikipedia.org/wiki/Inter-rater_reliability\">inter-rater reliability</a> is a bad sign (also: test-retest reliability is important, but it is unclear how to assess this as the reviewers will remember a paper).  So I wonder: how variable are the reviews among food critics for a good restaurant, relative to submitted papers to a conference?  I honestly don't know the answer.<br /><br />What I do know is that, while I want to be informed, I also want to be inspired.  That's why I go to conferences.  I hope reviewers will keep this in mind when they read papers.",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Paul Mineiro",
    "uri": "http://www.blogger.com/profile/05439062526157173163",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 0
}