{
  "title": "The End of the American Empire Is Here",
  "itunes:title": "The End of the American Empire Is Here",
  "pubDate": "Fri, 27 May 2022 05:11:30 +0000",
  "guid": "4fab3b17-c13b-4309-a7fa-0375c329b296",
  "link": "https://thejimmydoreshow.libsyn.com/the-end-of-the-american-empire-is-here",
  "itunes:image": "",
  "description": "<p>While the US Government continues to write blank checks for the war in Ukraine and bloats the Pentagon budget to an obscene degree, the collapse at home continues as homelessness, inflation, poverty, addiction and other serious problems grow worse every day. Jimmy and Pulitzer Prize-winning journalist Chris Hedges discuss the rapidly approaching collapse of US hegemony across the globe.<br /> <br /> Plus a segment on Henry Kissinger's controversial recent acknowledgment that Ukraine will have to trade territory for peace.<br /> <br /> Also featuring Stef Zamorano, Kurt Metzger, and Mike MacRae! And phone calls from Barack Obama and George Bush, and Rick Perry!</p>",
  "content:encoded": "<p>While the US Government continues to write blank checks for the war in Ukraine and bloats the Pentagon budget to an obscene degree, the collapse at home continues as homelessness, inflation, poverty, addiction and other serious problems grow worse every day. Jimmy and Pulitzer Prize-winning journalist Chris Hedges discuss the rapidly approaching collapse of US hegemony across the globe.  Plus a segment on Henry Kissinger's controversial recent acknowledgment that Ukraine will have to trade territory for peace.  Also featuring Stef Zamorano, Kurt Metzger, and Mike MacRae! And phone calls from Barack Obama and George Bush, and Rick Perry!</p>",
  "enclosure": "",
  "itunes:duration": "01:03:32",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "While the US Government continues to write blank checks for the war in Ukraine and bloats the Pentagon budget to an obscene degree, the collapse at home continues as homelessness, inflation, poverty, addiction and other serious problems grow worse...",
  "itunes:episodeType": "full",
  "itunes:summary": "While the US Government continues to write blank checks for the war in Ukraine and bloats the Pentagon budget to an obscene degree, the collapse at home continues as homelessness, inflation, poverty, addiction and other serious problems grow worse every day. Jimmy and Pulitzer Prize-winning journalist Chris Hedges discuss the rapidly approaching collapse of US hegemony across the globe. Plus a segment on Henry Kissinger's controversial recent acknowledgment that Ukraine will have to trade territory for peace. Also featuring Stef Zamorano, Kurt Metzger, and Mike MacRae! And phone calls from Barack Obama and George Bush, and Rick Perry!"
}