{
  "title": "Russia and Afghanistan’s partnership of convenience",
  "link": "https://www.eastasiaforum.org/2022/11/03/russia-and-afghanistans-partnership-of-convenience/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=russia-and-afghanistans-partnership-of-convenience",
  "comments": "https://www.eastasiaforum.org/2022/11/03/russia-and-afghanistans-partnership-of-convenience/#respond",
  "dc:creator": "Claudia Chia Yi En",
  "pubDate": "Wed, 02 Nov 2022 23:00:07 +0000",
  "category": [
    "Afghanistan",
    "Russia",
    "Sanctions",
    "Trade",
    "Afghanistan-Russia relations",
    "Aid",
    "China",
    "Chinese investment",
    "Chinese investment Afghanistan",
    "COVID-19",
    "international monetary fund",
    "international recognition",
    "international trade",
    "IS",
    "ISIS",
    "Islamic State",
    "legitimacy",
    "oil",
    "Putin",
    "sanctions",
    "Shanghai Cooperation Organisation",
    "Taliban",
    "Taliban legitimacy",
    "trade restrictions",
    "Ukraine",
    "wheat"
  ],
  "guid": "https://www.eastasiaforum.org/?p=1315431",
  "description": "<p>Author: Claudia Chia Yi En, NUS The signing of a provisional deal between Russia and the Taliban in September 2022 marks the Taliban’s first known major international economic deal. But beyond the announcement that Russia will supply gas, oil and wheat to Afghanistan, the payment and pricing details have not been released to the public. [&#8230;]</p>\nThe post <a href=\"https://www.eastasiaforum.org/2022/11/03/russia-and-afghanistans-partnership-of-convenience/\">Russia and Afghanistan’s partnership of convenience</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "content:encoded": "<p>Author: Claudia Chia Yi En, NUS</p>\n<p>The signing of a <a href=\"https://www.reuters.com/markets/commodities/exclusive-afghan-taliban-sign-deal-russian-oil-products-gas-wheat-2022-09-27/\" target=\"_blank\" rel=\"noopener noreferrer\">provisional deal</a> between Russia and the Taliban in September 2022 marks the Taliban’s first known major international economic deal. But beyond the announcement that Russia will supply gas, oil and wheat to Afghanistan, the payment and pricing details have not been released to the public. How the two countries will navigate international sanctions and their exclusion from the global banking system remains unclear.<span id=\"more-1315431\"></span></p>\n<p><img class=\"size-medium wp-image-1315445 aligncenter\" src=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-400x243.jpg\" alt=\"Russian Foreign Minister Sergei Lavrov welcomes member of Taliban delegation Alhaj Mohammad Sohail Shaina during the multilateral peace talks on Afghanistan in Moscow, 9 November 2018. (Photo: Reuters/Sergei Karpukhin\" width=\"400\" height=\"243\" srcset=\"https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-400x243.jpg 400w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-600x365.jpg 600w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-150x91.jpg 150w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-768x467.jpg 768w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-1536x934.jpg 1536w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-scaled.jpg 2048w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-300x182.jpg 300w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-100x61.jpg 100w, https://www.eastasiaforum.org/wp-content/uploads/2022/11/2018-11-09T082748Z_722601037_RC1C1B4AAD40_RTRMADP_3_RUSSIA-AFGHANISTAN-500x304.jpg 500w\" sizes=\"(max-width: 400px) 100vw, 400px\" /></p>\n<p>This deal comes against the backdrop of active trade talks between the Taliban and its regional neighbours and Russia’s discussions with several non-Western countries on long-term oil contracts. The economic value of Afghanistan–Russia trade relations might be dismal, but more bilateral engagements and partnerships are a positive diplomatic asset for Russia and the Taliban. They show the international community that neither country is isolated.</p>\n<p>The Taliban has been striving to diversify its trading partners and enhance relations with its regional neighbours. International sanctions, followed by the freezing of assets by the United States, have affected Afghan businesses. Since August 2021, the economy has shrunk by 20 to 30 per cent.</p>\n<p>The ongoing humanitarian crisis, along with an increase in violent attacks by other militant parties, has worsened living conditions. The incoming winter pressures the Taliban to hastily secure oil and gas imports. Negotiations with Iran, Kazakhstan and Turkmenistan are ongoing. In July 2022, the Afghan Ministry of Commerce and Industry <a href=\"https://tolonews.com/index.php/business-178889\" target=\"_blank\" rel=\"noopener noreferrer\">signed a contract</a> with a Turkmenistan oil company to supply fuel at a discount and inked an agreement with Iran to purchase oil.</p>\n<p>The Taliban initially had high expectations for Chinese investment, but this has not materialised. Beijing remains reluctant to invest and <a href=\"https://www.fmprc.gov.cn/mfa_eng/xwfw_665399/s2510_665401/2511_665403/202209/t20220922_10769948.html\" target=\"_blank\" rel=\"noopener noreferrer\">harbours suspicions</a> about the Taliban’s commitment to cut ties with the Turkistan Islamic Party, formerly known as the <a href=\"https://www.eastasiaforum.org/2021/09/25/chinas-reluctant-taliban-embrace/\" target=\"_blank\" rel=\"noopener noreferrer\">East Turkestan Islamic Movement</a>. Khan Jan Alokozay, the vice president of Afghanistan’s Chamber of Commerce and Investment, <a href=\"https://www.bloomberg.com/news/articles/2022-09-26/china-s-failure-to-invest-in-afghanistan-is-frustrating-the-taliban\" target=\"_blank\" rel=\"noopener noreferrer\">publicly stated that</a> ‘there has not even been a penny of investment by China’.</p>\n<p>Russia is a natural choice for the Taliban because it is an existing trade partner with significant energy resources. The Taliban has remained neutral regarding the Ukraine–Russia conflict, officially <a href=\"https://twitter.com/QaharBalkhi/status/1497104807932272647?s=20\" target=\"_blank\" rel=\"noopener noreferrer\">calling for restraint</a> on both sides.</p>\n<p>Despite being bogged down in the Ukraine crisis and facing ongoing European disentanglement from its oil and gas, the Russian economy seems to be resilient against these shocks. In September 2022, the <a href=\"https://www.economist.com/finance-and-economics/2022/10/11/as-europe-falls-into-recession-russia-climbs-out\" target=\"_blank\" rel=\"noopener noreferrer\">International Monetary Fund forecasted</a> that Russia’s GDP will decline by 3.4 per cent, an adjustment from its earlier forecast of an 8.5 per cent fall.</p>\n<p>Russian oil companies have been enticing non-Western buyers with discounts, insurance coverage and alternative payment schemes. Countries like Sri Lanka, India, Turkey and China have continued to purchase oil from Russia amid international sanctions. Cheaper prices are attractive for countries facing rising inflation, supply chain disruptions and economic setbacks due to the COVID-19 pandemic. The <a href=\"https://www.wsj.com/articles/saudi-arabia-rejects-u-s-allegations-of-siding-with-russia-in-ukraine-war-11665655670\" target=\"_blank\" rel=\"noopener noreferrer\">October 2022 clash</a> between Saudi Arabia and Washington over plans by the OPEC+ to cut oil production also drew speculations within the US that Riyadh is siding with Moscow.</p>\n<p>Despite their provisional trade deal, it does not appear that the Kremlin will officially recognise the Taliban. The clearest indication yet is the exclusion of the Taliban from the September 2022 <a href=\"https://www.eastasiaforum.org/2022/09/20/in-search-of-a-new-identity-for-sco/\" target=\"_blank\" rel=\"noopener noreferrer\">Shanghai Cooperation Organisation</a> (SCO)’s summit in Samarkand, Uzbekistan. Whether Afghanistan will retain its observer status at the SCO is unknown, given that the international community has not recognised the Taliban as the legitimate government of Afghanistan.</p>\n<p>Aside from issuing statements on helping the Afghan economy, the summit discussions highlighted that the region is more concerned with how best to protect themselves <em>against</em> any <a href=\"https://www.eastasiaforum.org/2021/11/03/how-taliban-victory-will-reshape-regional-dynamics-in-central-asia/\" target=\"_blank\" rel=\"noopener noreferrer\">potential spillover</a> of violence from Afghanistan.</p>\n<p>Russian President Vladimir Putin has <a href=\"https://tass.com/politics/1515399\" target=\"_blank\" rel=\"noopener noreferrer\">repeatedly expressed</a> his wariness of militants camouflaging as refugees from Afghanistan crossing into neighbouring states and plotting acts of terror. The so-called Islamic State (IS) has reportedly increased its anti-Russia propaganda. They have <a href=\"https://www.militantwire.com/p/islamic-state-celebrates-mutual-destruction\" target=\"_blank\" rel=\"noopener noreferrer\">lambasted Russia</a> as a ‘crusader government’ and ‘enemy of Islam’, actively encouraging their supporters to inflict harm on the country.</p>\n<p>The <a href=\"https://thediplomat.com/2022/09/the-islamic-state-vs-russia-in-afghanistan/\" target=\"_blank\" rel=\"noopener noreferrer\">5 September suicide bombing</a> of the Russian embassy in Kabul exemplified Russian concerns about the Islamic State of Khorasan Province (ISKP)’s expanding presence in Afghanistan. That was the first attack on a foreign embassy since the Taliban takeover of Kabul in August 2021.</p>\n<p>Other than undermining Russia’s legitimacy, IS and ISKP are also challenging Taliban rule within Afghanistan. Since 2014, both the Kremlin and the Taliban have shared the view that IS poses a significant threat. Russian officials have <a href=\"https://www.sipri.org/sites/default/files/China-Russia-relations-regional-dynamics.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">publicly acknowledged</a> exchanging information with the Taliban regarding IS.</p>\n<p>Reports of former Taliban and Central Asian fighters joining IS ranks have added to the severity of the security threat. The expansion of IS and its anti-Russia messaging further undermine Russia’s sphere of influence in Muslim-dominated Central Asia.</p>\n<p>The Taliban still calls for international recognition of its status as the government of Afghanistan. But with the economy in limbo and ongoing hostilities with militant organisations, it is aware that it needs to prioritise the flow of aid and resources into the country. Political and socioeconomic stability is of paramount importance for the Taliban if it is to maintain its hold on Afghanistan.</p>\n<p>It is worthwhile noting that Russia’s unwillingness to officially recognise the Taliban as the legitimate government of Afghanistan and its classification of the Taliban as a terrorist organisation since 2003 have not hindered their bilateral relationship so far. For the time being, Russian–Taliban engagement will continue.</p>\n<p>The Taliban views Russia as an attractive economic partner that could offer the cheaper oil and gas supplies that the Afghan economy desperately needs. For Russia, the Taliban is the most stable option in the region’s evolving security matrix and, for now, the only party that could curb the expansion of IS. Both sides have no reason to give up these benefits.</p>\n<p><em>Claudia Chia Yi En is a Research Analyst at the Institute of South Asian Studies, National University of Singapore.</em></p>The post <a href=\"https://www.eastasiaforum.org/2022/11/03/russia-and-afghanistans-partnership-of-convenience/\">Russia and Afghanistan’s partnership of convenience</a> first appeared on <a href=\"https://www.eastasiaforum.org\">East Asia Forum</a>.",
  "wfw:commentRss": "https://www.eastasiaforum.org/2022/11/03/russia-and-afghanistans-partnership-of-convenience/feed/",
  "slash:comments": 0,
  "post-id": 1315431
}