{
  "title": "Are You Content with Your Organization’s Content Strategy?",
  "link": "http://rocketdatascience.org/?p=1593",
  "comments": "http://rocketdatascience.org/?p=1593#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Tue, 06 Jul 2021 18:01:23 +0000",
  "category": [
    "Analytics",
    "Artificial Intelligence",
    "Big Data",
    "Internet of Things",
    "Machine Learning",
    "Products",
    "Strategy"
  ],
  "guid": "http://rocketdatascience.org/?p=1593",
  "description": "In this post, we will examine ways that your organization can separate useful content into separate categories that amplify your own staff’s performance. Before we start, I have a few questions for you. What attributes of your organization’s strategies can you attribute to successful outcomes? How long do you deliberate before taking specific deliberate actions? [&#8230;]",
  "content:encoded": "\n<p>In this post, we will examine ways that your organization can separate useful content into separate categories that amplify your own staff’s performance. Before we start, I have a few questions for you.</p>\n\n\n\n<p>What\nattributes of your organization’s strategies can you attribute to successful\noutcomes? How long do you deliberate before taking specific deliberate actions?\nDo you converse with your employees about decisions that might be the converse\nof what they would expect? Is a process modification that saves a minute in\nsomeone’s workday considered too minute for consideration? Do you present your\nemployees with a present for their innovative ideas? Do you perfect your plans\nin anticipation of perfect outcomes? Or do you project foregone conclusions on\na project before it is completed? </p>\n\n\n\n<p>If\nyou have good answers to these questions, that is awesome! I would not contest\nany of your answers since this is not a contest. In fact, this is actually\nsomething quite different. Before you combine all these questions in a heap and\nthresh them in a combine, and before you buffet me with a buffet of skeptical\nremarks, stick with me and let me explain. Do not close the door on me when I\nam so close to giving you an explanation. </p>\n\n\n\n<p>What\nyou have just experienced is a plethora of heteronyms. Heteronyms are words\nthat are spelled identically but have different meanings when pronounced\ndifferently. If you include the title of this blog, you were just presented\nwith 13 examples of heteronyms in the preceding paragraphs. Can you find them\nall?</p>\n\n\n\n<p>Seriously\nnow, what do these word games have to do with content strategy? I would say\nthat they have a great deal to do with it. Specifically, in the modern era of\nmassive data collections and exploding content repositories, we can no longer\nsimply rely on keyword searches to be sufficient. In the case of a heteronym, a\nkeyword search would return both uses of the word, even though their meanings\nare quite different. In “information retrieval” language, we would say that we\nhave high RECALL, but low PRECISION. In other words, we can find most occurrences\nof the word (recall), but not all the results correspond to the meaning of our\nsearch (precision). That is no longer good enough when the volume is so high.</p>\n\n\n\n<p>The\nkey to success is to start enhancing and augmenting content management systems\n(CMS) with additional features: semantic content and context. This is\naccomplished through tags, annotations, and metadata (TAM). TAM management,\nlike content management, begins with business strategy.</p>\n\n\n\n<p>Strategic content management focusses on business outcomes, business process improvement, efficiency (precision – i.e., &#8220;did I find only the content that I need without a lot of noise?&#8221;), and effectiveness (recall – i.e., &#8220;did I find all the content that I need?&#8221;). Just because people can request a needle in the haystack, it is not a good thing to deliver the whole haystack that contains that needle. Clearly, such a content delivery system is not good for business productivity. So, there must be a strategy regarding who, what, when, where, why, and how is the organization’s content to be indexed, stored, accessed, delivered, used, and documented. The content strategy should emulate a digital library strategy. Labeling, indexing, ease of discovery, and ease of access are essential if end-users are to find and benefit from the collection.</p>\n\n\n\n<p>My favorite approach to TAM creation and to modern data management in general is AI and machine learning (ML). That is, use AI and machine learning techniques on digital content (databases, documents, images, videos, press releases, forms, web content, social network posts, etc.) to infer topics, trends, sentiment, context, content, named entity identification, numerical content extraction (including the units on those numbers), and negations. Do not forget the negations. A document that states “this form should not be used for XYZ” is exactly the opposite of a document that states “this form must be used for XYZ”. Similarly, a social media post that states “Yes. I believe that this product is good” is quite different from a post that states “Yeah, sure. I believe that this product is good. LOL.”</p>\n\n\n\n<p>Contextual TAM enhances a CMS with knowledge-driven search and retrieval, not just keyword-driven. Contextual TAM includes semantic TAM, taxonomic indexing, and even usage-based tags (digital breadcrumbs of the users of specific pieces of content, including the key words and phrases that people used to describe the content in their own reports). Adding these to your organization’s content makes the CMS semantically searchable and usable. That’s far more laser-focused (high-precision) than keyword search.</p>\n\n\n\n<p>One\ntype of implementation of a content strategy that is specific to data\ncollections are data catalogs. Data catalogs are very useful and important.\nThey become even more useful and valuable if they include granular search\ncapabilities. For example, the end-user may only need the piece of the dataset\nthat has the content that their task requires, versus being delivered the full\ndataset. Tagging and annotating those subcomponents and subsets (i.e.,\ngranules) of the data collection for fast search, access, and retrieval is also\nimportant for efficient orchestration and delivery of the data that fuels AI,\nautomation, and machine learning operations. </p>\n\n\n\n<p>One\nway to describe this is “smart content” for intelligent digital business\noperations. Smart content includes labeled (tagged, annotated) metadata (TAM).\nThese labels include content, context, uses, sources, and characterizations\n(patterns, features) associated with the whole content and with individual\ncontent granules. Labels can be learned through machine learning, or applied by\nhuman experts, or proposed by non-experts when those labels represent cognitive\nhuman-discovered patterns and features in the data. Labels can be learned and\napplied in existing CMS, in massive streaming data, and in sensor data\n(collected in devices at the “edge”). </p>\n\n\n\n<p>Some specific tools and techniques that can be applied to CMS to generate smart content include these:</p>\n\n\n\n<ul><li>Natural language understanding and natural language generation</li><li>Topic modeling (including topic drift and topic emergence detection)</li><li>Sentiment detection (including emotion detection)</li><li>AI-generated and ML-inferred content and context</li><li>Entity identification and extraction</li><li>Numerical quantity extraction</li><li>Automated structured (searchable) database generation from textual (unstructured) document collections (for example: <a rel=\"noreferrer noopener\" aria-label=\"Textual ETL (opens in a new tab)\" href=\"https://www.forestrimtech.com/\" target=\"_blank\">Textual ETL</a>).</li></ul>\n\n\n\n<p>Consequently, smart content thrives at the convergence of AI and content. Labels are curated and stored with the content, thus enabling curation, cataloguing (indexing), search, delivery, orchestration, and use of content and data in AI applications, including knowledge-driven decision-making and autonomous operations. Techniques that both enable (contribute to) and benefit from smart content are content discovery, machine learning, knowledge graphs, semantic linked data, semantic data integration, knowledge discovery, and knowledge management. Smart content thus meets the needs for digital business operations and autonomous (AI and intelligent automation) activities, which must devour streams of content and data – not just any content, but smart content – the right (semantically identified) content delivered at the right time in the right context.</p>\n\n\n\n<p>The\nfour tactical steps in a smart content strategy include:</p>\n\n\n\n<ol><li>Characterize and contextualize the patterns, events, and entities in the content collection with semantic (contextual) tags, annotation, and metadata (TAM).</li><li>Collect, curate, and catalog (i.e., index) each TAM component to make it searchable, accessible, and reusable.</li><li>Deliver the right content at the right time in the right context to the decision agent.</li><li>Decide and act on the delivered insights and knowledge.</li></ol>\n\n\n\n<p>Remember,\ndo not be content with your current content management strategy. But discover\nand deliver the perfect smart content that perfects your digital business outcomes.\nSmart content strategy can save end-users countless minutes in a typical\nworkday, and that type of business process improvement certainly is not too\nminute for consideration.</p>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1593",
  "slash:comments": 0
}