{
  "title": "Experimental Economics and the Origin of Language with Bart Wilson",
  "pubDate": "Fri, 06 Apr 2018 15:31:55 +0000",
  "guid": "7697febb6b844ebd5c9dc8dfc43def8f",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP90Wilson_EDR.mp3",
  "itunes:image": "",
  "description": "<p>My guest for this episode of Economics Detective Radio is <a href=\"https://www1.chapman.edu/~bjwilson/\" target=\"_blank\" rel= \"noopener\">Bart Wilson of Chapman University</a>. He is the author of many experimental economics studies. Our conversation today focuses on one particular study entitled <a href= \"http://www.ehbonline.org/article/S1090-5138(16)30369-5/fulltext\" target=\"_blank\" rel=\"noopener\">Language and cooperation in hominin scavenging</a>. The abstract reads as follows:</p> <blockquote>Bickerton (2009, 2014) hypothesizes that language emerged as the solution to a scavenging problem faced by proto-humans. We design a virtual world to explore how people use words to persuade others to work together for a common end. By gradually reducing the vocabularies that the participants can use, we trace the process of solving the hominin scavenging problem. Our experiment changes the way we think about social dilemmas. Instead of asking how does a group overcome the self-interest of its constituents, the question becomes, how do constituents persuade one another to work together for a common end that yields a common benefit?</blockquote> <hr /> <p>You can view <a href= \"https://www.youtube.com/watch?v=uEtug2LYOo4\" target=\"_blank\" rel= \"noopener\">a video demonstration of the experimental software here</a>. The animation is quite cute!</p> <p><a href=\"https://en.wikipedia.org/wiki/Derek_Bickerton\" target= \"_blank\" rel=\"noopener\">Derek Bickerton</a> is the linguist whose theories Bart referenced in this episode.</p> <p> </p>",
  "content:encoded": "<p>My guest for this episode of Economics Detective Radio is <a href=\"https://www1.chapman.edu/~bjwilson/\" target=\"_blank\" rel= \"noopener\">Bart Wilson of Chapman University</a>. He is the author of many experimental economics studies. Our conversation today focuses on one particular study entitled <a href= \"http://www.ehbonline.org/article/S1090-5138(16)30369-5/fulltext\" target=\"_blank\" rel=\"noopener\">Language and cooperation in hominin scavenging</a>. The abstract reads as follows:</p> Bickerton (2009, 2014) hypothesizes that language emerged as the solution to a scavenging problem faced by proto-humans. We design a virtual world to explore how people use words to persuade others to work together for a common end. By gradually reducing the vocabularies that the participants can use, we trace the process of solving the hominin scavenging problem. Our experiment changes the way we think about social dilemmas. Instead of asking how does a group overcome the self-interest of its constituents, the question becomes, how do constituents persuade one another to work together for a common end that yields a common benefit?  <p>You can view <a href= \"https://www.youtube.com/watch?v=uEtug2LYOo4\" target=\"_blank\" rel= \"noopener\">a video demonstration of the experimental software here</a>. The animation is quite cute!</p> <p><a href=\"https://en.wikipedia.org/wiki/Derek_Bickerton\" target= \"_blank\" rel=\"noopener\">Derek Bickerton</a> is the linguist whose theories Bart referenced in this episode.</p> <p> </p>",
  "enclosure": "",
  "itunes:duration": "38:40",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest for this episode of Economics Detective Radio is . He is the author of many experimental economics studies. Our conversation today focuses on one particular study entitled . The abstract reads as follows: Bickerton (2009, 2014) hypothesizes...",
  "itunes:episode": 90,
  "itunes:episodeType": "full"
}