{
  "title": "Q&A: David Kaiser on Freeman Dyson, the relentless freethinker",
  "link": "https://news.mit.edu/2022/kaiser-freeman-dyson-book-1025",
  "description": "MIT physicist and historian of science has edited a new volume about Dyson, a famed quantum theorist and futurist.",
  "pubDate": "Tue, 25 Oct 2022 00:00:00 -0400",
  "guid": "https://news.mit.edu/2022/kaiser-freeman-dyson-book-1025",
  "dc:creator": "Peter Dizikes | MIT News Office",
  "content:encoded": "<p><em>In the early 2000s, David Kaiser first visited famed physicist Freeman Dyson at the Institute for Advanced Study in Princeton, New Jersey. By the end of the conversation, Dyson was handing over keys to his office, along with files, to help Kaiser’s research — a characteristically open gesture by Dyson, a legendary quantum theorist. </em></p>\n\n<p></p>\n\n<p><em>The English-born Dyson started his career as a mathematical prodigy who helped expand quantum electrodynamics (QED) — the study of the quantum behavior of light and its interaction with charged particles — and ended it as a renowned author of science books and essays. In between, Dyson dove into a wide array of subjects, including the origins of life, the design of nuclear power plants, nuclear missile disarmament, astrophysics, and space travel, becoming a hero to futurists. Dyson also courted controversy late in life for downplaying the dangers of climate change, having previously recognized the salience of the issue as early as the 1970s.</em></p>\n\n<p></p>\n\n<p><em>Now, Kaiser, a historian of science and active physicist himself, has edited a volume of essays about the life and career of Dyson, titled, “‘</em><em>Well, Doc, You’re In’: Freeman Dyson’s Journey through the Universe,” published today by the MIT Press. (The title is a quip Richard Feynman once made after another young physicist praised Dyson’s work at a physics conference.) Contributors include the prominent technologist Esther Dyson, who was Dyson’s daughter. </em>MIT News<em> talked about the new book with Kaiser, who is the Germeshausen Professor of the History of Science in MIT’s Program in Science, Technology, and</em><em> </em><em>Society, and a professor in the Department of Physics.</em></p>\n\n<p></p>\n\n<p><strong>Q:</strong> What is most interesting to you about Freeman Dyson?</p>\n\n<p></p>\n\n<p><strong>A:</strong> Freeman Dyson was more than just another really smart scientist. Dyson strikes me as an unusual thinker who tackled a range of questions with tenacity. He wasn’t right every time. We know sometimes he was fantastically not correct, like every human. But his intellectual fearlessness and open-ended curiosity was astonishing. To have made the kinds of contributions he did across the span of topics in addition to physics and math — an original design of a nuclear reactor, trying to reimagine space travel, thinking hard about nuclear disarmament, the fundamentals of life sciences and biology — he wasn’t just broadly curious, he was relentless. And over the decades he emerged as an award-winning, beloved author with bestselling books. When I got to know him, I saw kindness and curiosity. He was very self-effacing and modest, a fascinating person.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> Dyson is often described as expanding and popularizing the work of the quantum theorists Richard Feynman, Julian Schwinger, and Sin-Itiro Tomonaga, who had developed QED. But how would you describe his specific accomplishment here?</p>\n\n<p></p>\n\n<p><strong>A:</strong> Dyson was synthesizing work from multiple scientists that even his colleagues thought might not have much in common. They had each found a way to conquer the first round of corrections in QED, which had stymied generations before. That was enormous. For years until that time, the equations had kept breaking down, yielding these infinites when everyone knew the answer should be some small number. The three of them had cracked that, independently, with very different-looking methods.</p>\n\n<p></p>\n\n<p>Dyson put it all together in a way they had missed. He first demonstrated that the three distinct approaches were in fact compatible — they shared a common underpinning. And then he pushed much further than the other three, demonstrating in a real tour de force that one could calculate the corrections to arbitrary precision. Where Feynman, Schwinger, and Tomonaga had each found a way to calculate basically the percent-level corrections for a given physical process, Dyson demonstrated that the corrections could be computed, self-consistently, all the way out to parts-per-million, parts-per-billion, and beyond.</p>\n\n<p></p>\n\n<p>And indeed, thanks to Dyson’s insights, QED is the most precise scientific theory in human history. Specific quantities, such as how an electron will respond when placed in a magnetic field, can now be calculated using Dyson’s techniques all the way out to 12 decimal places and compared with stunning laboratory measurements — and the theoretical predictions and experimental measurements match all the way out to parts-per-trillion.</p>\n\n<p></p>\n\n<p>Dyson wasn’t just popularizing the work of others; he was supercharging the efforts of the other three. On top of that, Dyson became a remarkably effective ambassador for the new methods, patiently teaching a whole generation how to perform the new kind of calculations. You can trace the spread of these new techniques to Dyson, literally more than any person on Earth.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> Why did Dyson move on from physics? And across all these topics, were there any common characteristics in his thinking?</p>\n\n<p></p>\n\n<p><strong>A:</strong> Partly he had this roving curiosity from his really early years onward. And from his school years, through university, and his searing experience during the Second World War, when he worked for the British military authorities, trying to mathematize strategies for bombing campaigns, he became very skeptical of hierarchy and formal organizations.</p>\n\n<p></p>\n\n<p>Whereas thinking about problems at various scales is not unique to Dyson, he ran with it exuberantly. Details are important, and his work on QED was certainly detail-oriented, but Dyson would ask, “What’s going to dominate at a particular scale?” Most phenomena have many moving parts, and some interactions might be more important on one scale than another. That’s how many, many physicists think about the world now, but Dyson did it earlier. And he didn’t confine his approach to theoretical physics. When it came to nuclear disarmament, he realized there was an exponential growth that couldn’t possibly be sustained for above-ground testing, and that something dramatic had to change — not an incremental change. You see it in Dyson’s unusual approach to astrophysics and cosmology, where he’s not just taking a long view, but a preposterously long view — not just billions of years, but hundreds of billions of years.</p>\n\n<p></p>\n\n<p>We even see that in his forays into climate change, which became controversial later in his life. I hadn’t appreciated this, but he’d been thinking carefully and critically about climate change driven by human emissions, from the 1970s. His approach again was to say this problem is of such a scale that we’re not going to get there by incremental change. His thoughts on climate change later became harder to square with a robust scientific consensus, but in the early years, he was actually out in front of this.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> Okay, let’s talk about climate change. How did Dyson get so dug into a conflict with climate scientists and other advocates for strong climate action?</p>\n\n<p></p>\n\n<p><strong>A:</strong> It was interesting for me to learn more about it while working on the book. I think by the end of his life he was wrong on the topic of climate change, and I just want to be clear about that. I’m not an outlier in thinking that. So, what was the nature of his shift? He was very much concerned and even alarmed early on. If you read his earlier writings on the topic, they would sound very timely, even today.</p>\n\n<p></p>\n\n<p>Part of Dyson’s change was his habit of being skeptical when an organized consensus is forming. Yet sometimes organized consensuses are solid. People work together and treat each other’s work with helpful, constructive skepticism, and the collective understanding gets better. But Dyson had a personal allergy to that. He felt a responsibility to poke at a forming consensus. Yet he was getting older and not devoting the same attention to the real details of climate models as he had in the 1970s and 1980s.</p>\n\n<p></p>\n\n<p>So, we are left with a mixed record on the topic. Right up until he passed away, he agreed that climate change was happening and that it was accelerated by human activities; he was not a climate-change denier. But he became increasingly critical of the scientific community’s approach to understanding the problem and trying to address it. Unfortunately his strongest statements on the topic came long after he had stopped actively following research on the topic. He was also insufficiently vigilant about clarifying his position for those who had adopted some of his soundbites. And that’s on him. He should have done that. &nbsp;</p>\n\n<p></p>\n\n<p>Another important thread of his thinking is that was a techno-optimist. That is, he really thought that even though human-produced climate change is real and a problem, he had a kind of faith, not a calculation but a faith, that human technological ingenuity will get there faster than the climate calamities.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> It seems like these tensions in Dyson’s career involve a distrust of authority and consensus that wasn’t always borne out. He championed space exploration, but when we put people on the moon, it came from a fairly top-down organization.</p>\n\n<p></p>\n\n<p><strong>A:</strong> Yes, Dyson’s scientific approach did not just involve fearlessness, it was about unboundedness. But that doesn’t always work for organizing people. The unbounded imagination is critical, but that’s not the only register in which we need to think to get things done.</p>\n\n<p></p>\n\n<p><strong>Q:</strong> Can we apply Dyson-esque thinking to Dyson’s career? What helps generate an unbounded spirit of inquiry? At the Institute for Advanced Study he didn’t have to teach, and could focus on research. But at MIT we think teaching is good and can help spur ideas. Do you have any scaled-up conclusions about how to produce wide-ranging freethinkers like Dyson?</p>\n\n<p></p>\n\n<p><strong>A:</strong> In at least one important sense the Institute for Advanced Study does share a critical feature with MIT, which is, it can foster a focus on the long view. Having an institutional stability can enable a thinker to wander, to explore ideas across topics, in our case through tenure. And Dyson certainly was an intellectual wanderer. But he could do it safe in the knowledge that he had a home base. In other aspects, these institutions can be quite different. But nurturing a place where people can pursue ideas as their curiosity leads them — I think in many wonderful institutions of higher education around the world, we still have the great privilege to take advantage of that.</p>",
  "media:content": {
    "media:description": "MIT historian of science and physicist David Kaiser is the editor of a new volume exploring the life and work of physicist and futurist Freeman Dyson. The book, “’Well, Doc, You’re In’: Freeman Dyson’s Journey through the Universe,” is published by the MIT Press.",
    "media:credit": "Photo by Donna Coveney"
  },
  "category": [
    "Books and authors",
    "Faculty",
    "Program in STS",
    "Physics",
    "Technology and society",
    "History of science",
    "Interview",
    "School of Humanities Arts and Social Sciences",
    "School of Science"
  ]
}