{
  "title": "Challenging the State Lottery System with Matthew Curtis",
  "pubDate": "Sun, 14 Apr 2019 16:09:02 +0000",
  "guid": "6d19146af6fb4a8caf3999f295747368",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/EP120Curtis_EDR.mp3",
  "itunes:image": "",
  "description": "<p>My guest today is Matthew Curtis, founder of the startup <a href=\"https://www.vicelotteries.com/\" target=\"_blank\" rel= \"noopener\">Vice Lotteries</a>. Vice Lotteries is a new startup that aims to challenge state governments' legal monopolies over lotteries.</p> <p>State lotteries are amazingly and bizarrely unethical. They drain billions of dollars out of communities, primarily poor ones. Lottery spending <a href= \"https://www.washingtonpost.com/business/2018/10/23/per-capita-lottery-spending-has-doubled-since/\" target=\"_blank\" rel=\"noopener\">has increased substantially</a> over the past decades, with the average lotto player spending $600 per year, and many spending significantly more than that.</p> <p>Vice Lotteries aims to create a more ethical alternative to state lotteries, allowing people to have the fun of gambling without losing significant amounts of money. From the <a href= \"https://www.vicelotteries.com/\" target=\"_blank\" rel= \"noopener\">Vice Lotteries website</a>:</p> <blockquote>Vice Lotteries was founded with one purpose: Allow our customers to enjoy gambling while saving money. With Vice Lotteries, you can enjoy the tremendous pleasure of tossing the dice without losing your ability to afford all the other things in life that you love.</blockquote> <p>However, it is currently illegal to run a private lottery. Before Vice Lotteries can start operating, they need to win one of the multiple lawsuits they are filing in state courts to challenge state lotteries.</p> <hr /> <p> </p>",
  "content:encoded": "<p>My guest today is Matthew Curtis, founder of the startup <a href=\"https://www.vicelotteries.com/\" target=\"_blank\" rel= \"noopener\">Vice Lotteries</a>. Vice Lotteries is a new startup that aims to challenge state governments' legal monopolies over lotteries.</p> <p>State lotteries are amazingly and bizarrely unethical. They drain billions of dollars out of communities, primarily poor ones. Lottery spending <a href= \"https://www.washingtonpost.com/business/2018/10/23/per-capita-lottery-spending-has-doubled-since/\" target=\"_blank\" rel=\"noopener\">has increased substantially</a> over the past decades, with the average lotto player spending $600 per year, and many spending significantly more than that.</p> <p>Vice Lotteries aims to create a more ethical alternative to state lotteries, allowing people to have the fun of gambling without losing significant amounts of money. From the <a href= \"https://www.vicelotteries.com/\" target=\"_blank\" rel= \"noopener\">Vice Lotteries website</a>:</p> Vice Lotteries was founded with one purpose: Allow our customers to enjoy gambling while saving money. With Vice Lotteries, you can enjoy the tremendous pleasure of tossing the dice without losing your ability to afford all the other things in life that you love. <p>However, it is currently illegal to run a private lottery. Before Vice Lotteries can start operating, they need to win one of the multiple lawsuits they are filing in state courts to challenge state lotteries.</p>  <p> </p>",
  "enclosure": "",
  "itunes:duration": "51:24",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "My guest today is Matthew Curtis, founder of the startup . Vice Lotteries is a new startup that aims to challenge state governments' legal monopolies over lotteries. State lotteries are amazingly and bizarrely unethical. They drain billions of dollars...",
  "itunes:episode": 120,
  "itunes:episodeType": "full"
}