{
  "title": "Josh Wolf: Clowns, Microdosing, and Hookers",
  "itunes:title": "Josh Wolf: Clowns, Microdosing, and Hookers",
  "pubDate": "Wed, 27 Oct 2021 08:00:00 +0000",
  "guid": "4e9a7375-f6a7-40a4-b78e-a4346038467a",
  "link": "https://dumbblonde.libsyn.com/josh-wolf-clowns-microdosing-and-hookers",
  "itunes:image": "",
  "description": "<p>The hilarious Josh Wolf joins Bunnie this week to talk about what life is really like as a stand-up comic, how he got connected with Jelly and now loves performing with him, and the worst time he's ever bombed on stage. Josh talks about going from performing as a clown and getting indecent proposals from moms to appearing as a regular on Chelsea Lately, the car ride that changed his life, microdosing, choosing happiness, and what surprises his fans most when they meet him in real life.</p> <div class=\"gmail_default\">\"I would suck a clown's dick\" - Bunnie</div> <div class=\"gmail_default\"> </div> <div class=\"gmail_default\"><strong><span style= \"font-weight: 400;\">Bunnie: <a href= \"http://www.dumbblondeunrated.com\">www.dumbblondeunrated.com</a></span></strong></div> <div class=\"gmail_default\"><strong>Josh Wolf: <a href= \"https://www.comedianjoshwolf.com/\">www.comedianjoshwolf.com</a></strong></div>",
  "content:encoded": "<p>The hilarious Josh Wolf joins Bunnie this week to talk about what life is really like as a stand-up comic, how he got connected with Jelly and now loves performing with him, and the worst time he's ever bombed on stage. Josh talks about going from performing as a clown and getting indecent proposals from moms to appearing as a regular on Chelsea Lately, the car ride that changed his life, microdosing, choosing happiness, and what surprises his fans most when they meet him in real life.</p> \"I would suck a clown's dick\" - Bunnie   Bunnie: <a href= \"http://www.dumbblondeunrated.com\">www.dumbblondeunrated.com</a> Josh Wolf: <a href= \"https://www.comedianjoshwolf.com/\">www.comedianjoshwolf.com</a>",
  "enclosure": "",
  "itunes:duration": "01:27:53",
  "itunes:explicit": true,
  "itunes:keywords": "jellyroll,standupcomedy,chelseahandler,chelsealately,joshwolf,bunniexo,dumbblonde,nashvillecomedy",
  "itunes:subtitle": "The hilarious Josh Wolf joins Bunnie this week to talk about what life is really like as a stand-up comic, how he got connected with Jelly and now loves performing with him, and the worst time he's ever bombed on stage. Josh talks about going from...",
  "itunes:season": 3,
  "itunes:episode": 22,
  "itunes:episodeType": "full",
  "itunes:author": "Dumb Blonde"
}