{
  "title": "The political economy of climate transition",
  "link": "https://audioboom.com/posts/7742168",
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 2587,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>Climate transition is hotly debated in EU circles as it impacts all areas of policy: from the ambitious climate targets set by the President of the European Commission with the European Green Deal, to the discussions of the next budget of the Union and the recovery plan from the current pandemic.<br>\n<br>\n\n</div>\n<div>The topic is especially important for 2021 with a new US administration more likely to engage on climate change, a commitment for carbon neutrality in 40 years by China and the delayed COP26 under the leadership (or not) of the United Kingdom. Any European debate is certain to have an important impact on a regional and national level, but will also influence the global trajectory of climate policy.<br>\n<br>\n\n</div>\n<div>In this episode of the Sound of Economics,<a href=\"https://www.bruegel.org/author/giuseppe-porcaro/\"> Giuseppe Porcaro</a> hosts <a href=\"https://www.bruegel.org/author/heather-grabbe/\">Heather Grabbe</a>, director of the Open Society European Policy Institute in Brussels, <a href=\"https://www.bruegel.org/author/piotr-arak/\">Piotr Arak</a>, Director of the Polish Economic Institute from Warsaw and <a href=\"https://www.bruegel.org/author/simone-tagliapietra/\">Simone Tagliapietra</a>, research fellow at Bruegel (joining from Italy) for a conversation on the political economy of the climate transition as covering the European Green deal, the concept of “green industrial policy”, and distributional challenges of decarbonisation.<br>\n<br>\n\n</div>\n",
  "itunes:summary": "Is the green deal a strategy for growth or simply a reallocation mechanism?",
  "pubDate": "Wed, 02 Dec 2020 15:12:52 +0000",
  "guid": "tag:audioboom.com,2020-12-02:/posts/7742168",
  "itunes:author": "Bruegel",
  "dc:creator": "Bruegel",
  "media:rights": ""
}