{
  "title": "Israel’s voters bring radical ultranationalists too close to power",
  "link": "https://www.rt.com/news/566008-israel-netanyahu-religious-zionism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
  "guid": "https://www.rt.com/news/566008-israel-netanyahu-religious-zionism/",
  "description": "<img alt=\"Preview\" align=\"left\" style=\"margin-right: 10px;\" src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/6366801d2030275edd67e1fd.jpg\" /> Religious Zionism, a divisive ultranationalist alliance, has made big gains in the elections that brought Benjamin Netanyahu back to power <br/><a href=\"https://www.rt.com/news/566008-israel-netanyahu-religious-zionism/?utm_source=rss&utm_medium=rss&utm_campaign=RSS\">Read Full Article at RT.com</a>",
  "content:encoded": "\n                            <p><strong>To get back in power, Benjamin Netanyahu had to make a deal with a group known for promoting Jewish supremacy and segregation</strong></p>\n            \n                        \n            <p>As Benjamin Netanyahu prepares to form the next Israeli government, the ultranationalist Religious Zionism alliance is celebrating its own rise to power, having gone from fringe to mainstream and possibly, the second most powerful group in government. This represents a loss for the administration of US President Joe Biden and will have wide-ranging consequences for Palestinians.</p>\n<p>Israelis went to the ballot box for the fifth time in three years on Tuesday, paving the way towards<a href=\"https://www.bbc.com/news/world-middle-east-63459824\" target=\"_blank\" rel=\"noopener noreferrer\"> another government headed by the Likud Party&rsquo;s Benjamin Netanyahu</a>. However, the return to power&nbsp;of the longest-serving Israeli Prime Minister comes&nbsp;largely&nbsp;thanks to the rise of the infamous ultra-nationalist Religious Zionism alliance, with which Netanyahu had signed an agreement promising government positions in exchange for support.</p>\n<p>Religious Zionism subsequently emerged as the third largest list elected to Israel&rsquo;s parliament, the Knesset. This means that Benjamin Netanyahu will be at the mercy of politicians that were once known as <a href=\"https://www.aljazeera.com/news/2022/11/1/far-right-ben-gvir-emerge-as-key-player-in-israel-election\" target=\"_blank\" rel=\"noopener noreferrer\">fringe</a> and were labeled as a <em>&ldquo;<a href=\"https://www.jpost.com/israel-news/politics-and-diplomacy/article-719982\" target=\"_blank\" rel=\"noopener noreferrer\">danger to Israel</a>&rdquo;</em> by the editor-in-chief of the Jerusalem Post.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.11/thumbnail/636405a820302773753ce152.jpg\" alt=\"Likud party leader Benjamin Netanyahu and his wife Sara react to first exit poll results for the Israeli Parliamentary election at his party&#039;s headquarters in Jerusalem, November 2, 2022.\" />\n            <figcaption><a href=\"https://www.rt.com/news/565913-israel-election-netanyahu-results/\">Netanyahu wins Israeli election</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>The two most prominent Religious Zionism figures are Itamar Ben-Gvir of the &lsquo;Jewish Power&rsquo; Party and Bezalel Smotrich of the &lsquo;National Union-Tkuma&rsquo; party. The former is a disciple of the ultranationalist extremist Meir Kahane, whose Kach Party was banned from running for a seat in the Knesset in 1988, for being &ldquo;manifestly racist,&rdquo; and which was later labeled a terrorist group by both Tel Aviv and Washington.</p>\n<p>Ben-Gvir took over the &lsquo;Jewish Power&rsquo; party from his colleague Ben-Zion Gopstein, who was also banned from running for the Knesset over racist remarks, and who currently heads the group known as Lehava, which advocates segregation and the prevention of mixed marriages between Jews and Arabs. Ben-Gvir has been prosecuted in Israel over 53 times, by his own admission, for the likes of backing a terrorist group,&nbsp;<a href=\"https://www.jpost.com/israel/ben-gvir-convicted-of-inciting-to-racism\" target=\"_blank\" rel=\"noopener noreferrer\">inciting racism</a> and for <a href=\"https://www.france24.com/en/middle-east/20210515-itamar-ben-gvir-the-ultra-nationalist-accused-of-stirring-up-violence-in-jerusalem\" target=\"_blank\" rel=\"noopener noreferrer\">violence against Arabs</a>.</p>\n<p>Bezalel Smotrich, on the other hand, has <a href=\"https://www.reuters.com/article/us-israel-racism-idUSKCN0X3161\" target=\"_blank\" rel=\"noopener noreferrer\">advocated the segregation of Arabs and Jews in maternity wards</a> and claims that God commands that <a href=\"https://www.jpost.com/Israel-News/Politics-And-Diplomacy/Bayit-Yehudi-MK-causes-uproar-by-saying-God-commanded-Jews-not-to-sell-homes-to-Arabs-409241\" target=\"_blank\" rel=\"noopener noreferrer\">Jews not sell their homes to Arabs</a>. Smotrich was labeled by a top UK Jewish body as promoting a <em>&ldquo;<a href=\"https://www.timesofisrael.com/top-uk-jewish-body-tells-visiting-far-right-mk-smotrich-to-get-back-on-a-plane/\" target=\"_blank\" rel=\"noopener noreferrer\">hate-provoking ideology</a>&rdquo;</em> and told to leave the United Kingdom, while on a tour of Jewish communities.</p>\n<p>Likewise, Itamar Ben-Gvir&rsquo;s Jewish Power party was last year&nbsp;labelled&nbsp;<em>&ldquo;<a href=\"https://www.theguardian.com/world/2021/mar/24/racist-and-reprehensible-jewish-power-set-to-enter-israels-parliament\" target=\"_blank\" rel=\"noopener noreferrer\">racist and reprehensible</a>&rdquo;</em> by the American Israel Public Affairs Committee (AIPAC). The fact that publications&nbsp;such as the Jerusalem Post call them <em>&ldquo;<a href=\"https://www.jpost.com/opinion/article-720689\" target=\"_blank\" rel=\"noopener noreferrer\">fascistic</a>&rdquo;</em> and that vehemently pro-Israel groups in both the United States and United Kingdom have labeled these figures racist, gives an idea of just how divisive they are.</p>\n<p>Both Smotrich and Ben-Gvir are eyeing high-ranking ministerial positions in any Netanyahu-led government, meaning that not only will the Religious Zionism alliance have the power to greatly influence the incoming government&rsquo;s policies, but will likely strive to be active players in the cabinet.</p>\n<p><em>&ldquo;We&rsquo;ll reassert ownership of this state,&rdquo;</em>&nbsp;<a href=\"https://www.timesofisrael.com/well-reassert-ownership-of-this-state-ben-gvir-vows-as-exit-polls-show-big-gains/\" target=\"_blank\" rel=\"noopener noreferrer\">said Ben-Gvir</a> in a speech after exit polls had shown large gains for Religious Zionism, which seeks to overhaul Israel&rsquo;s legal system and to deport Palestinian citizens of Israel if they display <em>&ldquo;<a href=\"https://foreignpolicy.com/2022/10/30/religious-zionism-israel-far-right-different/\" target=\"_blank\" rel=\"noopener noreferrer\">disloyalty</a>&rdquo;</em> to the Jewish State. From a US perspective, a Biden administration official&nbsp;is reported to have <a href=\"https://www.israelhayom.com/2022/09/29/us-concerned-with-far-right-mk-becoming-minister-in-future-government/\" target=\"_blank\" rel=\"noopener noreferrer\">told Israel Hayom news</a> that they were against the likes of Itamar Ben-Gvir becoming a minister in any Israeli government.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure>\n            <img src=\"https://mf.b37mrtl.ru/files/2022.10/thumbnail/6347e39f20302736233a761d.jpg\" alt=\"Palestinian gunmen from the Balata refugee camp battalions emanating from the Fatah movement after a press conference after an Israeli army raid in which a 25-year-old Palestinian was killed and another was arrested, in Balata refugee camp, east of Nablus in the West Bank.\" />\n            <figcaption><a href=\"https://www.rt.com/news/564555-third-palestinian-intifada/\">A third Palestinian intifada: With political leaders becoming increasingly unpopular, a new armed uprising takes hold</a></figcaption>\n        </figure>\n    </blockquote>\n\n    \n\n<p>According to analysis by Shalom Lipner, who served the Israeli PM&rsquo;s office from 1990 to 2016, and published in &lsquo;Foreign Policy&rsquo;, a majority win for the Netanyahu bloc would put him at the mercy of the ultranationalists of Religious Zionism and <a href=\"https://foreignpolicy.com/2022/10/31/netanyahu-israel-religious-zionism-israels-political-virtuoso-in-denial/\" target=\"_blank\" rel=\"noopener noreferrer\">could cause a schism between Tel Aviv and Washington</a>.</p>\n<p>Religious Zionism will also push for <a href=\"https://www.jpost.com/israel-elections/article-720785\" target=\"_blank\" rel=\"noopener noreferrer\">other policy priorities</a>, including long-term prison sentences for illegal immigrants, as well as introducing the death penalty for Palestinian citizens of Israel that kill Jewish Israelis, and for revoking the citizenships of Palestinian-Israelis for throwing stones and Molotov cocktails at Israeli Jews.</p>\n<p>Another controversial policy position is the cancellation of a provision within the Law of Return for Jews, which currently entitles anyone with a Jewish grandparent to claim Israeli citizenship even if they aren&rsquo;t Jewish themselves. If this amendment to the Jewish Law of Return is adopted by the incoming government, it could greatly impact immigration to Israel from around the world and may cause a backlash from Jewish communities around the globe.</p>\n<p>What has been largely glossed over, however, is how such an Israeli government would impact Palestinians in the Palestinian Authority (PA). Back in September, then Israeli Prime Minister Yair Lapid <a href=\"https://news.un.org/en/story/2022/09/1127551\" target=\"_blank\" rel=\"noopener noreferrer\">spoke at the United Nations General Assembly</a>, entertaining the idea of a two-State solution, as did PA President Mahmoud Abbas and US President Joe Biden. Yair Lapid and then-Defense Minister Benny Gantz were both making a greater effort to strengthen the PA in the West Bank, in order to allow it confront the growing number of armed Palestinian groups in the occupied territory. If the Netanyahu-led far-right government that seems destined to rule is inaugurated, it is likely to flatly reject any talk of a two-State solution.</p>\n<p>The problem for both the Palestinian Authority and Israel is that they both need each other in order to prevent the armed uprising in the West Bank from growing even further.</p>\n<p>If Mahmoud Abbas is snubbed by Netanyahu and the PA is put in a chokehold&nbsp;under the influence&nbsp;of Religious Zionism, the Palestinian Authority will be forced to either fight Israel or face a possible rebellion from within.</p>\n<p>Furthermore, if the PA cannot be effective against grassroots Palestinian movements, NGOs and newly-formed armed groups, then the Israeli army will be forced to do all the heavy lifting, which means escalation and even greater bloodshed.</p>\n<p>If we combine the policies which could be on the way for dealing with Palestinians under occupation, with the possible injustices that may be carried out against Palestinian citizens of Israel, the stage may well be set for a large-scale Palestinian uprising. Not only have the Israeli public voted for a radical right-wing government, but they may have just voted for a massive escalation of the Palestine-Israel conflict, too.</p>",
  "enclosure": "",
  "pubDate": "Sat, 05 Nov 2022 15:56:22 +0000",
  "dc:creator": "RT"
}