{
  "id": "tag:blogger.com,1999:blog-582368152716771238.post-825285511729202178",
  "published": "2022-10-25T09:48:00.009-05:00",
  "updated": "2022-10-28T09:04:47.570-05:00",
  "category": [
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    "",
    ""
  ],
  "title": "Truss Tragedy",
  "content": "<p>(at <a href=\"https://www.project-syndicate.org/commentary/tragedy-liz-truss-right-policy-goals-bad-messaging-politics-by-john-h-cochrane-and-jon-hartley-2022-10?utm_source=twitter&amp;utm_medium=organic-social&amp;utm_campaign=page-posts-oct22&amp;utm_post-type=link&amp;utm_format=16:9&amp;utm_creative=quote-card&amp;utm_post-date=2022-10-25\" target=\"_blank\">Project Syndicate</a>)</p><p>The Liz Truss Tragedy</p><p><i>The former British prime minister’s downfall holds important lessons for growth-minded policymakers in the United States, Europe, and elsewhere. While her diagnosis of the country’s economic problem was spot on, she fatally mismanaged both the politics and the messaging of her policy response.</i></p><p>STANFORD – Liz Truss’s stint as British prime minister is over, but she was right that the United Kingdom needs growth. Her downfall is tragic, because growth is the only path out of the country’s economic dilemma.&nbsp;</p><p>The UK is surprisingly poor. Its <a href=\"https://ourworldindata.org/grapher/gdp-per-capita-worldbank?tab=chart&amp;country=USA~GBR\" target=\"_blank\">GDP per capita </a>is just $43,000, compared to $60,000 in the United States. The average British home is <a href=\"https://www.businessinsider.com/ons-english-homes-are-a-third-of-the-size-of-american-homes-2017-10\" target=\"_blank\">one-third</a> the size of the average US home. Worse, the country’s economy is not growing. Its GDP per capita is lower than it was in 2007.<a href=\"https://fred.stlouisfed.org/series/RTFPNAGBA632NRUG\" target=\"_blank\"> Productivity </a>– the underlying source of economic growth – has been flat for over a decade.&nbsp;</p><p>The UK desperately needs supply-side reforms. Surging inflation tells us that demand-side stimulus is a spent force.&nbsp;<span></span></p><a name='more'></a><p></p><p>If anything, Truss’s proposed reforms were too mild. A <a href=\"https://www.theguardian.com/politics/2022/oct/03/liz-truss-abandon-plan-scrap-45p-top-rate-income-tax-tory-revolt-kwasi-kwarteng-chancellor\" target=\"_blank\">40% top marginal income tax rate</a> (down from 45%) would not make the UK a low-tax free-market Shangri-La, especially considering that it would also still have a 20% value-added tax (VAT), national insurance taxes, property taxes, corporate taxes, and more. Recall that US President Ronald Reagan and Speaker of the House Tip O’Neill (a Democrat) cut the top federal marginal rate from <a href=\"https://www.history.com/this-day-in-history/reagan-signs-economic-recovery-tax-act-erta\" target=\"_blank\">70% to 28%</a>.&nbsp;</p><p>Truss also proposed free-market “<a href=\"https://www.theguardian.com/politics/2022/sep/30/liz-truss-to-push-ahead-with-unlimited-investment-zones-despite-costs-row\" target=\"_blank\">investment zones</a>.” But if one accepts that pro-investment tax and planning conditions are good in blighted areas, why not the whole country?&nbsp;</p><p>The UK is at a post-Brexit crossroads. Will it become a free-trade, entrepreneurial, financial hub – a “<a href=\"https://www.courthousenews.com/will-u-k-become-a-singapore-on-the-thames-rival-to-europe/\" target=\"_blank\">Singapore on Thames</a>”? Or does Brexit mean protecting and subsidizing inefficient businesses and places even more than the European Union allows?&nbsp;</p><p>Unfortunately, we now know the answer. Truss’s critics have no counterproposal that has any chance of reigniting growth. The stage is set for further high-tax, high-subsidy, over-regulated decline.&nbsp;</p><p>As sound as Truss’s plans were in economic-policy terms, her government’s handling of the messaging and the politics was spectacularly inept. That is an important lesson for those of us who want to see more growth-oriented policies in the US, Canada, and Europe.&nbsp;</p><p>One obvious mistake was Truss’s announcement of a £<a href=\"https://www.bloomberg.com/news/articles/2022-09-03/truss-spending-may-contribute-to-60-billion-shortfall-ft-says\" target=\"_blank\">60 billion</a> ($68 billion) blowout to hold down gas prices. That is not a good way to launch a pro-growth revolution.&nbsp;</p><p>She then moved on to “<a href=\"https://www.npr.org/2022/10/23/1130782408/how-liz-truss-aggressive-tax-cutting-policy-led-to-her-downfall\" target=\"_blank\">tax cuts</a>,” predictably raising the ire of the high-tax intelligentsia. In announcing the policy, neither Truss nor her chancellor of the Exchequer, Kwasi Kwarteng, explained the point of lowering tax rates. For example, Kwarteng <a href=\"https://www.ft.com/content/3c067e28-e33a-4bda-9f2e-81a109966b20\" target=\"_blank\">sold </a>tax cuts as “putting money back into people’s pockets.” But such Keynesian stimulus is the last thing the country needs amid historic inflation. Kwarteng should have explained that lower tax rates improve the incentives to work, save, invest, start a business, or, in the case of corporate taxes, move a business to the UK or keep it there. (Ideally, one cuts tax rates but broadens the base, maintaining revenues until spending falls.)&nbsp;</p><p>If you can’t explain that clearly and consistently, you either don’t understand or believe your own message, or you think voters are too dumb to comprehend it. Either way, your revolution will fail. In the face of predictable, implacable hostility from the entrenched left-wing media and economic commentariat, a free-market revolution needs great communicators.&nbsp;</p><p>By starting with taxes and subsidies, Truss and Kwarteng guaranteed that nobody would pay attention to the most important parts of the plan: the essential pro-growth regulatory reforms that they had described in the 2012 book <i><a href=\"https://link.springer.com/book/10.1057/9781137032249\" target=\"_blank\">Britannia Unchained</a></i>. Britain’s housing restrictions, as in the US, lead to absurdly high prices, which stymies many businesses and the workers they might hire. The situation is especially harmful to less-advantaged people who cannot afford to live near high-productivity jobs. Truss had also <a href=\"https://www.reuters.com/world/uk/new-uk-pm-truss-wants-more-oil-gas-extraction-north-sea-2022-09-07/\" target=\"_blank\">planned</a> to bring back North Sea oil production and lift the UK’s ban on fracking. These are sensible responses to a global energy crisis.&nbsp;</p><p>The lesson is that growth-minded policymakers should start with microeconomic reforms. Everyone can see that over-regulation and restrictions on housing and energy production are hobbling supply. Even climate-change activists are noticing that it is <a href=\"https://theconversation.com/onshore-wind-farm-restrictions-continue-to-stifle-britains-renewable-energy-potential-147812\" target=\"_blank\">too difficult</a> to get permits for windmills and transmission lines. Everyone can see that schools are awful and<a href=\"https://yougov.co.uk/topics/society/articles-reports/2021/06/02/current-state-english-school-system\" target=\"_blank\"> getting worse</a>. Workers as well as business owners and managers can see that labor<a href=\"https://www.researchgate.net/publication/5135628_Employment_Regulations_through_the_Eyes_of_Employers_Do_They_Matter_and_How_Do_Firms_Respond_to_Them\" target=\"_blank\"> regulations</a> are straitjacketing their workplaces. People can see in everyday experience how social-program disincentives lead some people not to work at all.&nbsp;</p><p>Patiently explaining these problems to voters can also make for good politics. We all long for simple mind-the-store competence in our governments. Fixing dysfunction is a visible achievement that works right away, with no short-run cost.&nbsp;</p><p>Truss’s handling of the politics was even worse than her marketing. Margaret Thatcher and Reagan faced the same withering scorn from the chattering classes, and they had to endure years of hardship before their reforms took root. But they held firm.&nbsp;</p><p>Truss’s critics seized on UK bond-market hiccups, though these were tiny compared to those of the 1980s. They also were largely attributable to the Bank of England <a href=\"https://www.reuters.com/markets/europe/bank-england-raises-rates-225-despite-likely-recession-2022-09-22/#:~:text=The%20BoE's%20Monetary%20Policy%20Committee,a%20smaller%20rise%20to%202%25.\" target=\"_blank\">raising rates</a>, and to a <a href=\"https://www.bloomberg.com/news/articles/2022-10-06/how-uk-pension-fund-risks-almost-toppled-britain-s-bond-market\" target=\"_blank\">pension </a>risk regulation fiasco. [Previous posts ending <a href=\"https://johnhcochrane.blogspot.com/2022/10/more-uk-finance-regulatory-failure.html\" target=\"_blank\">here</a>.] Nonetheless, Truss quickly gave in. By starting with an energy blowout to placate the left, she already encouraged her opponents to go in for the kill. When a shark is on your trail, you don’t offer it a foot and then assume that you’ll both get along. When an iron lady was needed, Truss proved to be made of straw.&nbsp;</p><p>The US, too, is a high-tax, over-regulated, over-subsidized, high-debt, slow-growth economy. For us, too, supply-side reforms are the only way out. Yet many of our conservative voices now pander to voters by advocating big-government big-tax nationalism, protectionism, subsidies, and crony capitalism, albeit directed in different directions than the left.&nbsp;</p><p>For those of us who still understand that the only real solution lies in economic freedom and small, competent government, Truss’s downfall offers important lessons. We must heed them so that we don’t blow our chance if we get one.&nbsp;</p><p>John H. Cochrane is a senior fellow of the Hoover Institution and an adjunct scholar at the CATO Institute.</p><p>Jon Hartley is a PhD student in economics at Stanford University and a research fellow at the Foundation for Research on Equal Opportunity.</p><p>****</p><p>PS, every bone in my body wanted to join the chorus yelling &nbsp;\"Hooray for fiscal theory of the price level, here come the bond market vigilantes I've been warning about for 20 years\" in response to the interest rate hiccups surrounding Truss' plan. But in honesty I cannot. The tax cuts were small, UK debt to GDP less than the US, similar tax cuts and raises have come and gone with nary a peep from the bond market -- Trump for example -- and the UK still borrows at negative rates. Look at interest rates in 1980. It doesn't add up. FTPL references debt to long-term ability to repay. You can't just pick and choose data points that coincide with your story and ignore the others. The point of asset markets is that nobody really knows why they move. Maybe it's true, but I need some indication that these small tax cuts really are the fiscal cliff.&nbsp;</p><p>Update: \"<a href=\"https://www.wsj.com/articles/rishi-sunak-wont-frack-u-k-natural-gas-liz-truss-russia-vladimir-putin-11666901841\" target=\"_blank\">Rishi Sunk won't allow fracking</a>\" WSJ. Here we go.&nbsp;</p>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "John H. Cochrane",
    "uri": "http://www.blogger.com/profile/04842601651429471525",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "thr:total": 29
}