{
  "title": "Protesters Maced at Canceled Far-right ‘Comedy’ Event at Penn State",
  "link": "https://www.splcenter.org/hatewatch/2022/10/25/protesters-maced-canceled-far-right-comedy-event-penn-state",
  "description": "<div class=\"field field-name-field-story-type field-type-list-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Hatewatch</div>\n      </div>\n</div>\n<div class=\"field field-name-field-long-text field-type-text-long field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Right-wing agitators allegedly sprayed protesters with mace at a far-right “comedy” event on Penn State’s campus in State College, Pennsylvania, on Monday night.</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-image field-type-image field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"></div>\n      </div>\n</div>\n<div class=\"field field-name-title-field field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><h1>Protesters Maced at Canceled Far-right ‘Comedy’ Event at Penn State</h1>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><p>Amid escalating tensions on Monday evening, Penn State canceled the event, which featured Gavin McInnes, founder of hate group the <a href=\"https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys\"> Proud Boys</a>, and right-wing YouTube performer Alex Stein. Until then, the university had ignored protesters and experts who warned that the gathering would attract violence to the campus.</p>\n<div data-embed-button=\"media\" data-entity-id=\"35273\" data-entity-label=\"Media\" data-entity-type=\"file\" data-entity-uuid=\"f6d527b3-25c6-44c8-b1bb-3b0e7ace0c07\" data-splc-media-url=\"\" data-view-mode=\"full\" class=\"align-right\">\n<div id=\"file-35273\" class=\"file file-image file-image-jpeg\">\n<h2 class=\"element-invisible\"><a href=\"/files/pennstateviolence2reuters-700pxjpg-0\"></a></h2>\n<div class=\"content\">\n    <img src=\"https://www.splcenter.org/sites/default/files/penn_state_violence_2_reuters-700px_0.jpg\" width=\"700\" height=\"490\" alt=\"Penn State violence\" title=\"Penn State violence\" /><br />\n<div class=\"field field-name-field-file-caption field-type-text-long field-label-hidden\">\n<div class=\"field-items\">\n<div class=\"field-item even \">An unidentified person wields a can of bear mace Monday before using it on protesters ahead of a scheduled event featuring Proud Boys founder Gavin McInnes at Penn State University in State College, Pennsylvania. The event was canceled by Penn State officials \"due to the threat of escalating violence.\" (Photo via Reuters/Leah Millis)</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<p>The group that hosted the event, meanwhile – which has connections to a broad network of far-right activists and groups – is advertising further events at other universities.</p>\n<p>A participant in the rally (whose name is being withheld over personal safety concerns) told Hatewatch that the mood among 200 or so protesters on campus had been defiant but upbeat until the event was escalated in two ways by campus police.</p>\n<p>At one point, the protester said, a number of mounted police moved to a small area on one side of the venue, in close proximity to one group of protesters.</p>\n<p>“That escalated things. People started yelling, ‘Fuck you!’ at the cops,” he told Hatewatch in a telephone conversation, “and some of them started saying, ‘Fuck you!’ back.”</p>\n<p>Video of the event <a href=\"https://twitter.com/StreamerWayward/status/1584816255885664256\"> posted on social media</a> appears to confirm this account of police entering into a contentious interaction with protesters.</p>\n<p>Soon afterwards, he said, police allowed Alex Stein – one of the scheduled speakers – to mingle with the crowd at some distance from law enforcement, provoking them as he often does to generate outrage content for his YouTube channel.</p>\n<p>“Very obviously, [Stein] was trying to get in people’s faces to get content,” the protester said.</p>\n<p>Daryle Lamont Jenkins, who reported on the event for independent antifascist news website <a href=\"http://idavox.com/index.php/2022/10/25/fash-started-it-and-penn-state-ended-it-gavin-mcinnes-campus-event-shut-down/\"> Idavox</a>, confirmed that Stein attempted to “<a href=\"https://twitter.com/IdavoxOPP/status/1584719838567878656?s=20&amp;t=HoACC8JYunnNmLLXv43fug\">troll</a>” the crowd.</p>\n<p>He told Hatewatch in a telephone conversation that until that point, the focus had been on “maintaining a vigil,” but “the mood changed when Alex Stein started provoking people.”</p>\n<p>“He shouldn’t have been allowed to do that,” Jenkins added.</p>\n<p>“The police weren’t standing close enough to intervene had someone thrown a punch,” Jenkins said.</p>\n<p>“To the credit of protesters, almost no one took the bait,” Jenkins said. “Stein was <a href=\"https://twitter.com/IdavoxOPP/status/1584883948483936256?s=20&amp;t=HoACC8JYunnNmLLXv43fug\"> visibly frustrated</a> that people were not being more aggressive in their responses to him.”</p>\n<p>Soon after, according to Jenkins, a number of Proud Boys emerged into the crowd and began interacting aggressively with protesters.</p>\n<p>Finally in an incident captured on <a href=\"https://twitter.com/FordFischer/status/1584904927234719745?s=20&amp;t=A-9-yqHZWM5Q3anTOVofkA\"> multiple videos</a> posted to social media, a protester on the far-right side – clad in body armor and facial protection gear that obscured his identity – released pepper spray into the crowd without provocation, disabling nearby students and reporters.</p>\n<p>Soon after, Penn State canceled the event and issued a statement that appeared to blame student protesters for violence, without citing evidence. The statement condemned \"polarization\" rather than far-right violence.</p>\n<p>The statement defended Penn State’s actions while offering an idiosyncratic theory of protest, stating, “We have encouraged peaceful protest, and, while protest is an acceptable means of expression, it becomes unacceptable when it obstructs the basic exchange of ideas.”</p>\n<p>“Such obstruction is a form of censorship, no matter who initiates it or for what reasons,” the statement added.</p>\n<p>Neither that statement, nor a <a href=\"https://www.psu.edu/news/campus-life/story/message-president-neeli-bendapudi-cancellation-campus-event/\"> follow-up</a> signed by Penn State president Neeli Bendapudi, acknowledged that student protesters had been pepper-sprayed by far-right activists, with Bendapudi claiming that it was “unclear which individuals onsite then resorted to ... using pepper spray.”</p>\n<p>Hatewatch contacted Penn State’s strategic communication office for comment on the actions of police and the outcome of the event, but there was no immediate response.</p>\n<p>Meanwhile, Uncensored America (UA), which hosted the event, is still advertising future events and promoting its chapters at Penn State, the University of Tennessee, Knoxville, and the University of Wisconsin-Madison. All the group’s past and future events platform far-right speakers, sometimes in “debates” with other social media performers who style themselves as liberals or centrists.</p>\n<p>As Hatewatch <a href=\"https://www.splcenter.org/hatewatch/2022/10/20/far-right-student-organization-brings-extremists-mcinnes-doyle-penn-state-and-tennessee\"> previously reported</a>, the group was founded by Sean Semanko, whose membership in the pro-Trump student group the Bull Moose Party links him with a network of far-right actors that includes the principals of white nationalist publishing house <a href=\"https://www.splcenter.org/hatewatch/2022/06/13/white-nationalist-book-publishers-revealed\"> Antelope Hill</a>.</p>\n<p>In September, the event was approved for funding by Penn State’s University Park Allocation Committee (UPAC), which allocates a proportion of student fees to registered student organizations for on-campus events.</p>\n<p>UPAC records show that funding included $6,500 total in honoraria for McInnes and Stein, and over $1,000 for their airfares, according to UPAC meeting records.</p>\n<p>On Penn State’s decision to host the event, Jenkins, the journalist, said that alongside the threat to public safety, these payments from student fees were the main concerns of protesters.</p>\n<p>On the administration’s decision to try to hold the event, Jenkins said: “Free speech is not a suicide pact. You knew this was coming.”</p>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-byline field-type-text field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \">Jason Wilson</div>\n      </div>\n</div>\n<div class=\"field field-name-field-addthis field-type-addthis field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><div class=\"addthis_toolbox addthis_default_style  \" addthis:title=\"Protesters Maced at Canceled Far-right &amp;lsquo;Comedy&amp;rsquo; Event at Penn State - Southern Poverty Law Center\" addthis:url=\"https://www.splcenter.org/hatewatch/2022/10/25/protesters-maced-canceled-far-right-comedy-event-penn-state\"><a href=\" \" class=\"addthis_button_facebook\" aria-label=\"Facebook: Share this page\"></a>\n<a href=\" \" class=\"addthis_button_twitter\" aria-label=\"Twitter: Share this page\"></a>\n</div>\n</div>\n      </div>\n</div>\n<div class=\"field field-name-field-publish-date field-type-date field-label-hidden\">\n    <div class=\"field-items\">\n                <div class=\"field-item even \"><span class=\"date-display-single\">October 25, 2022</span></div>\n      </div>\n</div>",
  "pubDate": "Tue, 25 Oct 2022 21:08:25 +0000",
  "dc:creator": "chris.heller_1541",
  "guid": "17199 at https://www.splcenter.org"
}