{
  "title": "Dask Development Log",
  "link": "",
  "updated": "2017-12-06T00:00:00+00:00",
  "id": "https://mrocklin.github.io/blog/work/2017/12/06/dask-dev-9",
  "content": "<p><em>This work is supported by <a href=\"http://anaconda.com\">Anaconda Inc</a> and the\nData Driven Discovery Initiative from the <a href=\"https://www.moore.org/\">Moore\nFoundation</a></em></p>\n\n<p>To increase transparency I’m trying to blog more often about the current work\ngoing on around Dask and related projects.  Nothing here is ready for\nproduction.  This blogpost is written in haste, so refined polish should not be\nexpected.</p>\n\n<p>Current development in Dask and Dask-related projects includes the following\nefforts:</p>\n\n<ol>\n  <li>A possible change to our community communication model</li>\n  <li>A rewrite of the distributed scheduler</li>\n  <li>Kubernetes and Helm Charts for Dask</li>\n  <li>Adaptive deployment fixes</li>\n  <li>Continued support for NumPy and Pandas’ growth</li>\n  <li>Spectral Clustering in Dask-ML</li>\n</ol>\n\n<h3 id=\"community-communication\">Community Communication</h3>\n\n<p>Dask community communication generally happens in Github issues for bug and\nfeature tracking, the Stack Overflow #dask tag for user questions, and an\ninfrequently used Gitter chat.</p>\n\n<p>Separately, Dask developers who work for Anaconda Inc (there are about five of\nus part-time) use an internal company chat and a closed weekly video meeting.\nWe’re now trying to migrate away from closed systems when possible.</p>\n\n<p>Details about future directions are in <a href=\"https://github.com/dask/dask/issues/2945\">dask/dask\n#2945</a>.  Thoughts and comments on\nthat issue would be welcome.</p>\n\n<h3 id=\"scheduler-rewrite\">Scheduler Rewrite</h3>\n\n<p>When you start building clusters with 1000 workers the distributed scheduler\ncan become a bottleneck on some workloads.  After working with PyPy and Cython\ndevelopment teams we’ve decided to rewrite parts of the scheduler to make it\nmore amenable to acceleration by those technologies.  Note that no actual\nacceleration has occurred yet, just a refactor of internal state.</p>\n\n<p>Previously the distributed scheduler was focused around a large set of Python\ndictionaries, sets, and lists that indexed into each other heavily.  This was\ndone both for low-tech code technology reasons and for performance reasons\n(Python core data structures are fast).  However, compiler technologies like\nPyPy and Cython can optimize Python object access down to C speeds, so we’re\nexperimenting with switching away from Python data structures to Python objects\nto see how much this is able to help.</p>\n\n<p>This change will be invisible operationally (the full test suite remains\nvirtually unchanged), but will be a significant change to the scheduler’s\ninternal state.  We’re keeping around a compatibility layer, but people who\nwere building their own diagnostics around the internal state should check out\nwith the new changes.</p>\n\n<p>Ongoing work by Antoine Pitrou in <a href=\"https://github.com/dask/distributed/pull/1594\">dask/distributed #1594</a></p>\n\n<h3 id=\"kubernetes-and-helm-charts-for-dask\">Kubernetes and Helm Charts for Dask</h3>\n\n<p>In service of the <a href=\"https://pangeo-data.github.io\">Pangeo</a> project to enable\nscalable data analysis of atmospheric and oceanographic data we’ve been\nimproving the tooling around launching Dask on Cloud infrastructure,\nparticularly leveraging Kubernetes.</p>\n\n<p>To that end we’re making some flexible Docker containers and Helm Charts for\nDask, and hope to combine them with JupyterHub in the coming weeks.</p>\n\n<p>Work done by myself in the following repositories.  Feedback would be very\nwelcome.  I am learning on the job with Helm here.</p>\n\n<ul>\n  <li><a href=\"https://github.com/dask/helm-chart\">https://github.com/dask/dask-docker</a></li>\n  <li><a href=\"https://github.com/dask/helm-chart\">https://github.com/dask/helm-chart</a></li>\n</ul>\n\n<p>If you use Helm on Kubernetes then you might want to try the following:</p>\n\n<div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>helm repo add dask https://dask.github.io/helm-chart\nhelm update\nhelm install dask/dask\n</code></pre></div></div>\n\n<p>This installs a full Dask cluster and a Jupyter server.  The Docker containers\ncontain entry points that allow their environments to be updated with custom\npackages easily.</p>\n\n<p>This work extends prior work on the previous package,\n<a href=\"https://github.com/dask/dask-kubernetes\">dask-kubernetes</a>, but is slightly\nmore modular for use alongside other systems.</p>\n\n<h3 id=\"adaptive-deployment-fixes\">Adaptive deployment fixes</h3>\n\n<p>Adaptive deployments, where a cluster manager scales a Dask cluster up or down\nbased on current workloads recently got a makeover, including a number of bug\nfixes around odd or infrequent behavior.</p>\n\n<p>Work done by <a href=\"https://github.com/rbubley\">Russ Bubley</a> here:</p>\n\n<ul>\n  <li><a href=\"https://github.com/dask/distributed/pull/1607\">dask/distributed #1607</a></li>\n  <li><a href=\"https://github.com/dask/distributed/pull/1608\">dask/distributed #1608</a></li>\n  <li><a href=\"https://github.com/dask/distributed/pull/1609\">dask/distributed #1609</a></li>\n</ul>\n\n<h3 id=\"keeping-up-with-numpy-and-pandas\">Keeping up with NumPy and Pandas</h3>\n\n<p>NumPy 1.14 is due to release soon.  Dask.array had to update how it handled\nstructured dtypes in <a href=\"https://github.com/dask/dask/pull/2964\">dask/dask #2694</a>\n(Work by Tom Augspurger).</p>\n\n<p>Dask.dataframe is gaining the ability to merge/join simultaneously on columns\nand indices, following a similar feature released in Pandas 0.22.  Work done by\nJon Mease in <a href=\"https://github.com/dask/dask/pull/2960\">dask/dask #2960</a></p>\n\n<h3 id=\"spectral-clustering-in-dask-ml\">Spectral Clustering in Dask-ML</h3>\n\n<p>Dask-ML recently added an approximate and scalable Spectral Clustering\nalgorithm in <a href=\"https://github.com/dask/dask-ml/pull/91\">dask/dask-ml #91</a>\n(<a href=\"http://dask-ml.readthedocs.io/en/latest/auto_examples/plot_spectral_clustering.html\">gallery example</a>).</p>"
}