{
  "id": "https://bibleinoneyear.org/en/youth/64",
  "title": "Day 64: How to Keep Healthy",
  "description": "Proverbs 6:20–27, Leviticus 13:59, Mark 12:28–31,35-37b. Even more important than a healthy physical heart is the condition of your spiritual heart  In the passages for today we see five key ways to keep your spiritual heart healthy",
  "pubDate": "Fri, 05 Mar 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/64/?ignore",
  "itunes:duration": "13:22",
  "guid": "enyouth05032021-64",
  "length": 802.06,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 64: How to Keep Healthy",
  "itunes:subtitle": "Proverbs 6:20–27, Leviticus 13:59, Mark 12:28–31,35-37b. Even more important than a healthy physical heart is the condition of your spiritual heart  In the passages for today we see five key ways to keep your spiritual heart healthy",
  "itunes:summary": "Avoid smoking and using tobacco products\nBe physically active every day\nEat a heart-healthy diet\nMaintain a healthy weight\nManage your blood pressure\nControl your total cholesterol\nKeep your blood sugar healthy\n\nAccording to the American Heart Association, these are the seven things that you should do to keep your physical heart healthy.\nThe human heart weighs less than a pound (450g). It beats 100,000 times a day and over 2.5 billion times in the average lifetime. Your system of blood vessels – arteries, veins and capillaries – is over 60,000 miles long – enough to go around the world more than twice.\nThis is not just an amazing spectacle; it is the ‘heart’ of human life. Without your heart your body would quickly cease to work. Heart disease is the number one cause of death in the Western world.\nJesus spoke a great deal about the heart. The heart is a metaphor for the inner life. The word Jesus used means the seat of the physical, spiritual and mental life. The heart is the centre and the source of the whole inner being – thinking, feeling, and willing.\nGod is concerned, primarily, about your heart. He wants you to have a healthy heart. He said to Samuel, ‘The Lord does not look at the things people look at. People look at the outward appearance, but the Lord looks at the heart’ (1 Samuel 16:7).\nEven more important than a healthy physical heart is the condition of your spiritual heart. In the passages for today we see five key ways to keep your spiritual heart healthy.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 64
}