{
  "title": "EPISODE 49 The Father of Martial Arts: Jigoro Kano (Part 1)",
  "dc:creator": "Daniele Bolelli",
  "pubDate": "Thu, 06 Jun 2019 20:22:51 +0000",
  "link": "http://historyonfirepodcast.com/episodes/2019/6/1/episode-49-the-father-of-martial-arts-jigoro-kano-part-1",
  "guid": "5578b4f8e4b0c66a0f23675e:558068f6e4b06fdef68b1c8e:5cf2231badb6f600012cb84c",
  "description": "<figure class=\"\n              sqs-block-image-figure\n              intrinsic\n            \"\n        >\n          \n        \n        \n\n        \n          \n            \n          \n            \n              <img class=\"thumb-image\" data-image=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1559852536782-60VZ7LO7588VT1AR2DMV/HOF-49-JigoroKano-Pt01-FatherOfMartialArts.jpg\" data-image-dimensions=\"1000x1000\" data-image-focal-point=\"0.5,0.5\" alt=\"HOF-49-JigoroKano-Pt01-FatherOfMartialArts.jpg\" data-load=\"false\" data-image-id=\"5cf975f5dfde820001250628\" data-type=\"image\" src=\"https://images.squarespace-cdn.com/content/v1/5578b4f8e4b0c66a0f23675e/1559852536782-60VZ7LO7588VT1AR2DMV/HOF-49-JigoroKano-Pt01-FatherOfMartialArts.jpg?format=1000w\" />\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n<p class=\"\"><em>“It was a period of stupendous change and immense challenge; the entire social, political, and economic landscape of Japan would be transformed within a few decades. Just as this new era was dawning in Japan, Jigoro Kano was born, on October 28, 1860.”</em> — John Stevens&nbsp;</p><p class=\"\"><em>“In my childhood, I had heard that there was a thing called jujutsu thanks to which even a weak person could defeat a strong person. I definitely thought about learning it.”</em> — Jigoro Kano&nbsp;</p><p class=\"\">“Some people believe that Judo means simply practicing at the dojo. This is applying the principle of judo at the dojo when practicing defense against attack, and through it is certainly one aspect of judo, it is only a small part of it.” — Jigoro Kano&nbsp;</p><p class=\"\">In the second half of the 1800s, after the United States made Japan an offer it couldn’t refuse, Japan experienced a period of crisis and extremely fast modernization. Swept by efforts to copy everything that made the West powerful, Japan turned its back on much of its traditional culture. Martial arts were considered anachronistic and irrelevant, and looked well on their way to disappear into the dustbin of history much in the same way as they had done in other parts of the world. In 1882, a small, nerdy man named Jigoro Kano made his stand to reverse this process. Kano was only 22 years old, and had only little over 5 years of martial arts practice. But what 22-year old Kano started in some spare rooms in a Buddhist temple was going to affect the lives of millions of people.</p><p class=\"\">This story is about martial arts, but is also about much more. This story is about the dramatic transformations in Japanese history in the 1800s (and without understanding them, it’s pretty much impossible to understand the role played by Japan in WWII.) It is a story about how one individual can radically impact millions. It’s about how cultural traditions that are seemingly anachronistic can be reinvented to provide value in a modern context. It’s a story about Taoist philosophy, Olympic Games and U.S. presidents, pro-wrestling and helping society, the tension between globalization and nationalism, the role that physical education can play in shaping a person’s character, and a bunch of other things that have only marginally to do with martial arts per se. So, with this in mind, let’s get rolling.&nbsp;</p><p class=\"\">If you'd like to keep following my work on Luminary, please follow my personal link to their platform to sign up. Thank you for understanding that this move is necessary to keep History on Fire viable. <a href=\"https://luminarypodcasts.com/signup?_branch_match_id=486767570160189673\">luminary.link/history</a>&nbsp;</p><p class=\"\">My lady (and author of History on Fire logo, plus producer and editor of History on Fire) has a FB public page about her art & fighting: <a href=\"https://www.facebook.com/NahryEm/\">https://www.facebook.com/NahryEm/</a>.&nbsp;</p><p class=\"\">This is my public FB page: <a href=\"https://www.facebook.com/danielebolelli1/\">https://www.facebook.com/danielebolelli1/</a>&nbsp;</p><p class=\"\">Here is a link to the audiobook of my “Not Afraid”: <a href=\"http://www.danielebolelli.com/downloads/not-afraid-audiobook/\">http://www.danielebolelli.com/downloads/not-afraid-audiobook/</a>&nbsp;</p><p class=\"\">For those of you who may be interested, here is a lecture series I created about Taoist philosophy: <a href=\"http://www.danielebolelli.com/downloads/taoist-lectures/\">http://www.danielebolelli.com/downloads/taoist-lectures/</a></p>",
  "media:content": {
    "media:title": "EPISODE 49 The Father of Martial Arts: Jigoro Kano (Part 1)"
  }
}