{
  "title": "SC EP:450 Watch out of for the Boogerman!",
  "itunes:title": "SC EP:450 Watch out of for the Boogerman!",
  "pubDate": "Mon, 09 Jul 2018 00:26:09 +0000",
  "guid": "gid://art19-episode-locator/V0/getbB_16nwpZEww6fJEI-cUABLcp24LPCKmiLpKZqDY",
  "link": "https://traffic.libsyn.com/secure/sasquatchchronicles/45020FINAL.mp3",
  "itunes:image": "",
  "description": "<p>John writes \"In 1983 When I was 18 yrs old me and a friend who has since passed away, God rest his soul were backed up on a tractor path in forsyth county, North Carolina.</p> <p>This path was off an old dirt road that ended down where it got at the bottom of a holler at the creek bottoms. This road was bout 1/3 of a mile as the crow flies to corn products. This company takes corn and renders it down into animal feed and such. The company has corn brought in by rail in open boxcars and the corn would fall onto the rails from the shakin and moving of the train and such. The rails kinda follow the creek down in the bottoms before it rises up to the plant to be processed. I recond because of the water source cause them there rails been laid many a lustrum ago! That corn attracts many a critter down on the ground that away! We would go deer,dove and coon huntin down in them bottoms and have a field day.</p> <p>Many a family was fed with the critters harvested down in that holler. There was only a few farm houses on that road back then and they would use that path to get to the bottoms where they planted corn,soybean and such.The path was about 14-15 feet wide. That was so they could get the disc and such down in there. Us youngins would go park down there and party durin the summer cause the closest farm house was way yonder up on the hill overlookin the holler. Kinda place where u scream and nobody would hear ya. We did hear sum hollarin down in the creek beds now and again but we thought it was just sum good ole boys rasin hell and such. On a cloudy night it would get kinda spooky sum of the girls got a bad vibe down there! Like I said sum nights be as dark as the inside of a cow don’t cha know. Well this path was bout 30 feet from the end of the road and it cut through bout 100 yrds of thick timber. Path kinda rose up slightly and crested and went down to the bottoms. I know i’m rambling a bit but I think all this is kinda important to the sightin! Like I said we’d park down there and not be to eco friendly with our trash. We would eat and drink down there and try to keep it fairly clean cause the farmers would not like trash all over.</p> <p>The law would start getting involved. On the other side of dirt road was about 25 yrds of scrub and thicket. then a hill that went up 30 or 40 feet and hwy 52 was up there. You could not see road from hwy. Now we had seen sum scuff marks on path that kinda looked like prints but were way too big and too far apart that we didn’t think much of it. Well we had been there bout 10 minutes and we had a six pack of beer with us, back then u could buy beer at 18 and we had the windows rolled down and the ole car I had back then only had am radio so we had boom box playin real low, it seemed awful quiet in the woods that night. We were gonna go to this party at a girls house whos parents were gone 4 the 4th holiday I think that’s what got me thinkin bout this! It was bout 10 at night so we were gonna drink them beers real quick and smoke a fatty before we went to party cause they really didn’t get goin till bout 11:00 or 11:30. I had just opened beer and randy was lookin down twistin it up when I took my first swallow and as I was lookin down path this THING takes one stride now…and is standin facing us at the bottom of the path! I bout choked on that bud i’m here to say!</p> <p>Now I’ve been to wrestling matches and I’ve seen the undertaker and the big show up pretty close well this THING had about a foot and a half or maybe two on the big show, he made him look like the little show! The damn shoulders on it were damn near as wide as the hood of my pinto! I would put it at about 500 to 600 lbs! Now I had seen the legend of boggy creek and the Patterson footage.Like everybody says not here …In North Carolina.Then I thought well that’s what them tracks on the path were! I slowly elbowed randy in the side and whispered, slowly look up and do not scream..still lookin down he chuckled why…I said just do it and he did and jerked backwards and said what the f##k is that and I said guess. You could see the hair hanging down it’s body…but what I was concerned about was he was making fists with his hands over and over and I could hear the damn thing breathin over the radio..it was almost like it was working its way up to a confrontation and that breathin was spooky.Then he started lookin at us and kinda swiveling his head from side to side like a dog does when it hears sumthin it don’t understand u know what i’m saying? Then randy says turn your lights on maybe that will scare it away. I said r u crazy that thing is not afraid of any animal walking this earth. Then we heard this strange noise to his right our left..kinda like a whistle but different. Like people say it turned it’s head and body to look.</p> <p>Then it looked back at us and made this sound like when you disagree with somebody or think what they said was stupid…u know…psssst. Very loud and like he was saying your not worth my time, I got places to go and things to do. What I think the problem was we were blocking his easy access to the bottoms! He just turned and now just took one stride and was outta sight. We had turned off music and never heard a sound as he was leavin..somthing that big should make noise as it moved away but nuthin. Got the hell outa there and never went back! I have told 5 people all think i’m crazy except good ole boy used to work with said he seen one while huntin in Yadkin county!”</p> <p> </p> <p>JD writes \"I am a lifelong Kentuckian of 39 years. I should have emailed you long ago as I have been a fan of your incredible show and platform that I consider a cornerstone institution of Sasquatch cryptology.</p> <p>I shared a series of 3 consecutive encounters with an individual male Sasquatch with some of my childhood friends the summer before our senior year of highschool in Wolfe County Kentucky.</p> <p>As the summer vacation was winding down before the start of our final year of highschool me and my friends knew the campouts and summer vacations we’d shared for so many years would not be the same once our final year of school was completed and our lives inevitably shifted into adulthood. At 17 years of age I had already signed my military contract and was scheduled for basic immediately following graduation.</p> <p>We had over the years spent countless nights camping under the cliff overhangs colloquially known as ‘ rock houses’, even going as far as installing carpet remnants and constructing elaborate stone fire pits and enjoying all night arrowhead digging with our own large, custom built, mesh screen sifters. Several of us local boys were quite knowledgeable about native American artifacts. We were All American eastern Kentucky lads, most of us having fairly impressive gun collections as teenagers, trophy white tail racks, and native arrowhead & pottery collections.</p> <p>On a whim we decided to camp down at one of our favorite cave houses situated within the Daniel Boone National Forest. I grew up on a rural spread in the D Boone(as we refer to it).</p> <p>It was in July of 1995 and as the 3 of us finished collecting supplies for a comfortable overnight we were joined by two other local boys from our senior class. Those two hadn’t spent as much time roaming the creeks and ridges as myself and my two compadres but they wanted to share in the last of the summer fun.</p> <p>All five of us brought our favorite guns & snacks and we trecked down to our humble abode for the night. We built a small fire from our extensive cache of firewood to cook on and settled in for an evening of cave ash sifting, a cold beer or two and profanity laced fish tales.</p> <p>When we were much younger and were spending our first nights on our own campout adventures my retired Air Force father would hike down at a late hour and just check on us and then hike an hour or two back home.</p> <p>I mention this because the first encounter began with footsteps approaching our camp. My closest friend asked me if my father could be hiking down to check up on us? I told him and the others it was very unlikely as it had been some time since he had done that but not to worry as it could mean there was a family emergency or other.</p> <p>As I listened to the footsteps approaching I commented on how much heavier the foot steps were compared to one of us walking up the same path.</p> <p>None of my companions seriously considered my observation. And the bipedal individual walked to point approximately 80 feet down the sloping hill below the cliff overhang we were set up in. It was a curious situation with whatever or whoever had come to visit was now silently lingering below us. Between the five of us we had ten firearms strewn about the rock house. And being together next to our camp fire we felt only mild apprehension and some guarded curiosity. I had already began considering what we possibly had on our hands as Sasquatch was a semi regular visitor in our neighborhood with numerous sightings in my family over the many years.</p> <p>My suggestion to the same was met with stiffled laughter but I paid my friends no mind. They believed it could only be my father checking up on us even though he had stopped doing such a few years earlier.</p> <p>The two local boys that had joined our outing seemed to be the most unsettled and busied themselves preparing a meal for themselves as a diversion. One of my oldest friends never quit sifting for arrowheads only commenting “if it comes up here just shoot it”. So two of us stepped beyond the edge of the firelight allowing our eyes to adjust and used two D cell flashlights to try and identify what we had apparently standing behind a large poplar tree. The first thing we noticed was two red eyes opening and closing peeking from the edge of the tree. Eventually stepping half way out from behind the poplar tree the two of us saw that this was not a human but a Bigfoot covered in grey / white hair. I mentally marked a spot near its head for measurement later which showed it to be 7 1/2 feet tall.</p> <p>This whole encounter had lasted twenty minutes at that point. The stocky creature eventually easing out from behind the tree giving us a fair gander at him. Wes, it’s face was human and reminded me of an 80 year old Irishman. The only hair on his face was what looked like naturally grown mutton chops. My friend prodded me to walk up to it and see if I could shake it’s hand which was simply another of our standard & ludicrous challenges posed amongst each other, these inevitably involved something of the stupid and dangerous variety.</p> <p>It never made a peep standing behind the largest poplar below center of the rock house. Walking up to our location it walked the same path we had. And it didn’t seem to concern itself with being heard as it walked up to us either.</p> <p>After finally, and seemingly purposely stepping out from his tree and allowing us a good ten second look at him he eased back behind the tree and stood there silently for enough time to pass my friend and I went back up under the cliff. Later on I surmised it had done this purposely however, when it set off on a diagonal path out of the holler it sounded as if it huffed & puffed in some frustration as if he had wasted time he could have been golfing.”</p>",
  "content:encoded": "<p>John writes \"In 1983 When I was 18 yrs old me and a friend who has since passed away, God rest his soul were backed up on a tractor path in forsyth county, North Carolina.</p> <p>This path was off an old dirt road that ended down where it got at the bottom of a holler at the creek bottoms. This road was bout 1/3 of a mile as the crow flies to corn products. This company takes corn and renders it down into animal feed and such. The company has corn brought in by rail in open boxcars and the corn would fall onto the rails from the shakin and moving of the train and such. The rails kinda follow the creek down in the bottoms before it rises up to the plant to be processed. I recond because of the water source cause them there rails been laid many a lustrum ago! That corn attracts many a critter down on the ground that away! We would go deer,dove and coon huntin down in them bottoms and have a field day.</p> <p>Many a family was fed with the critters harvested down in that holler. There was only a few farm houses on that road back then and they would use that path to get to the bottoms where they planted corn,soybean and such.The path was about 14-15 feet wide. That was so they could get the disc and such down in there. Us youngins would go park down there and party durin the summer cause the closest farm house was way yonder up on the hill overlookin the holler. Kinda place where u scream and nobody would hear ya. We did hear sum hollarin down in the creek beds now and again but we thought it was just sum good ole boys rasin hell and such. On a cloudy night it would get kinda spooky sum of the girls got a bad vibe down there! Like I said sum nights be as dark as the inside of a cow don’t cha know. Well this path was bout 30 feet from the end of the road and it cut through bout 100 yrds of thick timber. Path kinda rose up slightly and crested and went down to the bottoms. I know i’m rambling a bit but I think all this is kinda important to the sightin! Like I said we’d park down there and not be to eco friendly with our trash. We would eat and drink down there and try to keep it fairly clean cause the farmers would not like trash all over.</p> <p>The law would start getting involved. On the other side of dirt road was about 25 yrds of scrub and thicket. then a hill that went up 30 or 40 feet and hwy 52 was up there. You could not see road from hwy. Now we had seen sum scuff marks on path that kinda looked like prints but were way too big and too far apart that we didn’t think much of it. Well we had been there bout 10 minutes and we had a six pack of beer with us, back then u could buy beer at 18 and we had the windows rolled down and the ole car I had back then only had am radio so we had boom box playin real low, it seemed awful quiet in the woods that night. We were gonna go to this party at a girls house whos parents were gone 4 the 4th holiday I think that’s what got me thinkin bout this! It was bout 10 at night so we were gonna drink them beers real quick and smoke a fatty before we went to party cause they really didn’t get goin till bout 11:00 or 11:30. I had just opened beer and randy was lookin down twistin it up when I took my first swallow and as I was lookin down path this THING takes one stride now…and is standin facing us at the bottom of the path! I bout choked on that bud i’m here to say!</p> <p>Now I’ve been to wrestling matches and I’ve seen the undertaker and the big show up pretty close well this THING had about a foot and a half or maybe two on the big show, he made him look like the little show! The damn shoulders on it were damn near as wide as the hood of my pinto! I would put it at about 500 to 600 lbs! Now I had seen the legend of boggy creek and the Patterson footage.Like everybody says not here …In North Carolina.Then I thought well that’s what them tracks on the path were! I slowly elbowed randy in the side and whispered, slowly look up and do not scream..still lookin down he chuckled why…I said just do it and he did and jerked backwards and said what the f##k is that and I said guess. You could see the hair hanging down it’s body…but what I was concerned about was he was making fists with his hands over and over and I could hear the damn thing breathin over the radio..it was almost like it was working its way up to a confrontation and that breathin was spooky.Then he started lookin at us and kinda swiveling his head from side to side like a dog does when it hears sumthin it don’t understand u know what i’m saying? Then randy says turn your lights on maybe that will scare it away. I said r u crazy that thing is not afraid of any animal walking this earth. Then we heard this strange noise to his right our left..kinda like a whistle but different. Like people say it turned it’s head and body to look.</p> <p>Then it looked back at us and made this sound like when you disagree with somebody or think what they said was stupid…u know…psssst. Very loud and like he was saying your not worth my time, I got places to go and things to do. What I think the problem was we were blocking his easy access to the bottoms! He just turned and now just took one stride and was outta sight. We had turned off music and never heard a sound as he was leavin..somthing that big should make noise as it moved away but nuthin. Got the hell outa there and never went back! I have told 5 people all think i’m crazy except good ole boy used to work with said he seen one while huntin in Yadkin county!”</p> <p> </p> <p>JD writes \"I am a lifelong Kentuckian of 39 years. I should have emailed you long ago as I have been a fan of your incredible show and platform that I consider a cornerstone institution of Sasquatch cryptology.</p> <p>I shared a series of 3 consecutive encounters with an individual male Sasquatch with some of my childhood friends the summer before our senior year of highschool in Wolfe County Kentucky.</p> <p>As the summer vacation was winding down before the start of our final year of highschool me and my friends knew the campouts and summer vacations we’d shared for so many years would not be the same once our final year of school was completed and our lives inevitably shifted into adulthood. At 17 years of age I had already signed my military contract and was scheduled for basic immediately following graduation.</p> <p>We had over the years spent countless nights camping under the cliff overhangs colloquially known as ‘ rock houses’, even going as far as installing carpet remnants and constructing elaborate stone fire pits and enjoying all night arrowhead digging with our own large, custom built, mesh screen sifters. Several of us local boys were quite knowledgeable about native American artifacts. We were All American eastern Kentucky lads, most of us having fairly impressive gun collections as teenagers, trophy white tail racks, and native arrowhead & pottery collections.</p> <p>On a whim we decided to camp down at one of our favorite cave houses situated within the Daniel Boone National Forest. I grew up on a rural spread in the D Boone(as we refer to it).</p> <p>It was in July of 1995 and as the 3 of us finished collecting supplies for a comfortable overnight we were joined by two other local boys from our senior class. Those two hadn’t spent as much time roaming the creeks and ridges as myself and my two compadres but they wanted to share in the last of the summer fun.</p> <p>All five of us brought our favorite guns & snacks and we trecked down to our humble abode for the night. We built a small fire from our extensive cache of firewood to cook on and settled in for an evening of cave ash sifting, a cold beer or two and profanity laced fish tales.</p> <p>When we were much younger and were spending our first nights on our own campout adventures my retired Air Force father would hike down at a late hour and just check on us and then hike an hour or two back home.</p> <p>I mention this because the first encounter began with footsteps approaching our camp. My closest friend asked me if my father could be hiking down to check up on us? I told him and the others it was very unlikely as it had been some time since he had done that but not to worry as it could mean there was a family emergency or other.</p> <p>As I listened to the footsteps approaching I commented on how much heavier the foot steps were compared to one of us walking up the same path.</p> <p>None of my companions seriously considered my observation. And the bipedal individual walked to point approximately 80 feet down the sloping hill below the cliff overhang we were set up in. It was a curious situation with whatever or whoever had come to visit was now silently lingering below us. Between the five of us we had ten firearms strewn about the rock house. And being together next to our camp fire we felt only mild apprehension and some guarded curiosity. I had already began considering what we possibly had on our hands as Sasquatch was a semi regular visitor in our neighborhood with numerous sightings in my family over the many years.</p> <p>My suggestion to the same was met with stiffled laughter but I paid my friends no mind. They believed it could only be my father checking up on us even though he had stopped doing such a few years earlier.</p> <p>The two local boys that had joined our outing seemed to be the most unsettled and busied themselves preparing a meal for themselves as a diversion. One of my oldest friends never quit sifting for arrowheads only commenting “if it comes up here just shoot it”. So two of us stepped beyond the edge of the firelight allowing our eyes to adjust and used two D cell flashlights to try and identify what we had apparently standing behind a large poplar tree. The first thing we noticed was two red eyes opening and closing peeking from the edge of the tree. Eventually stepping half way out from behind the poplar tree the two of us saw that this was not a human but a Bigfoot covered in grey / white hair. I mentally marked a spot near its head for measurement later which showed it to be 7 1/2 feet tall.</p> <p>This whole encounter had lasted twenty minutes at that point. The stocky creature eventually easing out from behind the tree giving us a fair gander at him. Wes, it’s face was human and reminded me of an 80 year old Irishman. The only hair on his face was what looked like naturally grown mutton chops. My friend prodded me to walk up to it and see if I could shake it’s hand which was simply another of our standard & ludicrous challenges posed amongst each other, these inevitably involved something of the stupid and dangerous variety.</p> <p>It never made a peep standing behind the largest poplar below center of the rock house. Walking up to our location it walked the same path we had. And it didn’t seem to concern itself with being heard as it walked up to us either.</p> <p>After finally, and seemingly purposely stepping out from his tree and allowing us a good ten second look at him he eased back behind the tree and stood there silently for enough time to pass my friend and I went back up under the cliff. Later on I surmised it had done this purposely however, when it set off on a diagonal path out of the holler it sounded as if it huffed & puffed in some frustration as if he had wasted time he could have been golfing.”</p>",
  "enclosure": "",
  "itunes:duration": "01:32:04",
  "itunes:explicit": false,
  "itunes:keywords": "podcast,camping,strange,scary,aliens,ufo,Outdoors,paranormal,Bigfoot,woods,cryptozoology,sasquatch,encounter,cryptid,cryptids,dogman,bobgimlin,bigfootencounters,pattersonfilm,pattersongimlinfilm",
  "itunes:subtitle": "John writes \"In 1983 When I was 18 yrs old me and a friend who has since passed away, God rest his soul were backed up on a tractor path in forsyth county, North Carolina. This path was off an old dirt road that ended down where it got at the bottom...",
  "itunes:episode": 450,
  "itunes:episodeType": "full"
}