{
  "title": "New ways to help teams work faster and smarter with G Suite",
  "link": "https://blog.google/products/g-suite/new-ways-help-teams-work-faster-and-smarter-g-suite/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p>Today’s workplace is vastly different than it was 30 years ago. It used to be that a business could rely on a single team in a single location to get things done. These days, business is more diverse, dynamic and distributed than ever before. Decisions have to be made fast, teams need to align quickly and time can’t be wasted on repetitive, manual tasks. Consequently, companies that rely on decades-old, legacy work systems may find they aren’t agile enough to compete and stay relevant.</p><p>Imagine that your team needs to close a major sales deal. Stakeholders in multiple locations have to be consulted on the strategy. Customer needs have to be identified, a winning pitch must be drafted and the entire team must align on the right pricing approach—all before the end of the quarter.</p><p>G Suite makes this possible. It transforms the way teams collaborate, with intelligent tools that help them solve problems faster and focus their time on work that matters. Today, we’re announcing new, intelligent updates to G Suite to give businesses even more ways to manage projects—like closing a sales deal or bringing a new product to market—from one place.</p><h2>Use a new, centralized platform to stay aligned on projects and make decisions quicker.</h2><p></p><p>Available today, <a href=\"https://goo.gl/1rJrGC\">Hangouts Chat</a> makes it easy to collaborate efficiently so teams can make faster decisions. With team chat rooms and threaded conversations, powerful search functionality and intelligent bots that connect workflows and speed up tasks (even with 3rd party apps), you can work on projects from one spot—like opening a new store location or launching an advertising campaign. Chat has deep integrations with other G Suite apps like <a href=\"https://goo.gl/aHM9jx\">Google Drive</a>, <a href=\"https://goo.gl/Uf9wB4\">Calendar</a> and <a href=\"https://goo.gl/qpwGWH\">Hangouts Meet</a>, and <a href=\"https://goo.gl/qrR3jv\">built-in security</a> to meet retention, eDiscovery and regulatory/compliance needs for enterprises. <a href=\"https://www.blog.google/products/g-suite/move-projects-forward-one-placehangouts-chat-now-available/\">Read more</a> about Hangouts Chat or learn how you can <a href=\"https://gsuite-developers.googleblog.com/2018/02/develop-bot-integrations-with-hangouts.html\">build your own bots</a>.</p><h2>Spend less time setting up meetings and more time accomplishing goals.</h2><p>We want to make it simple to manage meetings, which is why we’ve built tools to help you surface <a href=\"https://www.blog.google/products/g-suite/time-refresh-introducing-new-look-and-features-google-calendar-web/\">conference room information</a> and <a href=\"https://blog.google/products/calendar/save-time-with-smart-scheduling-in-google-calendar/\">find times to meet</a>. In the coming months, <a href=\"https://goo.gl/C44GH1\">Calendar</a> will use artificial intelligence to automatically suggest rooms for you to book. And because they’ll be optimized for each attendee based on their building and floor location, previous booking history, audio/video equipment needs and room capacity requirements, you can feel confident that you’re booking the right space for your team to be productive.<br/></p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"ARS - GIF\" class=\"article-image--full\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/RoomBooking-Blog.gif \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h2></h2><h2>Solve problems face-to-face with teammates over video, right away.</h2><p>Sometimes it’s best to jump into an online meeting face-to-face with colleagues so you don’t hold up progress. Now, your team can quickly transition from a conversation in Chat and join a <a href=\"https://goo.gl/RRRwHB\">Hangouts Meet</a> video conferencing meeting with just a few clicks.</p><h2>Spend less time searching for the right documents and more time crafting ideas.</h2><p>Today, we’re bringing Quick Access to Docs to help teams focus their time on work that matters (similar to <a href=\"https://www.blog.google/products/drive/save-time-with-quick-access-in-drive/\">Quick Access in Drive</a>). Quick Access uses artificial intelligence to suggest relevant files based on signals like Drive activity and information in your documents, so you can work with the most up-to-date information and create new material quickly. Let’s say your global marketing team needs a central project plan; the team can start a <a href=\"https://goo.gl/cE23PN\">Doc</a> and use Quick Access in the <a href=\"https://goo.gl/tdN2FT\">Explore panel</a> to find information from related files and add it into the plan quickly.<br/></p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"Image 3 - Bundle\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Quick_Access_in_Docs.max-500x500.png\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Quick_Access_in_Docs.max-1000x1000.png\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/Quick_Access_in_Docs.max-100x100.png \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p>To stay relevant, businesses must transform how they operate. Try today’s updates in G Suite and empower your teams to work better together.</p></div></div></body></html>",
  "pubDate": "Wed, 28 Feb 2018 17:00:00 +0000",
  "guid": "https://blog.google/products/g-suite/new-ways-help-teams-work-faster-and-smarter-g-suite/",
  "category": [
    "Calendar",
    "Docs",
    "Google Workspace",
    "Google Cloud",
    "Meet"
  ],
  "media:content": "",
  "og": {
    "type": "article",
    "title": "New ways to help teams work faster and smarter with G Suite",
    "description": "Is your business getting by or getting ahead? These intelligent updates in G Suite can help.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/WorkTransformationBundle-blogheader.max-600x600.png",
    "site_name": "Google",
    "url": "https://blog.google/products/g-suite/new-ways-help-teams-work-faster-and-smarter-g-suite/"
  },
  "author": {
    "name": "David Thacker",
    "title": "VP, Product Management",
    "department": "G Suite",
    "company": ""
  }
}