{
  "title": "Meet the Open Source PC That Fits in Your Pocket",
  "link": "https://spectrum.ieee.org/meet-an-open-source-pc-that-can-fit-in-your-pocket",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/a-purple-laptop-on-a-desk.jpg?id=31812808&width=1200&height=800&coordinates=0%2C110%2C0%2C110\"/><br/><br/><p>Open source computing is coming to your pocket.</p><p>MNT Research, <a href=\"https://mntre.com/\" rel=\"noopener noreferrer\" target=\"_blank\">creator of the Reform open source laptop</a> and <a href=\"https://shop.mntmn.com/products/zz9000-for-amiga-preorder\" rel=\"noopener noreferrer\" target=\"_blank\">ZZ9000 add-in board for Amiga computers</a>, is going small for its next project. The MNT Pocket Reform has a 7-inch screen with a clamshell design that, when closed, will be less than 5 centimeters thick. If its perky purple facade looks a bit retro, that’s no surprise; the Pocket’s inspirations read like a ‘greatest hits’ list of pocketable computers. </p><p>“We had a mood board with several classic handheld computers: Nokia N900, Atari Portfolio, Cambridge Z88, Blackberry, Game Boy Advance SP, Alan Kay’s Dynabook,” says <a href=\"https://twitter.com/minut_e?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\" target=\"_blank\">Lukas F. Hartmann, CEO and founder of MNT Research</a>. “I have a Psion 5mx, which was kind of a benchmark for the keyboard.”</p><hr/><h2>Barely pocketable, very modular </h2><p>MNT initially sketched out a design with an even smaller, 5-inch display. This better delivered on the Pocket’s titular pocketability, but the resulting device lacked space for a comfortable keyboard. Ultimately, the designers decided on a larger display with more internal space. It may require cargo jeans to carry but should prove more usable day-to-day. </p><p>There are other ways MNT could have shaved down the device. The tiny Nokia N900, and many Blackberry devices, use a slide-hinge design. Some modern computers, like Lenovo’s Yoga laptop line, have a 360-degree hinge. “We like to keep it simple,” says Hartmann. “We are a very small team--you could say a boutique--and we have to pick our battles. Complicated mechanical and multimodal designs can snowball into all kinds of problems, while most people don’t actually need them or ask for them.”</p><p>The Pocket also differs in its approach to modularity. It’s not built around a strict base specification and instead offers support for a range of modules from entirely different manufacturers. The base module is an NXP i.MX 8M Plus with four ARM Cortex A53 cores, but the list of alternatives includes the <a href=\"https://spectrum.ieee.org/eben-upton-the-raspberry-pi-pioneer\" target=\"_self\">Raspberry Pi</a> Compute Module 4 and Pine SOQuartz RK3566. The Pocket will also support reusing  modules compatible with the larger MNT Reform laptop.</p><p class=\"shortcode-media shortcode-media-rebelmouse-image\">\n<img alt=\"Rendering of the blue MNT Reform Pocket mainboard.\" class=\"rm-shortcode\" data-rm-shortcode-id=\"f292350c8a3495e49e5825b2ef82b523\" data-rm-shortcode-name=\"rebelmouse-image\" id=\"98e0d\" loading=\"lazy\" src=\"https://spectrum.ieee.org/media-library/rendering-of-the-blue-mnt-reform-pocket-mainboard.jpg?id=31812831&width=980\"/>\n<small class=\"image-media media-caption\" placeholder=\"Add Photo Caption...\">MNT’s open source approach extends to hardware documentation.</small><small class=\"image-media media-photo-credit\" placeholder=\"Add Photo Credit...\">MNT Research</small></p><p>An owner’s choice will affect performance: The default NXP module balances portability with speed, while the Raspberry Pi CM4 (which uses quicker Cortex A72 cores) will offer better overall performance and will support Vulkan GPU drivers. There’s also a selection of internal expansion options including NVMe and optional 4G/5G/LTE mobile data. </p><p>“It’s really about your individual needs—which features do you need most and which compromises you’re willing to make. You can mix and match and find something that works best for you,” says Hartmann.</p><h2>MNT is serious about open source hardware</h2><p>“Open source” has morphed into an elastic buzzword, which makes it easy to miss what MNT offers. MNT’s open source promise is not limited to an open source operating system or select internal components The Pocket Reform, like MNT’s full-size Reform laptop, will provide mainboard schematics, 3D models for physical components, and open source drivers, among other things. <a href=\"https://source.mnt.re/reform/reform\" rel=\"noopener noreferrer\" target=\"_blank\">MNT’s extensive GitLab repository for the full-size Reform laptop</a> serves a taste of what’s coming.</p><p>This approach is not entirely unique, but MNT’s extreme commitment to open source stands out. Competitors like Framework and System76 offer laptops with open source hardware and software, but still rely on some mainstream, proprietary components (such as Intel <em>x</em>86 processors or Nvidia graphics). Portions of the design remain opaque.</p><p class=\"pull-quote\">“We are offering an alternative to the treadmill of vendor-controlled and locked-in devices.”</p><p>In this sense, the Pocket is perhaps better understood as a pocketable open source hardware platform than a purpose-built computer. The Pocket will ship in a configuration that can be used without modification, but there’s obviously better devices for those who want to use an off-the-shelf computer. </p><p>“Consumer-ready open hardware products that are fully documented and allow you to modify, repair, or even clone them are incredibly rare,” says Hartmann. “We are offering an alternative to the treadmill of vendor-controlled and locked-in devices.” Offering the Pocket with an <em>x</em>86 processor from Intel or AMD, as does Framework and System76, would surely expand mainstream appeal­—but also runs against the Pocket’s open source mission. Modifying, tweaking, and hacking the Pocket is more than half the point.</p><p>The MNT Pocket Reform is still in development, with <a href=\"https://www.crowdsupply.com/mnt/pocket-reform\" rel=\"noopener noreferrer\" target=\"_blank\">an initial launch planned on crowdfunding website Crowd Supply</a>. MNT has yet to commit to a date, but a representative says the company will have more to share “later this year.” Until then, you can keep up to date with the MNT Pocket Reform’s development on the company’s official blog or, if you want to see the nitty-gritty details, <a href=\"https://source.mnt.re/reform/pocket-reform\" rel=\"noopener noreferrer\" target=\"_blank\">the Pocket Reform’s GitLab page</a>.</p>",
  "pubDate": "Tue, 27 Sep 2022 14:00:00 +0000",
  "guid": "https://spectrum.ieee.org/meet-an-open-source-pc-that-can-fit-in-your-pocket",
  "category": [
    "Mnt",
    "Mnt reform",
    "Pocketpc",
    "Open source"
  ],
  "dc:creator": "Matthew S. Smith",
  "media:content": ""
}