{
  "id": "https://bibleinoneyear.org/en/youth/248",
  "title": "Day 248: Godly Wisdom for Your Finances",
  "description": "Proverbs 22:1–4, Isaiah 8:12–13, 9:6–7, 2 Corinthians 8:1–4,7,9,13–15. 9)  However, the passages for today totally redefine this world’s understanding of the word ‘rich’",
  "pubDate": "Sun, 05 Sep 2021 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/248/?ignore",
  "itunes:duration": "15:11",
  "guid": "enyouth05092021-248",
  "length": 911.02,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 248: Godly Wisdom for Your Finances",
  "itunes:subtitle": "Proverbs 22:1–4, Isaiah 8:12–13, 9:6–7, 2 Corinthians 8:1–4,7,9,13–15. 9)  However, the passages for today totally redefine this world’s understanding of the word ‘rich’",
  "itunes:summary": "‘I am so happy I could cry! I am so excited that we might have the chance to go to Focus [our church holiday]! I can’t wait to see my children’s faces when I tell them!’ This was the reaction of a mother with two young children in our congregation when she heard she would be given a bursary (a discounted rate) to come to Focus. At the end of the week she wrote, ‘It is the best holiday we have ever had as a family. I am so happy.’\nI love the fact that hundreds of people come to Focus on bursaries, or even for nothing. Others give generously to make this possible.\nA few months later the mother who had written to me unexpectedly inherited some money from a distant relative. She gave extraordinarily generously. The amount far more than covered the bursary she and her family had received.\nThis is a practical outworking of the New Testament principle that those who can afford give to help those who cannot afford – so that there might be equality: ‘At the present time your plenty will supply what they need, so that in turn their plenty will supply what you need’ (2 Corinthians 8:14).\nSo much of our world is taken up with thinking, writing and talking about money, wealth and riches. The Bible has a great deal to say about these subjects. However, the biblical position is in contrast to that of today’s culture.\nIn today’s New Testament passage, Paul tells us that the whole point of the incarnation of Jesus was that you might ‘become rich’ (v.9). However, the passages for today totally redefine this world’s understanding of the word ‘rich’.",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 248
}