{
  "title": "Minkorrekt Folge 27 „Laborraketen“",
  "itunes:title": "Minkorrekt Folge 27 „Laborraketen“",
  "description": "Heute mit Wahlbetrug, dem Exibitionistenlurch, dem Unterschied zwischen männlichen und weiblichen Experimentatoren und der Mär vom gesunden Glas Wein. Experiment der Woche: \"Ethanolrakete\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "pubDate": "Tue, 03 Jun 2014 09:22:09 +0000",
  "link": "https://minkorrekt.podigee.io/29-minkorrekt-folge-27-laborraketen",
  "guid": "http://methodischinkorrekt.wordpress.com/?p=477",
  "content:encoded": "„Laborraketen“ direkt aus dem Baikonur der Wissenschaft.\n<p>&nbsp;</p>\n<p>Der Weltraum. Unendliche Weiten. Wir schreiben das Jahr 2014. Dies sind die Abenteuer von methodisch inkorrekt, die in der neusten Folge wieder in Paper blicken die nie zuvor ein Mensch gesehen hat.</p>\n<p>Zunächst aber bedanken wir uns für die vielen Löffelglockenbilder aus der letzten Sendung. Was wir aber eigentlich sagen wollten (in der Begeisterung aber vergessen haben): Die Aktion ist beendet, nehmt die Finger wieder aus den Ohren, die Tassen werden in den nächsten Tagen zu Euch geschickt.</p>\n<p>Der Deutsche Alexander Gerst (@astro_alex) ist auf der ISS angekommen. Wir blicken zurück auf den Start und schauen uns das wissenschaftliche Programm an was nun auf Gerst wartet.</p>\n<p><span id=\"more-930\"></span></p>\n<p>Thema 1: „statistisch gesehen gefälscht“ – Wir nehmen uns die Europawahl noch mal vor. Kann bei so einer Wahl manipuliert werden? Und haben wir Möglichkeiten so eine Manipulation zu erkennen? Wir diskutieren zwei Paper die genau das statistisch versuchen. Ein <a href=\"http://www.achimgoerres.de/work/Breunig_Goerres_Benford_Bundestag_elections.pdf\">Paper</a> versucht es mit dem <a href=\"http://de.wikipedia.org/wiki/Benfordsches_Gesetz\">Benfordschen Gesetz</a>. Das <a href=\"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3478593/#!po=25.000\">andere</a> vergleicht Wahlbeteiligung und das erzielte Ergebnis von Parteien. Ratet mal in welchen Ländern „Unregelmäßigkeiten“ aufgetreten sind.</p>\n<p>Thema 2: „Papier, Stein, Schere, Lurch ohne Spock“ – Reinhard erklärt uns Strategien für das beliebte „<a href=\"http://www.tb.ethz.ch/education/model/RPS/sinervo.pdf\">Papier, Stein, Schere</a>“ Spiel, zeigt uns aber auch wie die Natur ein ähnliches Prinzip nutzt um ein dynamisches Gleichgewicht zwischen <a href=\"http://arxiv.org/pdf/1404.5199v1.pdf\">Lurchpopulationen</a> zu erreichen. Enter: Der Exibitionistenlurch!</p>\n<p>Experiment der Woche: „Die Ethanolrakete“ – Macht das nicht zu Hause! Ehrlich nicht, haben wir ja gemacht (<a href=\"http://youtu.be/M5BKTy3XyMo\">hier</a> und <a href=\"http://youtu.be/rMNtJ7dUfGg\">hier</a>) für Euch!</p>\n<p>Thema 3: „Der Typ stresst mich“ – Nicolas erklärt welchen Unterschied das <a href=\"http://www.nature.com/nmeth/journal/v11/n6/full/nmeth.2935.html\">Geschlecht </a>des Experimentators bei Tierversuchen macht. Und er hat eine Idee seine Mitarbeiter zu „motivieren“ (vulgo: „zu verängstigen“)</p>\n<p>Thema 4: „Wir brauchen einen neuen Grund“ – Reinhard beraubt uns unserem besten Argument für das Gläschen <a href=\"http://archinte.jamanetwork.com/article.aspx?articleid=1868537\">Wein am Abend</a>. Was jetzt? Wir nehmen Vorschläge an!</p>\n<p>Zuhörerfrage von Tobias aus Kassel: Warum können Hummeln fliegen? Warum behaupten Physiker das Gegenteil? Or do they? Wir retten unseren Berufsehre!</p>\n<p>Nicolas schimpft zum Ende noch ein bisschen über das lahme Internet in Gelsenkirchen. Sogar der Mond hat bessere Datenübertragung. <a href=\"http://blogs.discovermagazine.com/d-brief/2014/05/28/the-moon-is-now-a-wi-fi-hotspot/#.U4cH-9oayK0\">Ernsthaft!</a></p>\n<p>Noch ein paar Termine:</p>\n<p>Double-Feature-Hörertreffen mit dem „<a href=\"http://omegataupodcast.net\">omega tau</a>“-Podcast (am 3.6. um 19:00 Uhr im <a href=\"http://www.unperfekthaus.de\">Unperfekthaus</a> in Essen.</p>\n<p>Die <a href=\"http://ehsm.eu\">EHSM 2014</a> Konferenz vom 27-29 Juni in Hamburg.</p>\n<p>Rausschmeißervideo: „<a href=\"https://www.youtube.com/watch?v=rGOXWIdSTWU\">Websiiiite!</a>“ – Am 8.6. ist der Geburtstag von Tim Berners Lee, der Vater des Internets. Wir ehren ihm mit diesem Video.</p>\n<p>Du möchtest mehr über unsere Werbepartner erfahren? <a href=\"https://linktr.ee/methodischinkorrekt\"><strong>Hier findest du alle Infos & Rabatte</strong></a></p>",
  "itunes:image": "",
  "itunes:episode": 29,
  "itunes:episodeType": "full",
  "itunes:subtitle": "„Laborraketen“ direkt aus dem Baikonur der Wissenschaft.",
  "itunes:summary": "Heute mit Wahlbetrug, dem Exibitionistenlurch, dem Unterschied zwischen männlichen und weiblichen Experimentatoren und der Mär vom gesunden Glas Wein. Experiment der Woche: \"Ethanolrakete\".\n\nDu möchtest mehr über unsere Werbepartner erfahren? Hier findest du alle Infos & Rabatte: https://linktr.ee/methodischinkorrekt",
  "itunes:explicit": "no",
  "itunes:keywords": "",
  "itunes:author": "Methodisch inkorrekt!",
  "enclosure": "",
  "itunes:duration": 9463
}