{
  "title": "Hey Ho, Thanks for Sticking Around!",
  "link": "",
  "updated": "2016-06-02T10:00:00+02:00",
  "published": "2016-06-02T10:00:00+02:00",
  "author": {
    "name": "Mikio L. Braun",
    "uri": "http://mikiobraun.de",
    "email": "mikiobraun@gmail.com"
  },
  "id": "http://blog.mikiobraun.de/2016/06/hey-ho-and-thanks-for-sticking-around",
  "content": "<p><p>So this was definitely a long radio silence! Since I blogged last time, a lot has happened.</p>\n\n<p>I’ve quit my PostDoc job and joined <a href=\"https://tech.zalando.de\">Zalando</a>, a big (the biggest?) European fashion retailer (revenue in 2015: about three billion Euros). I’m a “delivery lead”, kind of a technical lead role for two teams. One is running the recommendation service for all of Zalando, the other team is creating a new search backend service. It definitely is a management position, so I don’t code much (except for <a href=\"https://twitter.com/mikiobraun/status/735010846884147200\">sometimes</a>), but I find leadership extremely interesting, and challenging, and Zalando with its agile culture seems like the perfect place to be for me right now.</p>\n\n<p>One of my last projects at the university was a lecture series on Scalable Machine Learning. I had originally planned to spend about the same amount of time on Big Data technology as on the theoretical underpinnings, but after interventions from other professors who were concerned about people earning “double credits” it became the most mathematical piece of teaching I ever did. This was quite an experience. I had planned to prepare a few weeks worth in advance, but in the end, I was often spending all of Tuesday and Wednesday to churn out those 40-50 slides per week for the lecture on Thursday.</p>\n\n<p>I attended StrataHadoop in London last year, where Ben Lorica talked me into doing a video on <a href=\"http://shop.oreilly.com/product/0636920045274.do\">Scalable Machine Learning</a> for O’Reilly (finally, also being allowed to talk about the technical side). We recorded the video in Amsterdam during OSCON in October in a single day (also, quite an experience). It is geared at people who already have a good understanding of Data Science and ML, but are not yet familiar with large scale learning, or Big Data technology, and is intended as a starting point into technologies like Spark.</p>\n\n<p>So my interests have shifted a bit, away from pure machine learning towards topics like facilitating collaboration between data scientists and engineers. Yesterday I gave a talk titled <a href=\"http://conferences.oreilly.com/strata/hadoop-big-data-eu/public/schedule/detail/50378\">Hardcore Data Science in Practice</a> to present my current state of insights into the matter, and I put my <a href=\"http://www.slideshare.net/mikiobraun/hardcore-data-science-in-practice\">slides on the Internet</a>. Zalando has heavily invested in data scientists and it’s very interesting to see how that works out day to day. A friend of mine has remarked that I’m the only person he knows who uses the term “Data Scientist” unironically. ;)</p>\n\n<p>I also greatly enjoy working with developers on a daily basis. After all, I’m a computer scientist by training, but having worked in machine learning for so long where people come from many backgrounds like physics, mathematics, and so on, I almost forgot about this.</p>\n\n<p>One blog post that just didn’t happened was a lengthy treatement of my reasons for leaving academia. Personally it makes total sense to me now, and I think there is a lot left to improve in academia, but I don’t see the point in talking about it right now.</p>\n\n<p>There is obviously a lot of things happening right now in the <em>hypespace</em>. Internet of Things, chat bots, and suddenly <a href=\"http://www.businessinsider.de/salesforce-ceo-i-see-an-ai-first-world-2016-5\">AI is back</a> and there are a few upcoming things I just have to say about that, too ;)</p>\n\n<p>So thanks for sticking around, hopefully the next post will not take another year to write.</p>\n</p>\n   <p><a href=\"http://blog.mikiobraun.de/2016/06/hey-ho-and-thanks-for-sticking-around.html\">Click here for the full article</a>"
}