{
  "title": "Google’s new Viger office is an homage to Montréal",
  "link": "https://blog.google/inside-google/company-announcements/googles-new-viger-office-is-an-homage-to-montreal/",
  "description": "<html><head></head><body><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">Google first laid down roots in Québec in 2004, when three engineers worked out of shared coworking spaces no larger than vestibules — including me, I’m employee number five in Montréal! Over the years Google expanded. For many years, we called McGill College home, and it became a place where team members shared milestones, forged community and built software that touches the lives of so many in Québec and around the globe.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">Today, we’re proud to continue our commitment as we enter a new frontier for Google in Québec, by celebrating the official opening of Google Montréal Viger. Viger is a sustainability-focused office located in downtown Montréal, on the periphery of the city’s beloved Old Port. <b>We’re also announcing $2.75 million towards Québec’s tech ecosystem and digital skills training.</b></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">The new office is home to a variety of teams that work on some of the most crucial products and services Google offers worldwide, including cybersecurity, AI research, Chrome and Cloud.</p><p data-block-key=\"8ckoc\"></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"lwlvn\">Explore Google Montréal’s Viger space</h3></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">Montréal is often referred to as a medley of neighbourhoods, each with its own distinct identity. The retrofitted historical building pays homage to Montréal by reflecting the essence of five of the city’s most beloved neighbourhoods — Little Italy, Le Village, Le Plateau, Chinatown and Old Port. Every inch of the office celebrates the spirit of this vibrant city from the <i>Farine Five Roses</i> style Google Montréal sign when you enter the lobby, to the playful nods, traditional elements and architectural detailing of historic neighborhoods like Chinatown's flock and damask, Little Italy's artisan markets, Old Port's industrial roots, and Le Village's festive spirit.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"interior image of cafeteria\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2547-HDR7.max-500x500.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2547-HDR7.max-1000x1000.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2547-HDR7.max-100x100.jpg \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">The building is equipped with the latest LEED Gold sustainability standards, and includes enhanced ventilation that helps conserve energy and sustainably sourced furniture and materials. Throughout the space you can discover carefully curated art from Québec artists, which aims to inspire employees and strengthen connections that Google maintains with local makers. Some of the artists featured include Nadia Myre, a Montréal-based member of the Kitigan Zibi Anishinabeg First Nation, and Bryan Beyung, a street artist and painter born in Montréal into a Chinese-Cambodian refugee family.</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">To acknowledge Indigenous connection and stewardship to the land where Google Montréal exists, and to help remind Google team members of this history, we named many of our meeting rooms after local tree species in the Kanienʼkéha (Mohawk) language. The name selection process was conducted in consultation with the nearby Mohawk community of Kahnawake. A native Kanienʼkéha speaker helped ensure spellings were correct, and traditions and cultural practices were respected.</p></div></div><div class=\"block-image_full_width\"><div class=\"h-c-page\"><div class=\"article-image h-c-grid__col--10 h-c-grid__col--offset-1 h-c-grid__col-l--offset-2 h-c-grid__col-l--8\"><a class=\"article-image--link\"><img alt=\"interior area with couches and chairs\" class=\"article-image--full\" data-loading='{\n                \"mobile\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2232-HDR7.max-500x500.jpg\",\n                \"desktop\": \"https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2232-HDR7.max-1000x1000.jpg\"\n              }' loading=\"lazy\" src=\" https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2232-HDR7.max-100x100.jpg \" tabindex=\"0\"/></a></div></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><h3 data-block-key=\"lwlvn\">Supporting Québec’s tech ecosystem</h3></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">Today, we are also excited to announce a commitment to Québec’s tech ecosystem of over $2.75 million. This funding will support curiosity-driven research that tackles some of the most important 21st century challenges and catalyze Québec’s future digital builders and innovators:</p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><ul><li data-block-key=\"lwlvn\">Google Canada is committed to pushing the boundaries of deep learning research and is renewing its collaboration with <a href=\"https://mila.quebec/en/\">Mila</a> by providing a $1.5M grant for 2023. The funding will help support fundamental AI research projects in areas like AI for Humanity, climate change and sustainable agriculture. Support will also be provided to increase successful participation of students and faculty from underrepresented groups in computing research careers.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\"><b>Google.org Support:</b></p></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><ul><li data-block-key=\"lwlvn\">To create new opportunities for students across Québec looking to build digital skills, Google.org is providing a grant to <a href=\"https://digitalmoment.org/\">Digital Moment</a> (formerly Kids Code Jeunesse) to help their organization launch The Quebec Digital Literacy Project, a program aimed to equip teachers &amp; students in grades 3-12 with digital skills.</li><li data-block-key=\"bbu2p\">To help job seekers in Québec gain the technical and digital skills required in the current job market, Google is now offering the <a href=\"https://www.coursera.org/professional-certificates/gestion-de-projet-de-google\">Project Management</a> and <a href=\"https://www.coursera.org/professional-certificates/soutien-des-ti-de-google\">IT Support</a> <a href=\"https://grow.google/intl/fr-CA_ca/\">Google Career Certificates</a> in French. The courses will be available to the public on Coursera, a global online learning platform. Google.org will also provide a grant to <a href=\"https://npowercanada.ca/\">NPower Canada</a> to deliver the Google Career Certificates in Québec. NPower Canada will offer need-based scholarships to the programs that will be distributed through local workforce development nonprofits<a href=\"https://www.maisondelamitie.ca/\">La Maison de l’Amitié</a> and <a href=\"https://aimcroitqc.org/en/home/\">AIM CROIT</a>.</li><li data-block-key=\"dffi\">Google and Google.org are providing additional support to local Québec organizations, like Startup Montreal, Pathways to Education, E2 Adventures, UpstartED, AI4Good Lab and Resilience Montréal. These organizations work to tackle digital skilling, fostering startup communities, STEM education, job training and often support some of Québec’s most underrepresented communities.</li></ul></div></div><div class=\"block-paragraph\"><div class=\"rich-text\"><p data-block-key=\"lwlvn\">For over 16 years, I’ve watched our team in Québec grow and work on some of Google’s most beloved products. Today, I’m proud to continue this journey and expand our commitment to Québec’s tech ecosystem. I look forward to what the next 20 years brings.</p></div></div></body></html>",
  "pubDate": "Wed, 02 Nov 2022 14:15:00 +0000",
  "guid": "https://blog.google/inside-google/company-announcements/googles-new-viger-office-is-an-homage-to-montreal/",
  "category": "Company announcements",
  "media:content": "",
  "og": {
    "type": "article",
    "title": "Google’s new Viger office is an homage to Montréal",
    "description": "We're officially opening Google Montréal Viger, a sustainability-focused office located in downtown Montréal.",
    "image": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/_Q3A2309-HDR7.max-600x600.jpg",
    "site_name": "Google",
    "url": "https://blog.google/inside-google/company-announcements/googles-new-viger-office-is-an-homage-to-montreal/"
  },
  "author": {
    "name": "Fabrice Jaubert",
    "title": "Google Montréal Site Lead",
    "department": "",
    "company": ""
  }
}