{
  "id": "tag:blogger.com,1999:blog-37798047.post-4049457482069625866",
  "published": "2021-03-20T23:12:00.005-04:00",
  "updated": "2021-03-20T23:52:47.549-04:00",
  "title": "Deconstructing that $69million NFT",
  "content": "<p>\"NFTs\" have hit the mainstream news with the sale of an NFT based digital artwork for $69 million. I thought I'd write up an explainer. Specifically, I deconstruct that huge purchase and show what actually was exchanged, down to the raw code. (The answer: almost nothing).</p><p>The reason for this post is that every other description of NFTs describe what they <i>pretend</i>&nbsp;to be. In this blogpost, I drill down on what they <i>actually</i>&nbsp;are.</p><p>Note that this example is about \"NFT artwork\", the thing that's been in the news. There are other uses of NFTs, which work very differently than what's shown here.</p><p><b>tl;dr</b></p><p>I have long bit of text explaining things. Here is the short form that allows you to drill down to the individual pieces.</p><p></p><ul><li><a href=\"https://www.beeple-crap.com/\">Beeple</a> created a piece of art in a <a href=\"https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">file</a></li><li>He created a <a href=\"https://google.com/search?q=QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">hash</a> that uniquely, and unhackably, identified that file<br /></li><li>He created a <a href=\"https://dweb.link/ipfs/QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\">metadata file</a> that included the hash to the artwork</li><li>He created a <a href=\"https://google.com/search?q=QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\">hash</a> to the metadata file</li><li>He uploaded both files (metadata and artwork) to the <a href=\"https://en.wikipedia.org/wiki/InterPlanetary_File_System\">IPFS</a> darknet decentralized file sharing service</li><li>He created, or&nbsp;<a href=\"https://etherscan.io/tx/0x84760768c527794ede901f97973385bfc1bf2e297f7ed16f523f75412ae772b3#eventlog\">minted a token</a> governed by the <a href=\"https://etherscan.io/address/0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756#code\">MakersTokenV2 smart contract</a> on the Ethereum blockchain</li><li>Christies created an <a href=\"https://onlineonly.christies.com/s/first-open-beeple/beeple-b-1981-1/112924\">auction</a> for this token</li><li>The auction was concluded with a payment of $69 million worth of Ether cryptocurrency. However, nobody has been able to find this payment on the Ethereum blockchain, the money was probably transferred through some private means.</li><li>Beeple <a href=\"https://etherscan.io/tx/0xa342e9de61c34900883218fe52bc9931daa1a10b6f48c506f2253c279b15e5bf#eventlog\">transferred</a> the token to the winner, who <a href=\"https://etherscan.io/tx/0x01d0967faaaf95f3e19164803a1cf1a2f96644ebfababb2b810d41a72f502d49#eventlog\">transferred</a> it again to this final <a href=\"https://etherscan.io/address/0x8bb37fb0f0462bb3fc8995cf17721f8e4a399629#tokentxnsErc721\">Metakovan</a> account</li></ul><div>Each of the link above allows you to drill down to exactly what's happening on the blockchain. The rest of this post discusses things in long form.</div><div><br /></div><p><b>Why do I care?</b></p><p>Well, you don't. It makes you feel stupid that you haven't heard about it, when everyone is suddenly talking about it as if it's been a thing for a long time. But the reality, <i>they</i>&nbsp;didn't know what it was a month ago, either. Here is the Google Trends graph to prove this point -- interest has only exploded in the last couple months:</p><p></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-vfJHf0Zchlw/YFVv5E2zxvI/AAAAAAAAGgI/Yp57S2C6pnM_r2HyVrDAxO3xRekJ5ijIACLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"479\" data-original-width=\"1223\" height=\"125\" src=\"https://lh3.googleusercontent.com/-vfJHf0Zchlw/YFVv5E2zxvI/AAAAAAAAGgI/Yp57S2C6pnM_r2HyVrDAxO3xRekJ5ijIACLcBGAsYHQ/image.png\" width=\"320\" /></a></div><p></p><div>The same applies to me. I've been aware of them (since the CryptoKitties craze from a couple years ago) but haven't invested time reading source code until now. Much of this blogpost is written as notes as I discover for myself exactly what was purchased for $69 million, reading the actual transactions.</div><div><br /></div><div style=\"font-weight: bold;\"><b><br /></b></div><b>So what is it?</b><div><br /></div><div>My definition: \"Something new that can be traded on a blockchain that isn't a fungible cryptocurrency\".</div><div><br /></div><div>In this post, I'm going to explain in technical details. Before this, you might want to pause and see what everyone else is saying about it. You can look <a href=\"https://en.wikipedia.org/wiki/Non-fungible_token\">on Wikipedia</a> to answer that question, or look at the following definition <a href=\"https://www.cnn.com/2021/03/17/business/what-is-nft-meaning-fe-series/index.html\">from CNN</a> (the first result when I google it):</div><div><span style=\"font-size: x-small;\"><blockquote>Non-fungible tokens, or NFTs, are pieces of digital content linked to the blockchain, the digital database underpinning cryptocurrencies such as bitcoin and ethereum. Unlike NFTs, those assets are fungible, meaning they can be replaced or exchanged with another identical one of the same value, much like a dollar bill.</blockquote></span></div><div>You can also get a list of common NFT systems <a href=\"https://etherscan.io/tokens-nft\">here</a>. While this list of NFT systems contains a lot of things related to artwork (as described in this blogpost), a lot aren't. For example, CryptoKitties is an online game, not artwork (though it too allows ties to pictures of the kitties).</div><div><br /><b><br /></b></div><div><b>What is fungible?</b></div><div><p>Let's define the word <b>fungible</b> first. The word refers to goods you purchase that can be replaced by an identical good, like a pound of sugar, an ounce of gold, a barrel of West Texas Intermediate crude oil. When you buy one, you don't care which one you get.</p><p>In contrast, an automobile is a <b>non-fungible</b> good -- if you order a Tesla Model 3, you won't be satisfied with just any car that comes out of the factory, but one that matches the color and trim that you ordered. Art work is a well known non-fungible asset -- there's only one Mona Lisa painting in the world, for example.</p><p>Dollar bills and coins are fungible <b>tokens</b> -- they represent the value printed on the currency. You can pay your bar bill with any dollars.&nbsp;</p><p><b>Cryptocurrencies</b> like Bitcoin, ZCash, and Ethereum are also \"fungible tokens\". That's where they get their value, from their fungibility.</p><p>NFTs, or <b>non-fungible tokens</b>, is the idea of trading something unique (non-fungible, not the same as anything else) on the blockchain. You can trade them, but each is unique, like a painting, a trading card, a rare coin, and so on.</p><p>This is a <b>token</b>&nbsp; -- it represents a thing. You aren't trading an artwork itself on the blockchain, but a token that represents the artwork. I mention this because most descriptions about NFTs are that you are buying artwork -- you aren't. Instead, you are buying a token that points to the artwork.</p><p>The best real world example is a <b>receipt</b> for purchase. Let's say you go to the Louvre and buy the Mona Lisa painting, and they give you a receipt attesting to the authenticity of the transaction. The receipt is not the artwork itself, but something that represents the artwork. It's proof you legitimately purchased it -- that you didn't steal it. If you ever resell the painting, you'll probably need something like this proving the provenance of the piece.</p><p><br /></p><p><b>Show me an example!</b></p><p>So let's look an at an example NFT, the technical details, to see how it works. We might as well use this massive $69 million purchase as our example. Some news reports describing the purchase are here: [<a href=\"https://www.washingtonpost.com/technology/2021/03/17/nft-beeple-metakovan-christies/\">1</a>] [<a href=\"https://www.theverge.com/2021/3/11/22325054/beeple-christies-nft-sale-cost-everydays-69-million\">2</a>] [<a href=\"https://www.nytimes.com/2021/03/11/arts/design/nft-auction-christies-beeple.html\">3</a>].</p><p>None of these stories say what actually happened. They say the \"artwork was purchased\", but what does that actually mean? We are going to deconstruct that here. (The answer is: the artwork wasn't actually purchased).</p><p><b><br /></b></p><p><b>What was the artwork?</b></p><p>It's a piece created by an artist named \"<a href=\"https://www.beeple-crap.com/everydays\">Beeple</a>\" (Mike Winkelmann), called \"<b>Everydays: The First 5000 Days</b>\". It's a 500-megapixel image, which is about 300-megabytes in size. A thumbnail of this work is shown below.</p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://ipfsgateway.makersplace.com/ipfs/QmZ15eQX8FPjfrtdX3QYbrhZxJpbLpvDpsgb2p3VEH8Bqq\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"800\" data-original-width=\"800\" height=\"194\" src=\"https://ipfsgateway.makersplace.com/ipfs/QmZ15eQX8FPjfrtdX3QYbrhZxJpbLpvDpsgb2p3VEH8Bqq\" width=\"194\" /></a></div><div><br /></div><div><br /></div><div>So the obvious question is <b>where is this artwork?</b>&nbsp;Is it somewhere on the blockchain? Well, no, the file is 300-megabytes in size, much too large to put on the blockchain. Instead, the file exists somewhere out in cyberspace (described below).</div><div><br /></div><div>What exists on the blockchain is a unique fingerprint linking to the file, known as a <b>hash</b>.</div><div><br /></div><div><br /></div><div><b>What is a hash?</b></div><div><p>It's at this point we need to discuss <b>cryptography</b>: it's not just about encryption, but also random numbers, public keys, and hashing.</p><p>A \"hash\" passes all the bytes of a file through an algorithm to generate a short <b>signature</b>&nbsp;or <b>fingerprint</b>&nbsp;unique to that file. No two files with different contents can have the same hash. The most popular algorithm is <b>SHA-256</b>, which produces a 256-bit hash.</p><p>We call it a <b>cryptographic hash</b>&nbsp;to differentiate it from weaker algorithms. With a strong algorithm, it's <i>essentially</i>&nbsp;impossible for a hacker to create a different file that has the same hash -- even if the hacker tried really hard.</p><p>Thus, the hash is the <b>identity</b>&nbsp;of the file. The identity of the artwork in question is not the title of the piece mentioned above, other pieces of art can also be given that title. Instead, the identity of the artwork is its hash. Other pieces of artwork cannot have the same hash.</p><p>For this artwork, that 300-megabyte file is hashed, producing a 256-bit value. Written in hex, this value is:</p><blockquote><p>6314b55cc6ff34f67a18e1ccc977234b803f7a5497b94f1f994ac9d1b896a017</p></blockquote><p>Hexadecimal results in long strings. There are shorter ways of representing hashes. One is a format called <b>MultiHash</b>. It's value is shown below. This refers to the same 256-bits, and thus the two forms equivalent, they are simply displayed in different ways.</p><blockquote><p>QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA</p></blockquote><p>This is the identity of the artwork. If you want to download the entire 300-megabyte file, simply copy and paste that into google, and it'll lead you to someplace in cyberspace where you can download it. Once you download it, you can verify the hash, such as with the command-line tool OpenSSL:</p><p></p><blockquote><p><span style=\"font-family: courier; font-size: x-small;\">$ openssl dgst -sha256 everdays5000.jfif</span></p><p><span style=\"font-family: courier; font-size: x-small;\">SHA256(everdays5000.jfif)= 6314b55cc6ff34f67a18e1ccc977234b803f7a5497b94f1f994ac9d1b896a017</span></p><p></p></blockquote><p>The above is exactly what I've done -- I downloaded the file from cyberspace, named it \"everydays5000.jfif\", and then calculated the hash to see if it matches. As you can tell by looking at my result with the above hash, they do match, so I know I have an exact copy of the artwork.</p><p><b><br /></b></p><p><b>Where to download the image from cyberspace?</b></p><p>Above, I downloaded the file in order to demonstrate calculating the hash. It doesn't live on the blockchain, so where does it live?</p><p>There's two answers. The first answer is potentially&nbsp;<b>anywhere in cyberspace. </b>Thousands of people have downloaded the file onto the personal computers, so obviously it exists on their machines -- you just can't get at it. If you ever do come across it somewhere, you can always verify it's the exact copy by looking at the hash.</p><p>The second answer is <b>somewhere on the darknet</b>. The term \"darknet\" refers to various systems on the Internet other than the web. Remember, the \"web\" is not the \"Internet\", but simply one of many services on the Internet.</p><p>The most popular darknet services are <b>decentralized file sharing</b>&nbsp;systems like BitTorrent and <a href=\"https://en.wikipedia.org/wiki/InterPlanetary_File_System\">IPFS</a>. In much the same way that blockchains are decentralized transaction services, these two system are decentralized file services. When something is too big to live on the blockchain, it often lives on the darknet, usually via IPFS.</p><p>The way these services identify files is through their hashes. If you know their hash, you can stick it into one of these services and find it. Thus, if you want to find this file on IPFS, download some IPFS aware software, and plug in the hash.</p><p>There's an alternative privacy-focused browser called \"Brave\" that includes darknet features (TOR, BitTorrent, and IPFS). To download this file using Brave, simply use the following URL:</p><p></p><blockquote>ipfs://QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA</blockquote><p></p><p>But an easier way is to use one of the many <b>IPFS gateways</b>. These are web servers that will copy a file off the darknet and make it available to you. Here is a URL using one of those gateways:</p><p></p><blockquote><a href=\"https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA</a></blockquote><p></p><p>If you click on this link within your browser, you'll download the 300-megabyte file from the IPFS darknet. It'll take a while, the service is slow. Once you get it, you can verify the hashes match. But since the URL is based on the hash, of course they should match, unless there was some error in transmission.</p><p><br /></p><p><b>So this hash is on the blockchain?</b></p><p>Well, it could've been, but it wasn't. Instead, the hash that's on the blockchain points to a file containing metadata -- and it's the metadata that points to the hash.</p><p>In other words, it's a chain of hashes. The hash on the blockchain (as we'll see below) is this one here (I've made it a link so you can click on it to see the raw data):</p><p></p><blockquote><a href=\"https://dweb.link/ipfs/QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\">QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz</a></blockquote><p></p><p>When you click on this, you see a bunch of JSON data. Below, I've stripped away the uninteresting stuff to show the meaningful bits;</p><blockquote><b>title</b>:\"<i>EVERYDAYS: THE FIRST 5000 DAYS</i>\"&nbsp;</blockquote><blockquote><b>description</b>:\"<i>I made a picture from start to finish every single day from May 1st, 2007 - January 7th, 2021.&nbsp; This is every motherfucking one of those pictures.</i>\"&nbsp;</blockquote><blockquote><b>digital_media_signature</b>:\"<i>6314b55cc6ff34f67a18e1ccc977234b803f7a5497b94f1f994ac9d1b896a017</i>\"&nbsp;</blockquote><blockquote><b>raw_media_file</b>:\"<i><a href=\"https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA</a></i>\"</blockquote><p>Now remember that due to the magic of cryptographic hashes, this chain can't be broken. One hash leads to the next, such that changing any single bit breaks the chain. Indeed, that's what a \"blockchain\" is -- a hash chain. Changing any bit of information anywhere on the Bitcoin blockchain is immediately detectable, because it throws off the hash calculations.</p><p>So we have a chain:&nbsp;</p><p></p><blockquote>hash -&gt; metadata -&gt; hash -&gt; artwork</blockquote><p></p><p>So if you own the root, you own the entire chain.</p><p>Note that this chain seems unbreakable here, in this $69 million NFT token. However, in a lot of other tokens, it's not. I mean, the hash chain itself doesn't promise much (it simply points at the artwork, giving no control over it), but other NFTs promise even less.</p><p><b><br /></b></p><p><b>So what, exactly, is the NFT that was bought and sold?</b></p><p>Here's what&nbsp;<a href=\"https://en.wikipedia.org/wiki/Christie%27s\">Christie's</a>&nbsp;sold. Here's how <a href=\"https://onlineonly.christies.com/s/first-open-beeple/beeple-b-1981-1/112924\">Christies describes it</a>:</p><p></p><blockquote><p>Beeple (b. 1981)<br />EVERYDAYS: THE FIRST 5000 DAYS<br /><b>token ID</b>: 40913<br />wallet address: 0xc6b0562605D35eE710138402B878ffe6F2E23807<br /><b>smart contract address</b>: 0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756<br />non-fungible token (jpg)<br />21,069 x 21,069 pixels (319,168,313 bytes)<br />Minted on 16 February 2021. This work is unique.</p><p></p></blockquote><p>The seller is the artist&nbsp;<a href=\"https://www.beeple-crap.com/\">Beeple</a>. The artist created the <b>token </b>(shown below) and assigned their <b>wallet address</b>&nbsp;as the owner. This is their wallet address:</p><blockquote><a href=\"https://etherscan.io/address/0xc6b0562605d35ee710138402b878ffe6f2e23807\">0xc6b0562605D35eE710138402B878ffe6F2E23807</a></blockquote><p></p><p>When Beeple created the token, he did so using a <b>smart contract</b>&nbsp;that governs the rules for the token. Such smart contracts is what makes Ethereum different from Bitcoin, allowing things to be created and managed on the blockchain other than simple currency transfers. Contracts have addresses on the blockchain, too, but no person controls them -- they are rules for decentralized transfer of things, with nobody (other than the code) in control.</p><p>There are many smart contracts that can manage NFTs. The one Beeple chose is known as <b>MakersTokenV2</b>. This contract has the following address:</p><blockquote><a href=\"https://etherscan.io/address/0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756#code\">0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756</a></blockquote><p></p><p>Note that if you browse this link, you'll eventually get to the&nbsp;<a href=\"https://etherscan.io/address/0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756#code\" style=\"font-weight: bold;\">code</a>&nbsp;so that you can read the smart contract and see how it works. It's a derivation of something known as&nbsp;<a href=\"https://github.com/ethereum/EIPs/blob/master/EIPS/eip-721.md\">ERC721</a>&nbsp;that defines the properties of a certain class of non-fungible tokens.</p><p>Finally, we get to the actual token being sold here. It is:</p><blockquote><p>#40913</p></blockquote><p>In other words, it's the 40913rd token created and managed by the MakersTokenV2 contract. The full description of what Christies is selling is this token number governed by the named contract on the Ethereum blockchain:</p><blockquote><p>Ethereum -&gt; 0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756 -&gt; 40913</p></blockquote><p>We have to search the blockchain in order to find the transaction that created this token. The transaction is identified by the hash:</p><blockquote><p><a href=\"https://etherscan.io/tx/0x84760768c527794ede901f97973385bfc1bf2e297f7ed16f523f75412ae772b3#eventlog\">0x84760768c527794ede901f97973385bfc1bf2e297f7ed16f523f75412ae772b3</a></p></blockquote><p>The smart contract is code, so in the above transaction, Beeple calls functions within the contract to create a new token, assign digital media to it (the hash), and assign himself owner of the newly created token.</p><p>After doing this, the token #40913 now contains the following information:</p><div><blockquote><b>creator </b>: 0xc6b0562605d35ee710138402b878ffe6f2e23807<br /><div><b>metadataPath </b>: QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz<br /><div><b>tokenURI </b>: ipfs://ipfs/QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz</div></div></blockquote><div><span style=\"font-size: x-small;\"></span></div></div><p>This is the thing that Christie's auction house sold. As you can see in their description above, it all points to this token on the blockcahin.</p><p>Now after the auction, the next step is to transfer the token to the new owner. Again, the contract is code, so this is calling the \"Transfer()\" function in that code. Beeple is the only person who can do this transfer, because only he knows the private key that controls his wallet. This transfer is done in the transaction below:</p><blockquote><p><a href=\"https://etherscan.io/tx/0xa342e9de61c34900883218fe52bc9931daa1a10b6f48c506f2253c279b15e5bf#eventlog\">0xa342e9de61c34900883218fe52bc9931daa1a10b6f48c506f2253c279b15e5bf&nbsp;</a></p></blockquote><blockquote>token : 40913<br />from : 0xc6b0562605d35ee710138402b878ffe6f2e23807<br />to : 0x58bf1fbeac9596fc20d87d346423d7d108c5361a</blockquote><p></p><p>That's not the current owner. Instead, it was soon transferred again in the following transaction:</p><p></p><blockquote><p><a href=\"https://etherscan.io/tx/0x01d0967faaaf95f3e19164803a1cf1a2f96644ebfababb2b810d41a72f502d49#eventlog\">0x01d0967faaaf95f3e19164803a1cf1a2f96644ebfababb2b810d41a72f502d49</a>&nbsp;</p></blockquote><blockquote><p>token : 40913<br />from : 0x58bf1fbeac9596fc20d87d346423d7d108c5361a<br />to :&nbsp;0x8bb37fb0f0462bb3fc8995cf17721f8e4a399629</p><p></p></blockquote><p>That final address is known to belong to a person named \"Metakovan\", who the press has identified as the buyer of the piece. I don't know what that intermediary address between Beeple and Metakovan was, but it's common in the cryptocurrency world to have many accounts that people transfer things between, so I bet it also belongs to Metakovan.</p><p><br /></p><p><b>How are things transferred?</b></p><p>Like everything on the blockchain, control is transfered via public/private keys. Your <b>wallet address</b>&nbsp;is a hash of your <b>public key</b>, which everyone knows. Anybody can transfer something to your public address without you being involved.</p><p>But every public key has a matching <b>private key</b>. Both are generated together, because they are mathematically related. Only somebody who knows the private key that matches the wallet address can transfer something out of the wallet to another person.</p><p>Thus Beeple's account as the following public address. But we don't know his private key, which he has stored on a computer file somewhere.</p><p></p><blockquote><a href=\"https://etherscan.io/address/0xc6b0562605d35ee710138402b878ffe6f2e23807\">0xc6b0562605D35eE710138402B878ffe6F2E23807</a></blockquote><p></p><p><br /></p><p><b>To summarize what was bought and sold</b></p><p>So that's it. To summarize:</p><p></p><ul style=\"text-align: left;\"><li><a href=\"https://www.beeple-crap.com/\">Beeple</a>&nbsp;created a piece of art in a&nbsp;<a href=\"https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">file</a></li><li>He created a&nbsp;<a href=\"https://google.com/search?q=QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\">hash</a>&nbsp;that uniquely, and unhackably, identified that file</li><li>He created a&nbsp;<a href=\"https://dweb.link/ipfs/QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\">metadata file</a>&nbsp;that included the hash to the artwork</li><li>He created a&nbsp;<a href=\"https://google.com/search?q=QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\">hash</a>&nbsp;to the metadata file</li><li>He uploaded both files (metadata and artwork) to the&nbsp;<a href=\"https://en.wikipedia.org/wiki/InterPlanetary_File_System\">IPFS</a>&nbsp;darknet decentralized file sharing service</li><li>He created, or&nbsp;<a href=\"https://etherscan.io/tx/0x84760768c527794ede901f97973385bfc1bf2e297f7ed16f523f75412ae772b3#eventlog\">minted a token</a>&nbsp;governed by the&nbsp;<a href=\"https://etherscan.io/address/0x2a46f2ffd99e19a89476e2f62270e0a35bbf0756#code\">MakersTokenV2 smart contract</a>&nbsp;on the Ethereum blockchain</li><li>Christies created an&nbsp;<a href=\"https://onlineonly.christies.com/s/first-open-beeple/beeple-b-1981-1/112924\">auction</a>&nbsp;for this token</li><li>The auction was concluded with a payment of $69 million worth of Ether cryptocurrency. However, nobody has been able to find this payment on the Ethereum blockchain, the money was probably transferred through some private means.</li><li>Beeple&nbsp;<a href=\"https://etherscan.io/tx/0xa342e9de61c34900883218fe52bc9931daa1a10b6f48c506f2253c279b15e5bf#eventlog\">transferred</a>&nbsp;the token to the winner, who&nbsp;<a href=\"https://etherscan.io/tx/0x01d0967faaaf95f3e19164803a1cf1a2f96644ebfababb2b810d41a72f502d49#eventlog\">transferred</a>&nbsp;it again to this final&nbsp;<a href=\"https://etherscan.io/address/0x8bb37fb0f0462bb3fc8995cf17721f8e4a399629#tokentxnsErc721\">Metakovan</a>&nbsp;account</li></ul><div>And that's it.</div><div><br /></div><div><b>Okay, I understand. But I have a question. WHAT IS AN NFT????</b></div><div><b><br /></b></div><div>So if you've been paying attention, and understood everything I've said, then you should still be completely confused. What exactly was purchased that was worth $69 million?</div><div><br /></div><div>If we are asking what Metakovan purchased for his $69 million, it comes down to this: the ability to transfer MakersTokenV2 #40913 to somebody else.</div><div><br /></div><div>That's it. That's everything he purchased. He didn't purchase the artwork, he didn't purchase the copyrights, he didn't purchase anything more than the ability to transfer that token. Even saying he owns the token is a misnomer, since the token lives on the blockchain. Instead, since only Metakovan knows the private key that controls his wallet, all that he possesses is the ability to transfer the token to the control of another private key.</div><div><br /></div><div>It's not even as unique as people claim. Beeple can mint another token for the same artwork. Anybody else can mint a token for Beeple's artwork. Insignificant changes can be made to that artwork, and tokens can be minted for that, too. There's nothing hard and fast controlled by the code -- the relationship is in people's minds.</div><div><br /></div><div>If you are coming here asking why somebody thinks this is worth $69 million, I have no answer for you.</div><div><br /></div><div><br /></div><div><b>The conclusion</b></div><p></p><div>I think there are two things that are clear here:</div><div><ul style=\"text-align: left;\"><li>This token is not going to be meaningful to most of us: who cares if the token points to a hash that eventually points to a file freely available on the Internet?</li><li>This token is meaningful to those in the \"crypto\" (meaning \"cryptocurrency\") community, but it's in their minds, rather than something hard and fast controlled by code or cryptography.</li></ul><div>In other words, the work didn't sell for $69 million of real money.</div><div><br /></div><div>For one thing, it's not the work that was traded, or rights or control over that work. It's simply a token that pointed to the work.</div><div><br /></div><div>For another thing, it was sold for 42329.453 ETH, not $dollars. Early adopters with lots of cryptocurrency are likely to believe the idea that the token is meaningful, whereas outsiders with $dollars don't.</div><div><br /></div><div>An NFT is ultimately like those plaques you see next to paintings in a museum telling people about the donor or philanthropist involved -- only this plaque is somewhere where pretty much nobody will see it.</div><div><br /></div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://lh3.googleusercontent.com/-KetTuaEStoM/YFbC7Dv7D8I/AAAAAAAAGgk/t16aL950ioou97GRNvyZF9DIL21Oe3AAgCLcBGAsYHQ/image.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img alt=\"\" data-original-height=\"1404\" data-original-width=\"1920\" height=\"234\" src=\"https://lh3.googleusercontent.com/-KetTuaEStoM/YFbC7Dv7D8I/AAAAAAAAGgk/t16aL950ioou97GRNvyZF9DIL21Oe3AAgCLcBGAsYHQ/image.png\" width=\"320\" /></a></div><br /><br /></div><div><br /></div></div></div></div>",
  "link": [
    "",
    "",
    "",
    "",
    ""
  ],
  "author": {
    "name": "Robert Graham",
    "uri": "http://www.blogger.com/profile/09879238874208877740",
    "email": "noreply@blogger.com",
    "gd:image": ""
  },
  "media:thumbnail": "",
  "thr:total": 8
}