{
  "id": "yt:video:oaWtMPfApQw",
  "yt:videoId": "oaWtMPfApQw",
  "yt:channelId": "UCbmNph6atAoGfqLoCL_duAg",
  "title": "Lighter: Let Go of the Past, Connect with the Present, and Expand the Future | Talks at Google",
  "link": "",
  "author": {
    "name": "Talks at Google",
    "uri": "https://www.youtube.com/channel/UCbmNph6atAoGfqLoCL_duAg"
  },
  "published": "2022-10-28T16:00:42+00:00",
  "updated": "2022-10-29T11:52:53+00:00",
  "media:group": {
    "media:title": "Lighter: Let Go of the Past, Connect with the Present, and Expand the Future | Talks at Google",
    "media:content": "",
    "media:thumbnail": "",
    "media:description": "Diego Perez, aka YUNG PUEBLO discusses his book \"Lighter: Let Go of the Past, Connect with the Present, and Expand the Future\" where he demonstrates how we can all move forward in our healing, from learning self-compassion to letting go to becoming emotionally mature. \n\nAs the heaviness falls away, our minds will finally stop feeling overburdened with tension and we’ll be able to reconnect with the present. And the world around us will hopefully become more inviting in crisp and newly vibrant ways. But these are just the first steps. As we grow stronger and expand our self-awareness, it’s our responsibility—and also part of the healing journey—to take actions to support the health and harmony of all people. The final section of Lighter shows how we can and must contribute to building a world that is no longer structurally harmful but, instead, structurally compassionate. \n\nGet the book here: https://goo.gle/3EUcjZP.\n\nYung Pueblo’s hope is that as more of us heal, our actions will become more intentional, our decisions will become more compassionate, our thinking will become clearer, and the future will become brighter.\n\nDiego Perez is a New York Times bestselling author who is widely known on Instagram and various social media networks through his pen name Yung Pueblo. His writing focuses on the power of self-healing, creating healthy relationships, and the wisdom that comes when we truly work on knowing ourselves. Diego is primarily a meditator who shares his insights on his life, his healing journey and advice on lifting the heaviness that prevents us from healing ourselves and the world. Diego hopes to inspire others that deep healing is possible and achievable.\n\nModerated by Bradley Horowitz.",
    "media:community": {
      "media:starRating": "",
      "media:statistics": ""
    }
  }
}