{
  "title": "DEArt: Dataset of European Art. (arXiv:2211.01226v2 [cs.CV] UPDATED)",
  "link": "http://arxiv.org/abs/2211.01226",
  "description": "<p>Large datasets that were made publicly available to the research community\nover the last 20 years have been a key enabling factor for the advances in deep\nlearning algorithms for NLP or computer vision. These datasets are generally\npairs of aligned image / manually annotated metadata, where images are\nphotographs of everyday life. Scholarly and historical content, on the other\nhand, treat subjects that are not necessarily popular to a general audience,\nthey may not always contain a large number of data points, and new data may be\ndifficult or impossible to collect. Some exceptions do exist, for instance,\nscientific or health data, but this is not the case for cultural heritage (CH).\nThe poor performance of the best models in computer vision - when tested over\nartworks - coupled with the lack of extensively annotated datasets for CH, and\nthe fact that artwork images depict objects and actions not captured by\nphotographs, indicate that a CH-specific dataset would be highly valuable for\nthis community. We propose DEArt, at this point primarily an object detection\nand pose classification dataset meant to be a reference for paintings between\nthe XIIth and the XVIIIth centuries. It contains more than 15000 images, about\n80% non-iconic, aligned with manual annotations for the bounding boxes\nidentifying all instances of 69 classes as well as 12 possible poses for boxes\nidentifying human-like objects. Of these, more than 50 classes are CH-specific\nand thus do not appear in other datasets; these reflect imaginary beings,\nsymbolic entities and other categories related to art. Additionally, existing\ndatasets do not include pose annotations. Our results show that object\ndetectors for the cultural heritage domain can achieve a level of precision\ncomparable to state-of-art models for generic images via transfer learning.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Reshetnikov_A/0/1/0/all/0/1\">Artem Reshetnikov</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Marinescu_M/0/1/0/all/0/1\">Maria-Cristina Marinescu</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Lopez_J/0/1/0/all/0/1\">Joaquim More Lopez</a>"
}