{
  "title": "`littlemcmc` — A Standalone HMC and NUTS Sampler in Python",
  "link": "",
  "id": "https://www.georgeho.org/littlemcmc/",
  "updated": "2020-10-06T00:00:00Z",
  "published": "2020-10-06T00:00:00Z",
  "content": "<center>\n<img\nsrc=\"https://raw.githubusercontent.com/eigenfoo/littlemcmc/master/docs/_static/logo/default-cropped.png\"\nalt=\"LittleMCMC logo\">\n</center>\n<p>Recently there has been a modularization (or, if you&rsquo;re hip with tech-lingo, an\n<a href=\"https://techcrunch.com/2015/04/18/the-unbundling-of-everything/\"><em>unbundling</em></a>)\nof Bayesian modelling libraries. Whereas before, probability distributions,\nmodel specification, inference and diagnostics were more or less rolled into one\nlibrary, it&rsquo;s becoming more and more realistic to specify a model in one\nlibrary, accelerate it using another, perform inference with a third and use a\nfourth to visualize the results. (For example, Junpeng Lao has recently had\n<a href=\"https://twitter.com/junpenglao/status/1309470970223226882\">good success</a> doing\nexactly this!)</p>\n<p>It&rsquo;s in this spirit of unbundling that the PyMC developers wanted to <a href=\"https://discourse.pymc.io/t/isolate-nuts-into-a-new-library/3974\">spin out\nthe core HMC and NUTS samplers from PyMC3 into a separate\nlibrary</a>.\nPyMC3 has a very well-tested and performant Python implementation of HMC and\nNUTS, which would be very useful to any users who have their own functions for\ncomputing log-probability and its gradients, and who want to use a lightweight\nand reliable sampler.</p>\n<p>So for example, if you&rsquo;re a physical scientist with a Bayesian model who&rsquo;s\nwritten your own functions to compute the log probability and its gradients\n(perhaps for performance or interoperability reasons), and need a good MCMC\nsampler, then <code>littlemcmc</code> is for you! As long as you can call your functions\nfrom Python, you can use the same HMC or NUTS sampler that&rsquo;s used by the rest of\nthe PyMC3 community.</p>\n<p>So without further ado: please check out <code>littlemcmc</code>!</p>\n<ul>\n<li><a href=\"https://github.com/eigenfoo/littlemcmc\">GitHub</a></li>\n<li><a href=\"https://littlemcmc.readthedocs.io/en/latest/\">Read the Docs</a></li>\n</ul>"
}