{
  "title": "What Outperformers Do Differently to Tap Internal Talent",
  "link": "https://sloanreview.mit.edu/article/what-outperformers-do-differently-to-tap-internal-talent/",
  "comments": "https://sloanreview.mit.edu/article/what-outperformers-do-differently-to-tap-internal-talent/#respond",
  "pubDate": "Mon, 17 Oct 2022 11:00:09 +0000",
  "dc:creator": "Nithya Vaduganathan, Ben Zweig, Colleen McDonald, and Lisa Simon. <p>Nithya Vaduganathan is a managing director and partner at Boston Consulting Group and a BCG Henderson Institute Fellow on the Future of Work. Ben Zweig is CEO of Revelio Labs and an adjunct professor of economics at New York University’s Stern School of Business. Colleen McDonald is a partner at the Consulting Group and BCG Henderson Institute Ambassador on the Future of Work. Lisa Simon is a senior economist at Revelio Labs.</p>\n",
  "category": [
    "Employee Recruitment and Satisfaction",
    "Employee Turnover",
    "Human Capital",
    "Organizational Change",
    "Leadership",
    "Performance Management",
    "Talent Management",
    "Workplace, Teams, & Culture"
  ],
  "description": "In a tight labor market, companies are in trouble when career growth opportunities within the organization are misaligned with the needs of employees. According to Pew Center Research data, more than 60% of U.S. employees who quit their jobs in the past year cited a lack of career advancement opportunities as a leading reason for [&#8230;]",
  "content:encoded": "<p></p>\n<figure class=\"article-inline\">\n<img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/2022_1017_Vaduganathan-1290x860-1.jpg\" alt=\"\" /><br />\n</figure>\n<p>In a tight labor market, companies are in trouble when career growth opportunities within the organization are misaligned with the needs of employees.</p>\n<p>According to Pew Center Research data, more than 60% of U.S. employees who quit their jobs in the past year cited a <a href=\"https://www.pewresearch.org/fact-tank/2022/03/09/majority-of-workers-who-quit-a-job-in-2021-cite-low-pay-no-opportunities-for-advancement-feeling-disrespected\">lack of career advancement opportunities</a> as a leading reason for leaving, and a recent study by researchers at the MIT Sloan School of Management, New York University’s Stern School of Business, and Revelio Labs found that <a href=\"https://sloanreview.mit.edu/article/toxic-culture-is-driving-the-great-resignation\">lateral career opportunities</a> are more than twice as important as compensation in predicting employee retention. Additionally, lateral moves and promotions allow employees to experience professional growth and develop new skills. Yet our research finds that only 10% of job opportunities today are filled with internal lateral hires.</p>\n<p>While often overlooked as a lever for talent, offering employees lateral moves can be an untapped gold mine for companies. By adopting leading practices for internal mobility, companies can better deploy existing worker capacity and benefit from more successful hires who hit the ground running in new roles with greater institutional knowledge, higher levels of engagement and retention, and even improved gender equity. At the same time, employees benefit from meaningful skill and career development opportunities that better align with their goals, making this a win-win for employers and employees alike.</p>\n<p></p>\n<p>In our research, we have identified companies that are leading the way as <em>talent mobility outperformers</em>. These organizations have higher internal lateral mobility rates and higher employee satisfaction. In this article, we explore four practical insights based on best practices of outperformers, offering ways for companies that are currently underutilizing internal talent to learn from those at the leading edge of this trend.</p>\n<h3>What Talent Mobility Outperformers Do Differently</h3>\n<p>We identified internal and external hires at the 750 largest U.S. public and private companies by analyzing the employment histories described in their professional online resumes (See “Identifying Internal Lateral Mobility Outperformers”).  We define an internal lateral career move as a new position of an employee within the same company, where the occupation changes but the level of seniority remains the same. We found that the median lateral mobility rate for large U.S. companies is 8%, and only about a quarter of companies in the data set boasted rates above 15%.</p>\n<div class=\"callout-highlight callout-no-background\">\n<aside class=\"l-content-wrap\">\n<article>\n<h4>Identifying Internal Lateral Mobility Outperformers</h4>\n<p class=\"caption\">This chart uses data from 2021 to show the relationship between the lateral mobility rate and employee satisfaction ratings from more than 400 large U.S. public and private companies. Those in the top right quadrant fall into the outperformer category, scoring higher on both internal mobility rate and employee satisfaction.</p>\n<p><img src=\"https://sloanreview.mit.edu/wp-content/uploads/2022/10/Vaduganathan-internal-mobility-fig1.jpg\" alt=\"Identifying Internal Lateral Mobility Outperformers\" class=\"mt20 mobile-mt20\"></p>\n<p class=\"attribution\">\n</article>\n</aside>\n</div>\n<p>We also found that certain industries, growth stages, and occupations (including business process specialists, brand managers, and strategists) are more conducive than others for employees to make lateral moves. Perhaps more surprising is the fact that these variables explain only about a quarter of the variation in companies’ internal lateral mobility rates. Other factors, such as company talent practices, play a more significant role. </p>\n<p>In the following section, we look at four talent practices that are setting talent mobility outperformers apart.</p>\n<p></p>\n<h4>Put More Power in the Hands of Employees</h4>\n<p>Talent hoarding is one of the greatest barriers to talent mobility. Only 20% of employees feel supported by teams to make an <a href=\"https://hbr.org/2022/05/what-stops-employees-from-applying-for-internal-roles\">internal move</a>. And many employees — especially women — leave companies without even exploring internal options. Talent mobility outperformers overcome this tension in part by giving employees the ability to browse and apply for opportunities directly on <a href=\"https://sloanreview.mit.edu/article/create-a-crisis-growth-plan-start-with-opportunity-marketplaces/\">talent marketplaces</a> without first notifying their line managers. </p>\n<p>While conversations with managers are often encouraged, most don’t require approval from line managers for job changes or project opportunities. Asaf Jackoby, vice president of global HR at Amdocs, explains that resistance to change can come at a cost for the organization. “While it’s only human nature to want to hang on to your talent,” says Jackoby, “managers simply don’t have the opportunity to limit mobility for their teams.” </p>\n<p>For companies like Amdocs and HSBC, the shift from <em>organization-led</em> mobility, where managers must initiate and approve mobility opportunities, to <em>employee-led</em> mobility is intentional, designed to give employees more agency while reducing the friction associated with finding opportunities internally. </p>\n<p>Of course, designing mobility processes to empower employees is only part of the equation. Change management is still critical. No matter how well companies design their internal talent systems, a layer of skeptical managers telling their teams that staying put is the surest path to advancement is sure to slow adoption. At Mastercard, chief talent and organizational effectiveness officer Lucrecia Borgonovo emphasizes the importance of showing leaders the benefits of tapping into talent in other parts of the organization. Amdocs monitors mobility metrics at all levels of the organization, reviewing which businesses are talent exporters and which are talent importers on a monthly basis, helping to surface insights for leaders and hold them accountable for internal mobility goals. </p>\n<h4>Expand the Mobility Option Menu </h4>\n<p>While historically many internal mobility programs have focused on permanent job transfers, a growing number of companies are embracing more varied models for lateral mobility — especially through project or internal gig work, in which employees contribute to a project while remaining in their jobs. In fact, most companies that are outperforming in terms of internal lateral mobility based on job changes are also implementing some form of project matching.</p>\n<p>Fidelity International has launched a pilot career vitality program focused on growing internal talent. Internal project work and job-shadowing opportunities that offer a promising path to permanent internal transfers are at the core of the program. “We recently had an employee who undertook job shadowing and project work in our asset management team,” Fidelity International’s global head of talent, Carmel Mitchell, explained. “When that team had a job opening, this individual applied and transferred into the department. They would have never applied had they not gained experience through project participation.”</p>\n<p>At Seagate Technology, an employee from marketing helped the talent acquisition team with a project so successfully that they then transferred into a full-time employer branding role. And an engineer who took part in a six-month innovation project became an innovation lead in addition to their day-to-day responsibilities.</p>\n<p>Projects offer employees the opportunity to explore a passion and develop new skills while unlocking additional worker capacity and innovation for their employers. “It’s easy for people to think that internal mobility is all about moving from one role to another,” says Hamish Nisbet, global head of resourcing for HSBC. “But if you think about it from a future-of-work lens, internal mobility might also be about stretching into other areas while remaining in your job role or unit.” </p>\n<h4>Take Advantage of Recent Innovation </h4>\n<p>Third-party solutions that help companies tap into internal talent have blossomed in recent years. In 2021 alone, $12 billion was invested in the <a href=\"https://www.bcg.com/publications/2022/billion-dollar-opportunity-in-hr-technology\">HR technology</a> space. Where companies used to create their own custom technologies for internal mobility, platform developers like Gloat, Fuel50, and Eightfold AI now offer internal talent marketplaces powered by artificial intelligence. Human capital management providers like Workday have introduced talent marketplaces of their own.</p>\n<p>Third-party offerings can accelerate a company’s internal mobility journey and create a virtuous cycle of adoption and learning (from data collected through the marketplaces) while avoiding common traps that come with developing and maintaining custom internal platforms (such as maintaining a growing list of APIs). Most outperformers use third-party solutions for their talent marketplaces, and many of those that have built their own are exploring options to partner. </p>\n<p>These partnerships also reflect a philosophy of looking outward to fuel internal talent innovation. Unilever’s vice president of global learning and future of work, Paddy Hull, reflects that companies at the leading edge look at “the trends and beyond the walls of their own organizations.” Unilever is a prime example. In 2018, Unilever went on a digital safari to visit future of work startups in five cities around the world. It was then that they met Gloat, with whom they would partner to launch Unilever’s Flex experiences program, which uses AI to help employees match with open career opportunities.</p>\n<p></p>\n<h4>Integrate Mobility With Other Talent Practices</h4>\n<p>In order to build a successful talent program around internal mobility, leaders need to think about bringing these practices into day-to-day routines — such as onboarding, learning and development planning, and performance management. A focused approach to talent mobility can also help companies to integrate talent processes that have historically been disconnected.</p>\n<p>Take the example of Comcast, which reimagined quarterly reviews, rebranding them as quarterly connections to allow for conversations about next steps and potential job changes in addition to in-role performance. At Unilever, purpose workshops where employees can develop future-fit skill plans create opportunities for talent mobility to support employees’ development goals. And S&P Global has a dedicated internal career development coaching team that provides confidential support to employees at all levels of the organization as they navigate their career paths.</p>\n<p>Companies are also tightening the links between talent mobility and talent development. Seagate Technology, which requires that jobs be posted internally before being posted externally, has set an 80% skills match threshold for job transfers. The company started an upskilling program to help employees bridge the gap from 80% to 100% and ensure that employees are successful as they transition to new roles. Using data from the talent marketplace allows Seagate to identify skills gaps in the organization and tailor learning and development programs to help close them.</p>\n<p></p>\n<p>Tapping internal talent in the workforce is a meaningful opportunity for companies facing growing skills gaps, hiring pressures, and retention risks — especially in an economic downturn. As more organizations follow the lead of outperformers to invest in internal lateral mobility, companies that overlook this strategy risk becoming less competitive for talent in a market in which career opportunity matters more than ever. </p>\n<p></p>\n",
  "wfw:commentRss": "https://sloanreview.mit.edu/article/what-outperformers-do-differently-to-tap-internal-talent/feed/",
  "slash:comments": 0
}