{
  "title": "Control-enhanced quantum metrology under Markovian noise. (arXiv:2211.01803v1 [quant-ph])",
  "link": "http://arxiv.org/abs/2211.01803",
  "description": "<p>Quantum metrology is supposed to significantly improve the precision of\nparameter estimation by utilizing suitable quantum resources. However, the\npredicted precision can be severely distorted by realistic noises. Here, we\npropose a control-enhanced quantum metrology scheme to defend against these\nnoises for improving the metrology performance. Our scheme can automatically\nalter the parameter encoding dynamics with adjustable controls, thus leading to\noptimal resultant states that are less sensitive to the noises under\nconsideration. As a demonstration, we numerically apply it to the problem of\nfrequency estimation under several typical Markovian noise channels. Through\ncomparing our control-enhanced scheme with the standard scheme and the\nancilla-assisted scheme, we show that our scheme performs better and can\nimprove the estimation precision up to around one order of magnitude.\nFurthermore, we conduct a proof-of-principle experiment in nuclear magnetic\nresonance system to verify the effectiveness of the proposed scheme. The\nresearch here is helpful for current quantum platforms to harness the power of\nquantum metrology in realistic noise environments.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/quant-ph/1/au:+Zhai_Y/0/1/0/all/0/1\">Yue Zhai</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Yang_X/0/1/0/all/0/1\">Xiaodong Yang</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Tang_K/0/1/0/all/0/1\">Kai Tang</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Long_X/0/1/0/all/0/1\">Xinyue Long</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Nie_X/0/1/0/all/0/1\">Xinfang Nie</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Xin_T/0/1/0/all/0/1\">Tao Xin</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Lu_D/0/1/0/all/0/1\">Dawei Lu</a>, <a href=\"http://arxiv.org/find/quant-ph/1/au:+Li_J/0/1/0/all/0/1\">Jun Li</a>"
}