{
  "title": "Arts and Minds with Anton Howes",
  "pubDate": "Mon, 31 Aug 2020 16:18:22 +0000",
  "guid": "81dd8305-59cf-4f59-9c5a-a7fd92740690",
  "link": "https://traffic.libsyn.com/secure/economicsdetective/149_Howes.mp3",
  "itunes:image": "",
  "description": "<div style=\"float: right; padding-left: 10px;\"><a href= \"https://www.amazon.com/Arts-Minds-Society-Changed-Nation-ebook/dp/B081J6JP69/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=1254e5151f467c17264ae10d3a1563f1&language=en_US\" target=\"_blank\" rel=\"noopener\"><img src= \"//ws-na.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B081J6JP69&Format=_SL250_&ID=AsinImage&MarketPlace=US&ServiceVersion=20070822&WS=1&tag=economicsde0f-20&language=en_US\" border=\"0\" /></a><img style= \"border: none !important; margin: 0px !important;\" hidden=\"\" src= \"https://ir-na.amazon-adsystem.com/e/ir?t=economicsde0f-20&language=en_US&l=li3&o=1&a=B081J6JP69\" alt=\"\" width=\"1\" height=\"1\" border=\"0\" /></div> <p>Anton Howes returns to the podcast to discuss his new book, <a href=\"https://amzn.to/2YSiuHU\">Arts and Minds: How the Royal Society of Arts Changed a Nation</a>.</p> <blockquote>From its beginnings in a coffee house in the mid-eighteenth century, the Royal Society for the Encouragement of Arts, Manufactures and Commerce has tried to improve British life in every way imaginable. It has sought to influence how Britons work, how they are educated, the music they listen to, the food they eat, the items in their homes, and even how they remember their own history. Arts and Minds is the remarkable story of an institution unlike any other—a society for the improvement of everything and anything.<br /> <br /> Drawing on exclusive access to a wealth of rare papers and artefacts from the Society’s own archives, Anton Howes shows how this vibrant and singularly ambitious organisation has evolved and adapted, constantly having to reinvent itself to keep in step with changing times. The Society has served as a platform for Victorian utilitarian reformers, purchased and restored an entire village, encouraged the planting of more than sixty million trees, and sought technological alternatives to child labour. But this is more than just a story about unusual public initiatives. It is an engaging and authoritative history of almost three centuries of social reform and competing visions of a better world—the Society’s members have been drawn from across the political spectrum, including Adam Smith, Edmund Burke, and Karl Marx.<br /> <br /> Informative and entertaining, Arts and Minds reveals how a society of public-spirited individuals tried to make their country a better place, and draws vital lessons from their triumphs and failures for all would-be reformers today.</blockquote> <hr />",
  "content:encoded": "<a href= \"https://www.amazon.com/Arts-Minds-Society-Changed-Nation-ebook/dp/B081J6JP69/ref=as_li_ss_il?ie=UTF8&linkCode=li3&tag=economicsde0f-20&linkId=1254e5151f467c17264ae10d3a1563f1&language=en_US\" target=\"_blank\" rel=\"noopener\"></a> <p>Anton Howes returns to the podcast to discuss his new book, <a href=\"https://amzn.to/2YSiuHU\">Arts and Minds: How the Royal Society of Arts Changed a Nation</a>.</p> From its beginnings in a coffee house in the mid-eighteenth century, the Royal Society for the Encouragement of Arts, Manufactures and Commerce has tried to improve British life in every way imaginable. It has sought to influence how Britons work, how they are educated, the music they listen to, the food they eat, the items in their homes, and even how they remember their own history. Arts and Minds is the remarkable story of an institution unlike any other—a society for the improvement of everything and anything.  Drawing on exclusive access to a wealth of rare papers and artefacts from the Society’s own archives, Anton Howes shows how this vibrant and singularly ambitious organisation has evolved and adapted, constantly having to reinvent itself to keep in step with changing times. The Society has served as a platform for Victorian utilitarian reformers, purchased and restored an entire village, encouraged the planting of more than sixty million trees, and sought technological alternatives to child labour. But this is more than just a story about unusual public initiatives. It is an engaging and authoritative history of almost three centuries of social reform and competing visions of a better world—the Society’s members have been drawn from across the political spectrum, including Adam Smith, Edmund Burke, and Karl Marx.  Informative and entertaining, Arts and Minds reveals how a society of public-spirited individuals tried to make their country a better place, and draws vital lessons from their triumphs and failures for all would-be reformers today. ",
  "enclosure": "",
  "itunes:duration": "01:07:41",
  "itunes:explicit": false,
  "itunes:keywords": "",
  "itunes:subtitle": "Anton Howes returns to the podcast to discuss his new book, . From its beginnings in a coffee house in the mid-eighteenth century, the Royal Society for the Encouragement of Arts, Manufactures and Commerce has tried to improve British life in every...",
  "itunes:episode": 149,
  "itunes:episodeType": "full"
}