{
  "title": "Applying Lessons from Global Entrepreneurship",
  "description": " <p><b>Please join us for a public event that will explore how the U.S. can lead the world in meeting the global demand for entrepreneurship and innovation.</b><br />  <br /> To remain competitive in a 21st-century workforce, youth must have strong backgrounds in STEM (Science, Technology, Engineering, and Math) and leadership skills. Developing economies will stagnate without qualified workforces, and there will be a mismatch between the skills that are needed for open jobs and those being taught in schools. Creating environments that foster entrepreneurship will bolster economic development and provide jobs for people around the world. There are many stories such as that of the Indonesian <a href=\"https://fortune.com/2019/10/21/gojek-ceo-nadiem-makarim-resigns-indonesia-ride-hailing/\">“unicorn,”</a> Go-Jek, that went from having 20 bikes to be valued at <a href=\"https://www.scmp.com/week-asia/business/article/2116287/how-indonesian-unicorn-go-jek-went-20-bikes-us25-billion-and-e\">$2.5 billion</a> in just 10 years. <a href=\"https://blogs.worldbank.org/opendata/chart-how-worlds-youth-population-changing\">42%</a> of the world’s population is under 25 years old, therefore finding jobs for the growing number of youth entering the workforce each year will one of the most pressing global development challenges.<br />  <br /> Small and medium-sized enterprises (SMEs) are valuable sources of economic growth and help economies harness and utilize new technologies. Under the right circumstances, SMEs can play a disruptive effect on the market and pushing the incumbent players to be more efficient with the pricing of their products and services. For example, they were responsible for over <a href=\"https://www.oecd-ilibrary.org/sites/34907e9c-en/1/1/6/index.html?itemId=/content/publication/34907e9c-en&mimeType=text/html&_csp_=97b1ca7ff34abaf04c3b6ec7089258c9&itemIGO=oecd&itemContentType=book\">60 percent</a> of employment in many OECD regions and cities. Startups, in particular, have massive potential for growth with the average startup in the United States hiring <a href=\"https://indicators.kauffman.org/\">5.2 employees</a> in its first year. Startups also have greater agility in charting growth and market expansion. Over <a href=\"https://indicators.kauffman.org/\">86 percent</a> of entrepreneurs who create and scale startups do so out of choice and not as a necessity.<br />  <br /> As the world prepares to confront the job creation challenge to respond to an expanding youth bulge, the global economy must be driven by entrepreneurship, while governments must enable innovation in creating favorable conditions that sustain SME growth.<br />  <br /> <i>This event is made possible with general support from Chevron. </i></p>\n ",
  "itunes:author": "Daniel F. Runde",
  "pubDate": "Tue, 14 Jan 2020 10:00:00 -0500",
  "enclosure": "",
  "itunes:duration": "1:14:26",
  "guid": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/field_soundcloud_audio/Applying%20Lessons%20from%20Global%20Entrepreneurship.mp3"
}