{
  "itunes:episode": 20,
  "title": "So Successful That He Fired Himself with Marco Arment (Part 1)",
  "link": "http://newdisrupt.org/blog/2013/4/24/marco-arment-in-episode-20-so-successful-he-fired-himself",
  "description": "<p><a href=\"http://www.marco.org/\">Marco Arment's</a> career has come in two main acts: as the first employee of <a href=\"https://www.tumblr.com/\">Tumblr</a>, he helped create a service that changed the fundamental nature of blogging by introducing both ease of creation and social networking. While there, he toyed with a service, to let him read Web pages offline without formatting, that became <a href=\"https://www.instapaper.com/\">Instapaper</a>. In late 2010, he left Tumblr to focus on that service full time. Now Marco is a successful podcaster and the editorial director of <i><a href=\"https://the-magazine.org/\">The Magazine</a></i> — the best publication ever created — at which I'm the editor and he's my boss! (I still have a job after we recorded the podcast.)</p>\n\n<p>Our conversation will be aired in two parts, each about an hour long. In this first part, we talk about how as a Tumblr developer Marco found out he didn't want to manage people, how Instapaper developed, and issues of managing resources and scaling. In the second, we move further into podcasting, <i>The Magazine</i>, blogging, advertising, and other areas.</p>\n\n<p>On Twitter, <a href=\"https://twitter.com/marcoarment\">Marco Arment</a>, <a href=\"https://twitter.com/instapaper\">Instapaper</a>, and <a href=\"https://twitter.com/themagazineapp\">The Magazine</a>.\n</p>\n\n\n\n<p>Sponsored by</p>\n\n<p><a href=\"http://www.barebones.com/lm\">BBEdit 10</a>. A hundred new things. $50. Really.</p>\n\n<p><a href=\"http://squarespace.com/newdisruptors\">Squarespace</a>: Everything you need to build exceptional websites!</p>\n\n\n",
  "pubDate": "Wed, 24 Apr 2013 11:21:55 -0700",
  "enclosure": "",
  "itunes:image": "",
  "itunes:duration": "1:02:21",
  "guid": "tag:soundcloud,2010:tracks/103192900",
  "itunes:author": "Glenn Fleishman",
  "itunes:explicit": "no",
  "itunes:subtitle": "Marco Arment's career has come in two main acts: as the first employee of Tumblr, he helped create a service that changed the fundamental nature of blogging by introducing both ...",
  "itunes:summary": "Marco Arment's career has come in two main acts: as the first employee of Tumblr, he helped create a service that changed the fundamental nature of blogging by introducing both ease of creation and social networking. While there, he toyed with a service, to let him read Web pages offline without formatting, that became Instapaper. In late 2010, he left Tumblr to focus on that service full time. Now Marco is a successful podcaster and the editorial director of The Magazine — the best publication ever created — at which I'm the editor and he's my boss! (I still have a job after we recorded the podcast.)\n\nOur conversation will be aired in two parts, each about an hour long. In this first part, we talk about how as a Tumblr developer Marco found out he didn't want to manage people, how Instapaper developed, and issues of managing resources and scaling. In the second, we move further into podcasting, The Magazine, blogging, advertising, and other areas.\n\nOn Twitter, Marco Arment, Instapaper, and The Magazine."
}