{
  "title": "RPA and IPA – Their Similarities are Different, but Their Rapid Growth Trajectories are the Same",
  "link": "http://rocketdatascience.org/?p=1558",
  "comments": "http://rocketdatascience.org/?p=1558#respond",
  "dc:creator": "Kirk Borne",
  "pubDate": "Sat, 13 Feb 2021 02:30:39 +0000",
  "category": [
    "Artificial Intelligence",
    "Machine Learning",
    "Strategy",
    "Robotic Process Automation",
    "RPA"
  ],
  "guid": "http://rocketdatascience.org/?p=1558",
  "description": "When I was growing up, friends at school would occasionally ask me if my older brother and I were twins. We were not, though we looked twin-like! As I grew tired of answering that question, one day I decided to give a more thoughtful answer to the question (beyond a simple “No”). I replied: “Yes, [&#8230;]",
  "content:encoded": "\n<p>When I was growing up, friends at school would occasionally\nask me if my older brother and I were twins. We were not, though we looked\ntwin-like! As I grew tired of answering that question, one day I decided to\ngive a more thoughtful answer to the question (beyond a simple “No”). I\nreplied: “Yes, we are twins. We were born 20 months apart!” My response caused\nthe questioner to pause and think about what I said, and perhaps reframe their\nown thinking. </p>\n\n\n\n<p>This story reminds me that two things may appear very much\nthe same, but they may be found to be not so similar after deeper inspection\nand reflection. RPA and IPA are like that. Their similarities are different!</p>\n\n\n\n<p>What are RPA and IPA? RPA is Robotic Process Automation, and\nIPA is Intelligent Process Automation. Sound similar? Yes, in fact, their\ndifferences are similar! </p>\n\n\n\n<p>In the rest of this article, we will refer to IPA as\nintelligent automation (IA), which is simply short-hand for intelligent process\nautomation.</p>\n\n\n\n<p>Process automation is relatively clear – it refers to an\nautomatic implementation of a process, specifically a business process in our\ncase. One can automate a very complicated and time-consuming process, even for\na one-time bespoke application – the ROI must be worth it, to justify doing this\nonly once. Robotic Process Automation is for “more than once” automation. RPA then\nrefers specifically to the robotic repetition of a business process. Repetition\nimplies that the same steps are repeated many times, for example claims\nprocessing or business form completion or invoice processing or invoice\nsubmission or more data-specific activities, such as data extraction from\ndocuments (such as PDFs), data entry, data validation, and report preparation. </p>\n\n\n\n<p>The benefits of RPA accrue from its robotic repetition of a\nwell-defined process (specifically some sort of digital process with defined instructions,\ninputs, rules, and outputs), which is to be repeated without error, thus\nremoving potential missteps in the process, or accidental omission of steps, or\nemployee fatigue. The process must be simple, stable, repetitive, and routine, and\nit must be carried out the same way hundreds or thousands (or more) times. This\nrobotic repetition of the process assures that the steps are replicated identically,\ncorrectly, and rapidly from one application to the next, thus yielding higher\nbusiness productivity. Consequently, as organizations everywhere are undergoing\nsignificant digital transformation, we have been witnessing increases both in\nthe use of RPA in organizations and in the number of RPA products in the\nmarket. </p>\n\n\n\n<p>So, what about Intelligent Automation? IA refers to the\naddition of “intelligence” to the RPA – transforming it into “smart RPA” or\neven “cognitive RPA”. This is accomplished by adding more data-driven, machine\nlearning, and AI (artificial intelligence) components to the process discovery,\nprocess mining, and process learning stages. IA incorporates feedback,\nlearning, improvement, and optimization in the automation loop. The market and\nbusiness appetite for IA is growing rapidly, particularly as more organizations\nare seeking to add AI to their enterprise functions and to step up the value\nderived from their process automation activities. </p>\n\n\n\n<p>The pivot from RPA to IA right now has spurred <a href=\"https://www.automationanywhere.com/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Automation Anywhere, Inc. (opens in a new tab)\">Automation Anywhere, Inc.</a> (AAI) to conduct a survey of businesses and organizations in numerous sectors and industries, to assess the current and future (Now and Next) state of RPA in the enterprise. AAI’s recently published “<a rel=\"noreferrer noopener\" aria-label=\"Now and Next State of RPA” report (opens in a new tab)\" href=\"https://bit.ly/3p0IZpJ\" target=\"_blank\">Now and Next State of RPA” report</a> presents detailed results of that survey. </p>\n\n\n\n<p>The AAI report covers these industries: energy/utilities,\nfinancial/insurance, government, healthcare, industrial/manufacturing, life\nsciences, retail/consumer, services/consulting, technology, telecom, and\ntransportation/airlines. </p>\n\n\n\n<p>The first part of the report addresses the “Now” – the\npresent-day impact of RPA and IA – how organizations are deploying process\nautomation, what their priorities are, how much are they investing in it, and\nwhat are the benefits being achieved. The “Next” part of the report probes\norganizations’ forward-looking strategies and goals over the next one to two\nyears. Of course, both the “now” and “next” sections are affected and informed\nby the COVID-19 pandemic.</p>\n\n\n\n<p>Some top trends from the report include: </p>\n\n\n\n<ul><li>Cloud is becoming the platform of choice for RPA\ndeployments. Cloud is top of mind for leaders everywhere, and that includes\ncloud migration and cloud security.</li><li>Organizations are thinking big about RPA, with\nmillions of bots already implemented by AAI customers. Some AAI customers have\nindividually deployed tens of thousands of bots.</li><li>The pandemic has rapidly increased demand for\nRPA, especially in customer-facing functions, such as call centers.</li><li>Most organizations (63%) are deploying or\nscaling their efforts, while 27% are still evaluating RPA solutions, and 10%\nhave no plans at this time.</li><li>Spending on RPA is increasing, with an estimated\ndoubling of the number of bots deployed in the next 12 months in most\norganizations who are already actively using RPA bots.</li><li>Productivity improvement is the single most\nimportant driver for adopting RPA, IA, and AI.</li><li>The average ROI from RPA/IA deployments is 250%.</li><li>Interest in AI is high and growing, specifically\nin the areas of smart analytics, customer-centricity, chatbots, and predictive\nmodeling. Many organizations are seeing a strong alignment of their AI and RPA\n(hence, IA) projects.</li><li>The top barriers to adoption are (in order of\nsignificance): lack of expertise, insufficient budget, lack of resources, lack\nof use cases, limited ROI, organizational resistance, scalability concerns, and\nsecurity concerns.</li><li>Top use cases in the back office include finance\n(general ledger data reconciliation), accounts payable (invoice processing and\npayment), and HR (new employee onboarding).</li><li>Top use cases in the front office include\ncustomer records management (including account updates), customer service\n(request handling and call center support), and sales order processing.</li><li>RPA education and training are on the rise\n(specifically online training). This reflects the corresponding increase in\ninterest among many organizations in data literacy, analytics skills, AI\nliteracy, and AI skills training. Education initiatives address the change\nmanagement, employee reskilling, and worker upskilling that organizations are\nnow prioritizing.</li><li>Organizations report an increased excitement for\nRPA/IA, an awareness of significant new opportunities for adoption, and a\ndesire for more mature RPA – that is, intelligent automation!</li></ul>\n\n\n\n<p>There are many more details, including specific insights for different sectors, in the 21-page “Now and Next State of RPA” report from <a href=\"https://www.automationanywhere.com/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\"Automation Anywhere, Inc (opens in a new tab)\">Automation Anywhere, Inc</a>. You can download the full report here: <a rel=\"noreferrer noopener\" aria-label=\"https://bit.ly/3p0IZpJ (opens in a new tab)\" href=\"https://t.co/BDpqR63Tcw?amp=1\" target=\"_blank\">https://bit.ly/3p0IZpJ</a>. Download it for free and learn more how the robotic twinning and repetition of business processes is the most intelligent step in accelerating digital transformation and boosting business productivity.</p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><a href=\"https://bit.ly/3p0IZpJ\" target=\"_blank\" rel=\"noreferrer noopener\"><img loading=\"lazy\" width=\"902\" height=\"810\" src=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsRkqH5XMAA_D1b.jpg\" alt=\"\" class=\"wp-image-1560\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsRkqH5XMAA_D1b.jpg 902w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsRkqH5XMAA_D1b-300x269.jpg 300w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsRkqH5XMAA_D1b-768x690.jpg 768w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsRkqH5XMAA_D1b-624x560.jpg 624w\" sizes=\"(max-width: 902px) 100vw, 902px\" /></a><figcaption><a href=\"https://bit.ly/3p0IZpJ\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">https://bit.ly/3p0IZpJ</a></figcaption></figure></div>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"854\" height=\"878\" src=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDCSUPXYAAmCDP.png\" alt=\"\" class=\"wp-image-1567\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDCSUPXYAAmCDP.png 854w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDCSUPXYAAmCDP-292x300.png 292w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDCSUPXYAAmCDP-768x790.png 768w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDCSUPXYAAmCDP-624x642.png 624w\" sizes=\"(max-width: 854px) 100vw, 854px\" /><figcaption>Productivity is the top driver of RPA and AI.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"928\" height=\"842\" src=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVfXIAEnatY.jpg\" alt=\"\" class=\"wp-image-1568\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVfXIAEnatY.jpg 928w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVfXIAEnatY-300x272.jpg 300w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVfXIAEnatY-768x697.jpg 768w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVfXIAEnatY-624x566.jpg 624w\" sizes=\"(max-width: 928px) 100vw, 928px\" /><figcaption>Open-ended survey questions gave insights into organizations&#8217; planned AI projects.</figcaption></figure>\n\n\n\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"1024\" height=\"507\" src=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh-1024x507.jpg\" alt=\"\" class=\"wp-image-1569\" srcset=\"http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh-1024x507.jpg 1024w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh-300x149.jpg 300w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh-768x380.jpg 768w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh-624x309.jpg 624w, http://rocketdatascience.org/wp-content/uploads/2021/02/EsDGiVhXUAErsmh.jpg 1199w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption>Training initiatives are a high priority for increasing ROI from RPA and AI projects.<br></figcaption></figure>\n",
  "wfw:commentRss": "http://rocketdatascience.org/?feed=rss2&#038;p=1558",
  "slash:comments": 0
}