{
  "title": "Unravelling the origin of the peculiar transition in the magnetically ordered phase of the Weyl semimetal Co3Sn2S2. (arXiv:2211.01483v1 [cond-mat.str-el])",
  "link": "http://arxiv.org/abs/2211.01483",
  "description": "<p>Recent discovery of topologically non-trivial behavior in Co3Sn2S2 stimulated\na notable interest in this itinerant ferromagnet (Tc = 174 K). The exact\nmagnetic state remains ambiguous, with several reports indicating the existence\nof a second transition in the range 125 -- 130 K, with antiferromagnetic and\nglassy phases proposed to coexist with the ferromagnetic phase. Using detailed\nangle-dependent DC and AC magnetization measurements on large, high-quality\nsingle crystals we reveal a highly anisotropic behavior of both static and\ndynamic response of Co3Sn2S2. It is established that many observations related\nto sharp magnetization changes when B || c are influenced by the\ndemagnetization factor of a sample. On the other hand, a genuine transition has\nbeen found at Tp = 128 K, with the magnetic response being strictly\nperpendicular to the c-axis and several orders of magnitude smaller than for B\n|| c. Calculations using density-functional theory indicate that the ground\nstate magnetic structure consist of magnetic moments canted away from the\nc-axis by a small angle (~ 1.5deg). We argue that the second transition\noriginates from a small additional canting of moments within the kagome plane,\nwith two equivalent orientations for each spin.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cond-mat/1/au:+Zivkovic_I/0/1/0/all/0/1\">Ivica Zivkovic</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yadav_R/0/1/0/all/0/1\">Ravi Yadav</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Soh_J/0/1/0/all/0/1\">Jian-Rui Soh</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yi_C/0/1/0/all/0/1\">ChangJiang Yi</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Shi_Y/0/1/0/all/0/1\">YouGuo Shi</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Yazyev_O/0/1/0/all/0/1\">Oleg V. Yazyev</a>, <a href=\"http://arxiv.org/find/cond-mat/1/au:+Ronnow_H/0/1/0/all/0/1\">Henrik M. Ronnow</a>"
}