{
  "title": "Honoring work to support innovation in aging",
  "link": "https://news.mit.edu/2022/honoring-work-support-innovation-aging-1027",
  "description": "MIT AgeLab co-hosts 10th anniversary celebration of Boston Bridge, a longtime collaborator offering development, networking, career growth, and mentorship in the field of aging.",
  "pubDate": "Thu, 27 Oct 2022 08:00:00 -0400",
  "guid": "https://news.mit.edu/2022/honoring-work-support-innovation-aging-1027",
  "dc:creator": "Adam Felts | MIT AgeLab",
  "content:encoded": "<p>On Sept. 13, <a href=\"http://agelab.mit.edu/\">MIT AgeLab</a> co-hosted a celebration honoring the 10th anniversary of <a href=\"https://bostonbridge.org/\">Boston Bridge</a>, a nonprofit professional development organization in the field of aging with a longtime AgeLab association.</p>\n\n<p>Since its founding in 2012, AgeLab has been affiliated with Boston Bridge, an interdisciplinary program that works with business, government, and nongovernmental organizations to improve the quality of life of older people and those who care for them. MIT AgeLab researcher Taylor Patskanick is the current president of Boston Bridge, and the MIT Sloan School of Management is the current site of Boston Bridge’s monthly meetings.</p>\n\n<p>Boston Bridge holds meetings and networking dinners that invite established and emerging professionals in the field of aging to share their expertise with those interested or involved in the aging field. The organization also connects older and younger professionals for mentorship opportunities.</p>\n\n<p>A growing cohort of aging Americans means that we can hardly afford to neglect to pay attention to older adults, said Patskanick in her opening remarks for the anniversary celebration. She noted too that the Covid-19 pandemic has tightened the labor market significantly, while at the same time the aging population has created unprecedented demand for professionals who work with and serve older adults.</p>\n\n<p>Boston Bridge’s focus on mentorship makes it both a professional development organization and a form of intergenerational programming. And the genesis of Boston Bridge was itself an intergenerational affair: The organization was founded by Barbara Friedman, who had recently retired from a role as director of intergenerational programming at the nonprofit <a href=\"https://2lifecommunities.org/\" target=\"_blank\">2Life Communities</a>, and Elana Kieffer, a recent graduate of Brandeis University.</p>\n\n<p>Early in her career, when Friedman was a high school biology teacher, she noticed that her class textbook ended its discussion of the development of the human body after age 25. “I asked myself,” she said, ‘Didn’t anything happen to the body after 25?’” This observation of the lack of attention paid to the experiences of older people, she said, propelled her into a later career in aging, and eventually, to founding Boston Bridge.</p>\n\n<p>As Boston Bridge has grown and shown resiliency over the decade since its founding, the organization released a <a href=\"https://bostonbridge.org/index.php/2022/09/13/boston-bridge-replication-manual/\">replication manual</a> for professionals to develop similar programs in their own cities. The Boston area has proven to be the home of many firsts in the field of innovation in aging: In 2020 and 2021, the <em>The Boston Globe</em> released <a href=\"https://apps.bostonglobe.com/opinion/graphics/2022/04/the-longevity-hub/\">a series of articles</a> highlighting aspects of the city’s role as a “longevity hub.”</p>\n\n<p>Emily Shea, commissioner of Boston’s Age Strong Commission; Sandra Harris, vice president of AARP Massachusetts; and Alice Bonner, former secretary of the Massachusetts Executive Office of Elder Affairs and current senior advisor for aging at the Institute for Healthcare Improvement, also gave remarks at the ceremony. Speaking about her formative professional experience working with older adults, Bonner said, “My first job at a nursing home was like being on another planet … it changes you.” The people who have chosen the vocation of working with and helping older people, she said, constitute a special class of professionals, and are worth investing in and developing.</p>\n\n<p>Friedman and Kieffer, as well as Joseph Coughlin, MIT AgeLab founder and director, were recognized with awards for their involvement in developing Boston Bridge. Speaking about the role that Boston Bridge plays both in developing the aging workforce and in pushing forward thought leadership on how to serve the aging population, Coughlin said, “Boston Bridge is a step to invest in action. Innovation comes from people doing the work.”</p>",
  "media:content": {
    "media:description": "Taylor Patskanick (left) presents an award to Boston Bridge founders Barbara Friedman (right) and Elana Kieffer.",
    "media:credit": "Photo courtesy of MIT AgeLab."
  },
  "category": [
    "Special events and guest speakers",
    "Aging",
    "Mentoring",
    "Community",
    "AgeLab",
    "Center for Transportation and Logistics",
    "MIT Sloan School of Management"
  ]
}