{
  "title": "Summer of Data Science 2018 #SoDS18 Launch Day!",
  "link": "https://www.becomingadatascientist.com/2018/05/28/summer-of-data-science-2018-sods18-launch-day/",
  "comments": "https://www.becomingadatascientist.com/2018/05/28/summer-of-data-science-2018-sods18-launch-day/#comments",
  "pubDate": "Mon, 28 May 2018 17:53:49 +0000",
  "dc:creator": "Renee",
  "category": [
    "#SoDS",
    "resources",
    "data science communities",
    "data science learning",
    "data science projects",
    "summer of data science"
  ],
  "guid": "https://www.becomingadatascientist.com/?p=1526",
  "description": " The main goal of the Summer of Data Science is to learn something new during a fixed period of time, and share your progress and references to help and inspire others (and to get help from and get inspired by others, too!).",
  "content:encoded": "<p>Memorial Day is the unofficial start of summer in the U.S., so in the past, we&#8217;ve also used it as the start date for the <a href=\"https://www.becomingadatascientist.com/category/sods/\">Summer of Data Science</a>! The main goal of the Summer of Data Science is to learn something new during a fixed period of time, and share your progress and references to help and inspire others (and to get help from and get inspired by others, too!). If you want to learn more about the origin and history of the hashtag, I gave more background in <a href=\"https://www.becomingadatascientist.com/2017/05/29/summer-of-data-science-2017/\">last year&#8217;s post</a>.</p>\n<p>But I&#8217;m sure the main thing you&#8217;re here to find out is how to get involved yourself! So, here are the basics:</p>\n<blockquote><p>How to participate in the Summer of Data Science:</p>\n<ul>\n<li style=\"margin-bottom: 1em;\">Pick a thing or a short list of things related to data science that you want to learn more about this summer (or this winter if you&#8217;re in the southern hemisphere!)</li>\n<li style=\"margin-bottom: 1em;\">Make a plan to learn it (like an online course, a practice project, etc.).</li>\n<li>Share that plan on social media, then post updates as you make progress, with the hashtag <a href=\"https://twitter.com/search?q=%23SoDS18\" rel=\"noopener\" target=\"_blank\">#SoDS18</a>.</li>\n</blockquote>\n<p>Here&#8217;s <a href=\"https://twitter.com/i/moments/878277513130192896\" rel=\"noopener\" target=\"_blank\">a twitter moment with a bunch of entries from #SoDS17</a> for reference!</p>\n<p>We&#8217;ll run this one from today &#8211; May 28, 2018 &#8211; through Labor Day in the U.S. &#8211; September 3, 2018. What you can realistically get done in that time depends on where you are in your data science learning journey, what your work schedule and family obligations are like, and many other factors &#8211; so think about what&#8217;s realistic for you to accomplish during this time.</p>\n<p>Week 1 will be about brainstorming and researching possibilities and resources for summer projects, courses, etc. And in Week 2 we&#8217;ll set specific goals for the rest of the summer. So, start thinking of ideas now!</p>\n<p>If you would like some ideas for beginners, here&#8217;s a list of beginner content on my site DataSciGuide:<br />\n<a href=\"http://www.datasciguide.com/recommended-resources-for-beginners/\" rel=\"noopener\" target=\"_blank\">Recommended Resources for Beginners</a><br />\nYou might want to pick a book or course and go through it, trying out the exercises this summer.</p>\n<p>I also have a Flipboard where I have collected a bunch of <a href=\"https://flipboard.com/@becomingdatasci/data-science-related-tutorials-1h97ri85y\" rel=\"noopener\" target=\"_blank\">Data Science Tutorials</a> you might want to check out (note: these aren&#8217;t all aimed at beginners).</p>\n<p>There are also a whole bunch of online communities where you can join others in a project, or ask questions if you get stuck on yours. I’ll be writing another post highlighting those this week!</p>\n<p>Follow me on twitter <a href=\"https://twitter.com/BecomingDataSci\" rel=\"noopener\" target=\"_blank\">@becomingdatasci</a>, and tweet with the hashtag <a href=\"https://twitter.com/search?q=%23SoDS18\" rel=\"noopener\" target=\"_blank\">#SoDS18</a> when you post updates about your progress! (It’s a good idea to “thread” your tweets throughout the summer, or add them to a Twitter Moment, so others can easily follow along!)</p>\n<p>I&#8217;ll be retweeting a bunch of people&#8217;s ideas and resources, so keep an eye out there for more ideas if you aren&#8217;t sure where to start!</p>\n",
  "wfw:commentRss": "https://www.becomingadatascientist.com/2018/05/28/summer-of-data-science-2018-sods18-launch-day/feed/",
  "slash:comments": 2
}