{
  "title": "S17 Ep100: It's Not About The Gun w/ Kathy Stearman",
  "link": "https://audioboom.com/posts/8144134",
  "itunes:episode": 100,
  "itunes:title": "It's Not About The Gun w/ Kathy Stearman",
  "itunes:season": 17,
  "enclosure": "",
  "media:content": [
    "",
    ""
  ],
  "itunes:image": "",
  "itunes:duration": 12521,
  "itunes:explicit": "no",
  "itunes:episodeType": "full",
  "description": "<div>True Crime Tuesday presents It's Not About The Gun: Lessons from My Global Career as a Female FBI Agent with ex-FBI Agent/Author, Kathy Stearman!<br>\n<br>\nWhen she entered the FBI Academy in 1987, Stearman was one of about 600 women in a force of 10,000 agents. While there, she evolved into an assertive woman, working her way up the ranks and across the globe to hold positions that very few women have held before. And yet, even at the height of her career, Stearman had to check herself to make sure that she never appeared weak, inferior, or afraid. The accepted attitude for women in power has long been cool, calm, and in control—even though Stearman herself is funny, personable, and empathetic.<br>\n<br>\nStearman changed for the FBI, but she longs for a different path for future women of the Bureau. If the system changes, then women can remain constant, valuing their female identity and nurturing the people they truly are.<br>\n<br>\nFrom the rolling hills of Kentucky to the rigors of training camp, from the chaos of New Delhi to the fog and intrigue in Beijing, <em>It’s Not About the Gun</em>, paints a vivid picture of life as a woman in the FBI, and reveals how Stearman’s perception of her country and the FBI has evolved as America—and the world—continues to change.  Kathy joins TCT today to talk about these experiences and about the current state of the FBI in today's climate. <br>\n<br>\nPLUS: An all-new Dumb Crimes/Stupid Criminals with Beer City Bruiser!<br>\n<br>\n#crime #truecrime #truecrimeppodcasts #truecrimeradio #truecrimetuesday #timdennis #beercitybruiser #ringofhonorwrestiling #dumbcrimesstupidcriminals <br>\n#kathystearman #FBI #sexualdiscrimination #sexualharassment #quantico #terrorism #counterterrorism #cybercrime #cyberterrorism #spy #spying #itsnotaboutthegun #LessonsfromMyGlobalCareerasaFemaleFBIAgent #robertmueller #johnpistole #jonhuntsmanjr #ericholder #attorneygeneral #davidpetraeus #louisfreeh #china #india #srilnka #mongolia #bhutan #maldives #sanfrancisco #newyork #washingtondc </div>\n",
  "pubDate": "Tue, 23 Aug 2022 08:00:00 +0000",
  "guid": "tag:audioboom.com,2022-08-23:/posts/8144134",
  "itunes:author": "Darkness Radio",
  "dc:creator": "Darkness Radio",
  "media:rights": ""
}