{
  "title": "Episode 9: &#8220;How High The Moon&#8221; by Les Paul and Mary Ford",
  "link": "https://500songs.com/podcast/how-high-the-moon-by-les-paul-and-mary-ford/",
  "pubDate": "Mon, 03 Dec 2018 04:40:18 +0000",
  "dc:creator": "Andrew Hickey",
  "guid": "https://500songs.com/podcast/how-high-the-moon-by-les-paul-and-mary-ford/",
  "description": "Welcome to episode nine of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Les Paul and Mary Ford, and \"How High The Moon\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum: </strong>I say Django Reinhardt never played electric guitar. He did, in his last few years, but not on any of his most famous recordings.\n\n<strong>A couple of notes:</strong>\n\nThis one is a few hours late, as I had some *severe* technical problems with the several previous attempts at recording this. This version was recorded starting around midnight on Sunday night, which is usually the time I put them up, so I apologise if it's lacking a final polish\n\n<strong>Resources</strong>\n\nIf the episode starts you wondering about playing instruments while physically disabled, or inventing new instruments, you might want to check out a charity called the <a href=\"https://www.ohmi.org.uk/\">One-Handed Musical Instrument Trust</a>, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-9-how-high-the-moon/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2QBY5nw\">This 3-CD box set</a> is a very good compilation of Les Paul and Mary Ford's best work.\n\nThe quotes from Les Paul in this episode come from<a href=\"https://amzn.to/2Q66Jv6\"> this book of interviews with him.</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nTo be a truly great guitarist, you need to have an imagination. You need to be inventive. And you need to have a sense of musicality. Some would also say that you need to have a lot of dexterity, and to be able to move your fingers lightning fast. Maybe also have long fingers, so you could reach further down the neck.\n\nBut let's talk about Django Reinhardt for a bit.\n\nWe mentioned Django a little bit in the episode on Bob Wills and “Ida Red”. We talked, in particular, about how he was making music that sounded very, very similar to what the early Western Swing musicians were doing.\n\nWe're not going to talk much about Django in this series, because he was a jazz musician, but he *was* very influential on a few of the people who went on to influence rock, so we're going to touch on him briefly here. He never played an electric guitar, but he still influenced pretty much every guitarist since, either directly or indirectly.\n\nAnd this was despite having disadvantages that would have stopped almost anyone. One point we haven't made very much yet, but which needs to be made repeatedly, is that the people in most of these early podcasts were crushingly, hellishly, poor by today's standards. Poverty still exists of course, to far too great an extent, but the people we're talking about here lived in conditions that would be unimaginable to almost all of the listeners to this podcast.\n\nAnd Reinhardt had it worse than most. He was a Romany traveller, and while growing up his greatest skill was stealing chickens -- real, proper, poverty. But he became a professional musician, and it looked like he might actually become well off. And then his bad luck got worse. His caravan caught on fire, and in trying to rescue his wife and child, he suffered such extreme burns that one of his legs became paralysed -- and more importantly for Reinhardt as a musician, he lost the use of two of his fingers on his left hand. He had to re-teach himself to play the guitar, and to use only two fingers and a thumb on his left hand to play.\n\nRemarkably, he managed well enough to do things like this:\n\n[Excerpt: \"How High The Moon\" Django Reinhardt]\n\nReinhardt influenced many guitarists, and one American guitarist in particular became a friend of Reinhardt and said that he and Reinhardt were the only two guitarists in the world at that time who were actually serious about their instrument. He was another jazzman, with a similar style to Reinhardt but one who had a more direct influence on rock and roll.\n\nWaukesha, Wisconsin, is not the most rock and roll town in the world. It was a spa town, before the water started to dry up, and about the most exciting thing that ever happened there is that Mr Sears, the founder of Sears & Roebuck, retired there when he got too ill to work any more. It's a bland, whitebread, midwestern town in a state that's most notable for dairy farming.\n\nYet it's also the birthplace of the only man who is in the rock and roll hall of fame *and* the National Inventors Hall of Fame, and who probably did more than any other individual to make the guitar a respected lead instrument. Almost every moderately-known guitarist eventually gets a \"signature\" model named after them, and most of these sell a small number of instruments before being discontinued. But one man has a signature model that's so popular that other guitarists get their signatures *alongside his*. When you buy a Jimmy Page or Mark Knopfler or Slash or Eric Clapton signature guitar, there are two names on there -- the name of Page or Clapton or whoever, and the name Les Paul.\n\nLes Paul was a remarkable man, whose inventions are far more widely known even than his name. You'll almost certainly have seen musicians playing guitar and harmonica at the same time, using a harmonica holder -- Les Paul invented that, as a teenager, making the first one out of a coathanger. I guess if you were a teenager in Waukesha in the 1920s, you'd have little better to do with yourself than invent coathanger harmonica holders too.\n\nBut Les Paul was, first and foremost, a guitar player, and he became a semi-professional musician by the time he was thirteen. The choice of the guitar was one that was actually made by his mother. She explained to him \"if you play the piano you got your back turned to the audience. If you play the drums, you gotta carry all that stuff around, it's not musical. If you play a saxophone, you can't sing and talk at the same time.\" In his own words, she \"whittled it down to guitar in a hurry\". His mother, indeed, seems to have been a remarkable woman in many ways -- if you read any interviews with Les, he barely ever goes a few sentences without saying something about how much she did for him.\n\nThat's one of the defining characteristics of Les Paul's life, really -- his admiration for his mother. There were two more things that characterised him though. The first was that pretty much dead on, every ten years, he would have some major health crisis that would put him out of commission for a year. The other was his lifelong devotion to learning, which meant that he used those health crises as an opportunity to learn something new.\n\nThis love of learning could be seen from his very early days. When he was just learning the guitar, the singing cowboy star Gene Autry came to town. Gene Autry was a star of Western music -- the very biggest star in the country -- and his music was a cleaned-up, politer, version of the kind of music Bob Wills played:\n\n[excerpt: Gene Autry \"Back in the Saddle Again\"].\n\nLes and his friend went to every show in the residency, and after a couple of nights, Gene Autry stopped the show in the middle of the set and said \"something strange has been happening here -- every time I play an F chord, and *only* when I play an F chord, there's a flash of light. What's going on, how is this happening?\"\n\nIt turned out that Les had been wanting to learn how Autry made that chord shape, so he'd been there with a pencil and paper, and his friend had a torch, and every time he played the chord Les Paul wanted to learn, the torch would come on and Les would be trying to sketch the shape of Autry's fingers. Autry invited Les Paul onto the stage, showed him how to make the chord, and had him play a couple of songs. A few years later, when Autry moved from radio to films, he suggested Les Paul take over his radio show.\n\nSo Les Paul was always fascinated by learning, and always trying to improve himself and his equipment. And once he decided to be a guitarist, he also decided to electrify his guitar, a full decade before electric guitars became a widespread instrument.\n\nHe explained that when he was starting out, he was playing at a hotdog stand, using a homemade microphone for his voice and harmonica -- the microphone was made out of bits of an old telephone, and it was plugged in to his mother's radio.\n\nPeople who were listening liked his performances, but they said they wished the guitar was as loud as his voice -- so he took his *dad's* radio, too, and connected it to a record player needle, which he jammed into the body of his guitar.\n\nOnce electric guitars started being manufactured, Paul started playing them, but he never liked them. The electric guitars of the late 1930s were what we'd now call electro-acoustics -- they were acoustic guitars, playable as such, but with pickups. There were two main problems with them -- firstly, they were very prone to feedback, because the hollow body of the guitar would resonate. And secondly, most of the sonic energy from the strings was going into the guitar itself, so there was no sustain. Paul came up with a simple solution to this problem, which he called \"the log\".\n\nThe log was almost exactly what the name would suggest. It was a plank, to which were nailed some pickups, strings, and tuning pegs. On the front was attached the front of a normal guitar -- not anything that would actually resonate, just to make it look like a proper guitar. But basically it was just a lump of wood.\n\nLes Paul wasn't the first person to build a solid-body electric guitar -- but as he put it himself later \"there may be some guy out there in Iowa says he built the guitar in 1925, for all I know, and he may have. I only know what I was doing and I was out there weaving my own basket, and there wasn't anybody else around and it had to be done.\".\n\nHe perfected the solid-body guitar during the first of his years of illness -- he'd been running an illegal radio station, accidentally stuck his hand in the transmitter, and not only got an electric shock but had a load of equipment fall on him. By the time he was well enough to work again, he had the idea perfected.\n\nHe took his solid-body guitar idea to Gibson in 1941, but they weren't interested -- no-one was going to want to buy a solid guitar. It wasn't until Leo Fender started selling his guitars in 1950 that Gibson realised that it might be worth doing.\n\nBut by then Les Paul had become one of the most famous guitarists in the country. Even before he became hugely famous, though, he'd been one of the *best* guitarists in the country. In 1944, when the guitarist Oscar Moore was unable at the last minute to play at Jazz At The Philharmonic -- the first of what would eventually become the most famous series of jazz concerts ever -- Les Paul was drafted in at short notice, and the live recordings of that show are some of the greatest instrumental jazz you'll hear, at a time when the borders between jazz, R&B, and pop music were more fluid than they became. Listen, for example, to this excerpt from \"Blues, 1, 2, & 3\".\n\n[excerpt]\n\nThe honking saxophone player there is Ilinois Jacquet, the man who we talked about in episode one of this podcast, who invented R&B saxophone. The pianist there was also pretty great -- he was, in fact, a pianist who was already regarded as one of the best in the business, even before he started to sing, and who later had two further, separate careers under his more familiar name – one in R&B in which he inspired a generation of singers like Charles Brown and Ray Charles, and one in pop, where he became one of the great ballad singers of all time. He's credited on the track we just heard as \"Shorty Nadine\" for contractual reasons, but you probably know him better as Nat \"King\" Cole.\n\nListening to that you can hear musicians performing at a time when jazz and R&B and rock and roll were all still sort of the same thing, before they all went off in their different directions, and it's hard not to wish that that cross-fertilisation had continued a while longer.\n\nBut it didn't, and it would be easy to imagine that as a result Les Paul, who was absolutely a jazz musician, would make no further contributions to rock and roll after his popularising the solid-body electric guitar. But we haven't even got to his real importance yet. Yes, something he did that was even more important than the Les Paul guitar.\n\nIt started when his mother told him she'd enjoyed something she heard him play on the radio. He'd replied that it wasn't him she'd heard, and she'd said \"well, all those electric guitar players sound the same. If you want to be a real success, you want to sound different from everyone else -- at least different enough that your own mother can recognise you\". And over the years, Les Paul had learned to listen to his mother -- she'd been the one who'd got him playing guitar, and she'd been the one who had told him to go and see Bob Wills, the day he'd ended up meeting Charlie Christian for the first time.\n\nSo he went and spent a lot of time working on a sound that was totally different from anything else, spending days and weeks alone. He stopped working with his trio -- and started working with a young country singer who renamed herself Mary Ford, who Gene Autry had introduced him to and who he soon married -- and he eventually came up with a whole new idea.\n\nThis episode is primarily about Les Paul, because he was such an astonishing force of nature, but it's worth making clear that Mary Ford was very much an equal partner in their sixteen years together. She was an excellent singer -- *far* better than Les Paul was -- and also a pretty good guitarist herself. On their live dates she would play rhythm guitar, and often the two would do a comedy guitar duel, with her copying everything Les Paul played. She was a vital part of the sound -- and of the sonic innovations the records contained, because one of the things they did for the first time was to have her sing very close to the mic -- a totally different technique than had been used before, which gave her vocals a different tone which almost everyone imitated.\n\nBut that wasn't the only odd sound on the records. It sounded like Les Paul was playing two or three guitars at the same time, playing the same part. And sometimes he was playing notes that were higher than any guitar could play.\n\nAnd sometimes, when Mary Ford was singing... it sounded as if there were two or more of her!\n\nThis was such an unusual sound that on the duo's radio and TV appearances they made a joke of it -- they pretended that Paul had invented a \"Les Paulveriser\", which could duplicate everything, and that for example he could use the Les Paulveriser on Mary, so there'd be multiple Marys and she could get the vacuum cleaning done quicker.\n\nIt was the fifties.\n\nBut of course, what Paul was actually doing was overdubbing -- recording one guitar part, and then going back and recording a second over it. He'd been fascinated by the idea for decades and he'd first done it as an experiment when he was still with the trio. He'd wanted to rehearse a song on his own, but with the arrangement the rest of the band played, so he'd recorded himself playing all the parts, using a disc cutter and playing along with previous takes.\n\nThis didn't give good results until the introduction of magnetic tape recording in the very late forties -- when you recorded directly to a disc there was so much surface noise, and recording quality was so poor, that no-one would even think of recording overdubs.\n\nBut in 1945, American soldiers brought back a new technology from Germany as spoils of war -- high fidelity tape recording. With magnetic tape you could record sound with orders of magnitude less noise than by cutting to disc.\n\nAnd Bing Crosby, who often worked with Les Paul, was the first person to see the possibilities of this new technology (in his case, for pre-recording his radio shows so they didn't have to go out live, which meant he could record them in batches and have more time to spend on the golf course).\n\nLes Paul was far more technical than Crosby, though, and far more aware of what could happen if, for example, you had two tape recorders. Or if you ran one slow so that when you played it back at normal speed everything sounded sped up. Or a dozen other obvious tricks that occurred to him, but had never occurred to anyone else.\n\nSo on those Les Paul and Mary Ford records, literally every instrument was Les Paul on the guitar. The bass was Les Paul's guitar slowed down to half speed, the percussion was his guitar, *everything* was his guitar.\n\nSo now we come to \"How High the Moon\" itself. This is a song that originally dated back to 1940 -- the Benny Goodman band had the first hit with it, and indeed Les Paul had recorded a version of it in 1945, with his trio.\n\n[excerpt Les Paul Trio version of \"How High the Moon\"]\n\nThat was right before his experiments with tape recording started. Shortly after the first results of those were released, in 1948, there was another one of those every-decade health problems. In this case, Mary Ford was driving the two of them from Wisconsin to LA. She was from California, and not used to driving in winter weather. She hit a patch of ice and the two of them went off the road. Les Paul spent hours in ice water with multiple bones broken before anyone could get him to a hospital. For a while, it was believed it would not be possible to save his right arm -- and then for a while after that the doctors believed they could save it, but it would permanently be fixed in a single position if they did, as his elbow would be unfixable. He told them to try their best, and to set it in a position with his hand over his navel, because if it was in that position he could still play guitar.\n\nAs a precaution, he spent his time in hospital drawing up plans for a synthesiser, ten years before Robert Moog invented his, because he figured he could play the synth with one arm.\n\nWhen he got better, he and Mary Ford recorded a new version of \"How High The Moon\", but at first the record label didn't want to release it:\n\n[Excerpt Les Paul and Mary Ford: \"How High The Moon\"]\n\nThat record sat unreleased for eighteen months, until 1951, because Jim Conkling at Capitol said that there'd been seventy-five recordings of the song before and none of them had been a hit. Conkling thought this was because the lyrics don't make sense, but Les Paul was insistent that no-one was going to listen to the lyrics anyway. \"It doesn't matter what Mary sang or if it was done by the Four Nosebleeds. It didn't make any difference, because that wasn't what made the record. It was the arrangement and the performance.\"\n\nAnd he was right -- the version by Les Paul and Mary Ford was an absolute phenomenon. It spent twenty-five weeks in the Billboard pop charts, nine of them at number one, and while it was at number one another Paul and Ford track was at number two. Even more astonishingly, it also made number two on the rhythm and blues charts. Remember, that was a chart that was specifically aimed at the black audience, and between 1950 and 1955 only five records by white performers made the R&B charts at all, mostly very early rock and roll records.\n\n\"How High the Moon\" might easily seem an odd fit for the R&B charts. To twenty-first century ears, it's hard to imagine anything more white-sounding.\n\nBut what it does, absolutely, share with the music that was charting on the R&B charts at the time, and the reason it appealed to the R&B audience, is a delight in finding totally new sounds. The R&B charts at the time were where you looked for experimentation, for people trying new things.\n\nAnd also, there's that rhythm on the record -- this is entirely a record that's driven by the rhythm. It's not quite dance music, not like the jump bands -- and there's only guitar and vocals on it, something which would be absolutely out of the ordinary for rhythm and blues records at the time with their emphasis on piano and saxophone -- but what there is in that guitar playing is personal expression.\n\nAnd R&B was all about individual expression.\n\nLes Paul was doing something which was qualitatively different both from jazz and from R&B, and so it's not surprising that he ended up crossing over from one market to another.\n\nBut in doing so, he also invented the way the guitar was to be used in rock and roll music. There's a lot of Western Swing about what he's doing on \"How High the Moon\", unsurprisingly. But while the rhythm guitar is keeping to the same kind of rhythms that the Western Swing people would use, the lead guitar is much more aggressive and forceful than anything you got in country or western music at the time. It's playing jazz and R&B lines -- it's playing, in fact, the kind of thing that a saxophone player like Illinois Jacquet might play, full of aggressive stabs and skronks.\n\nAnd more than that, he invented the way the recording studio would be used in rock and roll. Before Les Paul and Mary Ford's early records, the recording studio was used solely as a way of reproducing the sound of live instruments as accurately as possible. After them, it became a way to create new sounds that could not be made live.\n\nOne thing we're going to see over and again in this series is the way technological change, artistic change and social change all feed back into each other. The 1950s was a time of absolutely unprecedented technological change in America, and people went from, in the beginning of the decade, listening to recordings played at 78RPM, often on wind-up gramophones, made of breakable shellac, to listening to high fidelity forty-five RPM singles and long-playing records which could -- shockingly -- last more than four minutes a side. Radio went from being something that had to be listened to as a family because of the size of the radiogram to something a teenager could listen to in bed under the blankets on a transistor radio, or something that you could even have on in your car!\n\nThe combination of these changes made music into something that could be personal as well as communal. Teenagers didn't have to share the music with their parents.\n\nAll of that was still to come, of course, and we'll look at those things as they happen during our history. But \"How High the Moon\" was the first and best sign of what was to come, as the 1940s gave way to the 1950s, and music entered a totally new age.\n\nLes Paul kept playing the guitar into his nineties. Interviewed in his late seventies, when his arthritis was so bad he only had movement in two fingers, with all the others so stiff they just had to stay where he put them, he said he played better than he had when he had ten fingers, because he'd had to learn more about the instrument to do it this way. In the end, his arthritis got to the point that he could no longer move any fingers on either hand -- so he just let his fingers stay where they were, but would move his whole hand to play single notes and bar chords -- he could lift his fingers up and down, just not move the knuckles.\n\nBut he could still play. This is him on his ninetieth birthday:\n\n[excerpt: Les Paul 90th birthday concert “Sweet Georgia Brown”]\n\nSo it turns out you don't even need the two fingers Django had left, not if you have the kind of mind that gets you into the rock and roll hall of fame *and* the inventors' hall of fame.\n\nLes Paul died, aged ninety-four, in 2009.",
  "itunes:subtitle": "Welcome to episode nine of A History of Rock Music in Five Hundred Songs. Today were looking at Les Paul and Mary Ford, and How High The Moon. Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum",
  "itunes:keywords": "Bing Crosby,disability,Django Reinhardt,Gene Autry,Illinois Jacquet,Les Paul,Mary Ford,Nat King Cole,overdubbing,synthesiser",
  "itunes:episodeType": "full",
  "itunes:episode": 9,
  "content:encoded": "Welcome to episode nine of <em>A History of Rock Music in Five Hundred Songs</em>. Today we're looking at Les Paul and Mary Ford, and \"How High The Moon\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\n<strong>Erratum: </strong>I say Django Reinhardt never played electric guitar. He did, in his last few years, but not on any of his most famous recordings.\n\n<strong>A couple of notes:</strong>\n\nThis one is a few hours late, as I had some *severe* technical problems with the several previous attempts at recording this. This version was recorded starting around midnight on Sunday night, which is usually the time I put them up, so I apologise if it's lacking a final polish\n\n<strong>Resources</strong>\n\nIf the episode starts you wondering about playing instruments while physically disabled, or inventing new instruments, you might want to check out a charity called the <a href=\"https://www.ohmi.org.uk/\">One-Handed Musical Instrument Trust</a>, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created <a href=\"https://www.mixcloud.com/AndrewHickey/500-songs-supplemental-9-how-high-the-moon/\">a Mixcloud streaming playlist</a> with full versions of all the songs in the episode.\n\n<a href=\"https://amzn.to/2QBY5nw\">This 3-CD box set</a> is a very good compilation of Les Paul and Mary Ford's best work.\n\nThe quotes from Les Paul in this episode come from<a href=\"https://amzn.to/2Q66Jv6\"> this book of interviews with him.</a>\n\n<strong>Patreon</strong>\n\nThis podcast is brought to you by the generosity of my backers on Patreon.<a href=\"https://www.patreon.com/join/AndrewHickey\"> Why not join them?</a>\n\n<strong>Transcript</strong>\n\nTo be a truly great guitarist, you need to have an imagination. You need to be inventive. And you need to have a sense of musicality. Some would also say that you need to have a lot of dexterity, and to be able to move your fingers lightning fast. Maybe also have long fingers, so you could reach further down the neck.\n\nBut let's talk about Django Reinhardt for a bit.\n\nWe mentioned Django a little bit in the episode on Bob Wills and “Ida Red”. We talked, in particular, about how he was making music that sounded very, very similar to what the early Western Swing musicians were doing.\n\nWe're not going to talk much about Django in this series, because he was a jazz musician, but he *was* very influential on a few of the people who went on to influence rock, so we're going to touch on him briefly here. He never played an electric guitar, but he still influenced pretty much every guitarist since, either directly or indirectly.\n\nAnd this was despite having disadvantages that would have stopped almost anyone. One point we haven't made very much yet, but which needs to be made repeatedly, is that the people in most of these early podcasts were crushingly, hellishly, poor by today's standards. Poverty still exists of course, to far too great an extent, but the people we're talking about here lived in conditions that would be unimaginable to almost all of the listeners to this podcast.\n\nAnd Reinhardt had it worse than most. He was a Romany traveller, and while growing up his greatest skill was stealing chickens -- real, proper, poverty. But he became a professional musician, and it looked like he might actually become well off. And then his bad luck got worse. His caravan caught on fire, and in trying to rescue his wife and child, he suffered such extreme burns that one of his legs became paralysed -- and more importantly for Reinhardt as a musician, he lost the use of two of his fingers on his left hand. He had to re-teach himself to play the guitar, and to use only two fingers and a thumb on his left hand to play.\n\nRemarkably, he managed well enough to do things like this:\n\n[Excerpt: \"How High The Moon\" Django Reinhardt]\n\nReinhardt influenced many guitarists, and one American guitarist in particular became a friend of Reinhardt and said that he and Reinhardt were the only two guitarists in the world at that time who were actually serious about their instrument. He was another jazzman, with a similar style to Reinhardt but one who had a more direct influence on rock and roll.\n\nWaukesha, Wisconsin, is not the most rock and roll town in the world. It was a spa town, before the water started to dry up, and about the most exciting thing that ever happened there is that Mr Sears, the founder of Sears & Roebuck, retired there when he got too ill to work any more. It's a bland, whitebread, midwestern town in a state that's most notable for dairy farming.\n\nYet it's also the birthplace of the only man who is in the rock and roll hall of fame *and* the National Inventors Hall of Fame, and who probably did more than any other individual to make the guitar a respected lead instrument. Almost every moderately-known guitarist eventually gets a \"signature\" model named after them, and most of these sell a small number of instruments before being discontinued. But one man has a signature model that's so popular that other guitarists get their signatures *alongside his*. When you buy a Jimmy Page or Mark Knopfler or Slash or Eric Clapton signature guitar, there are two names on there -- the name of Page or Clapton or whoever, and the name Les Paul.\n\nLes Paul was a remarkable man, whose inventions are far more widely known even than his name. You'll almost certainly have seen musicians playing guitar and harmonica at the same time, using a harmonica holder -- Les Paul invented that, as a teenager, making the first one out of a coathanger. I guess if you were a teenager in Waukesha in the 1920s, you'd have little better to do with yourself than invent coathanger harmonica holders too.\n\nBut Les Paul was, first and foremost, a guitar player, and he became a semi-professional musician by the time he was thirteen. The choice of the guitar was one that was actually made by his mother. She explained to him \"if you play the piano you got your back turned to the audience. If you play the drums, you gotta carry all that stuff around, it's not musical. If you play a saxophone, you can't sing and talk at the same time.\" In his own words, she \"whittled it down to guitar in a hurry\". His mother, indeed, seems to have been a remarkable woman in many ways -- if you read any interviews with Les, he barely ever goes a few sentences without saying something about how much she did for him.\n\nThat's one of the defining characteristics of Les Paul's life, really -- his admiration for his mother. There were two more things that characterised him though. The first was that pretty much dead on, every ten years, he would have some major health crisis that would put him out of commission for a year. The other was his lifelong devotion to learning, which meant that he used those health crises as an opportunity to learn something new.\n\nThis love of learning could be seen from his very early days. When he was just learning the guitar, the singing cowboy star Gene Autry came to town. Gene Autry was a star of Western music -- the very biggest star in the country -- and his music was a cleaned-up, politer, version of the kind of music Bob Wills played:\n\n[excerpt: Gene Autry \"Back in the Saddle Again\"].\n\nLes and his friend went to every show in the residency, and after a couple of nights, Gene Autry stopped the show in the middle of the set and said \"something strange has been happening here -- every time I play an F chord, and *only* when I play an F chord, there's a flash of light. What's going on, how is this happening?\"\n\nIt turned out that Les had been wanting to learn how Autry made that chord shape, so he'd been there with a pencil and paper, and his friend had a torch, and every time he played the chord Les Paul wanted to learn, the torch would come on and Les would be trying to sketch the shape of Autry's fingers. Autry invited Les Paul onto the stage, showed him how to make the chord, and had him play a couple of songs. A few years later, when Autry moved from radio to films, he suggested Les Paul take over his radio show.\n\nSo Les Paul was always fascinated by learning, and always trying to improve himself and his equipment. And once he decided to be a guitarist, he also decided to electrify his guitar, a full decade before electric guitars became a widespread instrument.\n\nHe explained that when he was starting out, he was playing at a hotdog stand, using a homemade microphone for his voice and harmonica -- the microphone was made out of bits of an old telephone, and it was plugged in to his mother's radio.\n\nPeople who were listening liked his performances, but they said they wished the guitar was as loud as his voice -- so he took his *dad's* radio, too, and connected it to a record player needle, which he jammed into the body of his guitar.\n\nOnce electric guitars started being manufactured, Paul started playing them, but he never liked them. The electric guitars of the late 1930s were what we'd now call electro-acoustics -- they were acoustic guitars, playable as such, but with pickups. There were two main problems with them -- firstly, they were very prone to feedback, because the hollow body of the guitar would resonate. And secondly, most of the sonic energy from the strings was going into the guitar itself, so there was no sustain. Paul came up with a simple solution to this problem, which he called \"the log\".\n\nThe log was almost exactly what the name would suggest. It was a plank, to which were nailed some pickups, strings, and tuning pegs. On the front was attached the front of a normal guitar -- not anything that would actually resonate, just to make it look like a proper guitar. But basically it was just a lump of wood.\n\nLes Paul wasn't the first person to build a solid-body electric guitar -- but as he put it himself later \"there may be some guy out there in Iowa says he built the guitar in 1925, for all I know, and he may have. I only know what I was doing and I was out there weaving my own basket, and there wasn't anybody else around and it had to be done.\".\n\nHe perfected the solid-body guitar during the first of his years of illness -- he'd been running an illegal radio station, accidentally stuck his hand in the transmitter, and not only got an electric shock but had a load of equipment fall on him. By the time he was well enough to work again, he had the idea perfected.\n\nHe took his solid-body guitar idea to Gibson in 1941, but they weren't interested -- no-one was going to want to buy a solid guitar. It wasn't until Leo Fender started selling his guitars in 1950 that Gibson realised that it might be worth doing.\n\nBut by then Les Paul had become one of the most famous guitarists in the country. Even before he became hugely famous, though, he'd been one of the *best* guitarists in the country. In 1944, when the guitarist Oscar Moore was unable at the last minute to play at Jazz At The Philharmonic -- the first of what would eventually become the most famous series of jazz concerts ever -- Les Paul was drafted in at short notice, and the live recordings of that show are some of the greatest instrumental jazz you'll hear, at a time when the borders between jazz, R&B, and pop music were more fluid than they became. Listen, for example, to this excerpt from \"Blues, 1, 2, & 3\".\n\n[excerpt]\n\nThe honking saxophone player there is Ilinois Jacquet, the man who we talked about in episode one of this podcast, who invented R&B saxophone. The pianist there was also pretty great -- he was, in fact, a pianist who was already regarded as one of the best in the business, even before he started to sing, and who later had two further, separate careers under his more familiar name – one in R&B in which he inspired a generation of singers like Charles Brown and Ray Charles, and one in pop, where he became one of the great ballad singers of all time. He's credited on the track we just heard as \"Shorty Nadine\" for contractual reasons, but you probably know him better as Nat \"King\" Cole.\n\nListening to that you can hear musicians performing at a time when jazz and R&B and rock and roll were all still sort of the same thing, before they all went off in their different directions, and it's hard not to wish that that cross-fertilisation had continued a while longer.\n\nBut it didn't, and it would be easy to imagine that as a result Les Paul, who was absolutely a jazz musician, would make no further contributions to rock and roll after his popularising the solid-body electric guitar. But we haven't even got to his real importance yet. Yes, something he did that was even more important than the Les Paul guitar.\n\nIt started when his mother told him she'd enjoyed something she heard him play on the radio. He'd replied that it wasn't him she'd heard, and she'd said \"well, all those electric guitar players sound the same. If you want to be a real success, you want to sound different from everyone else -- at least different enough that your own mother can recognise you\". And over the years, Les Paul had learned to listen to his mother -- she'd been the one who'd got him playing guitar, and she'd been the one who had told him to go and see Bob Wills, the day he'd ended up meeting Charlie Christian for the first time.\n\nSo he went and spent a lot of time working on a sound that was totally different from anything else, spending days and weeks alone. He stopped working with his trio -- and started working with a young country singer who renamed herself Mary Ford, who Gene Autry had introduced him to and who he soon married -- and he eventually came up with a whole new idea.\n\nThis episode is primarily about Les Paul, because he was such an astonishing force of nature, but it's worth making clear that Mary Ford was very much an equal partner in their sixteen years together. She was an excellent singer -- *far* better than Les Paul was -- and also a pretty good guitarist herself. On their live dates she would play rhythm guitar, and often the two would do a comedy guitar duel, with her copying everything Les Paul played. She was a vital part of the sound -- and of the sonic innovations the records contained, because one of the things they did for the first time was to have her sing very close to the mic -- a totally different technique than had been used before, which gave her vocals a different tone which almost everyone imitated.\n\nBut that wasn't the only odd sound on the records. It sounded like Les Paul was playing two or three guitars at the same time, playing the same part. And sometimes he was playing notes that were higher than any guitar could play.\n\nAnd sometimes, when Mary Ford was singing... it sounded as if there were two or more of her!\n\nThis was such an unusual sound that on the duo's radio and TV appearances they made a joke of it -- they pretended that Paul had invented a \"Les Paulveriser\", which could duplicate everything, and that for example he could use the Les Paulveriser on Mary, so there'd be multiple Marys and she could get the vacuum cleaning done quicker.\n\nIt was the fifties.\n\nBut of course, what Paul was actually doing was overdubbing -- recording one guitar part, and then going back and recording a second over it. He'd been fascinated by the idea for decades and he'd first done it as an experiment when he was still with the trio. He'd wanted to rehearse a song on his own, but with the arrangement the rest of the band played, so he'd recorded himself playing all the parts, using a disc cutter and playing along with previous takes.\n\nThis didn't give good results until the introduction of magnetic tape recording in the very late forties -- when you recorded directly to a disc there was so much surface noise, and recording quality was so poor, that no-one would even think of recording overdubs.\n\nBut in 1945, American soldiers brought back a new technology from Germany as spoils of war -- high fidelity tape recording. With magnetic tape you could record sound with orders of magnitude less noise than by cutting to disc.\n\nAnd Bing Crosby, who often worked with Les Paul, was the first person to see the possibilities of this new technology (in his case, for pre-recording his radio shows so they didn't have to go out live, which meant he could record them in batches and have more time to spend on the golf course).\n\nLes Paul was far more technical than Crosby, though, and far more aware of what could happen if, for example, you had two tape recorders. Or if you ran one slow so that when you played it back at normal speed everything sounded sped up. Or a dozen other obvious tricks that occurred to him, but had never occurred to anyone else.\n\nSo on those Les Paul and Mary Ford records, literally every instrument was Les Paul on the guitar. The bass was Les Paul's guitar slowed down to half speed, the percussion was his guitar, *everything* was his guitar.\n\nSo now we come to \"How High the Moon\" itself. This is a song that originally dated back to 1940 -- the Benny Goodman band had the first hit with it, and indeed Les Paul had recorded a version of it in 1945, with his trio.\n\n[excerpt Les Paul Trio version of \"How High the Moon\"]\n\nThat was right before his experiments with tape recording started. Shortly after the first results of those were released, in 1948, there was another one of those every-decade health problems. In this case, Mary Ford was driving the two of them from Wisconsin to LA. She was from California, and not used to driving in winter weather. She hit a patch of ice and the two of them went off the road. Les Paul spent hours in ice water with multiple bones broken before anyone could get him to a hospital. For a while, it was believed it would not be possible to save his right arm -- and then for a while after that the doctors believed they could save it, but it would permanently be fixed in a single position if they did, as his elbow would be unfixable. He told them to try their best, and to set it in a position with his hand over his navel, because if it was in that position he could still play guitar.\n\nAs a precaution, he spent his time in hospital drawing up plans for a synthesiser, ten years before Robert Moog invented his, because he figured he could play the synth with one arm.\n\nWhen he got better, he and Mary Ford recorded a new version of \"How High The Moon\", but at first the record label didn't want to release it:\n\n[Excerpt Les Paul and Mary Ford: \"How High The Moon\"]\n\nThat record sat unreleased for eighteen months, until 1951, because Jim Conkling at Capitol said that there'd been seventy-five recordings of the song before and none of them had been a hit. Conkling thought this was because the lyrics don't make sense, but Les Paul was insistent that no-one was going to listen to the lyrics anyway. \"It doesn't matter what Mary sang or if it was done by the Four Nosebleeds. It didn't make any difference, because that wasn't what made the record. It was the arrangement and the performance.\"\n\nAnd he was right -- the version by Les Paul and Mary Ford was an absolute phenomenon. It spent twenty-five weeks in the Billboard pop charts, nine of them at number one, and while it was at number one another Paul and Ford track was at number two. Even more astonishingly, it also made number two on the rhythm and blues charts. Remember, that was a chart that was specifically aimed at the black audience, and between 1950 and 1955 only five records by white performers made the R&B charts at all, mostly very early rock and roll records.\n\n\"How High the Moon\" might easily seem an odd fit for the R&B charts. To twenty-first century ears, it's hard to imagine anything more white-sounding.\n\nBut what it does, absolutely, share with the music that was charting on the R&B charts at the time, and the reason it appealed to the R&B audience, is a delight in finding totally new sounds. The R&B charts at the time were where you looked for experimentation, for people trying new things.\n\nAnd also, there's that rhythm on the record -- this is entirely a record that's driven by the rhythm. It's not quite dance music, not like the jump bands -- and there's only guitar and vocals on it, something which would be absolutely out of the ordinary for rhythm and blues records at the time with their emphasis on piano and saxophone -- but what there is in that guitar playing is personal expression.\n\nAnd R&B was all about individual expression.\n\nLes Paul was doing something which was qualitatively different both from jazz and from R&B, and so it's not surprising that he ended up crossing over from one market to another.\n\nBut in doing so, he also invented the way the guitar was to be used in rock and roll music. There's a lot of Western Swing about what he's doing on \"How High the Moon\", unsurprisingly. But while the rhythm guitar is keeping to the same kind of rhythms that the Western Swing people would use, the lead guitar is much more aggressive and forceful than anything you got in country or western music at the time. It's playing jazz and R&B lines -- it's playing, in fact, the kind of thing that a saxophone player like Illinois Jacquet might play, full of aggressive stabs and skronks.\n\nAnd more than that, he invented the way the recording studio would be used in rock and roll. Before Les Paul and Mary Ford's early records, the recording studio was used solely as a way of reproducing the sound of live instruments as accurately as possible. After them, it became a way to create new sounds that could not be made live.\n\nOne thing we're going to see over and again in this series is the way technological change, artistic change and social change all feed back into each other. The 1950s was a time of absolutely unprecedented technological change in America, and people went from, in the beginning of the decade, listening to recordings played at 78RPM, often on wind-up gramophones, made of breakable shellac, to listening to high fidelity forty-five RPM singles and long-playing records which could -- shockingly -- last more than four minutes a side. Radio went from being something that had to be listened to as a family because of the size of the radiogram to something a teenager could listen to in bed under the blankets on a transistor radio, or something that you could even have on in your car!\n\nThe combination of these changes made music into something that could be personal as well as communal. Teenagers didn't have to share the music with their parents.\n\nAll of that was still to come, of course, and we'll look at those things as they happen during our history. But \"How High the Moon\" was the first and best sign of what was to come, as the 1940s gave way to the 1950s, and music entered a totally new age.\n\nLes Paul kept playing the guitar into his nineties. Interviewed in his late seventies, when his arthritis was so bad he only had movement in two fingers, with all the others so stiff they just had to stay where he put them, he said he played better than he had when he had ten fingers, because he'd had to learn more about the instrument to do it this way. In the end, his arthritis got to the point that he could no longer move any fingers on either hand -- so he just let his fingers stay where they were, but would move his whole hand to play single notes and bar chords -- he could lift his fingers up and down, just not move the knuckles.\n\nBut he could still play. This is him on his ninetieth birthday:\n\n[excerpt: Les Paul 90th birthday concert “Sweet Georgia Brown”]\n\nSo it turns out you don't even need the two fingers Django had left, not if you have the kind of mind that gets you into the rock and roll hall of fame *and* the inventors' hall of fame.\n\nLes Paul died, aged ninety-four, in 2009.",
  "enclosure": "",
  "itunes:summary": "Welcome to episode nine of A History of Rock Music in Five Hundred Songs. Today we're looking at Les Paul and Mary Ford, and \"How High The Moon\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum: I say Django Reinhardt never played electric guitar. He did, in his last few years, but not on any of his most famous recordings.\n\nA couple of notes:\n\nThis one is a few hours late, as I had some *severe* technical problems with the several previous attempts at recording this. This version was recorded starting around midnight on Sunday night, which is usually the time I put them up, so I apologise if it's lacking a final polish\n\nResources\n\nIf the episode starts you wondering about playing instruments while physically disabled, or inventing new instruments, you might want to check out a charity called the One-Handed Musical Instrument Trust, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created a Mixcloud streaming playlist with full versions of all the songs in the episode.\n\nThis 3-CD box set is a very good compilation of Les Paul and Mary Ford's best work.\n\nThe quotes from Les Paul in this episode come from this book of interviews with him.\n\nPatreon\n\nThis podcast is brought to you by the generosity of my backers on Patreon. Why not join them?\n\nTranscript\n\nTo be a truly great guitarist, you need to have an imagination. You need to be inventive. And you need to have a sense of musicality. Some would also say that you need to have a lot of dexterity, and to be able to move your fingers lightning fast. Maybe also have long fingers, so you could reach further down the neck.\n\nBut let's talk about Django Reinhardt for a bit.\n\nWe mentioned Django a little bit in the episode on Bob Wills and “Ida Red”. We talked, in particular, about how he was making music that sounded very, very similar to what the early Western Swing musicians were doing.\n\nWe're not going to talk much about Django in this series, because he was a jazz musician, but he *was* very influential on a few of the people who went on to influence rock, so we're going to touch on him briefly here. He never played an electric guitar, but he still influenced pretty much every guitarist since, either directly or indirectly.\n\nAnd this was despite having disadvantages that would have stopped almost anyone. One point we haven't made very much yet, but which needs to be made repeatedly, is that the people in most of these early podcasts were crushingly, hellishly, poor by today's standards. Poverty still exists of course, to far too great an extent, but the people we're talking about here lived in conditions that would be unimaginable to almost all of the listeners to this podcast.\n\nAnd Reinhardt had it worse than most. He was a Romany traveller, and while growing up his greatest skill was stealing chickens -- real, proper, poverty. But he became a professional musician, and it looked like he might actually become well off. And then his bad luck got worse. His caravan caught on fire, and in trying to rescue his wife and child, he suffered such extreme burns that one of his legs became paralysed -- and more importantly for Reinhardt as a musician, he lost the use of two of his fingers on his left hand. He had to re-teach himself to play the guitar, and to use only two fingers and a thumb on his left hand to play.\n\nRemarkably, he managed well enough to do things like this:\n\n[Excerpt: \"How High The Moon\" Django Reinhardt]\n\nReinhardt influenced many guitarists, and one American guitarist in particular became a friend of Reinhardt and said that he and Reinhardt were the only two guitarists in the world at that time who were actually serious about their instrument. He was another jazzman, with a similar style to Reinhardt but one who had a more direct influence on rock and roll.\n\nWaukesha, Wisconsin, is not the most rock and roll town in the world. It was a spa town, before the water started to dr",
  "itunes:explicit": "clean",
  "itunes:block": "no",
  "itunes:duration": "0:00",
  "itunes:author": "Andrew Hickey",
  "googleplay:description": "Welcome to episode nine of A History of Rock Music in Five Hundred Songs. Today we're looking at Les Paul and Mary Ford, and \"How High The Moon\". Click the full post to read liner notes, links to more information, and a transcript of the episode.\n\n\n\nErratum: I say Django Reinhardt never played electric guitar. He did, in his last few years, but not on any of his most famous recordings.\n\nA couple of notes:\n\nThis one is a few hours late, as I had some *severe* technical problems with the several previous attempts at recording this. This version was recorded starting around midnight on Sunday night, which is usually the time I put them up, so I apologise if it's lacking a final polish\n\nResources\n\nIf the episode starts you wondering about playing instruments while physically disabled, or inventing new instruments, you might want to check out a charity called the One-Handed Musical Instrument Trust, which invents and provides instruments for one-handed musicians.\n\nAs always, I've created a",
  "googleplay:explicit": "No",
  "googleplay:block": "no"
}