{
  "id": "https://bibleinoneyear.org/en/youth/211",
  "title": "Day 211: How to Be a Good Citizen",
  "description": "Psalm 89:38-39, 44, 1 Chronicles 9:1, Romans 13:1–5,8–10.  There is a good side to human government but there can also be an evil side  As Oscar Cullmann remarks, according to whether ‘the state remains within its *limits* or transgresses them, the Christian will describe it as the servant of God or as the instrument of the Devil’",
  "pubDate": "Sat, 30 Jul 2022 12:00:00 UTC",
  "link": "https://bibleinoneyear.org/en/youth/211/",
  "itunes:duration": "12:42",
  "guid": "enyouth30072022-211",
  "length": 762.04,
  "enclosure": "",
  "ppg:enclosureLegacy": "",
  "ppg:enclosureSecure": "",
  "media:content": "",
  "author": {
    "name": "Nicky and Pippa Gumbel"
  },
  "itunes:title": "Day 211: How to Be a Good Citizen",
  "itunes:subtitle": "Psalm 89:38-39, 44, 1 Chronicles 9:1, Romans 13:1–5,8–10.  There is a good side to human government but there can also be an evil side  As Oscar Cullmann remarks, according to whether ‘the state remains within its *limits* or transgresses them, the Christian will describe it as the servant of God or as the instrument of the Devil’",
  "itunes:summary": "Politicians: how do we treat them? Governments and local councils: how do we view them? Taxes: do we really need to pay them? What about evil regimes? If you live under a Hitler or Stalin are you supposed to obey them?\n‘Be a good citizen,’ writes the apostle Paul. ‘All governments are under God. Insofar as there is peace and order, it’s God&#039;s order. So live responsibly as a citizen. If you’re irresponsible to the state, then you’re irresponsible with God, and God will hold you responsible. Duly constituted authorities are only a threat if you’re trying to get by with something. Decent citizens should have nothing to fear’ (Romans 13:1–3, MSG).\nThis would have been a radical idea to Paul’s original readers. In the ancient world most people saw religion and government as intertwined. The early church was still adjusting to the idea that the Messiah was not going to rule over his people in an earthly government. Those around them would have worshipped Rome and the Emperor as god. Yet here Paul tells them to follow Jesus as their King and still submit to Roman authority.\nPaul’s teaching in Romans 13 needs to be balanced by Revelation 13. Revelation 13 was written at the time of the persecution of Christians under the Emperor Domitian. The state is seen as the ally of the devil (pictured as a red dragon) who has given his authority to the persecuting state (pictured as a monster emerging out of the sea). At worst, government can be demonic.\nBoth Romans 13 and Revelation 13 are true. There is good government and there is bad government. There is a good side to human government but there can also be an evil side. As Oscar Cullmann remarks, according to whether ‘the state remains within its limits or transgresses them, the Christian will describe it as the servant of God or as the instrument of the Devil’.\nHow then can you live as a good citizen?",
  "itunes:author": "Nicky and Pippa Gumbel",
  "itunes:explicit": [
    false,
    "no"
  ],
  "itunes:episode": 576
}