{
  "title": "Startups across AWS Accelerators use AI and ML to solve mission-critical customer challenges",
  "link": "https://aws.amazon.com/blogs/machine-learning/startups-across-aws-accelerators-use-ai-and-ml-to-solve-mission-critical-customer-challenges/",
  "dc:creator": "Swami Sivasubramanian",
  "pubDate": "Tue, 01 Nov 2022 15:05:36 +0000",
  "category": [
    "Amazon Machine Learning",
    "Artificial Intelligence"
  ],
  "guid": "e11a8f4fb8627af48249573d33fca346da67e49f",
  "description": "Relentless advancement in technology is improving the decision-making capacity of humans and enterprises alike. Digitization of the physical world has accelerated the three dimensions of data: velocity, variety, and volume. This has made information more widely available than before, allowing for advancements in problem-solving. Now, with cloud-enabled democratized availability, technologies like artificial intelligence (AI) and […]",
  "content:encoded": "<p>Relentless advancement in technology is improving the decision-making capacity of humans and enterprises alike. Digitization of the physical world has accelerated the three dimensions of data: velocity, variety, and volume. This has made information more widely available than before, allowing for advancements in problem-solving. Now, with cloud-enabled democratized availability, technologies like artificial intelligence (AI) and machine learning (ML) are able to increase the speed and accuracy of decision-making by humans and machines.</p> \n<p>Nowhere is this speed and accuracy of decisions more important than in the public sector, where organizations across defense, healthcare, aerospace, and sustainability are solving challenges that impact citizens around the world. Many public sector customers see the benefits of using AI/ML to address these challenges, but can be overwhelmed with the range of solutions. AWS launched AWS Accelerators to find and develop startups with technologies that meet public sector customers’ unique challenges. Read on to learn more about AI/ML use cases from startups in the AWS Accelerator that are making an impact for public sector customers.</p> \n<h2>Healthcare</h2> \n<p><a href=\"https://piecestech.com/\" target=\"_blank\" rel=\"noopener\"><strong>Pieces</strong></a>: Healthcare providers want to spend more time caring for patients and less time on paperwork. Pieces, an <a href=\"https://aws.amazon.com/blogs/publicsector/announcing-10-finalists-inaugural-aws-healthcare-accelerator-program/\" target=\"_blank\" rel=\"noopener\">AWS Healthcare Accelerator</a> startup, uses AWS to make it easier to input, manage, store, organize, and gain insight from Electronic Health Record (EHR) data to address social determinants of health and improve patient care. With AI, natural language processing (NLP), and clinically reviewed algorithms, Pieces can provide projected hospital discharge dates, anticipated clinical and non-clinical barriers to discharge, and risk of readmission. Pieces services also provide insights to healthcare providers in plain language and optimize clarity of patients’ clinical issues to help care teams work more efficiently. <a href=\"https://t.sidekickopen86.com/s3t/c/5/f18dQhb0S7kF8bWqf7W2hC1v159hl3kW7_k2847sC-SQW1mlMRJ1HmBMHV27Kq865LjSb103?te=W3R5hFj4cm2zwW3R5HxG1JCh31W2-bjWD4phbtf1W3&amp;si=7000000000083586&amp;pi=9b3f8aaf-cb6d-41fb-c1cc-0aeb320dcf69\" target=\"_blank\" rel=\"noopener\">According to Pieces</a>, the software delivers a 95% positive prediction in identifying barriers to patient discharge, and at one hospital, has shown its ability to reduce patient hospital stays on average by 2 days.</p> \n<p>Pieces uses <a href=\"http://aws.amazon.com/ec2\" target=\"_blank\" rel=\"noopener\">Amazon Elastic Compute Cloud</a> (Amazon EC2), <a href=\"http://aws.amazon.com/rds\" target=\"_blank\" rel=\"noopener\">Amazon Relational Database Service</a> (Amazon RDS), and <a href=\"https://aws.amazon.com/msk/\" target=\"_blank\" rel=\"noopener\">Amazon Managed Streaming for Apache Kafka</a> (Amazon MSK) for collecting and processing streamed clinical data. Pieces uses <a href=\"https://aws.amazon.com/eks/\" target=\"_blank\" rel=\"noopener\">Amazon Elastic Kubernetes Service</a> (Amazon EKS), <a href=\"https://aws.amazon.com/opensearch-service/\" target=\"_blank\" rel=\"noopener\">Amazon OpenSearch Service</a>, and <a href=\"https://aws.amazon.com/managed-workflows-for-apache-airflow/\" target=\"_blank\" rel=\"noopener\">Amazon Managed Workflows for Apache Airflow</a> (Amazon MWAA) to run multiple ML models on data in production at scale.</p> \n<p><a href=\"https://www.pephealth.ai/\" target=\"_blank\" rel=\"noopener\"><strong>PEP Health</strong></a>: Patient experience is a key priority, but gathering patient feedback can be a challenge. PEP Health, a startup in the <a href=\"https://aws.amazon.com/blogs/startups/aws-uk-healthcare-accelerator-announces-12-startups-selected-for-the-inaugural-program/\" target=\"_blank\" rel=\"noopener\">AWS Healthcare Accelerator’s UK cohort</a>, uses NLP technology to analyze millions of online, publicly posted patient comments, generating scores that highlight areas for celebration or concern, and identifying the reasons for improving or declining patient satisfaction. This data can be used to improve experiences, drive better outcomes, and democratize the patient voice.</p> \n<p>PEP Health uses <a href=\"http://aws.amazon.com/lambda\" target=\"_blank\" rel=\"noopener\">AWS Lambda</a>, <a href=\"https://aws.amazon.com/fargate\" target=\"_blank\" rel=\"noopener\">AWS Fargate</a>, and Amazon EC2 to ingest information in real time from hundreds of thousands of webpages. With proprietary NLP models built and run on <a href=\"https://aws.amazon.com/sagemaker/\" target=\"_blank\" rel=\"noopener\">Amazon SageMaker</a>, PEP Health identifies and scores themes relevant to the quality of care. These results feed PEP Health’s Patient Experience Platform and ML algorithms built and powered by Lambda, Fargate, Amazon EC2, Amazon RDS, SageMaker, and <a href=\"\\Users\\kshoyle\\Downloads\\aws.amazon.com\\cognito\" target=\"_blank\" rel=\"noopener\">Amazon Cognito</a>, which enable relationship analysis and uncover patterns between people, places, and things that may otherwise seem disconnected.</p> \n<p style=\"padding-left: 40px\"><em>“Through the accelerator, PEP Health was able to scale its operations significantly with the introduction of AWS Lambda to collect more comments faster and more affordably. Additionally, we’ve been able to use Amazon SageMaker to derive further insights for customers.”</em></p> \n<p style=\"padding-left: 40px\">– Mark Lomax, PEP Health CEO.</p> \n<h2>Defense and space</h2> \n<p><a href=\"https://lunaroutpost.com/\" target=\"_blank\" rel=\"noopener\"><strong>Lunar Outpost</strong></a>: Lunar Outpost was part of the <a href=\"https://www.allthingsdistributed.com/2021/06/aws-accelerates-startups-in-space.html\" target=\"_blank\" rel=\"noopener\">AWS Space Accelerator’s inaugural cohort</a> in 2021. The company is taking part in missions to the Moon and is developing Mobile Autonomous Platform (MAP) rovers that will be capable of surviving and navigating the extreme environments of other planetary bodies. To successfully navigate in conditions that can’t be found on Earth, Lunar Outpost makes extensive use of robotic simulations to validate AI navigation algorithms.</p> \n<p>Lunar Outpost uses <a href=\"https://aws.amazon.com/robomaker/\" target=\"_blank\" rel=\"noopener\">AWS RoboMaker</a>, Amazon EC2, <a href=\"http://aws.amazon.com/ecr/\" target=\"_blank\" rel=\"noopener\">Amazon Elastic Container Registry</a> (Amazon ECR), <a href=\"http://aws.amazon.com/s3\" target=\"_blank\" rel=\"noopener\">Amazon Simple Storage Service</a> (Amazon S3), <a href=\"http://aws.amazon.com/vpc\" target=\"_blank\" rel=\"noopener\">Amazon Virtual Private Cloud</a> (Amazon VPC), Lambda, <a href=\"http://aws.amazon.com/codebuild\" target=\"_blank\" rel=\"noopener\">AWS CodeBuild</a>, and <a href=\"https://aws.amazon.com/quicksight\" target=\"_blank\" rel=\"noopener\">Amazon QuickSight</a> to test rovers by deploying lunar simulations. As Lunar Outpost develops navigation technologies for the lunar surface, simulation instances are spun up. These simulations will be used during lunar missions to assist human operators and decrease risk. Data streamed back from the lunar surface will be imported into their simulation, giving a real-time view of the rover’s activities. Simulation of digital MAP rovers allows for trial runs of navigation trajectories without moving the physical rover, dramatically reducing the risks of moving rovers in space.</p> \n<p><a href=\"https://www.adarga.ai/\" target=\"_blank\" rel=\"noopener\"><strong>Adarga</strong></a>: Adarga, part of the <a href=\"https://aws.amazon.com/blogs/publicsector/announcing-10-startups-selected-participate-first-aws-defence-accelerator/\" target=\"_blank\" rel=\"noopener\">first AWS Defense Accelerator cohort</a>, is delivering an AI-driven intelligence platform to rapidly understand risks and opportunities for theater entry preparation and deployment. Adarga uses AI to find insights buried within large volumes of unstructured data, such as news, presentations, reports, videos, and more.</p> \n<p>Adarga uses Amazon EC2, OpenSearch Service, <a href=\"https://aws.amazon.com/rds/aurora/\" target=\"_blank\" rel=\"noopener\">Amazon Aurora</a>, <a href=\"https://aws.amazon.com/documentdb/\" target=\"_blank\" rel=\"noopener\">Amazon DocumentDB (with MongoDB compatibility)</a>, <a href=\"https://aws.amazon.com/translate/\" target=\"_blank\" rel=\"noopener\">Amazon Translate</a>, and SageMaker. Adarga ingests information in real time, translates foreign language documents, and transcribes audio and video files into text. In addition to SageMaker, Adarga uses proprietary NLP models to extract and classify details, like people, places, and things, deploying disambiguation techniques to contextualize the information. These details are mapped into a dynamic intelligence picture for customers. Adarga’s ML algorithms, together with AWS AI/ML services, enable relationship analysis, uncovering patterns that may otherwise seem disconnected.</p> \n<p style=\"padding-left: 40px\"><em>“We are proud to be part of this pioneering initiative as we continue to work closely with AWS and a wider ecosystem of tech players to deliver game-changing capabilities to defence, enabled by hyperscale cloud.” </em></p> \n<p style=\"padding-left: 40px\">– Robert Bassett-Cross, CEO, Adarga</p> \n<h2>Sustainable cities</h2> \n<p><a href=\"https://smarthelio.com/\" target=\"_blank\" rel=\"noopener\"><strong>SmartHelio</strong></a>: Within the commercial solar farm industry, it is critical to determine the health of installed solar infrastructure. SmartHelio combines physics and SageMaker to construct models that determine the current health of solar assets, build predictions on which assets will fail, and determine proactively which assets to service first.</p> \n<p>SmartHelio’s solution, built on AWS, analyzes incredibly complex photovoltaic physics and power systems. A data lake on Amazon S3 stores billions of data points streamed on a real-time basis from Supervisory Control and Data Acquisition (SCADA) servers on solar farms, Internet of Things (IoT) devices, or third-party Content Management Systems (CMS) platforms. SmartHelio uses SageMaker to run deep learning models to recognize patterns, quantify solar farm health, and predict farm losses on a real-time basis, delivering intelligent insights instantly to its customers.</p> \n<p>After being selected for the first <a href=\"https://aws.amazon.com/blogs/publicsector/announcing-10-finalists-inaugural-aws-clean-energy-accelerator-program/\" target=\"_blank\" rel=\"noopener\">AWS Sustainable Cities Accelerator cohort</a>, SmartHelio secured several pilots with new customers. In CEO Govinda Upadhyay’s words, “the AWS Accelerator gave us global exposure to markets, mentors, potential customers, and investors.”</p> \n<p><a href=\"https://www.automotus.co/\" target=\"_blank\" rel=\"noopener\"><strong>Automotus</strong></a>: Automotus uses computer vision technology to give drivers the ability to view in real time if curb space is available, significantly reducing time spent searching for parking. Automotus helps cities and airports manage and monetize their curbs using a fleet of computer vision sensors powered by <a href=\"https://aws.amazon.com/greengrass/\" target=\"_blank\" rel=\"noopener\">AWS IoT Greengrass</a>. Automotus’s sensors upload training data to Amazon S3, where a workflow powered by Lambda indexes sample data to create complex datasets for training new models and improving existing ones.</p> \n<p>Automotus uses SageMaker to automate and containerize its computer vision model training process, the outputs of which are deployed back to the edge using a simple, automated process. Equipped with these trained models, Automotus sensors send metadata to the cloud using <a href=\"https://aws.amazon.com/iot-core/\" target=\"_blank\" rel=\"noopener\">AWS IoT Core</a>, uncovering granular insights about curb activity and enabling fully automated billing and enforcement at the curb. With <a href=\"https://blog.parknews.biz/2021/03/automotus-raises-2-3m-to-scale-curbside-management-technology-to-cities-across-the-country/\" target=\"_blank\" rel=\"noopener\">one customer</a>, Automotus increased enforcement efficiency and revenue by more than 500%, resulting in a 24% increase in parking turnover and a 20% reduction in traffic.</p> \n<h2>What’s next for AI/ML and startups</h2> \n<p>Customers have embraced AI/ML to solve a wide spectrum of challenges, which is a testament to the advancement of the technology and the increased confidence customers have in using data to improve decision-making. AWS Accelerators aim to continue the acceleration and adoption of AI/ML solutions by helping customers brainstorm and share critical problem statements, and finding and connecting startups with these customers.</p> \n<p>Interested in advancing solutions for public good through your startup? Or have a challenge in need of a disruptive solution? Connect with the AWS Worldwide Public Sector Venture Capital and Startups team today to learn more about AWS Accelerators and other resources available to drive decision-making innovations.</p> \n<hr> \n<h3>About the authors</h3> \n<p style=\"clear: both\"><strong> <a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/swami.png\"><img loading=\"lazy\" class=\"size-full wp-image-45096 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/swami.png\" alt=\"\" width=\"100\" height=\"100\"></a>Swami Sivasubramanian</strong> is Vice President of Data and Machine Learning at AWS. In this role, Swami oversees all AWS Database, Analytics, and AI &amp; Machine Learning services. His team’s mission is to help organizations put their data to work with a complete, end-to-end data solution to store, access, analyze, and visualize, and predict.</p> \n<p style=\"clear: both\"><strong><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/Manpreet-Mattu.png\"><img loading=\"lazy\" class=\"size-full wp-image-45095 alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/31/Manpreet-Mattu.png\" alt=\"\" width=\"100\" height=\"133\"></a>Manpreet Mattu</strong> is the Global Head for Venture Capital and Startups Business Development for the World Wide Public Sector at Amazon Web Services (AWS). He has 15 years of experience in venture Investments and acquisitions in leading-edge technology and non-tech segments. Beyond tech, Manpreet’s interest spans history, philosophy, and economics. He is also an endurance runner.</p>"
}