{
  "title": "Improve data extraction and document processing with Amazon Textract",
  "link": "https://aws.amazon.com/blogs/machine-learning/improve-data-extraction-and-document-processing-with-amazon-textract/",
  "dc:creator": "Sathya Balakrishnan",
  "pubDate": "Wed, 02 Nov 2022 16:04:47 +0000",
  "category": [
    "Advanced (300)",
    "Amazon Textract",
    "Artificial Intelligence",
    "Natural Language Processing",
    "NLP"
  ],
  "guid": "4808c1dfaad26c12784d452fa76190d6fc93ce2a",
  "description": "Intelligent document processing (IDP) has seen widespread adoption across enterprise and government organizations. Gartner estimates the IDP market will grow more than 100% year over year, and is projected to reach $4.8 billion in 2022. IDP helps transform structured, semi-structured, and unstructured data from a variety of document formats into actionable information. Processing unstructured data […]",
  "content:encoded": "<p>Intelligent document processing (IDP) has seen widespread adoption across enterprise and government organizations. <a href=\"https://www.gartner.com/en/documents/4011605\" target=\"_blank\" rel=\"noopener noreferrer\">Gartner estimates</a> the IDP market will grow more than 100% year over year, and is projected to reach $4.8 billion in 2022.</p> \n<p>IDP helps transform structured, semi-structured, and unstructured data from a variety of document formats into actionable information. Processing unstructured data has become much easier with the advancements in optical character recognition (OCR), machine learning (ML), and natural language processing (NLP).</p> \n<p>IDP techniques have grown tremendously, allowing us to extract, classify, identify, and process unstructured data. With AI/ML powered services such as <a href=\"https://aws.amazon.com/textract/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Textract</a>, <a href=\"https://aws.amazon.com/transcribe/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Transcribe</a>, and <a href=\"https://aws.amazon.com/comprehend/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Comprehend</a>, building an IDP solution has become much easier and doesn’t require specialized AI/ML skills.</p> \n<p>In this post, we demonstrate how to use Amazon Textract to extract meaningful, actionable data from a wide range of complex multi-format PDF files. PDF files are challenging; they can have a variety of data elements like headers, footers, tables with data in multiple columns, images, graphs, and sentences and paragraphs in different formats. We explore the data extraction phase of IDP, and how it connects to the steps involved in a document process, such as ingestion, extraction, and postprocessing.</p> \n<h2>Solution overview</h2> \n<p>Amazon Textract provides various options for data extraction, based on your use case. You can use forms, tables, query-based extractions, handwriting recognition, invoices and receipts, identity documents, and more. All the extracted data is returned with <a href=\"https://docs.aws.amazon.com/textract/latest/dg/text-location.html\" target=\"_blank\" rel=\"noopener noreferrer\">bounding box coordinates</a>. This solution uses <a href=\"https://constructs.dev/packages/amazon-textract-idp-cdk-constructs/v/0.0.7?lang=typescript\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Textract IDP CDK constructs</a> to build the document processing workflow that handles Amazon Textract asynchronous invocation, raw response extraction, and persistence in <a href=\"http://aws.amazon.com/s3\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Simple Storage Service</a> (Amazon S3). This solution adds an Amazon Textract postprocessing component to the base workflow to handle paragraph-based text extraction.</p> \n<p>The following diagram shows the document processing flow.</p> \n<p><img loading=\"lazy\" class=\"alignnone wp-image-44613 size-full\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/21/AmazonTextract-Blog.png\" alt=\"\" width=\"1131\" height=\"662\"></p> \n<p>The document processing flow contains the following steps:</p> \n<ol> \n <li>The document extraction flow is initiated when a user uploads a PDF document to Amazon S3.</li> \n <li>An S3 object notification event triggered by new the S3 object with an <code>uploads/</code> prefix, which triggers the <a href=\"http://aws.amazon.com/step-functions\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Step Functions</a> asynchronous workflow.</li> \n <li>The <a href=\"http://aws.amazon.com/lambda\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Lambda</a> function <code>SimpleAsyncWorkflow</code> Decider validates the PDF document. This step prevents processing invalid documents.</li> \n <li><a href=\"https://constructs.dev/packages/amazon-textract-idp-cdk-constructs/v/0.0.7/api/TextractAsyncToJSON?lang=typescript\" target=\"_blank\" rel=\"noopener noreferrer\">TextractAsync</a> is an IDP CDK construct that abstracts the invocation of the Amazon Textract <code>Async</code> API, handling <a href=\"https://aws.amazon.com/sns/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Simple Notification Service</a> (Amazon SNS) messages and workflow processing. The following are some high-level steps: \n  <ol type=\"a\"> \n   <li>The construct invokes the asynchronous Amazon Textract <a href=\"https://docs.aws.amazon.com/textract/latest/dg/API_StartDocumentTextDetection.html\" target=\"_blank\" rel=\"noopener noreferrer\">StartDocumentTextDetection</a> API.</li> \n   <li>Amazon Textract processes the PDF file and publishes a completion status event to an Amazon SNS topic.</li> \n   <li>Amazon Textract stores the paginated results in Amazon S3.</li> \n   <li>Construct handles the Amazon Textract completion event, returns the paginated results output prefix to the main workflow.</li> \n  </ol> </li> \n <li>The Textract Postprocessor Lambda function uses the extracted content in the results Amazon S3 bucket to retrieve the document data. This function iterates through all the files, and extracts data using bounding boxes and other metadata. It performs various postprocessing optimizations to aggregate paragraph data, identify and ignore headers and footers, combine sentences spread across pages, process data in multiple columns, and more.</li> \n <li>The Textract Postprocessor Lambda function persists the aggregated paragraph data as a CSV file in Amazon S3.</li> \n</ol> \n<h2>Deploy the solution with the AWS CDK</h2> \n<p>To deploy the solution, launch the <a href=\"https://aws.amazon.com/cdk/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Cloud Development Kit</a> (AWS CDK) using <a href=\"https://aws.amazon.com/cloud9/\" target=\"_blank\" rel=\"noopener noreferrer\">AWS Cloud9</a> or from your local system. If you’re launching from your local system, you need to have the AWS CDK and Docker installed. Follow the instructions in the <a href=\"https://github.com/aws-samples/amazon-textract-pdf-text-extractor#deployment-instructions\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub repo</a> for deployment.</p> \n<p>The stack creates the key components depicted in the architecture diagram.</p> \n<h2>Test the solution</h2> \n<p>The <a href=\"https://github.com/aws-samples/amazon-textract-pdf-text-extractor/tree/main/test\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub repo</a> contains the following sample files:</p> \n<ul> \n <li><strong>sample_climate_change.pdf</strong> – Contains headers, footers, and sentences flowing across pages</li> \n <li><strong>sample_multicolumn.pdf</strong> – Contains data in two columns, headers, footers, and sentences flowing across pages</li> \n</ul> \n<p>To test the solution, complete the following steps:</p> \n<ol> \n <li>Upload the sample PDF files to the S3 bucket created by the stack: The file upload triggers the Step Functions workflow via S3 event notification. \n  <div class=\"hide-language\"> \n   <pre><code class=\"lang-bash\">aws s3 cp sample_climate_change.pdf s3://{bucketname}/uploads/sample_climate_change.pdf\n\naws s3 cp sample_ multicolumn.pdf s3://{bucketname}/uploads/ sample_climate_ multicolumn.pdf</code></pre> \n  </div> </li> \n <li>&nbsp;Open the Step Functions console to view the workflow status. You should find one workflow instance per document.<img loading=\"lazy\" class=\"aligncenter wp-image-44706 size-full\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/22/SimpleAsyncWorkflow-instance.png\" alt=\"\" width=\"2156\" height=\"930\"></li> \n <li>Wait for all three steps to complete.</li> \n <li>On the Amazon S3 console, browse to the S3 prefix mentioned in the JSON path <code>TextractTempOutputJsonPath</code>. The below screenshot of the Amazon S3 console shows the Amazon Textract paginated results (in this case objects 1 and 2) created by Amazon Textract. The postprocessing task stores the extracted paragraphs from the sample PDF as <code>extracted-text.csv.</code><img loading=\"lazy\" class=\"aligncenter wp-image-44707 size-full\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/22/textract-results.png\" alt=\"\" width=\"1496\" height=\"561\"></li> \n <li>Download the <code>extracted-text.csv</code> file to view the extracted content.</li> \n</ol> \n<p>The <code>sample_climate_change.pdf</code> file has sentences flowing across pages, as shown in the following screenshot.</p> \n<p><img loading=\"lazy\" class=\"aligncenter wp-image-44708 size-full\" style=\"margin: 10px 0px 10px 0px;border: 1px solid #CCCCCC\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/22/sentence_acrosspages.png\" alt=\"\" width=\"824\" height=\"597\"></p> \n<p>The postprocessor identifies and ignores the header and footer, and combines the text across pages into one paragraph. The extracted text for the combined paragraph should look like:</p> \n<p>“Impacts on this scale could spill over national borders, exacerbating the damage further. Rising sea levels and other climate-driven changes could drive millions of people to migrate: more than a fifth of Bangladesh could be under water with a 1m rise in sea levels, which is a possibility by the end of the century. Climate-related shocks have sparked violent conflict in the past, and conflict is a serious risk in areas such as West Africa, the Nile Basin and Central Asia.”</p> \n<p>The <code>sample_multi_column.pdf</code> file has two columns of text with headers and footers, as shown in the following screenshot.</p> \n<p><img loading=\"lazy\" class=\"aligncenter wp-image-44710 size-full\" style=\"margin: 10px 0px 10px 0px;border: 1px solid #CCCCCC\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/10/22/multi-column-pdf.png\" alt=\"\" width=\"824\" height=\"933\"></p> \n<p>The postprocessor identifies and ignores the header and footer, processes the text in the columns from left to right, and combines incomplete sentences across pages. The extracted text should construct paragraphs from text in the left column and separate paragraphs from text in the right column. The last line in the right column is incomplete on that page and continues in the left column of the next page; the postprocessor should combine them as one paragraph.</p> \n<h2>Cost</h2> \n<p>With Amazon Textract, you pay as you go based on the number of pages in the document. Refer to <a href=\"https://aws.amazon.com/textract/pricing/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Textract pricing</a> for actual costs.</p> \n<h2>Clean up</h2> \n<p>When you’re finished experimenting with this solution, clean up your resources by using the <a href=\"http://aws.amazon.com/cloudformation\" target=\"_blank\" rel=\"noopener noreferrer\">AWS CloudFormation</a> console to delete all the resources deployed in this example. This helps you avoid continuing costs in your account.</p> \n<h2>Conclusion</h2> \n<p>You can use the solution presented in this post to build an efficient document extraction workflow and process the extracted document according to your needs. If you’re building an intelligent document processing system, you can further process the extracted document using Amazon Comprehend to get more insights about the document.</p> \n<p>For more information about Amazon Textract, visit <a href=\"https://aws.amazon.com/textract/resources/?amazon-translate.sort-by=item.additionalFields.postDateTime&amp;amazon-translate.sort-order=desc\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Textract resources</a> to find video resources and blog posts, and refer to <a href=\"https://aws.amazon.com/textract/faqs/\" target=\"_blank\" rel=\"noopener noreferrer\">Amazon Textract FAQs</a>. For more information about the IDP reference architecture, refer to <a href=\"https://aws.amazon.com/machine-learning/ml-use-cases/document-processing/fintech/\" target=\"_blank\" rel=\"noopener noreferrer\">Intelligent Document Processing</a>. Please share your thoughts with us in the comments section, or in the issues section of the project’s <a href=\"https://github.com/aws-samples/amazon-textract-pdf-text-extractor\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub repository</a>.</p> \n<hr> \n<h3>About the Author</h3> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/08/09/Sathya-Balakrishnan.png\"><img loading=\"lazy\" class=\"wp-image-40884 size-full alignleft\" src=\"https://d2908q01vomqb2.cloudfront.net/f1f836cb4ea6efb2a0b1b99f41ad8b103eff4b59/2022/08/09/Sathya-Balakrishnan.png\" alt=\"\" width=\"100\" height=\"86\"></a> <strong>Sathya Balakrishnan</strong> is a Sr. Customer Delivery Architect in the Professional Services team at AWS, specializing in data and ML solutions. He works with US federal financial clients. He is passionate about building pragmatic solutions to solve customers’ business problems. In his spare time, he enjoys watching movies and hiking with his family.</p>"
}