{
  "title": "Try to Avoid Attacks: A Federated Data Sanitization Defense for Healthcare IoMT Systems. (arXiv:2211.01592v1 [cs.CR])",
  "link": "http://arxiv.org/abs/2211.01592",
  "description": "<p>Healthcare IoMT systems are becoming intelligent, miniaturized, and more\nintegrated into daily life. As for the distributed devices in the IoMT,\nfederated learning has become a topical area with cloud-based training\nprocedures when meeting data security. However, the distribution of IoMT has\nthe risk of protection from data poisoning attacks. Poisoned data can be\nfabricated by falsifying medical data, which urges a security defense to IoMT\nsystems. Due to the lack of specific labels, the filtering of malicious data is\na unique unsupervised scenario. One of the main challenges is finding robust\ndata filtering methods for various poisoning attacks. This paper introduces a\nFederated Data Sanitization Defense, a novel approach to protect the system\nfrom data poisoning attacks. To solve this unsupervised problem, we first use\nfederated learning to project all the data to the subspace domain, allowing\nunified feature mapping to be established since the data is stored locally.\nThen we adopt the federated clustering to re-group their features to clarify\nthe poisoned data. The clustering is based on the consistent association of\ndata and its semantics. After we get the clustering of the private data, we do\nthe data sanitization with a simple yet efficient strategy. In the end, each\ndevice of distributed ImOT is enabled to filter malicious data according to\nfederated data sanitization. Extensive experiments are conducted to evaluate\nthe efficacy of the proposed defense method against data poisoning attacks.\nFurther, we consider our approach in the different poisoning ratios and achieve\na high Accuracy and a low attack success rate.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Chen_C/0/1/0/all/0/1\">Chong Chen</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Gao_Y/0/1/0/all/0/1\">Ying Gao</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Shi_L/0/1/0/all/0/1\">Leyu Shi</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Huang_S/0/1/0/all/0/1\">Siquan Huang</a>"
}