{
  "title": "SQUID: Faster Analytics via Sampled Quantiles Data-structure. (arXiv:2211.01726v1 [cs.DS])",
  "link": "http://arxiv.org/abs/2211.01726",
  "description": "<p>Measurement is a fundamental enabler of network applications such as load\nbalancing, attack detection and mitigation, and traffic engineering. A key\nbuilding block in many critical measurement tasks is \\emph{q-MAX}, where we\nwish to find the largest $q$ values in a number stream. A standard approach of\nmaintaining a heap of the largest $q$ values ordered results in logarithmic\nruntime, which is too slow for large measurements. Modern approaches attain a\nconstant runtime by removing small items in bulk and retaining the largest $q$\nitems at all times. Yet, these approaches are bottlenecked by an expensive\nquantile calculation method.\n</p>\n<p>We propose SQUID, a method that redesigns q-MAX to allow the use of\n\\emph{approximate quantiles}, which we can compute efficiently, thereby\naccelerating the solution and, subsequently, many measurement tasks. We\ndemonstrate the benefit of our approach by designing a novel weighted heavy\nhitters data structure that is faster and more accurate than the existing\nalternatives. Here, we combine our previous techniques with a lazy deletion of\nsmall entries, which expiates the maintenance process and increases the\naccuracy. We also demonstrate the applicability of our algorithmic approach in\na general algorithmic scope by implementing the LRFU cache policy with a\nconstant update time. Furthermore, we also show the practicality of SQUID for\nimproving real-world networked systems, by implementing a P4 prototype of SQUID\nfor in-network caching and demonstrating how SQUID enables a wide spectrum of\nscore-based caching policies directly on a P4 switch.\n</p>",
  "dc:creator": "<a href=\"http://arxiv.org/find/cs/1/au:+Ben_Basat_R/0/1/0/all/0/1\">Ran Ben-Basat</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Einziger_G/0/1/0/all/0/1\">Gil Einziger</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Han_W/0/1/0/all/0/1\">Wenchen Han</a>, <a href=\"http://arxiv.org/find/cs/1/au:+Tayh_B/0/1/0/all/0/1\">Bilal Tayh</a>"
}