{
  "title": "Coding Made AI—Now, How Will AI Unmake Coding?",
  "link": "https://spectrum.ieee.org/ai-code-generation-language-models",
  "description": "\n<img src=\"https://spectrum.ieee.org/media-library/two-people-sit-at-monitors-coding.jpg?id=31720455&width=1200&height=400&coordinates=0%2C902%2C0%2C902\"/><br/><br/><p>Are coders doomed? That question has been bouncing around computer-programming communities ever since OpenAI’s large language model, <a href=\"https://www.nytimes.com/2020/11/24/science/artificial-intelligence-ai-gpt3.html\" rel=\"noopener noreferrer\" target=\"_blank\">GPT-3</a>, surprised everyone with its ability to <a href=\"https://www.leadingedgeonly.com/article/gpt-3-innovations-in-web-design\" rel=\"noopener noreferrer\" target=\"_blank\">create html websites</a> from simple written instructions.</p><p>In the months since, rapid-fire advances have led to <a href=\"https://machinelearningtokyo.com/2020/07/26/10-cool-gpt-3-demos/\" target=\"_blank\">systems that can write complete, albeit simple, computer programs</a> from natural-language descriptions—spoken or written human language—and automated coding assistants that speed the work of computer programmers. How far will artificial intelligence go in replacing or augmenting the work of human coders?</p><p>According to the experts <em>IEEE Spectrum </em>consulted, the bad news is coding as we know it may indeed be doomed. But the good news is computer programming and software development appears poised to remain a very human endeavor for the foreseeable future. In the meantime, AI-powered automated code generation will increasingly speed software development by allowing more code to be written in a shorter time.  <br/></p><p class=\"pull-quote\">Programmers will not always need to learn a programming language. That will open software development to a much broader population.  </p><p>“I don’t believe AI is anywhere near replacing human developers,” said <a href=\"https://www.linkedin.com/in/vasi-philomin/\" target=\"_blank\">Vasi Philomin</a>, Amazon’s vice president for AI services, adding that AI tools will free coders from routine tasks, but the creative work of computer programming will remain.</p><p>If someone wants to become a developer, say, 10 years down the line, they won’t necessarily need to learn a programming language. Instead, they will need to understand the semantics, concepts, and logical sequences of building a computer program. That will open software development to a much broader population.</p><p>When the programming of electronic computers began in the 1940s, programmers wrote in numerical <a href=\"https://en.wikipedia.org/wiki/Machine_code\" rel=\"noopener noreferrer\" target=\"_blank\">machine code</a>. It wasn’t until the mid-1950s that <a href=\"https://president.yale.edu/biography-grace-murray-hopper\" rel=\"noopener noreferrer\" target=\"_blank\">Grace Hopper</a> and her team at the computer company <a href=\"https://www.si.edu/spotlight/bookkeeping-machines/remington-rand\" rel=\"noopener noreferrer\" target=\"_blank\">Remington Rand</a> developed <a href=\"https://en.wikipedia.org/wiki/FLOW-MATIC\" rel=\"noopener noreferrer\" target=\"_blank\">FLOW-MATIC</a>, which allowed programmers to use a limited English vocabulary to write programs.</p><p>Since then, programming has climbed a ladder of increasingly efficient languages that allow programmers to be more productive.</p><p>AI-written code is the cutting edge of a broader movement to allow people to write software without having to code at all. Already, with platforms like <a href=\"https://www.akkio.com/\" target=\"_blank\">Akkio</a>, people can build machine-learning models with simple drag, drop, and button-click features. Users of <a href=\"https://powerplatform.microsoft.com/en-us/\" target=\"_blank\">Microsoft’s Power Platform</a>, which includes a family of low-code products, can generate simple applications by just describing them.</p><p>In June, Amazon released <a href=\"https://aws.amazon.com/codewhisperer/\" target=\"_blank\">CodeWhisperer</a>, a coding assistant for programmers, like GitHub’s Copilot, which was first released in limited preview in June 2021. Both tools are based on <a href=\"https://hai.stanford.edu/news/how-large-language-models-will-transform-science-society-and-ai\" target=\"_blank\">large language models</a> (LLMs) that have been trained on massive code repositories. Both offer autocomplete suggestions as a programmer writes code or suggest executable instructions from simple natural-language phrases.</p><p class=\"pull-quote\">“There needs to be some incremental refinement, some conversation between the human and the machine.”<br/>—Peter Schrammel, Diffblue</p><p>A <a href=\"https://venturebeat.com/ai/study-provides-insights-on-github-copilots-impact-on-developer-productivity/\" target=\"_blank\">GitHub survey</a> of 2,000 developers found that Copilot cuts in half the time it takes for certain coding tasks and raised overall developer satisfaction in their work.<br/></p><p>But to move beyond autocompletion, the problem is teaching the intent to the computer. Software requirements are usually vague, while natural language is notoriously imprecise.</p><p>“To resolve all these ambiguities in English written specification, there needs to be some incremental refinement, some conversation between the human and the machine,” said <a href=\"https://www.eye-on.ai/podcast-106\" target=\"_blank\">Peter Schrammel</a>, cofounder of <a href=\"https://www.diffblue.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Diffblue</a>, which automates the writing of unit tests for Java.</p><p>To address these problems, researchers at Microsoft have recently proposed adding a feedback mechanism to LLM-based code generation so that the computer asks the programmer for clarification of any ambiguities before generating code.<br/></p><p>The interactive system, called <a href=\"https://syncedreview.com/2022/08/18/microsoft-penn-u-uc-san-diegos-ticoder-framework-generates-code-with-90-4-consistency-to-user-intent/\" rel=\"noopener noreferrer\" target=\"_blank\">TiCoder</a>, refines and formalizes user intent by generating what is called a “<a href=\"https://arxiv.org/abs/2208.05950\" target=\"_blank\">test-driven user-intent formalization</a>”—which attempts to use iterative feedback to divine the programmer’s algorithmic intent and then generate code that is consistent with the expressed intentions.</p><p>According to their paper, TiCoder improves the accuracy of automatically generated code by up to 85 percent from 48 percent, when evaluated on the <a href=\"https://arxiv.org/abs/2108.07732\" target=\"_blank\">Mostly Basic Programming Problems</a> (MBPP) benchmark. MBPP, meant to evaluate machine-generated code, consists of around 1,000 crowd-sourced Python programming problems, designed to be solvable by entry level programmers. <br/></p><p>A unit of code, which can be hundreds of lines long, is the smallest part of a program that can be maintained and executed independently. A suite of unit tests, typically consisting of dozens of unit tests, each of them between 10 and 20 lines of code, checks that the unit executes as intended, so that when you stack the units together, the program works as intended.  <br/></p><p>Unit tests are useful for debugging individual functions and for detecting errors when code is manually changed. But a unit test can also be used as the specification for the unit of code and can be used to guide programmers to write clean, bug-free code. While not many programmers pursue true test-driven development, in which the unit tests are written first, unit test and units are generally written together.</p><p class=\"pull-quote\">Hand-coding software programs will increasingly be like hand-knitting sweaters.</p><p>According to a <a href=\"https://www.diffblue.com/Education/research_papers/2019-diffblue-developer-survey/\" target=\"_blank\">survey by Diffblue</a>, developers spend roughly 35 percent of their time writing quality-control tests (as opposed to writing code destined for production use), so there are significant productivity gains to be made just by automating a part of this.  <br/></p><p>Meanwhile, Github’s Copilot, Amazon’s CodeWhisperer, and AI programming assistant packages can be used as interactive auto-completion tools for writing unit tests. The programmer is given suggestions and picks the one that they think will work best. Diffblue’s system, called <a href=\"https://www.diffblue.com/products/\" target=\"_blank\">Diffblue Cover</a>, uses reinforcement learning to write unit tests automatically, with no human intervention.</p><p>Earlier this year, Google’s U.K.-based, artificial intelligence lab, <a href=\"https://www.deepmind.com/\" target=\"_blank\">DeepMind</a>, went further in fully automatic code generation with <a href=\"https://alphacode.deepmind.com/\" rel=\"noopener noreferrer\" target=\"_blank\">AlphaCode</a>, a large language model that can write simple computer programs from natural-language instructions.</p><p>AlphaCode uses an encoder-decoder <a href=\"https://en.wikipedia.org/wiki/Transformer_(machine_learning_model)\" target=\"_blank\">transformer architecture</a>, first encoding the natural-language description of the problem and then decoding the resulting vector into code for a solution.</p><p>The model was first trained on the <a href=\"https://github.com/git/git\" target=\"_blank\">GitHub code repository</a> until the model was able to produce reasonable-looking code.</p><p>To fine-tune the model, DeepMind used 15,000 pairs of natural-language problem descriptions and successful code solutions from past coding competitions to create a specialized data set of input-output examples.</p><p>Once AlphaCode was trained and tuned, it was tested against problems it hadn’t seen before.</p><p class=\"pull-quote\">“I don’t believe AI is anywhere near replacing human developers. It will remove the mundane, boilerplate stuff that people have to do, and they can focus on higher-value things.”<br/>—Vasi Philomin, Amazon</p><p>The final step was to generate many solutions and then use a filtering algorithm to select the best one. “We created many different program possibilities by essentially sampling the language model almost a million times,” said <a href=\"https://scholar.google.com/citations?user=NkzyCvUAAAAJ&hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Oriol Vinyals</a>, who leads <a href=\"https://research.google/people/OriolVinyals/\" target=\"_blank\">DeepMind’s deep-learning team</a>.</p><p>To optimize the sample-selection process, DeepMind uses a clustering algorithm to divide the solutions into groups. The clustering process tends to group the working solutions together, making it easier to find a small set of candidates that are likely to work as well as those written by human programmers.</p><p>To test the system, DeepMind submitted 10 AlphaCode-written programs to a human coding competition on the popular <a href=\"https://codeforces.com/\" rel=\"noopener noreferrer\" target=\"_blank\">Codeforces</a> platform where its solutions ranked among the top 54 percent.</p><p>“To generate a program, will you just write it in natural language, no coding required, and then the solution comes out at the other end?” <a href=\"https://scholar.google.com/citations?user=NkzyCvUAAAAJ&hl=en\" rel=\"noopener noreferrer\" target=\"_blank\">Vinyals</a> asked rhetorically in a recent interview. “I believe so.”</p><p>Vinyals and others caution that it will take time, possibly decades, to reach that goal. “We are still very far away from when a person would be able to tell a computer about the requirements for an arbitrary complex computer program, and have that automatically get coded,” said <a href=\"https://www.andrewng.org/\" target=\"_blank\">Andrew Ng</a>, a founder and CEO of Landing AI who is an AI pioneer and founding lead of <a href=\"https://research.google/teams/brain/\" target=\"_blank\">Google Brain</a>.<br/></p><p>But given the speed at which AI-code generation has advanced in a few short years, it seems inevitable that AI systems will eventually be able to write code from natural-language instructions. Hand-coding software programs will increasingly be like hand-knitting sweaters.<br/></p><p>To give natural-language instructions to a computer, developers will still need to understand some concepts of logic and functions and how to structure things. They will still need to study foundational programming, even if they don’t learn specific programming languages or write in computer code. That will, in turn, enable a wider range of programmers to create more and more varied kinds of software.  <br/></p><p>“I don’t believe AI is anywhere near replacing human developers,” Amazon’s Philomin said. “It will remove the mundane, boilerplate stuff that people have to do, and they can focus on higher-value things.”<br/></p><p>Diffblue’s Schrammel agrees that AI-automated code generation will allow software developers to focus on more difficult and creative tasks. But, he adds, there will at least need to be one interaction with a human to confirm what the machine has understood is what the human intended. </p><p>“Software developers will not lose their jobs because an automation tool replaces them,” he said. “There always will be more software that needs to be written.”</p><p><strong><em>Update 6 Oct. 2022: </em></strong><em>A previous version of this story stated that coding jobs of the future will be increasingly “AI-dependent.” Acting on expert feedback, we changed the statement to “AI-assisted” instead. <br/></em></p><p><em>This article appears in the November 2022 print issue as “AI Is Rewriting the Job of Coding.”<br/></em></p>",
  "pubDate": "Mon, 19 Sep 2022 12:00:01 +0000",
  "guid": "https://spectrum.ieee.org/ai-code-generation-language-models",
  "category": [
    "Programming",
    "Programming languages",
    "Artificial intelligence",
    "Gpt-3",
    "Large language models"
  ],
  "dc:creator": "Craig S. Smith",
  "media:content": ""
}