{
  "title": "TU127 Grandma Heals: Community-Based Mental Health Care from Zimbabwe with Dr. Ruth Verhey",
  "link": "https://therapistuncensored.com/episodes/tu127-friendship-bench/?utm_source=rss&#038;utm_medium=rss&#038;utm_campaign=tu127-friendship-bench",
  "pubDate": "Tue, 04 Aug 2020 06:00:19 +0000",
  "guid": "https://therapistuncensored.com/?p=10713",
  "description": "The Friendship Bench -discover the 3-step community-based program that is has proven to be an effective non-traditional model of mental health care delivery.\nIn this episode, researcher and program director Dr. Ruth Verhey joins co-host Sue Marriott to discuss this community-based intervention, the Friendship Bench.  Together they explore the benefits and barriers to building a community-driven and cooperative approach to mental health.  By looking at what makes it effective, we can begin to explore what makes therapy effective in general and learn from the need to strip away the \"extra\" that may not add value to mental healthcare.",
  "enclosure": "",
  "itunes:subtitle": "Learn what actually works in therapy by learning from elders in low-resource areas.",
  "itunes:summary": "Discover the 3-step community-based program that is has proven to be a powerful non-traditional model of mental health care delivery. <br />\nIn this episode, researcher and program director Dr. Ruth Verhey joins co-host Sue Marriott to discuss this community-based intervention, the Friendship Bench.  Together they explore the benefits and barriers to building a cutting edge community-driven approach to mental health.  By looking at what makes it effective, we can begin to explore what makes therapy effective in general and learn from the need to strip away the \"extra\" that may not add value to mental healthcare. Shownotes at https://therapistuncensored.com/tu127-friendship-bench.",
  "itunes:author": "Sue Marriott, Ruth Verhey",
  "itunes:image": "",
  "itunes:season": 4,
  "itunes:episode": 127,
  "itunes:title": "Grandma Heals - Community-based Mental Health Care from Zimbabwe",
  "itunes:duration": "58:47"
}